/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */


/*
 * 《2015年统计用区划代码和城乡划分代码（截止2015年09月30日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2015/index.html）
 * 数据范围：河北省(13)、山西省(14)、内蒙古自治区(15)。
 */

/* 河北省 石家庄市 长安区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 02, 001, '建北街道办事处'),
	(13, 01, 02, 002, '青园街道办事处'),
	(13, 01, 02, 003, '广安街道办事处'),
	(13, 01, 02, 004, '育才街道办事处'),
	(13, 01, 02, 005, '跃进街道办事处'),
	(13, 01, 02, 007, '河东街道办事处'),
	(13, 01, 02, 010, '长丰街道办事处'),
	(13, 01, 02, 011, '谈固街道办事处'),
	(13, 01, 02, 012, '中山东路街道办事处'),
	(13, 01, 02, 013, '阜康街道办事处'),
	(13, 01, 02, 014, '建安街道办事处'),
	(13, 01, 02, 015, '胜利北街道办事处'),
	(13, 01, 02, 100, '西兆通镇'),
	(13, 01, 02, 101, '南村镇'),
	(13, 01, 02, 102, '高营镇'),
	(13, 01, 02, 103, '桃园镇');

/* 河北省 石家庄市 桥西区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 04, 001, '东里街道办事处'),
	(13, 01, 04, 002, '中山街道办事处'),
	(13, 01, 04, 004, '南长街道办事处'),
	(13, 01, 04, 005, '维明街道办事处'),
	(13, 01, 04, 007, '友谊街道办事处'),
	(13, 01, 04, 008, '红旗街道办事处'),
	(13, 01, 04, 009, '新石街道办事处'),
	(13, 01, 04, 010, '苑东街道办事处'),
	(13, 01, 04, 011, '西里街道办事处'),
	(13, 01, 04, 012, '振头街道办事处'),
	(13, 01, 04, 013, '留营街道办事处'),
	(13, 01, 04, 014, '长兴街道办事处'),
	(13, 01, 04, 015, '彭后街道办事处'),
	(13, 01, 04, 016, '东风街道办事处'),
	(13, 01, 04, 017, '东华街道办事处'),
	(13, 01, 04, 018, '休门街道办事处'),
	(13, 01, 04, 019, '汇通街道办事处');

/* 河北省 石家庄市 新华区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 05, 001, '革新街街道办事处'),
	(13, 01, 05, 003, '新华路街道办事处'),
	(13, 01, 05, 004, '宁安街道办事处'),
	(13, 01, 05, 005, '东焦街道办事处'),
	(13, 01, 05, 006, '西苑街道办事处'),
	(13, 01, 05, 007, '合作路街道办事处'),
	(13, 01, 05, 008, '联盟街道办事处'),
	(13, 01, 05, 009, '石岗街道办事处'),
	(13, 01, 05, 010, '五七街道办事处'),
	(13, 01, 05, 011, '天苑街道办事处'),
	(13, 01, 05, 012, '北苑街道办事处'),
	(13, 01, 05, 100, '大郭镇'),
	(13, 01, 05, 101, '赵陵铺镇'),
	(13, 01, 05, 201, '西三庄乡'),
	(13, 01, 05, 202, '杜北乡');

/* 河北省 石家庄市 井陉矿区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 07, 001, '矿市街道办事处'),
	(13, 01, 07, 002, '四微街道办事处'),
	(13, 01, 07, 100, '贾庄镇'),
	(13, 01, 07, 101, '凤山镇'),
	(13, 01, 07, 200, '横涧乡');

/* 河北省 石家庄市 裕华区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 08, 001, '裕兴街道办事处'),
	(13, 01, 08, 002, '裕强街道办事处'),
	(13, 01, 08, 003, '东苑街道办事处'),
	(13, 01, 08, 004, '建通街道办事处'),
	(13, 01, 08, 005, '槐底街道办事处'),
	(13, 01, 08, 006, '裕华路街道办事处'),
	(13, 01, 08, 007, '裕东街道办事处'),
	(13, 01, 08, 008, '裕翔街道办事处'),
	(13, 01, 08, 009, '建华南街道办事处'),
	(13, 01, 08, 101, '方村镇');

/* 河北省 石家庄市 藁城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 09, 100, '廉州镇'),
	(13, 01, 09, 101, '兴安镇'),
	(13, 01, 09, 102, '贾市庄镇'),
	(13, 01, 09, 103, '南营镇'),
	(13, 01, 09, 104, '梅花镇'),
	(13, 01, 09, 105, '岗上镇'),
	(13, 01, 09, 107, '南董镇'),
	(13, 01, 09, 108, '张家庄镇'),
	(13, 01, 09, 109, '南孟镇'),
	(13, 01, 09, 110, '增村镇'),
	(13, 01, 09, 111, '常安镇'),
	(13, 01, 09, 112, '西关镇'),
	(13, 01, 09, 200, '九门回族乡');

/* 河北省 石家庄市 鹿泉区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 10, 100, '获鹿镇'),
	(13, 01, 10, 101, '铜冶镇'),
	(13, 01, 10, 102, '寺家庄镇'),
	(13, 01, 10, 103, '上庄镇'),
	(13, 01, 10, 104, '李村镇'),
	(13, 01, 10, 105, '宜安镇'),
	(13, 01, 10, 106, '黄壁庄镇'),
	(13, 01, 10, 107, '大河镇'),
	(13, 01, 10, 108, '山尹村镇'),
	(13, 01, 10, 200, '石井乡'),
	(13, 01, 10, 201, '白鹿泉乡'),
	(13, 01, 10, 202, '上寨乡');

/* 河北省 石家庄市 栾城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 11, 100, '栾城镇'),
	(13, 01, 11, 103, '冶河镇'),
	(13, 01, 11, 104, '窦妪镇'),
	(13, 01, 11, 105, '楼底镇'),
	(13, 01, 11, 200, '南高乡'),
	(13, 01, 11, 201, '柳林屯乡'),
	(13, 01, 11, 202, '西营乡');

/* 河北省 石家庄市 井陉县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 21, 100, '微水镇'),
	(13, 01, 21, 101, '上安镇'),
	(13, 01, 21, 102, '天长镇'),
	(13, 01, 21, 103, '秀林镇'),
	(13, 01, 21, 104, '南峪镇'),
	(13, 01, 21, 105, '威州镇'),
	(13, 01, 21, 106, '小作镇'),
	(13, 01, 21, 107, '南障城镇'),
	(13, 01, 21, 108, '苍岩山镇'),
	(13, 01, 21, 109, '测鱼镇'),
	(13, 01, 21, 200, '吴家窑乡'),
	(13, 01, 21, 201, '北正乡'),
	(13, 01, 21, 202, '于家乡'),
	(13, 01, 21, 203, '孙庄乡'),
	(13, 01, 21, 204, '南陉乡'),
	(13, 01, 21, 205, '辛庄乡'),
	(13, 01, 21, 206, '南王庄乡');

/* 河北省 石家庄市 正定县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 23, 001, '诸福屯街道办事处'),
	(13, 01, 23, 002, '三里屯街道办事处'),
	(13, 01, 23, 100, '正定镇'),
	(13, 01, 23, 102, '新城铺镇'),
	(13, 01, 23, 103, '新安镇'),
	(13, 01, 23, 200, '南牛乡'),
	(13, 01, 23, 201, '南楼乡'),
	(13, 01, 23, 202, '西平乐乡'),
	(13, 01, 23, 203, '北早现乡'),
	(13, 01, 23, 204, '曲阳桥乡');

/* 河北省 石家庄市 行唐县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 25, 100, '龙州镇'),
	(13, 01, 25, 101, '南桥镇'),
	(13, 01, 25, 102, '上碑镇'),
	(13, 01, 25, 103, '口头镇'),
	(13, 01, 25, 200, '独羊岗乡'),
	(13, 01, 25, 201, '安香乡'),
	(13, 01, 25, 202, '只里乡'),
	(13, 01, 25, 203, '市同乡'),
	(13, 01, 25, 204, '翟营乡'),
	(13, 01, 25, 205, '城寨乡'),
	(13, 01, 25, 206, '上方乡'),
	(13, 01, 25, 207, '玉亭乡'),
	(13, 01, 25, 208, '北河乡'),
	(13, 01, 25, 209, '上闫庄乡'),
	(13, 01, 25, 210, '九口子乡');

/* 河北省 石家庄市 灵寿县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 26, 100, '灵寿镇'),
	(13, 01, 26, 101, '青同镇'),
	(13, 01, 26, 102, '塔上镇'),
	(13, 01, 26, 103, '陈庄镇'),
	(13, 01, 26, 104, '慈峪镇'),
	(13, 01, 26, 105, '岔头镇'),
	(13, 01, 26, 200, '三圣院乡'),
	(13, 01, 26, 201, '北洼乡'),
	(13, 01, 26, 202, '牛城乡'),
	(13, 01, 26, 203, '狗台乡'),
	(13, 01, 26, 204, '南寨乡'),
	(13, 01, 26, 205, '南燕川乡'),
	(13, 01, 26, 206, '北谭庄乡'),
	(13, 01, 26, 207, '寨头乡'),
	(13, 01, 26, 208, '南营乡');

/* 河北省 石家庄市 高邑县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 27, 100, '高邑镇'),
	(13, 01, 27, 101, '大营镇'),
	(13, 01, 27, 102, '富村镇'),
	(13, 01, 27, 201, '中韩乡'),
	(13, 01, 27, 202, '万城乡');

/* 河北省 石家庄市 深泽县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 28, 100, '深泽镇'),
	(13, 01, 28, 101, '铁杆镇'),
	(13, 01, 28, 102, '赵八镇'),
	(13, 01, 28, 200, '白庄乡'),
	(13, 01, 28, 201, '留村乡'),
	(13, 01, 28, 203, '桥头乡');

/* 河北省 石家庄市 赞皇县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 29, 100, '赞皇镇'),
	(13, 01, 29, 101, '院头镇'),
	(13, 01, 29, 200, '西龙门乡'),
	(13, 01, 29, 201, '南邢郭乡'),
	(13, 01, 29, 202, '南清河乡'),
	(13, 01, 29, 203, '西阳泽乡'),
	(13, 01, 29, 204, '土门乡'),
	(13, 01, 29, 205, '黄北坪乡'),
	(13, 01, 29, 206, '嶂石岩乡'),
	(13, 01, 29, 207, '许亭乡'),
	(13, 01, 29, 208, '张楞乡');

/* 河北省 石家庄市 无极县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 30, 100, '无极镇'),
	(13, 01, 30, 101, '七汲镇'),
	(13, 01, 30, 102, '张段固镇'),
	(13, 01, 30, 103, '北苏镇'),
	(13, 01, 30, 104, '郭庄镇'),
	(13, 01, 30, 105, '大陈镇'),
	(13, 01, 30, 200, '高头回族乡'),
	(13, 01, 30, 201, '郝庄乡'),
	(13, 01, 30, 202, '东侯坊乡'),
	(13, 01, 30, 203, '里城道乡'),
	(13, 01, 30, 204, '南流乡');

/* 河北省 石家庄市 平山县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 31, 100, '平山镇'),
	(13, 01, 31, 101, '东回舍镇'),
	(13, 01, 31, 102, '温塘镇'),
	(13, 01, 31, 103, '南甸镇'),
	(13, 01, 31, 104, '岗南镇'),
	(13, 01, 31, 105, '古月镇'),
	(13, 01, 31, 106, '下槐镇'),
	(13, 01, 31, 107, '孟家庄镇'),
	(13, 01, 31, 108, '小觉镇'),
	(13, 01, 31, 109, '蛟潭庄镇'),
	(13, 01, 31, 110, '西柏坡镇'),
	(13, 01, 31, 111, '下口镇'),
	(13, 01, 31, 200, '西大吾乡'),
	(13, 01, 31, 201, '上三汲乡'),
	(13, 01, 31, 202, '两河乡'),
	(13, 01, 31, 203, '东王坡乡'),
	(13, 01, 31, 204, '苏家庄乡'),
	(13, 01, 31, 205, '宅北乡'),
	(13, 01, 31, 207, '北冶乡'),
	(13, 01, 31, 209, '上观音堂乡'),
	(13, 01, 31, 210, '杨家桥乡'),
	(13, 01, 31, 211, '营里乡'),
	(13, 01, 31, 212, '合河口乡');

/* 河北省 石家庄市 元氏县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 32, 001, '城区街道办事处'),
	(13, 01, 32, 100, '槐阳镇'),
	(13, 01, 32, 101, '殷村镇'),
	(13, 01, 32, 102, '南佐镇'),
	(13, 01, 32, 103, '宋曹镇'),
	(13, 01, 32, 104, '南因镇'),
	(13, 01, 32, 105, '姬村镇'),
	(13, 01, 32, 106, '北褚镇'),
	(13, 01, 32, 107, '马村镇'),
	(13, 01, 32, 201, '东张乡'),
	(13, 01, 32, 202, '赵同乡'),
	(13, 01, 32, 204, '苏村乡'),
	(13, 01, 32, 205, '苏阳乡'),
	(13, 01, 32, 206, '北正乡'),
	(13, 01, 32, 207, '前仙乡'),
	(13, 01, 32, 208, '黑水河乡');

/* 河北省 石家庄市 赵县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 33, 100, '赵州镇'),
	(13, 01, 33, 101, '范庄镇'),
	(13, 01, 33, 102, '北王里镇'),
	(13, 01, 33, 103, '新寨店镇'),
	(13, 01, 33, 104, '韩村镇'),
	(13, 01, 33, 105, '南柏舍镇'),
	(13, 01, 33, 106, '沙河店镇'),
	(13, 01, 33, 200, '前大章乡'),
	(13, 01, 33, 201, '谢庄乡'),
	(13, 01, 33, 202, '高村乡'),
	(13, 01, 33, 203, '王西章乡');

/* 河北省 石家庄市 晋州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 83, 100, '晋州镇'),
	(13, 01, 83, 101, '总十庄镇'),
	(13, 01, 83, 102, '营里镇'),
	(13, 01, 83, 103, '桃园镇'),
	(13, 01, 83, 104, '东卓宿镇'),
	(13, 01, 83, 105, '马于镇'),
	(13, 01, 83, 106, '小樵镇'),
	(13, 01, 83, 107, '槐树镇'),
	(13, 01, 83, 108, '东里庄镇'),
	(13, 01, 83, 201, '周家庄乡');

/* 河北省 石家庄市 新乐市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 01, 84, 001, '长寿街道办事处'),
	(13, 01, 84, 101, '化皮镇'),
	(13, 01, 84, 102, '承安镇'),
	(13, 01, 84, 103, '正莫镇'),
	(13, 01, 84, 104, '南大岳镇'),
	(13, 01, 84, 105, '杜固镇'),
	(13, 01, 84, 106, '邯邰镇'),
	(13, 01, 84, 107, '东王镇'),
	(13, 01, 84, 108, '马头铺镇'),
	(13, 01, 84, 200, '协神乡'),
	(13, 01, 84, 201, '木村乡'),
	(13, 01, 84, 202, '彭家庄回族乡');

/* 河北省 唐山市 路南区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 02, 001, '学院南路街道办事处'),
	(13, 02, 02, 002, '友谊街道办事处'),
	(13, 02, 02, 003, '广场街道办事处'),
	(13, 02, 02, 004, '永红桥街道办事处'),
	(13, 02, 02, 005, '小山街道办事处'),
	(13, 02, 02, 006, '文北街道办事处'),
	(13, 02, 02, 007, '钱营街道办事处'),
	(13, 02, 02, 008, '惠民道街道办事处'),
	(13, 02, 02, 009, '梁家屯路街道办事处'),
	(13, 02, 02, 102, '稻地镇'),
	(13, 02, 02, 200, '女织寨乡');

/* 河北省 唐山市 路北区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 03, 001, '乔屯街道办事处'),
	(13, 02, 03, 002, '文化路街道办事处'),
	(13, 02, 03, 003, '钓鱼台街道办事处'),
	(13, 02, 03, 004, '东新村街道办事处'),
	(13, 02, 03, 005, '缸窑街道办事处'),
	(13, 02, 03, 006, '机场路街道办事处'),
	(13, 02, 03, 007, '河北路街道办事处'),
	(13, 02, 03, 008, '龙东街道办事处'),
	(13, 02, 03, 009, '大里街道办事处'),
	(13, 02, 03, 010, '光明街道办事处'),
	(13, 02, 03, 011, '翔云道街道办事处'),
	(13, 02, 03, 100, '韩城镇'),
	(13, 02, 03, 200, '果园乡');

/* 河北省 唐山市 古冶区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 04, 001, '林西街道办事处'),
	(13, 02, 04, 002, '唐家庄街道办事处'),
	(13, 02, 04, 003, '古冶街道办事处'),
	(13, 02, 04, 004, '赵各庄街道办事处'),
	(13, 02, 04, 007, '京华街道办事处'),
	(13, 02, 04, 100, '范各庄镇'),
	(13, 02, 04, 101, '卑家店镇'),
	(13, 02, 04, 201, '王辇庄乡'),
	(13, 02, 04, 202, '习家套乡'),
	(13, 02, 04, 203, '大庄坨乡');

/* 河北省 唐山市 开平区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 05, 001, '马家沟街道办事处'),
	(13, 02, 05, 002, '开平街道办事处'),
	(13, 02, 05, 003, '税务庄街道办事处'),
	(13, 02, 05, 005, '陡电街道办事处'),
	(13, 02, 05, 006, '荆各庄街道办事处'),
	(13, 02, 05, 100, '开平镇'),
	(13, 02, 05, 101, '栗园镇'),
	(13, 02, 05, 102, '郑庄子镇'),
	(13, 02, 05, 103, '双桥镇'),
	(13, 02, 05, 104, '洼里镇'),
	(13, 02, 05, 105, '越河镇');

/* 河北省 唐山市 丰南区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 07, 103, '小集镇'),
	(13, 02, 07, 104, '黄各庄镇'),
	(13, 02, 07, 105, '西葛镇'),
	(13, 02, 07, 106, '大新庄镇'),
	(13, 02, 07, 107, '钱营镇'),
	(13, 02, 07, 108, '唐坊镇'),
	(13, 02, 07, 109, '王兰庄镇'),
	(13, 02, 07, 110, '柳树酄镇'),
	(13, 02, 07, 111, '黑沿子镇'),
	(13, 02, 07, 113, '丰南镇'),
	(13, 02, 07, 114, '大齐各庄镇'),
	(13, 02, 07, 115, '岔河镇'),
	(13, 02, 07, 201, '南孙庄乡'),
	(13, 02, 07, 202, '东田庄乡'),
	(13, 02, 07, 203, '尖字沽乡');

/* 河北省 唐山市 丰润区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 08, 001, '太平路街道办事处'),
	(13, 02, 08, 002, '燕山路街道办事处'),
	(13, 02, 08, 003, '浭阳街道办事处'),
	(13, 02, 08, 100, '丰润镇'),
	(13, 02, 08, 102, '任各庄镇'),
	(13, 02, 08, 103, '左家坞镇'),
	(13, 02, 08, 104, '泉河头镇'),
	(13, 02, 08, 105, '王官营镇'),
	(13, 02, 08, 106, '火石营镇'),
	(13, 02, 08, 109, '新军屯镇'),
	(13, 02, 08, 110, '小张各庄镇'),
	(13, 02, 08, 111, '丰登坞镇'),
	(13, 02, 08, 112, '李钊庄镇'),
	(13, 02, 08, 113, '白官屯镇'),
	(13, 02, 08, 114, '石各庄镇'),
	(13, 02, 08, 115, '沙流河镇'),
	(13, 02, 08, 116, '七树庄镇'),
	(13, 02, 08, 117, '杨官林镇'),
	(13, 02, 08, 118, '银城铺镇'),
	(13, 02, 08, 119, '常庄镇'),
	(13, 02, 08, 202, '姜家营乡'),
	(13, 02, 08, 205, '欢喜庄乡'),
	(13, 02, 08, 208, '刘家营乡');

/* 河北省 唐山市 曹妃甸区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 09, 100, '唐海镇'),
	(13, 02, 09, 112, '滨海镇'),
	(13, 02, 09, 113, '柳赞镇');

/* 河北省 唐山市 滦县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 23, 001, '滦河街道办事处'),
	(13, 02, 23, 002, '古城街道办事处'),
	(13, 02, 23, 100, '滦州镇'),
	(13, 02, 23, 101, '响堂镇'),
	(13, 02, 23, 102, '东安各庄镇'),
	(13, 02, 23, 103, '雷庄镇'),
	(13, 02, 23, 104, '茨榆坨镇'),
	(13, 02, 23, 105, '榛子镇'),
	(13, 02, 23, 106, '杨柳庄镇'),
	(13, 02, 23, 107, '油榨镇'),
	(13, 02, 23, 108, '古马镇'),
	(13, 02, 23, 109, '小马庄镇'),
	(13, 02, 23, 110, '九百户镇'),
	(13, 02, 23, 111, '王店子镇');

/* 河北省 唐山市 滦南县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 24, 001, '友谊路街道办事处'),
	(13, 02, 24, 100, '倴城镇'),
	(13, 02, 24, 101, '宋道口镇'),
	(13, 02, 24, 102, '长凝镇'),
	(13, 02, 24, 103, '胡各庄镇'),
	(13, 02, 24, 104, '坨里镇'),
	(13, 02, 24, 105, '姚王庄镇'),
	(13, 02, 24, 106, '司各庄镇'),
	(13, 02, 24, 107, '安各庄镇'),
	(13, 02, 24, 108, '扒齿港镇'),
	(13, 02, 24, 109, '程庄镇'),
	(13, 02, 24, 110, '青坨营镇'),
	(13, 02, 24, 111, '柏各庄镇'),
	(13, 02, 24, 114, '南堡镇'),
	(13, 02, 24, 115, '方各庄镇'),
	(13, 02, 24, 116, '东黄坨镇'),
	(13, 02, 24, 117, '马城镇');

/* 河北省 唐山市 乐亭县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 25, 001, '乐安街道办事处'),
	(13, 02, 25, 100, '乐亭镇'),
	(13, 02, 25, 101, '汤家河镇'),
	(13, 02, 25, 102, '胡家坨镇'),
	(13, 02, 25, 104, '闫各庄镇'),
	(13, 02, 25, 105, '马头营镇'),
	(13, 02, 25, 106, '新寨镇'),
	(13, 02, 25, 107, '汀流河镇'),
	(13, 02, 25, 108, '姜各庄镇'),
	(13, 02, 25, 109, '毛庄镇'),
	(13, 02, 25, 110, '中堡镇'),
	(13, 02, 25, 201, '庞各庄乡'),
	(13, 02, 25, 202, '大相各庄乡'),
	(13, 02, 25, 203, '古河乡');

/* 河北省 唐山市 迁西县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 27, 001, '迁西县栗乡街道办事处'),
	(13, 02, 27, 100, '兴城镇'),
	(13, 02, 27, 101, '金厂峪镇'),
	(13, 02, 27, 102, '洒河桥镇'),
	(13, 02, 27, 103, '太平寨镇'),
	(13, 02, 27, 104, '罗家屯镇'),
	(13, 02, 27, 105, '东荒峪镇'),
	(13, 02, 27, 106, '新集镇'),
	(13, 02, 27, 107, '三屯营镇'),
	(13, 02, 27, 108, '滦阳镇'),
	(13, 02, 27, 200, '白庙子乡'),
	(13, 02, 27, 201, '上营乡'),
	(13, 02, 27, 202, '汉儿庄乡'),
	(13, 02, 27, 203, '渔户寨乡'),
	(13, 02, 27, 204, '旧城乡'),
	(13, 02, 27, 205, '尹庄乡'),
	(13, 02, 27, 206, '东莲花院乡'),
	(13, 02, 27, 207, '新庄子乡');

/* 河北省 唐山市 玉田县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 29, 001, '无终街道办事处'),
	(13, 02, 29, 100, '玉田镇'),
	(13, 02, 29, 101, '亮甲店镇'),
	(13, 02, 29, 102, '鸦鸿桥镇'),
	(13, 02, 29, 103, '窝洛沽镇'),
	(13, 02, 29, 104, '石臼窝镇'),
	(13, 02, 29, 105, '虹桥镇'),
	(13, 02, 29, 106, '散水头镇'),
	(13, 02, 29, 107, '林南仓镇'),
	(13, 02, 29, 108, '林西镇'),
	(13, 02, 29, 109, '杨家板桥镇'),
	(13, 02, 29, 110, '彩亭桥镇'),
	(13, 02, 29, 111, '孤树镇'),
	(13, 02, 29, 112, '大安镇镇'),
	(13, 02, 29, 113, '唐自头镇'),
	(13, 02, 29, 114, '郭家屯镇'),
	(13, 02, 29, 115, '杨家套镇'),
	(13, 02, 29, 201, '林头屯乡'),
	(13, 02, 29, 203, '潮洛窝乡'),
	(13, 02, 29, 204, '陈家铺乡'),
	(13, 02, 29, 205, '郭家桥乡');

/* 河北省 唐山市 遵化市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 81, 001, '华明路街道办事处'),
	(13, 02, 81, 002, '文化路街道办事处'),
	(13, 02, 81, 100, '遵化镇'),
	(13, 02, 81, 101, '堡子店镇'),
	(13, 02, 81, 102, '马兰峪镇'),
	(13, 02, 81, 103, '平安城镇'),
	(13, 02, 81, 104, '东新庄镇'),
	(13, 02, 81, 105, '新店子镇'),
	(13, 02, 81, 106, '党峪镇'),
	(13, 02, 81, 107, '地北头镇'),
	(13, 02, 81, 108, '东旧寨镇'),
	(13, 02, 81, 109, '铁厂镇'),
	(13, 02, 81, 110, '苏家洼镇'),
	(13, 02, 81, 111, '建明镇'),
	(13, 02, 81, 112, '石门镇'),
	(13, 02, 81, 200, '西留村乡'),
	(13, 02, 81, 201, '崔家庄乡'),
	(13, 02, 81, 202, '兴旺寨乡'),
	(13, 02, 81, 203, '西下营满族乡'),
	(13, 02, 81, 204, '汤泉满族乡'),
	(13, 02, 81, 205, '东陵满族乡'),
	(13, 02, 81, 206, '刘备寨乡'),
	(13, 02, 81, 207, '团瓢庄乡'),
	(13, 02, 81, 208, '娘娘庄乡'),
	(13, 02, 81, 209, '西三里乡'),
	(13, 02, 81, 210, '候家寨乡'),
	(13, 02, 81, 211, '小厂乡');

/* 河北省 唐山市 迁安市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 02, 83, 100, '迁安镇'),
	(13, 02, 83, 101, '夏官营镇'),
	(13, 02, 83, 102, '杨各庄镇'),
	(13, 02, 83, 103, '建昌营镇'),
	(13, 02, 83, 104, '赵店子镇'),
	(13, 02, 83, 105, '野鸡坨镇'),
	(13, 02, 83, 106, '大崔庄镇'),
	(13, 02, 83, 107, '杨店子镇'),
	(13, 02, 83, 108, '蔡园镇'),
	(13, 02, 83, 109, '马兰庄镇'),
	(13, 02, 83, 110, '沙河驿镇'),
	(13, 02, 83, 111, '木厂口镇'),
	(13, 02, 83, 200, '扣庄乡'),
	(13, 02, 83, 201, '彭店子乡'),
	(13, 02, 83, 202, '上射雁庄乡'),
	(13, 02, 83, 203, '闫家店乡'),
	(13, 02, 83, 204, '五重安乡'),
	(13, 02, 83, 205, '大五里乡'),
	(13, 02, 83, 206, '太平庄乡');

/* 河北省 秦皇岛市 海港区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 03, 02, 001, '文化路街道办事处'),
	(13, 03, 02, 002, '海滨路街道办事处'),
	(13, 03, 02, 003, '北环路街道办事处'),
	(13, 03, 02, 004, '建设大街街道办事处'),
	(13, 03, 02, 005, '河东街道办事处'),
	(13, 03, 02, 006, '西港路街道办事处'),
	(13, 03, 02, 007, '燕山大街街道办事处'),
	(13, 03, 02, 008, '港城大街街道办事处'),
	(13, 03, 02, 009, '东环路街道办事处'),
	(13, 03, 02, 010, '白塔岭街道办事处'),
	(13, 03, 02, 100, '东港镇'),
	(13, 03, 02, 101, '海港镇'),
	(13, 03, 02, 102, '西港镇'),
	(13, 03, 02, 103, '海阳镇'),
	(13, 03, 02, 104, '北港镇'),
	(13, 03, 02, 105, '杜庄镇'),
	(13, 03, 02, 106, '石门寨镇'),
	(13, 03, 02, 107, '驻操营镇');

/* 河北省 秦皇岛市 山海关区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 03, 03, 001, '南关街道办事处'),
	(13, 03, 03, 002, '古城街道办事处'),
	(13, 03, 03, 003, '西关街道办事处'),
	(13, 03, 03, 004, '路南街道办事处'),
	(13, 03, 03, 100, '第一关镇'),
	(13, 03, 03, 101, '石河镇'),
	(13, 03, 03, 102, '孟姜镇');

/* 河北省 秦皇岛市 北戴河区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 03, 04, 001, '西山街道办事处'),
	(13, 03, 04, 002, '东山街道办事处'),
	(13, 03, 04, 100, '海滨镇'),
	(13, 03, 04, 101, '戴河镇'),
	(13, 03, 04, 103, '牛头崖镇');

/* 河北省 秦皇岛市 抚宁区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 03, 06, 001, '骊城街道办事处'),
	(13, 03, 06, 002, '南戴河街道办事处'),
	(13, 03, 06, 100, '抚宁镇'),
	(13, 03, 06, 101, '留守营镇'),
	(13, 03, 06, 102, '榆关镇'),
	(13, 03, 06, 105, '台营镇'),
	(13, 03, 06, 106, '大新寨镇'),
	(13, 03, 06, 200, '茶棚乡'),
	(13, 03, 06, 202, '深河乡');

/* 河北省 秦皇岛市 青龙满族自治县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 03, 21, 100, '青龙镇'),
	(13, 03, 21, 101, '祖山镇'),
	(13, 03, 21, 102, '木头凳镇'),
	(13, 03, 21, 103, '双山子镇'),
	(13, 03, 21, 104, '马圈子镇'),
	(13, 03, 21, 105, '肖营子镇'),
	(13, 03, 21, 106, '大巫岚镇'),
	(13, 03, 21, 107, '土门子镇'),
	(13, 03, 21, 108, '八道河镇'),
	(13, 03, 21, 109, '隔河头镇'),
	(13, 03, 21, 110, '娄杖子镇'),
	(13, 03, 21, 200, '凤凰山乡'),
	(13, 03, 21, 201, '龙王庙乡'),
	(13, 03, 21, 202, '三星口乡'),
	(13, 03, 21, 203, '干沟乡'),
	(13, 03, 21, 206, '大石岭乡'),
	(13, 03, 21, 208, '官场乡'),
	(13, 03, 21, 209, '茨榆山乡'),
	(13, 03, 21, 210, '平方子乡'),
	(13, 03, 21, 211, '安子岭乡'),
	(13, 03, 21, 212, '朱杖子乡'),
	(13, 03, 21, 213, '草碾乡'),
	(13, 03, 21, 214, '七道河乡'),
	(13, 03, 21, 217, '三拨子乡'),
	(13, 03, 21, 218, '凉水河乡');

/* 河北省 秦皇岛市 昌黎县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 03, 22, 100, '昌黎镇'),
	(13, 03, 22, 101, '靖安镇'),
	(13, 03, 22, 102, '安山镇'),
	(13, 03, 22, 103, '龙家店镇'),
	(13, 03, 22, 104, '泥井镇'),
	(13, 03, 22, 105, '大蒲河镇'),
	(13, 03, 22, 106, '新集镇'),
	(13, 03, 22, 107, '刘台庄镇'),
	(13, 03, 22, 108, '茹荷镇'),
	(13, 03, 22, 109, '朱各庄镇'),
	(13, 03, 22, 110, '荒佃庄镇'),
	(13, 03, 22, 201, '团林乡'),
	(13, 03, 22, 202, '葛条港乡'),
	(13, 03, 22, 203, '马坨店乡'),
	(13, 03, 22, 206, '两山乡'),
	(13, 03, 22, 207, '十里铺乡');

/* 河北省 秦皇岛市 卢龙县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 03, 24, 100, '卢龙镇'),
	(13, 03, 24, 101, '潘庄镇'),
	(13, 03, 24, 102, '燕河营镇'),
	(13, 03, 24, 103, '双望镇'),
	(13, 03, 24, 104, '刘田各庄镇'),
	(13, 03, 24, 105, '石门镇'),
	(13, 03, 24, 106, '木井镇'),
	(13, 03, 24, 200, '下寨乡'),
	(13, 03, 24, 201, '刘家营乡'),
	(13, 03, 24, 202, '陈官屯乡'),
	(13, 03, 24, 203, '印庄乡'),
	(13, 03, 24, 204, '蛤泊乡');

/* 河北省 邯郸市 邯山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 02, 001, '火磨街道办事处'),
	(13, 04, 02, 002, '陵园路街道办事处'),
	(13, 04, 02, 003, '光明路街道办事处'),
	(13, 04, 02, 004, '滏东街道办事处'),
	(13, 04, 02, 005, '罗城头街道办事处'),
	(13, 04, 02, 006, '渚河路街道办事处'),
	(13, 04, 02, 007, '浴新南街道办事处'),
	(13, 04, 02, 008, '农林路街道办事处'),
	(13, 04, 02, 009, '贸东街道办事处'),
	(13, 04, 02, 010, '贸西街道办事处'),
	(13, 04, 02, 011, '盛和路街道办事处'),
	(13, 04, 02, 101, '北张庄镇'),
	(13, 04, 02, 200, '马庄乡');

/* 河北省 邯郸市 丛台区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 03, 001, '丛台西街道办事处'),
	(13, 04, 03, 002, '联纺西街道办事处'),
	(13, 04, 03, 003, '联纺东街道办事处'),
	(13, 04, 03, 004, '光明桥街道办事处'),
	(13, 04, 03, 005, '丛台东街道办事处'),
	(13, 04, 03, 006, '四季青街道办事处'),
	(13, 04, 03, 007, '和平街道办事处'),
	(13, 04, 03, 008, '中华街道办事处'),
	(13, 04, 03, 009, '人民路街道办事处'),
	(13, 04, 03, 010, '柳林桥街道办事处'),
	(13, 04, 03, 101, '黄粱梦镇'),
	(13, 04, 03, 200, '苏曹乡'),
	(13, 04, 03, 205, '三陵乡');

/* 河北省 邯郸市 复兴区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 04, 001, '胜利桥街道办事处'),
	(13, 04, 04, 002, '百家村街道办事处'),
	(13, 04, 04, 003, '铁路大院街道办事处'),
	(13, 04, 04, 004, '化林路街道办事处'),
	(13, 04, 04, 005, '庞村街道办事处'),
	(13, 04, 04, 006, '二六七二街道办事处'),
	(13, 04, 04, 007, '石化街道办事处'),
	(13, 04, 04, 100, '户村镇'),
	(13, 04, 04, 200, '彭家寨乡'),
	(13, 04, 04, 201, '康庄乡');

/* 河北省 邯郸市 峰峰矿区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 06, 001, '滏阳东路街道办事处'),
	(13, 04, 06, 100, '临水镇'),
	(13, 04, 06, 101, '峰峰镇'),
	(13, 04, 06, 102, '新坡镇'),
	(13, 04, 06, 103, '大社镇'),
	(13, 04, 06, 104, '和村镇'),
	(13, 04, 06, 105, '义井镇'),
	(13, 04, 06, 106, '彭城镇'),
	(13, 04, 06, 107, '界城镇'),
	(13, 04, 06, 108, '大峪镇'),
	(13, 04, 06, 200, '西固义乡');

/* 河北省 邯郸市 邯郸县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 21, 100, '尚璧镇'),
	(13, 04, 21, 102, '河沙镇镇'),
	(13, 04, 21, 200, '南堡乡'),
	(13, 04, 21, 201, '南吕固乡'),
	(13, 04, 21, 202, '兼庄乡'),
	(13, 04, 21, 203, '代召乡'),
	(13, 04, 21, 212, '姚寨乡');

/* 河北省 邯郸市 临漳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 23, 100, '临漳镇'),
	(13, 04, 23, 101, '南东坊镇'),
	(13, 04, 23, 102, '孙陶集镇'),
	(13, 04, 23, 103, '柳园镇'),
	(13, 04, 23, 104, '称勾集镇'),
	(13, 04, 23, 200, '狄邱乡'),
	(13, 04, 23, 201, '张村集乡'),
	(13, 04, 23, 202, '西羊羔乡'),
	(13, 04, 23, 203, '香菜营乡'),
	(13, 04, 23, 204, '杜村集乡'),
	(13, 04, 23, 205, '章里集乡'),
	(13, 04, 23, 206, '习文乡'),
	(13, 04, 23, 207, '砖寨营乡'),
	(13, 04, 23, 208, '柏鹤集乡');

/* 河北省 邯郸市 成安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 24, 100, '成安镇'),
	(13, 04, 24, 101, '商城镇'),
	(13, 04, 24, 102, '漳河店镇'),
	(13, 04, 24, 103, '李家疃镇'),
	(13, 04, 24, 200, '辛义乡'),
	(13, 04, 24, 201, '柏寺营乡'),
	(13, 04, 24, 202, '道东堡乡'),
	(13, 04, 24, 203, '北乡义乡'),
	(13, 04, 24, 204, '长巷乡');

/* 河北省 邯郸市 大名县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 25, 100, '大名镇'),
	(13, 04, 25, 101, '杨桥镇'),
	(13, 04, 25, 102, '万堤镇'),
	(13, 04, 25, 103, '龙王庙镇'),
	(13, 04, 25, 104, '束馆镇'),
	(13, 04, 25, 105, '金滩镇'),
	(13, 04, 25, 106, '沙圪塔镇'),
	(13, 04, 25, 201, '王村乡'),
	(13, 04, 25, 202, '铺上乡'),
	(13, 04, 25, 203, '黄金堤乡'),
	(13, 04, 25, 204, '大街乡'),
	(13, 04, 25, 205, '旧治乡'),
	(13, 04, 25, 206, '西未庄乡'),
	(13, 04, 25, 207, '孙甘店乡'),
	(13, 04, 25, 208, '西付集乡'),
	(13, 04, 25, 209, '埝头乡'),
	(13, 04, 25, 210, '北峰乡'),
	(13, 04, 25, 211, '张铁集乡'),
	(13, 04, 25, 212, '红庙乡'),
	(13, 04, 25, 213, '营镇回族乡');

/* 河北省 邯郸市 涉县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 26, 001, '平安街道办事处'),
	(13, 04, 26, 100, '涉城镇'),
	(13, 04, 26, 101, '河南店镇'),
	(13, 04, 26, 102, '索堡镇'),
	(13, 04, 26, 103, '西戌镇'),
	(13, 04, 26, 104, '井店镇'),
	(13, 04, 26, 105, '更乐镇'),
	(13, 04, 26, 106, '固新镇'),
	(13, 04, 26, 107, '西达镇'),
	(13, 04, 26, 108, '偏城镇'),
	(13, 04, 26, 200, '神头乡'),
	(13, 04, 26, 201, '辽城乡'),
	(13, 04, 26, 202, '偏店乡'),
	(13, 04, 26, 203, '龙虎乡'),
	(13, 04, 26, 204, '木井乡'),
	(13, 04, 26, 205, '关防乡'),
	(13, 04, 26, 206, '合漳乡'),
	(13, 04, 26, 207, '鹿头乡');

/* 河北省 邯郸市 磁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 27, 100, '磁州镇'),
	(13, 04, 27, 101, '高臾镇'),
	(13, 04, 27, 102, '西光禄镇'),
	(13, 04, 27, 103, '讲武城镇'),
	(13, 04, 27, 104, '岳城镇'),
	(13, 04, 27, 105, '观台镇'),
	(13, 04, 27, 106, '林坛镇'),
	(13, 04, 27, 107, '白土镇'),
	(13, 04, 27, 108, '黄沙镇'),
	(13, 04, 27, 200, '路村营乡'),
	(13, 04, 27, 202, '辛庄营乡'),
	(13, 04, 27, 203, '花官营乡'),
	(13, 04, 27, 204, '时村营乡'),
	(13, 04, 27, 205, '南城乡'),
	(13, 04, 27, 206, '台城乡'),
	(13, 04, 27, 207, '陶泉乡'),
	(13, 04, 27, 208, '都党乡'),
	(13, 04, 27, 209, '北贾壁乡');

/* 河北省 邯郸市 肥乡县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 28, 100, '肥乡镇'),
	(13, 04, 28, 101, '天台山镇'),
	(13, 04, 28, 102, '辛安镇镇'),
	(13, 04, 28, 200, '大西韩乡'),
	(13, 04, 28, 202, '毛演堡乡'),
	(13, 04, 28, 203, '元固乡'),
	(13, 04, 28, 204, '屯庄营乡'),
	(13, 04, 28, 205, '东漳堡乡'),
	(13, 04, 28, 206, '旧店乡');

/* 河北省 邯郸市 永年县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 29, 100, '临洺关镇'),
	(13, 04, 29, 101, '大北汪镇'),
	(13, 04, 29, 102, '张西堡镇'),
	(13, 04, 29, 103, '广府镇'),
	(13, 04, 29, 104, '南沿村镇'),
	(13, 04, 29, 105, '永合会镇'),
	(13, 04, 29, 200, '西苏乡'),
	(13, 04, 29, 201, '界河店乡'),
	(13, 04, 29, 202, '刘营乡'),
	(13, 04, 29, 203, '刘汉乡'),
	(13, 04, 29, 204, '正西乡'),
	(13, 04, 29, 205, '讲武乡'),
	(13, 04, 29, 206, '曲陌乡'),
	(13, 04, 29, 207, '辛庄堡乡'),
	(13, 04, 29, 208, '小龙马乡'),
	(13, 04, 29, 209, '东杨庄乡'),
	(13, 04, 29, 210, '小西堡乡'),
	(13, 04, 29, 211, '西河庄乡'),
	(13, 04, 29, 213, '西阳城乡');

/* 河北省 邯郸市 邱县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 30, 100, '新马头镇'),
	(13, 04, 30, 101, '邱城镇'),
	(13, 04, 30, 102, '梁二庄镇'),
	(13, 04, 30, 103, '香城固镇'),
	(13, 04, 30, 201, '南辛店乡'),
	(13, 04, 30, 203, '古城营乡'),
	(13, 04, 30, 204, '陈村回族乡');

/* 河北省 邯郸市 鸡泽县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 31, 100, '鸡泽镇'),
	(13, 04, 31, 101, '小寨镇'),
	(13, 04, 31, 102, '双塔镇'),
	(13, 04, 31, 200, '浮图店乡'),
	(13, 04, 31, 201, '吴官营乡'),
	(13, 04, 31, 202, '风正乡'),
	(13, 04, 31, 203, '曹庄乡');

/* 河北省 邯郸市 广平县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 32, 100, '广平镇'),
	(13, 04, 32, 101, '平固店镇'),
	(13, 04, 32, 102, '胜营镇'),
	(13, 04, 32, 103, '南阳堡镇'),
	(13, 04, 32, 201, '十里铺乡'),
	(13, 04, 32, 202, '南韩村乡'),
	(13, 04, 32, 204, '东张孟乡');

/* 河北省 邯郸市 馆陶县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 33, 100, '馆陶镇'),
	(13, 04, 33, 101, '房寨镇'),
	(13, 04, 33, 102, '柴堡镇'),
	(13, 04, 33, 103, '魏僧寨镇'),
	(13, 04, 33, 200, '寿山寺乡'),
	(13, 04, 33, 201, '王桥乡'),
	(13, 04, 33, 202, '南徐村乡'),
	(13, 04, 33, 203, '路桥乡');

/* 河北省 邯郸市 魏县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 34, 100, '魏城镇'),
	(13, 04, 34, 101, '德政镇'),
	(13, 04, 34, 102, '北皋镇'),
	(13, 04, 34, 103, '双井镇'),
	(13, 04, 34, 104, '牙里镇'),
	(13, 04, 34, 105, '车往镇'),
	(13, 04, 34, 106, '回隆镇'),
	(13, 04, 34, 107, '张二庄镇'),
	(13, 04, 34, 108, '东代固镇'),
	(13, 04, 34, 201, '棘针寨乡'),
	(13, 04, 34, 202, '沙口集乡'),
	(13, 04, 34, 203, '野胡拐乡'),
	(13, 04, 34, 204, '仕望集乡'),
	(13, 04, 34, 205, '前大磨乡'),
	(13, 04, 34, 206, '院堡乡'),
	(13, 04, 34, 207, '南双庙乡'),
	(13, 04, 34, 208, '大辛庄乡'),
	(13, 04, 34, 209, '大马村乡'),
	(13, 04, 34, 210, '边马乡'),
	(13, 04, 34, 212, '北台头乡'),
	(13, 04, 34, 213, '泊口乡');

/* 河北省 邯郸市 曲周县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 35, 100, '曲周镇'),
	(13, 04, 35, 101, '安寨镇'),
	(13, 04, 35, 102, '侯村镇'),
	(13, 04, 35, 103, '河南疃镇'),
	(13, 04, 35, 104, '第四疃镇'),
	(13, 04, 35, 200, '槐桥乡'),
	(13, 04, 35, 201, '南里岳乡'),
	(13, 04, 35, 202, '白寨乡'),
	(13, 04, 35, 203, '大河道乡'),
	(13, 04, 35, 204, '依庄乡');

/* 河北省 邯郸市 武安市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 04, 81, 100, '武安镇'),
	(13, 04, 81, 101, '康二城镇'),
	(13, 04, 81, 102, '午汲镇'),
	(13, 04, 81, 103, '磁山镇'),
	(13, 04, 81, 104, '伯延镇'),
	(13, 04, 81, 105, '淑村镇'),
	(13, 04, 81, 106, '大同镇'),
	(13, 04, 81, 107, '邑城镇'),
	(13, 04, 81, 108, '矿山镇'),
	(13, 04, 81, 109, '贺进镇'),
	(13, 04, 81, 110, '阳邑镇'),
	(13, 04, 81, 111, '徘徊镇'),
	(13, 04, 81, 112, '冶陶镇'),
	(13, 04, 81, 200, '上团城乡'),
	(13, 04, 81, 201, '北安庄乡'),
	(13, 04, 81, 202, '北安乐乡'),
	(13, 04, 81, 203, '西土山乡'),
	(13, 04, 81, 204, '西寺庄乡'),
	(13, 04, 81, 205, '活水乡'),
	(13, 04, 81, 206, '石洞乡'),
	(13, 04, 81, 207, '管陶乡'),
	(13, 04, 81, 208, '马家庄乡');

/* 河北省 邢台市 桥东区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 02, 001, '南长街街道办事处'),
	(13, 05, 02, 002, '北大街街道办事处'),
	(13, 05, 02, 003, '西大街街道办事处'),
	(13, 05, 02, 004, '西门里街道办事处'),
	(13, 05, 02, 005, '泉东街道办事处'),
	(13, 05, 02, 006, '豫让桥街道'),
	(13, 05, 02, 100, '东郭村镇'),
	(13, 05, 02, 200, '大梁庄乡');

/* 河北省 邢台市 桥西区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 03, 001, '钢铁路街道办事处'),
	(13, 05, 03, 002, '中兴路街道办事处'),
	(13, 05, 03, 003, '达活泉街道办事处'),
	(13, 05, 03, 004, '张宽街道办事处'),
	(13, 05, 03, 005, '章村街道办事处'),
	(13, 05, 03, 006, '中华大街街道办事处'),
	(13, 05, 03, 007, '团结路街道办事处'),
	(13, 05, 03, 008, '泉西街道办事处'),
	(13, 05, 03, 100, '南大郭镇'),
	(13, 05, 03, 101, '李村镇');

/* 河北省 邢台市 邢台县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 21, 103, '晏家屯镇'),
	(13, 05, 21, 104, '南石门镇'),
	(13, 05, 21, 105, '羊范镇'),
	(13, 05, 21, 106, '皇寺镇'),
	(13, 05, 21, 107, '会宁镇'),
	(13, 05, 21, 108, '西黄村镇'),
	(13, 05, 21, 109, '路罗镇'),
	(13, 05, 21, 110, '将军墓镇'),
	(13, 05, 21, 111, '浆水镇'),
	(13, 05, 21, 112, '宋家庄镇'),
	(13, 05, 21, 200, '太子井乡'),
	(13, 05, 21, 201, '龙泉寺乡'),
	(13, 05, 21, 202, '北小庄乡'),
	(13, 05, 21, 203, '城计头乡'),
	(13, 05, 21, 204, '白岸乡'),
	(13, 05, 21, 206, '冀家村乡');

/* 河北省 邢台市 临城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 22, 100, '临城镇'),
	(13, 05, 22, 101, '东镇镇'),
	(13, 05, 22, 102, '西竖镇'),
	(13, 05, 22, 103, '郝庄镇'),
	(13, 05, 22, 200, '黑城乡'),
	(13, 05, 22, 201, '鸭鸽营乡'),
	(13, 05, 22, 203, '石城乡'),
	(13, 05, 22, 205, '赵庄乡');

/* 河北省 邢台市 内丘县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 23, 100, '内丘镇'),
	(13, 05, 23, 101, '大孟村镇'),
	(13, 05, 23, 102, '金店镇'),
	(13, 05, 23, 103, '官庄镇'),
	(13, 05, 23, 104, '柳林镇'),
	(13, 05, 23, 200, '五郭店乡'),
	(13, 05, 23, 203, '南赛乡'),
	(13, 05, 23, 204, '獐獏乡'),
	(13, 05, 23, 205, '侯家庄乡');

/* 河北省 邢台市 柏乡县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 24, 100, '柏乡镇'),
	(13, 05, 24, 101, '固城店镇'),
	(13, 05, 24, 102, '西汪镇'),
	(13, 05, 24, 200, '王家庄乡'),
	(13, 05, 24, 202, '龙华乡'),
	(13, 05, 24, 203, '内步乡');

/* 河北省 邢台市 隆尧县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 25, 100, '隆尧镇'),
	(13, 05, 25, 101, '魏家庄镇'),
	(13, 05, 25, 102, '尹村镇'),
	(13, 05, 25, 103, '山口镇'),
	(13, 05, 25, 104, '莲子镇镇'),
	(13, 05, 25, 105, '固城镇'),
	(13, 05, 25, 200, '北楼乡'),
	(13, 05, 25, 201, '东良乡'),
	(13, 05, 25, 202, '双碑乡'),
	(13, 05, 25, 203, '牛家桥乡'),
	(13, 05, 25, 204, '千户营乡'),
	(13, 05, 25, 205, '大张庄乡');

/* 河北省 邢台市 任县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 26, 100, '任城镇'),
	(13, 05, 26, 101, '邢家湾镇'),
	(13, 05, 26, 102, '辛店镇'),
	(13, 05, 26, 103, '天口镇'),
	(13, 05, 26, 200, '西固城乡'),
	(13, 05, 26, 201, '永福庄乡'),
	(13, 05, 26, 202, '大屯乡'),
	(13, 05, 26, 204, '骆庄乡');

/* 河北省 邢台市 南和县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 27, 100, '和阳镇'),
	(13, 05, 27, 101, '贾宋镇'),
	(13, 05, 27, 102, '郝桥镇'),
	(13, 05, 27, 200, '东三召乡'),
	(13, 05, 27, 201, '阎里乡'),
	(13, 05, 27, 202, '河郭乡'),
	(13, 05, 27, 203, '史召乡'),
	(13, 05, 27, 204, '三思乡');

/* 河北省 邢台市 宁晋县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 28, 100, '凤凰镇'),
	(13, 05, 28, 101, '河渠镇'),
	(13, 05, 28, 102, '北河庄镇'),
	(13, 05, 28, 103, '耿庄桥镇'),
	(13, 05, 28, 104, '东汪镇'),
	(13, 05, 28, 105, '贾家口镇'),
	(13, 05, 28, 106, '四芝兰镇'),
	(13, 05, 28, 107, '大陆村镇'),
	(13, 05, 28, 108, '苏家庄镇'),
	(13, 05, 28, 109, '换马店镇'),
	(13, 05, 28, 200, '侯口乡'),
	(13, 05, 28, 202, '纪昌庄乡'),
	(13, 05, 28, 203, '唐邱乡'),
	(13, 05, 28, 205, '北鱼乡');

/* 河北省 邢台市 巨鹿县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 29, 100, '巨鹿镇'),
	(13, 05, 29, 101, '王虎寨镇'),
	(13, 05, 29, 102, '西郭城镇'),
	(13, 05, 29, 103, '官亭镇'),
	(13, 05, 29, 104, '阎疃镇'),
	(13, 05, 29, 105, '小吕寨镇'),
	(13, 05, 29, 200, '堤村乡'),
	(13, 05, 29, 201, '张王疃乡'),
	(13, 05, 29, 202, '观寨乡'),
	(13, 05, 29, 203, '苏家营乡');

/* 河北省 邢台市 新河县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 30, 100, '新河镇'),
	(13, 05, 30, 101, '寻寨镇'),
	(13, 05, 30, 200, '白神首乡'),
	(13, 05, 30, 201, '荆家庄乡'),
	(13, 05, 30, 202, '西流乡'),
	(13, 05, 30, 203, '仁让里乡');

/* 河北省 邢台市 广宗县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 31, 100, '广宗镇'),
	(13, 05, 31, 101, '冯家寨镇'),
	(13, 05, 31, 102, '北塘疃镇'),
	(13, 05, 31, 200, '葫芦乡'),
	(13, 05, 31, 201, '大平台乡'),
	(13, 05, 31, 202, '件只乡'),
	(13, 05, 31, 203, '核桃园乡'),
	(13, 05, 31, 204, '东召乡');

/* 河北省 邢台市 平乡县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 32, 001, '平乡县中华路街道办事处'),
	(13, 05, 32, 100, '丰州镇'),
	(13, 05, 32, 101, '平乡镇'),
	(13, 05, 32, 102, '河古庙镇'),
	(13, 05, 32, 200, '节固乡'),
	(13, 05, 32, 201, '油召乡'),
	(13, 05, 32, 202, '田付村乡'),
	(13, 05, 32, 203, '寻召乡');

/* 河北省 邢台市 威县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 33, 100, '洺州镇'),
	(13, 05, 33, 101, '梨园屯镇'),
	(13, 05, 33, 102, '章台镇'),
	(13, 05, 33, 103, '侯贯镇'),
	(13, 05, 33, 104, '七级镇'),
	(13, 05, 33, 105, '贺营镇'),
	(13, 05, 33, 106, '方家营镇'),
	(13, 05, 33, 107, '常庄镇'),
	(13, 05, 33, 201, '第什营乡'),
	(13, 05, 33, 202, '枣园乡'),
	(13, 05, 33, 203, '固献乡'),
	(13, 05, 33, 204, '贺钊乡'),
	(13, 05, 33, 206, '张家营乡'),
	(13, 05, 33, 207, '常屯乡'),
	(13, 05, 33, 209, '高公庄乡'),
	(13, 05, 33, 210, '赵村乡');

/* 河北省 邢台市 清河县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 34, 100, '葛仙庄镇'),
	(13, 05, 34, 101, '连庄镇'),
	(13, 05, 34, 102, '油坊镇'),
	(13, 05, 34, 103, '谢炉镇'),
	(13, 05, 34, 104, '王官庄镇'),
	(13, 05, 34, 105, '坝营镇');

/* 河北省 邢台市 临西县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 35, 100, '临西镇'),
	(13, 05, 35, 101, '河西镇'),
	(13, 05, 35, 102, '下堡寺镇'),
	(13, 05, 35, 103, '尖冢镇'),
	(13, 05, 35, 104, '老官寨镇'),
	(13, 05, 35, 105, '吕寨镇'),
	(13, 05, 35, 200, '东枣园乡'),
	(13, 05, 35, 203, '摇鞍镇乡'),
	(13, 05, 35, 204, '大刘庄乡');

/* 河北省 邢台市 南宫市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 81, 001, '凤岗街道办事处'),
	(13, 05, 81, 002, '南杜街道办事处'),
	(13, 05, 81, 003, '北胡街道办事处'),
	(13, 05, 81, 004, '西丁街道办事处'),
	(13, 05, 81, 100, '苏村镇'),
	(13, 05, 81, 101, '大高村镇'),
	(13, 05, 81, 102, '垂杨镇'),
	(13, 05, 81, 103, '明化镇'),
	(13, 05, 81, 104, '段芦头镇'),
	(13, 05, 81, 105, '紫冢镇'),
	(13, 05, 81, 200, '大村乡'),
	(13, 05, 81, 201, '南便村乡'),
	(13, 05, 81, 202, '大屯乡'),
	(13, 05, 81, 203, '王道寨乡'),
	(13, 05, 81, 204, '薛吴村乡');

/* 河北省 邢台市 沙河市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 05, 82, 001, '褡裢街道办事处'),
	(13, 05, 82, 002, '桥东街道办事处'),
	(13, 05, 82, 003, '桥西街道办事处'),
	(13, 05, 82, 004, '赞善办事处'),
	(13, 05, 82, 005, '周庄街道办事处'),
	(13, 05, 82, 101, '新城镇'),
	(13, 05, 82, 102, '白塔镇'),
	(13, 05, 82, 103, '十里亭镇'),
	(13, 05, 82, 104, '綦村镇'),
	(13, 05, 82, 201, '册井乡'),
	(13, 05, 82, 202, '刘石岗乡'),
	(13, 05, 82, 203, '柴关乡'),
	(13, 05, 82, 204, '蝉房乡');

/* 河北省 保定市 竞秀区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 02, 001, '先锋街道办事处'),
	(13, 06, 02, 002, '新市场街道办事处'),
	(13, 06, 02, 003, '东风街道办事处'),
	(13, 06, 02, 004, '建南街道办事处'),
	(13, 06, 02, 005, '韩村北路街道办事处'),
	(13, 06, 02, 200, '颉庄乡'),
	(13, 06, 02, 201, '富昌乡'),
	(13, 06, 02, 202, '韩村乡'),
	(13, 06, 02, 203, '南奇乡'),
	(13, 06, 02, 204, '江城乡');

/* 河北省 保定市 莲池区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 06, 001, '和平里街道办事处'),
	(13, 06, 06, 002, '五四路街道办事处'),
	(13, 06, 06, 003, '西关街道办事处'),
	(13, 06, 06, 004, '中华路街道办事处'),
	(13, 06, 06, 005, '东关街道办事处'),
	(13, 06, 06, 006, '联盟街道办事处'),
	(13, 06, 06, 007, '红星街道办事处'),
	(13, 06, 06, 008, '裕华街道办事处'),
	(13, 06, 06, 009, '永华街道办事处'),
	(13, 06, 06, 010, '南关街道办事处'),
	(13, 06, 06, 200, '韩庄乡'),
	(13, 06, 06, 201, '东金庄乡'),
	(13, 06, 06, 202, '百楼乡'),
	(13, 06, 06, 203, '杨庄乡'),
	(13, 06, 06, 204, '南大园乡'),
	(13, 06, 06, 205, '焦庄乡'),
	(13, 06, 06, 206, '五尧乡');

/* 河北省 保定市 满城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 07, 001, '惠阳街道办事处'),
	(13, 06, 07, 100, '满城镇'),
	(13, 06, 07, 101, '大册营镇'),
	(13, 06, 07, 102, '神星镇'),
	(13, 06, 07, 103, '南韩村镇'),
	(13, 06, 07, 104, '方顺桥镇'),
	(13, 06, 07, 201, '于家庄乡'),
	(13, 06, 07, 203, '要庄乡'),
	(13, 06, 07, 204, '白龙乡'),
	(13, 06, 07, 205, '石井乡'),
	(13, 06, 07, 206, '坨南乡'),
	(13, 06, 07, 207, '刘家台乡');

/* 河北省 保定市 清苑区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 08, 100, '清苑镇'),
	(13, 06, 08, 101, '冉庄镇'),
	(13, 06, 08, 102, '阳城镇'),
	(13, 06, 08, 103, '魏村镇'),
	(13, 06, 08, 104, '温仁镇'),
	(13, 06, 08, 105, '张登镇'),
	(13, 06, 08, 106, '大庄镇'),
	(13, 06, 08, 107, '臧村镇'),
	(13, 06, 08, 200, '白团乡'),
	(13, 06, 08, 201, '北店乡'),
	(13, 06, 08, 202, '石桥乡'),
	(13, 06, 08, 203, '李庄乡'),
	(13, 06, 08, 204, '北王力乡'),
	(13, 06, 08, 205, '东吕乡'),
	(13, 06, 08, 206, '何桥乡'),
	(13, 06, 08, 207, '孙村乡'),
	(13, 06, 08, 208, '阎庄乡'),
	(13, 06, 08, 209, '望亭乡');

/* 河北省 保定市 徐水区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 09, 100, '安肃镇'),
	(13, 06, 09, 101, '崔庄镇'),
	(13, 06, 09, 102, '大因镇'),
	(13, 06, 09, 103, '遂城镇'),
	(13, 06, 09, 104, '高林村镇'),
	(13, 06, 09, 105, '大王店镇'),
	(13, 06, 09, 106, '漕河镇'),
	(13, 06, 09, 200, '东史端乡'),
	(13, 06, 09, 201, '留村乡'),
	(13, 06, 09, 202, '正村乡'),
	(13, 06, 09, 203, '户木乡'),
	(13, 06, 09, 204, '瀑河乡'),
	(13, 06, 09, 205, '东釜山乡'),
	(13, 06, 09, 206, '义联庄乡');

/* 河北省 保定市 涞水县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 23, 001, '城区社区管理办公室街道办事处'),
	(13, 06, 23, 100, '涞水镇'),
	(13, 06, 23, 101, '永阳镇'),
	(13, 06, 23, 102, '义安镇'),
	(13, 06, 23, 103, '石亭镇'),
	(13, 06, 23, 104, '赵各庄镇'),
	(13, 06, 23, 105, '九龙镇'),
	(13, 06, 23, 106, '三坡镇'),
	(13, 06, 23, 200, '明义乡'),
	(13, 06, 23, 201, '王村乡'),
	(13, 06, 23, 202, '东文山乡'),
	(13, 06, 23, 203, '娄村满族乡'),
	(13, 06, 23, 204, '宋各庄乡'),
	(13, 06, 23, 205, '其中口乡'),
	(13, 06, 23, 206, '龙门乡'),
	(13, 06, 23, 207, '胡家庄乡');

/* 河北省 保定市 阜平县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 24, 100, '阜平镇'),
	(13, 06, 24, 101, '龙泉关镇'),
	(13, 06, 24, 102, '平阳镇'),
	(13, 06, 24, 103, '城南庄镇'),
	(13, 06, 24, 104, '天生桥镇'),
	(13, 06, 24, 105, '王林口镇'),
	(13, 06, 24, 202, '台峪乡'),
	(13, 06, 24, 203, '大台乡'),
	(13, 06, 24, 204, '史家寨乡'),
	(13, 06, 24, 205, '砂窝乡'),
	(13, 06, 24, 206, '吴王口乡'),
	(13, 06, 24, 207, '夏庄乡'),
	(13, 06, 24, 208, '北果元乡');

/* 河北省 保定市 定兴县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 26, 100, '定兴镇'),
	(13, 06, 26, 101, '固城镇'),
	(13, 06, 26, 102, '贤寓镇'),
	(13, 06, 26, 103, '北河镇'),
	(13, 06, 26, 104, '天宫寺镇'),
	(13, 06, 26, 105, '小朱庄镇'),
	(13, 06, 26, 200, '东落堡乡'),
	(13, 06, 26, 201, '高里乡'),
	(13, 06, 26, 202, '张家庄乡'),
	(13, 06, 26, 203, '姚村乡'),
	(13, 06, 26, 204, '肖村乡'),
	(13, 06, 26, 205, '柳卓乡'),
	(13, 06, 26, 206, '杨村乡'),
	(13, 06, 26, 207, '北田乡'),
	(13, 06, 26, 208, '北南蔡乡'),
	(13, 06, 26, 209, '李郁庄乡');

/* 河北省 保定市 唐县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 27, 100, '仁厚镇'),
	(13, 06, 27, 101, '王京镇'),
	(13, 06, 27, 102, '高昌镇'),
	(13, 06, 27, 103, '北罗镇'),
	(13, 06, 27, 104, '白合镇'),
	(13, 06, 27, 105, '军城镇'),
	(13, 06, 27, 106, '川里镇'),
	(13, 06, 27, 107, '长古城镇'),
	(13, 06, 27, 201, '都亭乡'),
	(13, 06, 27, 202, '南店头乡'),
	(13, 06, 27, 203, '北店头乡'),
	(13, 06, 27, 204, '罗庄乡'),
	(13, 06, 27, 205, '雹水乡'),
	(13, 06, 27, 206, '大洋乡'),
	(13, 06, 27, 207, '迷城乡'),
	(13, 06, 27, 208, '齐家佐乡'),
	(13, 06, 27, 209, '羊角乡'),
	(13, 06, 27, 210, '石门乡'),
	(13, 06, 27, 211, '黄石口乡'),
	(13, 06, 27, 212, '倒马关乡');

/* 河北省 保定市 高阳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 28, 100, '高阳镇'),
	(13, 06, 28, 101, '庞口镇'),
	(13, 06, 28, 102, '西演镇'),
	(13, 06, 28, 103, '邢家南镇'),
	(13, 06, 28, 104, '晋庄镇'),
	(13, 06, 28, 202, '蒲口乡'),
	(13, 06, 28, 203, '小王果庄乡'),
	(13, 06, 28, 204, '龙化乡'),
	(13, 06, 28, 205, '庞家佐乡');

/* 河北省 保定市 容城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 29, 100, '容城镇'),
	(13, 06, 29, 101, '小里镇'),
	(13, 06, 29, 102, '南张镇'),
	(13, 06, 29, 103, '大河镇'),
	(13, 06, 29, 104, '晾马台镇'),
	(13, 06, 29, 200, '八于乡'),
	(13, 06, 29, 201, '贾光乡'),
	(13, 06, 29, 203, '平王乡');

/* 河北省 保定市 涞源县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 30, 100, '涞源镇'),
	(13, 06, 30, 101, '银坊镇'),
	(13, 06, 30, 102, '走马驿镇'),
	(13, 06, 30, 103, '水堡镇'),
	(13, 06, 30, 104, '王安镇'),
	(13, 06, 30, 105, '杨家庄镇'),
	(13, 06, 30, 106, '白石山镇'),
	(13, 06, 30, 200, '南屯乡'),
	(13, 06, 30, 201, '南马庄乡'),
	(13, 06, 30, 202, '北石佛乡'),
	(13, 06, 30, 203, '金家井乡'),
	(13, 06, 30, 204, '留家庄乡'),
	(13, 06, 30, 205, '上庄乡'),
	(13, 06, 30, 206, '东团堡乡'),
	(13, 06, 30, 207, '塔崖驿乡'),
	(13, 06, 30, 208, '乌龙沟乡'),
	(13, 06, 30, 209, '烟煤洞乡');

/* 河北省 保定市 望都县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 31, 100, '望都镇'),
	(13, 06, 31, 101, '固店镇'),
	(13, 06, 31, 102, '贾村镇'),
	(13, 06, 31, 200, '寺庄乡'),
	(13, 06, 31, 201, '赵庄乡'),
	(13, 06, 31, 202, '黑堡乡'),
	(13, 06, 31, 204, '高岭乡'),
	(13, 06, 31, 205, '中韩庄乡');

/* 河北省 保定市 安新县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 32, 100, '安新镇'),
	(13, 06, 32, 101, '大王镇'),
	(13, 06, 32, 102, '三台镇'),
	(13, 06, 32, 103, '端村镇'),
	(13, 06, 32, 104, '赵北口镇'),
	(13, 06, 32, 105, '同口镇'),
	(13, 06, 32, 106, '刘李庄镇'),
	(13, 06, 32, 107, '安州镇'),
	(13, 06, 32, 108, '老河头镇'),
	(13, 06, 32, 200, '圈头乡'),
	(13, 06, 32, 201, '寨里乡'),
	(13, 06, 32, 202, '芦庄乡');

/* 河北省 保定市 易县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 33, 100, '易州镇'),
	(13, 06, 33, 101, '梁格庄镇'),
	(13, 06, 33, 102, '西陵镇'),
	(13, 06, 33, 103, '裴山镇'),
	(13, 06, 33, 104, '塘湖镇'),
	(13, 06, 33, 105, '狼牙山镇'),
	(13, 06, 33, 106, '良岗镇'),
	(13, 06, 33, 107, '紫荆关镇'),
	(13, 06, 33, 108, '高村镇'),
	(13, 06, 33, 200, '桥头乡'),
	(13, 06, 33, 201, '白马乡'),
	(13, 06, 33, 202, '流井乡'),
	(13, 06, 33, 204, '高陌乡'),
	(13, 06, 33, 205, '大龙华乡'),
	(13, 06, 33, 206, '安格庄乡'),
	(13, 06, 33, 207, '凌云册乡'),
	(13, 06, 33, 208, '西山北乡'),
	(13, 06, 33, 209, '尉都乡'),
	(13, 06, 33, 210, '独乐乡'),
	(13, 06, 33, 211, '七峪乡'),
	(13, 06, 33, 212, '富岗乡'),
	(13, 06, 33, 213, '坡仓乡'),
	(13, 06, 33, 214, '牛岗乡'),
	(13, 06, 33, 215, '桥家河乡'),
	(13, 06, 33, 216, '甘河净乡'),
	(13, 06, 33, 217, '蔡家峪乡'),
	(13, 06, 33, 218, '南城司乡');

/* 河北省 保定市 曲阳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 34, 100, '恒州镇'),
	(13, 06, 34, 101, '灵山镇'),
	(13, 06, 34, 102, '燕赵镇'),
	(13, 06, 34, 103, '羊平镇'),
	(13, 06, 34, 104, '文德镇'),
	(13, 06, 34, 200, '路庄子乡'),
	(13, 06, 34, 201, '下河乡'),
	(13, 06, 34, 202, '庄窠乡'),
	(13, 06, 34, 203, '孝墓乡'),
	(13, 06, 34, 205, '东旺乡'),
	(13, 06, 34, 206, '晓林乡'),
	(13, 06, 34, 207, '邸村乡'),
	(13, 06, 34, 208, '产德乡'),
	(13, 06, 34, 209, '齐村乡'),
	(13, 06, 34, 210, '党城乡'),
	(13, 06, 34, 211, '郎家庄乡'),
	(13, 06, 34, 212, '范家庄乡'),
	(13, 06, 34, 213, '北台乡');

/* 河北省 保定市 蠡县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 35, 100, '蠡吾镇'),
	(13, 06, 35, 101, '留史镇'),
	(13, 06, 35, 102, '大百尺镇'),
	(13, 06, 35, 103, '辛兴镇'),
	(13, 06, 35, 104, '北郭丹镇'),
	(13, 06, 35, 105, '万安镇'),
	(13, 06, 35, 106, '桑园镇'),
	(13, 06, 35, 107, '南庄镇'),
	(13, 06, 35, 108, '大曲堤镇'),
	(13, 06, 35, 200, '小陈乡'),
	(13, 06, 35, 201, '林堡乡'),
	(13, 06, 35, 202, '北埝头乡'),
	(13, 06, 35, 203, '鲍墟乡');

/* 河北省 保定市 顺平县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 36, 100, '蒲阳镇'),
	(13, 06, 36, 101, '高于铺镇'),
	(13, 06, 36, 102, '腰山镇'),
	(13, 06, 36, 103, '蒲上镇'),
	(13, 06, 36, 104, '神南镇'),
	(13, 06, 36, 201, '白云乡'),
	(13, 06, 36, 202, '河口乡'),
	(13, 06, 36, 203, '安阳乡'),
	(13, 06, 36, 204, '台鱼乡'),
	(13, 06, 36, 205, '大悲乡');

/* 河北省 保定市 博野县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 37, 100, '博野镇'),
	(13, 06, 37, 101, '小店镇'),
	(13, 06, 37, 102, '程委镇'),
	(13, 06, 37, 103, '东墟镇'),
	(13, 06, 37, 201, '北杨村乡'),
	(13, 06, 37, 202, '城东乡'),
	(13, 06, 37, 203, '南小王乡');

/* 河北省 保定市 雄县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 38, 100, '雄州镇'),
	(13, 06, 38, 101, '昝岗镇'),
	(13, 06, 38, 102, '大营镇'),
	(13, 06, 38, 103, '龙湾镇'),
	(13, 06, 38, 104, '朱各庄镇'),
	(13, 06, 38, 105, '米家务镇'),
	(13, 06, 38, 200, '北沙口乡'),
	(13, 06, 38, 203, '双堂乡'),
	(13, 06, 38, 204, '张岗乡');

/* 河北省 保定市 涿州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 81, 001, '双塔街道办事处'),
	(13, 06, 81, 002, '桃园街道办事处'),
	(13, 06, 81, 003, '清凉寺街道办事处'),
	(13, 06, 81, 100, '松林店镇'),
	(13, 06, 81, 101, '码头镇'),
	(13, 06, 81, 102, '东城坊镇'),
	(13, 06, 81, 103, '高官庄镇'),
	(13, 06, 81, 104, '东仙坡镇'),
	(13, 06, 81, 105, '百尺竿镇'),
	(13, 06, 81, 106, '义和庄镇'),
	(13, 06, 81, 203, '林家屯乡'),
	(13, 06, 81, 204, '孙庄乡'),
	(13, 06, 81, 205, '豆庄乡'),
	(13, 06, 81, 206, '刁窝乡');

/* 河北省 保定市 安国市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 83, 001, '祁州药市街道办事处'),
	(13, 06, 83, 100, '祁州镇'),
	(13, 06, 83, 101, '伍仁桥镇'),
	(13, 06, 83, 102, '石佛镇'),
	(13, 06, 83, 103, '郑章镇'),
	(13, 06, 83, 104, '大五女镇'),
	(13, 06, 83, 105, '西佛落镇'),
	(13, 06, 83, 200, '明官店乡'),
	(13, 06, 83, 201, '南娄底乡'),
	(13, 06, 83, 202, '西安国城乡'),
	(13, 06, 83, 204, '北段村乡');

/* 河北省 保定市 高碑店市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 06, 84, 001, '和平街道办事处'),
	(13, 06, 84, 002, '军城街道办事处'),
	(13, 06, 84, 003, '东盛街道办事处'),
	(13, 06, 84, 004, '北城街道办事处'),
	(13, 06, 84, 005, '兴华路街道办事处'),
	(13, 06, 84, 100, '方官镇'),
	(13, 06, 84, 101, '新城镇'),
	(13, 06, 84, 102, '泗庄镇'),
	(13, 06, 84, 104, '辛立庄镇'),
	(13, 06, 84, 105, '东马营镇'),
	(13, 06, 84, 200, '肖官营乡'),
	(13, 06, 84, 201, '梁家营乡'),
	(13, 06, 84, 202, '张六庄乡'),
	(13, 06, 84, 204, '辛桥乡');

/* 河北省 张家口市 桥东区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 02, 001, '红旗楼街道办事处'),
	(13, 07, 02, 002, '胜利北路街道办事处'),
	(13, 07, 02, 003, '五一路街道办事处'),
	(13, 07, 02, 004, '花园街街道办事处'),
	(13, 07, 02, 005, '工业路街道办事处'),
	(13, 07, 02, 101, '姚家庄镇');

/* 河北省 张家口市 桥西区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 03, 001, '新华街街道办事处'),
	(13, 07, 03, 002, '大境门街道办事处'),
	(13, 07, 03, 003, '明德北街街道办事处'),
	(13, 07, 03, 004, '明德南街街道办事处'),
	(13, 07, 03, 005, '堡子里街道办事处'),
	(13, 07, 03, 006, '南营坊街道办事处'),
	(13, 07, 03, 007, '工人新村街道办事处'),
	(13, 07, 03, 100, '东窑子镇');

/* 河北省 张家口市 宣化区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 05, 001, '天泰寺街道办事处'),
	(13, 07, 05, 002, '皇城街道办事处'),
	(13, 07, 05, 003, '南关街道办事处'),
	(13, 07, 05, 004, '南大街街道办事处'),
	(13, 07, 05, 005, '大北街街道办事处'),
	(13, 07, 05, 006, '工业街街道办事处'),
	(13, 07, 05, 007, '建国街街道办事处'),
	(13, 07, 05, 100, '庞家堡镇'),
	(13, 07, 05, 200, '河子西乡'),
	(13, 07, 05, 201, '春光乡'),
	(13, 07, 05, 202, '侯家庙乡');

/* 河北省 张家口市 下花园区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 06, 001, '城镇街道办事处'),
	(13, 07, 06, 002, '煤矿街道办事处'),
	(13, 07, 06, 200, '花园乡'),
	(13, 07, 06, 201, '辛庄子乡'),
	(13, 07, 06, 202, '定方水乡'),
	(13, 07, 06, 203, '段家堡乡');

/* 河北省 张家口市 宣化县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 21, 100, '洋河南镇'),
	(13, 07, 21, 101, '深井镇'),
	(13, 07, 21, 102, '崞村镇'),
	(13, 07, 21, 103, '沙岭子镇'),
	(13, 07, 21, 105, '大仓盖镇'),
	(13, 07, 21, 106, '贾家营镇'),
	(13, 07, 21, 107, '顾家营镇'),
	(13, 07, 21, 108, '赵川镇'),
	(13, 07, 21, 200, '王家湾乡'),
	(13, 07, 21, 201, '塔儿村乡'),
	(13, 07, 21, 202, '江家屯乡'),
	(13, 07, 21, 203, '东望山乡'),
	(13, 07, 21, 204, '李家堡乡');

/* 河北省 张家口市 张北县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 22, 100, '张北镇'),
	(13, 07, 22, 101, '公会镇'),
	(13, 07, 22, 102, '二台镇'),
	(13, 07, 22, 103, '大囫囵镇'),
	(13, 07, 22, 104, '小二台镇'),
	(13, 07, 22, 200, '台路沟乡'),
	(13, 07, 22, 201, '油篓沟乡'),
	(13, 07, 22, 202, '馒头营乡'),
	(13, 07, 22, 203, '二泉井乡'),
	(13, 07, 22, 204, '单晶河乡'),
	(13, 07, 22, 205, '大河乡'),
	(13, 07, 22, 206, '海流图乡'),
	(13, 07, 22, 207, '两面井乡'),
	(13, 07, 22, 208, '大西湾乡'),
	(13, 07, 22, 209, '郝家营乡'),
	(13, 07, 22, 210, '白庙滩乡'),
	(13, 07, 22, 212, '战海乡'),
	(13, 07, 22, 213, '三号乡');

/* 河北省 张家口市 康保县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 23, 100, '康保镇'),
	(13, 07, 23, 101, '张纪镇'),
	(13, 07, 23, 102, '土城子镇'),
	(13, 07, 23, 103, '邓油坊镇'),
	(13, 07, 23, 104, '李家地镇'),
	(13, 07, 23, 105, '照阳河镇'),
	(13, 07, 23, 106, '屯垦镇'),
	(13, 07, 23, 200, '闫油坊乡'),
	(13, 07, 23, 201, '丹清河乡'),
	(13, 07, 23, 202, '哈咇嘎乡'),
	(13, 07, 23, 203, '二号卜乡'),
	(13, 07, 23, 204, '芦家营乡'),
	(13, 07, 23, 205, '忠义乡'),
	(13, 07, 23, 206, '处长地乡'),
	(13, 07, 23, 207, '满德堂乡');

/* 河北省 张家口市 沽源县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 24, 100, '平定堡镇'),
	(13, 07, 24, 101, '小厂镇'),
	(13, 07, 24, 102, '黄盖淖镇'),
	(13, 07, 24, 103, '九连城镇'),
	(13, 07, 24, 200, '高山堡乡'),
	(13, 07, 24, 201, '小河子乡'),
	(13, 07, 24, 202, '二道渠乡'),
	(13, 07, 24, 203, '大二号回族乡'),
	(13, 07, 24, 204, '闪电河乡'),
	(13, 07, 24, 205, '长梁乡'),
	(13, 07, 24, 206, '丰源店乡'),
	(13, 07, 24, 207, '西辛营乡'),
	(13, 07, 24, 208, '莲花滩乡'),
	(13, 07, 24, 209, '白土窑乡');

/* 河北省 张家口市 尚义县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 25, 100, '南壕堑镇'),
	(13, 07, 25, 101, '大青沟镇'),
	(13, 07, 25, 102, '八道沟镇'),
	(13, 07, 25, 103, '红土梁镇'),
	(13, 07, 25, 104, '小蒜沟镇'),
	(13, 07, 25, 105, '三工地镇'),
	(13, 07, 25, 106, '满井镇'),
	(13, 07, 25, 200, '大营盘乡'),
	(13, 07, 25, 201, '大苏计乡'),
	(13, 07, 25, 202, '石井乡'),
	(13, 07, 25, 205, '七甲乡'),
	(13, 07, 25, 206, '套里庄乡'),
	(13, 07, 25, 207, '甲石河乡'),
	(13, 07, 25, 208, '下马圈乡');

/* 河北省 张家口市 蔚县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 26, 100, '蔚州镇'),
	(13, 07, 26, 101, '代王城镇'),
	(13, 07, 26, 102, '西合营镇'),
	(13, 07, 26, 103, '吉家庄镇'),
	(13, 07, 26, 104, '白乐镇'),
	(13, 07, 26, 105, '暖泉镇'),
	(13, 07, 26, 106, '南留庄镇'),
	(13, 07, 26, 107, '北水泉镇'),
	(13, 07, 26, 108, '桃花镇'),
	(13, 07, 26, 109, '阳眷镇'),
	(13, 07, 26, 110, '宋家庄镇'),
	(13, 07, 26, 200, '下宫村乡'),
	(13, 07, 26, 202, '南杨庄乡'),
	(13, 07, 26, 203, '柏树乡'),
	(13, 07, 26, 204, '常宁乡'),
	(13, 07, 26, 205, '涌泉庄乡'),
	(13, 07, 26, 206, '杨庄窠乡'),
	(13, 07, 26, 207, '南岭庄乡'),
	(13, 07, 26, 208, '陈家洼乡'),
	(13, 07, 26, 209, '黄梅乡'),
	(13, 07, 26, 210, '白草村乡'),
	(13, 07, 26, 211, '草沟堡乡');

/* 河北省 张家口市 阳原县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 27, 100, '西城镇'),
	(13, 07, 27, 101, '东城镇'),
	(13, 07, 27, 102, '化稍营镇'),
	(13, 07, 27, 103, '揣骨疃镇'),
	(13, 07, 27, 104, '东井集镇'),
	(13, 07, 27, 200, '要家庄乡'),
	(13, 07, 27, 201, '东坊城堡乡'),
	(13, 07, 27, 202, '井儿沟乡'),
	(13, 07, 27, 203, '三马坊乡'),
	(13, 07, 27, 204, '高墙乡'),
	(13, 07, 27, 205, '大田洼乡'),
	(13, 07, 27, 206, '辛堡乡'),
	(13, 07, 27, 207, '马圈堡乡'),
	(13, 07, 27, 208, '浮图讲乡');

/* 河北省 张家口市 怀安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 28, 100, '柴沟堡镇'),
	(13, 07, 28, 101, '左卫镇'),
	(13, 07, 28, 102, '头百户镇'),
	(13, 07, 28, 103, '怀安城镇'),
	(13, 07, 28, 200, '渡口堡乡'),
	(13, 07, 28, 201, '第六屯乡'),
	(13, 07, 28, 202, '西湾堡乡'),
	(13, 07, 28, 203, '西沙城乡'),
	(13, 07, 28, 204, '太平庄乡'),
	(13, 07, 28, 205, '王虎屯乡'),
	(13, 07, 28, 206, '第三堡乡');

/* 河北省 张家口市 万全县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 29, 001, '孔家庄街道办事处'),
	(13, 07, 29, 100, '孔家庄镇'),
	(13, 07, 29, 101, '万全镇'),
	(13, 07, 29, 102, '洗马林镇'),
	(13, 07, 29, 103, '郭磊庄镇'),
	(13, 07, 29, 200, '膳房堡乡'),
	(13, 07, 29, 201, '北新屯乡'),
	(13, 07, 29, 202, '宣平堡乡'),
	(13, 07, 29, 203, '高庙堡乡'),
	(13, 07, 29, 204, '旧堡乡'),
	(13, 07, 29, 205, '安家堡乡'),
	(13, 07, 29, 206, '北沙城乡');

/* 河北省 张家口市 怀来县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 30, 100, '沙城镇'),
	(13, 07, 30, 101, '北辛堡镇'),
	(13, 07, 30, 102, '新保安镇'),
	(13, 07, 30, 103, '东花园镇'),
	(13, 07, 30, 104, '官厅镇'),
	(13, 07, 30, 105, '桑园镇'),
	(13, 07, 30, 106, '存瑞镇'),
	(13, 07, 30, 107, '土木镇'),
	(13, 07, 30, 108, '大黄庄镇'),
	(13, 07, 30, 109, '西八里镇'),
	(13, 07, 30, 110, '小南辛堡镇'),
	(13, 07, 30, 200, '狼山乡'),
	(13, 07, 30, 203, '鸡鸣驿乡'),
	(13, 07, 30, 205, '东八里乡'),
	(13, 07, 30, 207, '瑞云观乡'),
	(13, 07, 30, 208, '孙庄子乡'),
	(13, 07, 30, 210, '王家楼回族乡');

/* 河北省 张家口市 涿鹿县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 31, 100, '涿鹿镇'),
	(13, 07, 31, 101, '张家堡镇'),
	(13, 07, 31, 102, '武家沟镇'),
	(13, 07, 31, 103, '五堡镇'),
	(13, 07, 31, 104, '保岱镇'),
	(13, 07, 31, 105, '矾山镇'),
	(13, 07, 31, 106, '大堡镇'),
	(13, 07, 31, 107, '河东镇'),
	(13, 07, 31, 108, '东小庄镇'),
	(13, 07, 31, 109, '辉耀镇'),
	(13, 07, 31, 110, '大河南镇'),
	(13, 07, 31, 111, '温泉屯镇'),
	(13, 07, 31, 112, '蟒石口镇'),
	(13, 07, 31, 201, '栾庄乡'),
	(13, 07, 31, 204, '黑山寺乡'),
	(13, 07, 31, 205, '卧佛寺乡'),
	(13, 07, 31, 206, '谢家堡乡');

/* 河北省 张家口市 赤城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 32, 100, '赤城镇'),
	(13, 07, 32, 101, '田家窑镇'),
	(13, 07, 32, 102, '龙关镇'),
	(13, 07, 32, 103, '雕鄂镇'),
	(13, 07, 32, 104, '独石口镇'),
	(13, 07, 32, 105, '白草镇'),
	(13, 07, 32, 106, '龙门所镇'),
	(13, 07, 32, 107, '后城镇'),
	(13, 07, 32, 108, '东卯镇'),
	(13, 07, 32, 200, '炮梁乡'),
	(13, 07, 32, 201, '大海陀乡'),
	(13, 07, 32, 202, '镇宁堡乡'),
	(13, 07, 32, 203, '马营乡'),
	(13, 07, 32, 204, '云州乡'),
	(13, 07, 32, 205, '三道川乡'),
	(13, 07, 32, 206, '东万口乡'),
	(13, 07, 32, 207, '茨营子乡'),
	(13, 07, 32, 208, '样田乡');

/* 河北省 张家口市 崇礼县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 07, 33, 001, '西湾子街道办'),
	(13, 07, 33, 100, '西湾子镇'),
	(13, 07, 33, 101, '高家营镇'),
	(13, 07, 33, 200, '四台嘴乡'),
	(13, 07, 33, 201, '红旗营乡'),
	(13, 07, 33, 202, '石窑子乡'),
	(13, 07, 33, 203, '驿马图乡'),
	(13, 07, 33, 204, '石嘴子乡'),
	(13, 07, 33, 205, '狮子沟乡'),
	(13, 07, 33, 206, '清三营乡'),
	(13, 07, 33, 207, '白旗乡');

/* 河北省 承德市 双桥区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 08, 02, 001, '西大街街道'),
	(13, 08, 02, 002, '头道牌楼街道'),
	(13, 08, 02, 003, '潘家沟街道'),
	(13, 08, 02, 004, '中华路街道'),
	(13, 08, 02, 005, '新华路街道'),
	(13, 08, 02, 006, '石洞子沟街道'),
	(13, 08, 02, 007, '桥东街道'),
	(13, 08, 02, 100, '水泉沟镇'),
	(13, 08, 02, 101, '狮子沟镇'),
	(13, 08, 02, 102, '牛圈子沟镇'),
	(13, 08, 02, 103, '大石庙镇'),
	(13, 08, 02, 105, '双峰寺镇');

/* 河北省 承德市 双滦区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 08, 03, 001, '元宝山街道'),
	(13, 08, 03, 002, '钢城街道'),
	(13, 08, 03, 100, '双塔山镇'),
	(13, 08, 03, 101, '滦河镇'),
	(13, 08, 03, 102, '大庙镇'),
	(13, 08, 03, 103, '偏桥子镇'),
	(13, 08, 03, 200, '陈栅子乡'),
	(13, 08, 03, 201, '西地满族乡');

/* 河北省 承德市 鹰手营子矿区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 08, 04, 001, '鹰手营子矿区铁北路街道办事处'),
	(13, 08, 04, 100, '鹰手营子镇'),
	(13, 08, 04, 101, '北马圈子镇'),
	(13, 08, 04, 102, '寿王坟镇'),
	(13, 08, 04, 103, '汪家庄镇');

/* 河北省 承德市 承德县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 08, 21, 100, '下板城镇'),
	(13, 08, 21, 102, '甲山镇'),
	(13, 08, 21, 103, '六沟镇'),
	(13, 08, 21, 104, '三沟镇'),
	(13, 08, 21, 105, '头沟镇'),
	(13, 08, 21, 106, '高寺台镇'),
	(13, 08, 21, 107, '鞍匠镇'),
	(13, 08, 21, 108, '三家镇'),
	(13, 08, 21, 200, '东小白旗乡'),
	(13, 08, 21, 202, '刘杖子乡'),
	(13, 08, 21, 203, '新杖子乡'),
	(13, 08, 21, 204, '孟家院乡'),
	(13, 08, 21, 205, '大营子乡'),
	(13, 08, 21, 206, '八家乡'),
	(13, 08, 21, 207, '上谷乡'),
	(13, 08, 21, 208, '满杖子乡'),
	(13, 08, 21, 209, '石灰窑乡'),
	(13, 08, 21, 210, '五道河乡'),
	(13, 08, 21, 211, '岔沟乡'),
	(13, 08, 21, 212, '岗子满族乡'),
	(13, 08, 21, 213, '磴上乡'),
	(13, 08, 21, 214, '两家满族乡'),
	(13, 08, 21, 216, '仓子乡');

/* 河北省 承德市 兴隆县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 08, 22, 100, '兴隆镇'),
	(13, 08, 22, 101, '半壁山镇'),
	(13, 08, 22, 102, '挂兰峪镇'),
	(13, 08, 22, 103, '青松岭镇'),
	(13, 08, 22, 104, '六道河镇'),
	(13, 08, 22, 105, '平安堡镇'),
	(13, 08, 22, 106, '北营房镇'),
	(13, 08, 22, 107, '孤山子镇'),
	(13, 08, 22, 108, '蓝旗营镇'),
	(13, 08, 22, 200, '南天门满族乡'),
	(13, 08, 22, 202, '八卦岭满族乡'),
	(13, 08, 22, 203, '陡子峪乡'),
	(13, 08, 22, 204, '上石洞乡'),
	(13, 08, 22, 205, '雾灵山乡'),
	(13, 08, 22, 206, '李家营乡'),
	(13, 08, 22, 207, '大杖子乡'),
	(13, 08, 22, 208, '蘑菇峪乡'),
	(13, 08, 22, 209, '三道河乡'),
	(13, 08, 22, 211, '安子岭乡'),
	(13, 08, 22, 212, '大水泉乡');

/* 河北省 承德市 平泉县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 08, 23, 100, '平泉镇'),
	(13, 08, 23, 101, '黄土梁子镇'),
	(13, 08, 23, 102, '榆树林子镇'),
	(13, 08, 23, 103, '杨树岭镇'),
	(13, 08, 23, 104, '七沟镇'),
	(13, 08, 23, 105, '小寺沟镇'),
	(13, 08, 23, 106, '党坝镇'),
	(13, 08, 23, 107, '卧龙镇'),
	(13, 08, 23, 108, '南五十家子镇'),
	(13, 08, 23, 109, '北五十家子镇'),
	(13, 08, 23, 110, '桲椤树镇'),
	(13, 08, 23, 111, '柳溪镇'),
	(13, 08, 23, 200, '王土房乡'),
	(13, 08, 23, 203, '七家岱满族乡'),
	(13, 08, 23, 204, '平房满族蒙古族乡'),
	(13, 08, 23, 206, '茅兰沟满族蒙古族乡'),
	(13, 08, 23, 207, '台头山乡'),
	(13, 08, 23, 209, '松树台乡'),
	(13, 08, 23, 210, '道虎沟乡');

/* 河北省 承德市 滦平县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 08, 24, 001, '中兴路街道办事处'),
	(13, 08, 24, 100, '滦平镇'),
	(13, 08, 24, 101, '长山峪镇'),
	(13, 08, 24, 102, '红旗镇'),
	(13, 08, 24, 103, '金沟屯镇'),
	(13, 08, 24, 104, '虎什哈镇'),
	(13, 08, 24, 105, '巴克什营镇'),
	(13, 08, 24, 106, '张百湾镇'),
	(13, 08, 24, 107, '付营子镇'),
	(13, 08, 24, 200, '平坊满族乡'),
	(13, 08, 24, 201, '安纯沟门满族乡'),
	(13, 08, 24, 205, '小营满族乡'),
	(13, 08, 24, 206, '西沟满族乡'),
	(13, 08, 24, 207, '邓厂满族乡'),
	(13, 08, 24, 208, '五道营子满族乡'),
	(13, 08, 24, 209, '马营子满族乡'),
	(13, 08, 24, 210, '付家店满族乡'),
	(13, 08, 24, 211, '火斗山乡'),
	(13, 08, 24, 212, '两间房乡'),
	(13, 08, 24, 213, '涝洼乡'),
	(13, 08, 24, 214, '大屯满族乡');

/* 河北省 承德市 隆化县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 08, 25, 001, '安州街道办事处'),
	(13, 08, 25, 100, '隆化镇'),
	(13, 08, 25, 101, '韩麻营镇'),
	(13, 08, 25, 102, '中关镇'),
	(13, 08, 25, 103, '七家镇'),
	(13, 08, 25, 104, '汤头沟镇'),
	(13, 08, 25, 105, '张三营镇'),
	(13, 08, 25, 106, '唐三营镇'),
	(13, 08, 25, 107, '蓝旗镇'),
	(13, 08, 25, 108, '步古沟镇'),
	(13, 08, 25, 109, '郭家屯镇'),
	(13, 08, 25, 200, '荒地乡'),
	(13, 08, 25, 201, '章吉营乡'),
	(13, 08, 25, 202, '茅荆坝乡'),
	(13, 08, 25, 203, '尹家营满族乡'),
	(13, 08, 25, 204, '庙子沟蒙古族满族乡'),
	(13, 08, 25, 205, '偏坡营满族乡'),
	(13, 08, 25, 206, '山湾乡'),
	(13, 08, 25, 207, '八达营蒙古族乡'),
	(13, 08, 25, 208, '太平庄满族乡'),
	(13, 08, 25, 209, '旧屯满族乡'),
	(13, 08, 25, 210, '西阿超满族蒙古族乡'),
	(13, 08, 25, 211, '白虎沟满族蒙古族乡'),
	(13, 08, 25, 212, '碱房乡'),
	(13, 08, 25, 213, '韩家店乡'),
	(13, 08, 25, 214, '湾沟门乡');

/* 河北省 承德市 丰宁满族自治县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 08, 26, 100, '大阁镇'),
	(13, 08, 26, 101, '大滩镇'),
	(13, 08, 26, 102, '鱼儿山镇'),
	(13, 08, 26, 103, '土城镇'),
	(13, 08, 26, 104, '黄旗镇'),
	(13, 08, 26, 105, '凤山镇'),
	(13, 08, 26, 106, '波罗诺镇'),
	(13, 08, 26, 107, '黑山咀镇'),
	(13, 08, 26, 108, '天桥镇'),
	(13, 08, 26, 109, '胡麻营镇'),
	(13, 08, 26, 200, '万胜永乡'),
	(13, 08, 26, 201, '四岔口乡'),
	(13, 08, 26, 202, '苏家店乡'),
	(13, 08, 26, 203, '外沟门乡'),
	(13, 08, 26, 204, '草原乡'),
	(13, 08, 26, 205, '窟窿山乡'),
	(13, 08, 26, 206, '小坝子乡'),
	(13, 08, 26, 207, '五道营乡'),
	(13, 08, 26, 208, '南关蒙古族乡'),
	(13, 08, 26, 209, '选将营乡'),
	(13, 08, 26, 210, '西官营乡'),
	(13, 08, 26, 211, '王营乡'),
	(13, 08, 26, 212, '北头营乡'),
	(13, 08, 26, 214, '石人沟乡'),
	(13, 08, 26, 215, '汤河乡'),
	(13, 08, 26, 216, '杨木栅子乡');

/* 河北省 承德市 宽城满族自治县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 08, 27, 100, '宽城镇'),
	(13, 08, 27, 101, '龙须门镇'),
	(13, 08, 27, 102, '峪耳崖镇'),
	(13, 08, 27, 103, '板城镇'),
	(13, 08, 27, 104, '汤道河镇'),
	(13, 08, 27, 105, '饽罗台镇'),
	(13, 08, 27, 106, '碾子峪镇'),
	(13, 08, 27, 107, '亮甲台镇'),
	(13, 08, 27, 200, '化皮溜子乡'),
	(13, 08, 27, 201, '塌山乡'),
	(13, 08, 27, 203, '孟子岭乡'),
	(13, 08, 27, 204, '独石沟乡'),
	(13, 08, 27, 206, '东大地乡'),
	(13, 08, 27, 207, '铧尖乡'),
	(13, 08, 27, 208, '东黄花川乡'),
	(13, 08, 27, 210, '苇子沟乡'),
	(13, 08, 27, 211, '大字沟门乡'),
	(13, 08, 27, 212, '大石柱子乡');

/* 河北省 承德市 围场满族蒙古族自治县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 08, 28, 100, '围场镇'),
	(13, 08, 28, 101, '四合永镇'),
	(13, 08, 28, 102, '克勒沟镇'),
	(13, 08, 28, 103, '棋盘山镇'),
	(13, 08, 28, 104, '半截塔镇'),
	(13, 08, 28, 105, '朝阳地镇'),
	(13, 08, 28, 106, '朝阳湾镇'),
	(13, 08, 28, 107, '腰站镇'),
	(13, 08, 28, 108, '龙头山镇'),
	(13, 08, 28, 109, '新拨镇'),
	(13, 08, 28, 200, '道坝子乡'),
	(13, 08, 28, 203, '黄土坎乡'),
	(13, 08, 28, 204, '四道沟乡'),
	(13, 08, 28, 205, '兰旗卡伦乡'),
	(13, 08, 28, 206, '银窝沟乡'),
	(13, 08, 28, 207, '新地乡'),
	(13, 08, 28, 208, '广发永乡'),
	(13, 08, 28, 209, '育太和乡'),
	(13, 08, 28, 210, '郭家湾乡'),
	(13, 08, 28, 211, '杨家湾乡'),
	(13, 08, 28, 212, '大唤起乡'),
	(13, 08, 28, 213, '哈里哈乡'),
	(13, 08, 28, 215, '张家湾乡'),
	(13, 08, 28, 216, '宝元栈乡'),
	(13, 08, 28, 217, '山湾子乡'),
	(13, 08, 28, 218, '三义永乡'),
	(13, 08, 28, 219, '姜家店乡'),
	(13, 08, 28, 220, '下伙房乡'),
	(13, 08, 28, 221, '燕格柏乡'),
	(13, 08, 28, 222, '牌楼乡'),
	(13, 08, 28, 223, '城子乡'),
	(13, 08, 28, 224, '老窝铺乡'),
	(13, 08, 28, 225, '御道口乡'),
	(13, 08, 28, 226, '石桌子乡'),
	(13, 08, 28, 227, '大头山乡'),
	(13, 08, 28, 228, '南山嘴乡'),
	(13, 08, 28, 229, '西龙头乡');

/* 河北省 沧州市 新华区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 02, 001, '建设北街街道办事处'),
	(13, 09, 02, 002, '车站街道办事处'),
	(13, 09, 02, 003, '南大街街道办事处'),
	(13, 09, 02, 004, '东环街道办事处'),
	(13, 09, 02, 005, '道东街道办事处'),
	(13, 09, 02, 200, '小赵庄乡');

/* 河北省 沧州市 运河区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 03, 001, '水月寺街道办事处'),
	(13, 09, 03, 002, '南环中路街道办事处'),
	(13, 09, 03, 003, '南湖街道办事处'),
	(13, 09, 03, 004, '市场街道办事处'),
	(13, 09, 03, 005, '西环中街街道办事处'),
	(13, 09, 03, 006, '公园街道办事处'),
	(13, 09, 03, 100, '小王庄镇'),
	(13, 09, 03, 200, '南陈屯乡');

/* 河北省 沧州市 沧县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 21, 100, '旧州镇'),
	(13, 09, 21, 101, '兴济镇'),
	(13, 09, 21, 102, '杜生镇'),
	(13, 09, 21, 103, '崔尔庄镇'),
	(13, 09, 21, 200, '薛官屯乡'),
	(13, 09, 21, 201, '捷地回族乡'),
	(13, 09, 21, 202, '张官屯乡'),
	(13, 09, 21, 203, '李天木回族乡'),
	(13, 09, 21, 204, '风化店乡'),
	(13, 09, 21, 205, '姚官屯乡'),
	(13, 09, 21, 206, '杜林回族乡'),
	(13, 09, 21, 207, '汪家铺乡'),
	(13, 09, 21, 208, '刘家庙乡'),
	(13, 09, 21, 209, '仵龙堂乡'),
	(13, 09, 21, 210, '大官厅乡'),
	(13, 09, 21, 211, '高川乡'),
	(13, 09, 21, 212, '黄递铺乡'),
	(13, 09, 21, 213, '大褚村回族乡'),
	(13, 09, 21, 214, '纸房头乡');

/* 河北省 沧州市 青县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 22, 100, '清州镇'),
	(13, 09, 22, 101, '金牛镇'),
	(13, 09, 22, 102, '新兴镇'),
	(13, 09, 22, 103, '流河镇'),
	(13, 09, 22, 104, '木门店镇'),
	(13, 09, 22, 105, '马厂镇'),
	(13, 09, 22, 200, '上伍乡'),
	(13, 09, 22, 201, '曹寺乡'),
	(13, 09, 22, 202, '盘古乡'),
	(13, 09, 22, 203, '陈嘴乡');

/* 河北省 沧州市 东光县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 23, 100, '东光镇'),
	(13, 09, 23, 101, '连镇镇'),
	(13, 09, 23, 102, '找王镇'),
	(13, 09, 23, 103, '秦村镇'),
	(13, 09, 23, 104, '灯明寺镇'),
	(13, 09, 23, 105, '南霞口镇'),
	(13, 09, 23, 106, '大单镇'),
	(13, 09, 23, 107, '龙王李镇'),
	(13, 09, 23, 201, '于桥乡');

/* 河北省 沧州市 海兴县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 24, 100, '苏基镇'),
	(13, 09, 24, 101, '辛集镇'),
	(13, 09, 24, 102, '高湾镇'),
	(13, 09, 24, 200, '赵毛陶乡'),
	(13, 09, 24, 201, '香坊乡'),
	(13, 09, 24, 202, '小山乡'),
	(13, 09, 24, 203, '张会亭乡');

/* 河北省 沧州市 盐山县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 25, 100, '盐山镇'),
	(13, 09, 25, 101, '望树镇'),
	(13, 09, 25, 102, '庆云镇'),
	(13, 09, 25, 103, '韩集镇'),
	(13, 09, 25, 104, '千童镇'),
	(13, 09, 25, 105, '圣佛镇'),
	(13, 09, 25, 200, '边务乡'),
	(13, 09, 25, 201, '小营乡'),
	(13, 09, 25, 202, '杨集乡'),
	(13, 09, 25, 203, '孟店乡'),
	(13, 09, 25, 204, '常庄乡'),
	(13, 09, 25, 205, '小庄乡');

/* 河北省 沧州市 肃宁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 26, 100, '肃宁镇'),
	(13, 09, 26, 101, '梁家村镇'),
	(13, 09, 26, 102, '窝北镇'),
	(13, 09, 26, 103, '尚村镇'),
	(13, 09, 26, 104, '万里镇'),
	(13, 09, 26, 105, '师素镇'),
	(13, 09, 26, 203, '河北留善寺乡'),
	(13, 09, 26, 204, '付家佐乡'),
	(13, 09, 26, 205, '邵庄乡');

/* 河北省 沧州市 南皮县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 27, 100, '南皮镇'),
	(13, 09, 27, 101, '冯家口镇'),
	(13, 09, 27, 102, '寨子镇'),
	(13, 09, 27, 103, '鲍官屯镇'),
	(13, 09, 27, 104, '王寺镇'),
	(13, 09, 27, 105, '乌马营镇'),
	(13, 09, 27, 200, '大浪淀乡'),
	(13, 09, 27, 201, '刘八里乡'),
	(13, 09, 27, 202, '潞灌乡');

/* 河北省 沧州市 吴桥县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 28, 100, '桑园镇'),
	(13, 09, 28, 101, '铁城镇'),
	(13, 09, 28, 102, '于集镇'),
	(13, 09, 28, 103, '梁集镇'),
	(13, 09, 28, 104, '安陵镇'),
	(13, 09, 28, 200, '曹家洼乡'),
	(13, 09, 28, 201, '宋门乡'),
	(13, 09, 28, 202, '杨家寺乡'),
	(13, 09, 28, 203, '沟店铺乡'),
	(13, 09, 28, 204, '何庄乡');

/* 河北省 沧州市 献县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 29, 100, '乐寿镇'),
	(13, 09, 29, 101, '淮镇镇'),
	(13, 09, 29, 102, '郭庄镇'),
	(13, 09, 29, 103, '河城街镇'),
	(13, 09, 29, 104, '韩村镇'),
	(13, 09, 29, 105, '陌南镇'),
	(13, 09, 29, 106, '陈庄镇'),
	(13, 09, 29, 205, '徐留高乡'),
	(13, 09, 29, 206, '商林乡'),
	(13, 09, 29, 207, '段村乡'),
	(13, 09, 29, 209, '张村乡'),
	(13, 09, 29, 210, '临河乡'),
	(13, 09, 29, 211, '小平王乡'),
	(13, 09, 29, 212, '十五级乡'),
	(13, 09, 29, 213, '垒头乡'),
	(13, 09, 29, 214, '南河头乡'),
	(13, 09, 29, 215, '西城乡'),
	(13, 09, 29, 216, '本斋回族乡');

/* 河北省 沧州市 孟村回族自治县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 30, 100, '孟村镇'),
	(13, 09, 30, 101, '新县镇'),
	(13, 09, 30, 102, '辛店镇'),
	(13, 09, 30, 103, '高寨镇'),
	(13, 09, 30, 200, '宋庄子乡'),
	(13, 09, 30, 201, '牛进庄乡');

/* 河北省 沧州市 泊头市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 81, 001, '解放街道办事处'),
	(13, 09, 81, 002, '河东街道办事处'),
	(13, 09, 81, 003, '古楼街道办事处'),
	(13, 09, 81, 100, '泊镇'),
	(13, 09, 81, 101, '交河镇'),
	(13, 09, 81, 102, '齐桥镇'),
	(13, 09, 81, 103, '寺门村镇'),
	(13, 09, 81, 104, '郝村镇'),
	(13, 09, 81, 105, '富镇镇'),
	(13, 09, 81, 106, '文庙镇'),
	(13, 09, 81, 107, '洼里王镇'),
	(13, 09, 81, 201, '王武庄乡'),
	(13, 09, 81, 202, '营子乡'),
	(13, 09, 81, 203, '四营乡'),
	(13, 09, 81, 204, '西辛店乡');

/* 河北省 沧州市 任丘市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 82, 001, '新华路街道'),
	(13, 09, 82, 002, '西环路街道'),
	(13, 09, 82, 003, '永丰路街道'),
	(13, 09, 82, 004, '中华路办事处'),
	(13, 09, 82, 100, '出岸镇'),
	(13, 09, 82, 101, '石门桥镇'),
	(13, 09, 82, 102, '吕公堡镇'),
	(13, 09, 82, 103, '长丰镇'),
	(13, 09, 82, 104, '鄚州镇'),
	(13, 09, 82, 105, '苟各庄镇'),
	(13, 09, 82, 106, '梁召镇'),
	(13, 09, 82, 107, '辛中驿镇'),
	(13, 09, 82, 108, '麻家坞镇'),
	(13, 09, 82, 203, '议论堡乡'),
	(13, 09, 82, 204, '青塔乡'),
	(13, 09, 82, 205, '北辛庄乡'),
	(13, 09, 82, 206, '七间房乡'),
	(13, 09, 82, 207, '北汉乡'),
	(13, 09, 82, 208, '于村乡');

/* 河北省 沧州市 黄骅市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 83, 001, '骅东街道'),
	(13, 09, 83, 002, '骅中街道'),
	(13, 09, 83, 003, '骅西街道'),
	(13, 09, 83, 100, '黄骅镇'),
	(13, 09, 83, 101, '南排河镇'),
	(13, 09, 83, 102, '吕桥镇'),
	(13, 09, 83, 103, '旧城镇'),
	(13, 09, 83, 200, '羊二庄回族乡'),
	(13, 09, 83, 202, '常郭乡'),
	(13, 09, 83, 203, '滕庄子乡'),
	(13, 09, 83, 204, '官庄乡'),
	(13, 09, 83, 205, '齐家务乡'),
	(13, 09, 83, 207, '羊三木回族乡');

/* 河北省 沧州市 河间市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 09, 84, 100, '瀛州镇'),
	(13, 09, 84, 101, '米各庄镇'),
	(13, 09, 84, 102, '景和镇'),
	(13, 09, 84, 103, '卧佛堂镇'),
	(13, 09, 84, 104, '束城镇'),
	(13, 09, 84, 105, '留古寺镇'),
	(13, 09, 84, 106, '沙河桥镇'),
	(13, 09, 84, 200, '故仙乡'),
	(13, 09, 84, 201, '黎民居乡'),
	(13, 09, 84, 202, '兴村乡'),
	(13, 09, 84, 203, '沙洼乡'),
	(13, 09, 84, 204, '西九吉乡'),
	(13, 09, 84, 205, '北石槽乡'),
	(13, 09, 84, 207, '诗经村乡'),
	(13, 09, 84, 208, '郭家村乡'),
	(13, 09, 84, 209, '时村乡'),
	(13, 09, 84, 210, '行别营乡'),
	(13, 09, 84, 211, '尊祖庄乡'),
	(13, 09, 84, 212, '龙华店乡'),
	(13, 09, 84, 213, '果子洼回族乡');

/* 河北省 廊坊市 安次区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 10, 02, 001, '银河南路街道'),
	(13, 10, 02, 002, '光明西道街道'),
	(13, 10, 02, 003, '永华道街道办事处'),
	(13, 10, 02, 100, '落垡镇'),
	(13, 10, 02, 101, '码头镇'),
	(13, 10, 02, 102, '葛渔城镇'),
	(13, 10, 02, 103, '东沽港镇'),
	(13, 10, 02, 200, '杨税务乡'),
	(13, 10, 02, 201, '仇庄乡'),
	(13, 10, 02, 202, '调河头乡'),
	(13, 10, 02, 203, '北史家务乡');

/* 河北省 廊坊市 广阳区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 10, 03, 001, '银河北路街道'),
	(13, 10, 03, 002, '爱民东道街道'),
	(13, 10, 03, 003, '解放道街道'),
	(13, 10, 03, 004, '新开路街道'),
	(13, 10, 03, 005, '新源道街道'),
	(13, 10, 03, 100, '南尖塔镇'),
	(13, 10, 03, 101, '万庄镇'),
	(13, 10, 03, 102, '九州镇'),
	(13, 10, 03, 200, '北旺乡');

/* 河北省 廊坊市 固安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 10, 22, 100, '固安镇'),
	(13, 10, 22, 101, '宫村镇'),
	(13, 10, 22, 102, '柳泉镇'),
	(13, 10, 22, 103, '牛驼镇'),
	(13, 10, 22, 104, '马庄镇'),
	(13, 10, 22, 200, '东湾乡'),
	(13, 10, 22, 201, '彭村乡'),
	(13, 10, 22, 202, '渠沟乡'),
	(13, 10, 22, 203, '礼让店乡');

/* 河北省 廊坊市 永清县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 10, 23, 001, '城区街道办事处'),
	(13, 10, 23, 100, '永清镇'),
	(13, 10, 23, 101, '韩村镇'),
	(13, 10, 23, 102, '后奕镇'),
	(13, 10, 23, 103, '别古庄镇'),
	(13, 10, 23, 104, '里澜城镇'),
	(13, 10, 23, 200, '管家务回族乡'),
	(13, 10, 23, 201, '曹家务乡'),
	(13, 10, 23, 202, '龙虎庄乡'),
	(13, 10, 23, 203, '刘街乡'),
	(13, 10, 23, 204, '三圣口乡');

/* 河北省 廊坊市 香河县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 10, 24, 100, '淑阳镇'),
	(13, 10, 24, 101, '蒋辛屯镇'),
	(13, 10, 24, 102, '渠口镇'),
	(13, 10, 24, 103, '安头屯镇'),
	(13, 10, 24, 104, '安平镇'),
	(13, 10, 24, 105, '刘宋镇'),
	(13, 10, 24, 106, '五百户镇'),
	(13, 10, 24, 107, '钱旺镇'),
	(13, 10, 24, 108, '钳屯镇');

/* 河北省 廊坊市 大城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 10, 25, 100, '平舒镇'),
	(13, 10, 25, 101, '旺村镇'),
	(13, 10, 25, 102, '大尚屯镇'),
	(13, 10, 25, 103, '南赵扶镇'),
	(13, 10, 25, 104, '留各庄镇'),
	(13, 10, 25, 105, '权村镇'),
	(13, 10, 25, 106, '里坦镇'),
	(13, 10, 25, 107, '广安镇'),
	(13, 10, 25, 200, '北位乡'),
	(13, 10, 25, 202, '臧屯乡');

/* 河北省 廊坊市 文安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 10, 26, 100, '文安镇'),
	(13, 10, 26, 101, '新镇镇'),
	(13, 10, 26, 102, '苏桥镇'),
	(13, 10, 26, 103, '大柳河镇'),
	(13, 10, 26, 104, '左各庄镇'),
	(13, 10, 26, 105, '滩里镇'),
	(13, 10, 26, 106, '史各庄镇'),
	(13, 10, 26, 107, '赵各庄镇'),
	(13, 10, 26, 108, '兴隆宫镇'),
	(13, 10, 26, 109, '大留镇镇'),
	(13, 10, 26, 110, '孙氏镇'),
	(13, 10, 26, 111, '德归镇'),
	(13, 10, 26, 200, '大围河回族满族乡');

/* 河北省 廊坊市 大厂回族自治县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 10, 28, 100, '大厂镇'),
	(13, 10, 28, 101, '夏垫镇'),
	(13, 10, 28, 102, '祁各庄镇'),
	(13, 10, 28, 103, '邵府镇'),
	(13, 10, 28, 104, '陈府镇');

/* 河北省 廊坊市 霸州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 10, 81, 100, '霸州镇'),
	(13, 10, 81, 101, '南孟镇'),
	(13, 10, 81, 102, '信安镇'),
	(13, 10, 81, 103, '堂二里镇'),
	(13, 10, 81, 104, '煎茶铺镇'),
	(13, 10, 81, 105, '胜芳镇'),
	(13, 10, 81, 106, '杨芬港镇'),
	(13, 10, 81, 200, '岔河集乡'),
	(13, 10, 81, 201, '康仙庄乡'),
	(13, 10, 81, 202, '东杨庄乡'),
	(13, 10, 81, 203, '王庄子乡'),
	(13, 10, 81, 204, '东段乡');

/* 河北省 廊坊市 三河市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 10, 82, 001, '鼎盛东大街街道办事处'),
	(13, 10, 82, 002, '泃阳西大街街道办事处'),
	(13, 10, 82, 100, '泃阳镇'),
	(13, 10, 82, 101, '李旗庄镇'),
	(13, 10, 82, 102, '杨庄镇'),
	(13, 10, 82, 103, '皇庄镇'),
	(13, 10, 82, 104, '新集镇'),
	(13, 10, 82, 105, '段甲岭镇'),
	(13, 10, 82, 106, '黄土庄镇'),
	(13, 10, 82, 107, '高楼镇'),
	(13, 10, 82, 108, '齐心庄镇'),
	(13, 10, 82, 109, '燕郊镇');

/* 河北省 衡水市 桃城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 11, 02, 001, '河西街道办事处'),
	(13, 11, 02, 002, '河东街道办事处'),
	(13, 11, 02, 003, '路北街道办事处'),
	(13, 11, 02, 004, '中华街道办事处'),
	(13, 11, 02, 100, '郑家河沿镇'),
	(13, 11, 02, 101, '赵家圈镇'),
	(13, 11, 02, 102, '邓庄镇'),
	(13, 11, 02, 200, '何家庄乡');

/* 河北省 衡水市 枣强县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 11, 21, 100, '枣强镇'),
	(13, 11, 21, 101, '恩察镇'),
	(13, 11, 21, 102, '大营镇'),
	(13, 11, 21, 103, '嘉会镇'),
	(13, 11, 21, 104, '马屯镇'),
	(13, 11, 21, 105, '肖张镇'),
	(13, 11, 21, 106, '张秀屯镇'),
	(13, 11, 21, 107, '新屯镇'),
	(13, 11, 21, 202, '王均乡'),
	(13, 11, 21, 203, '唐林乡'),
	(13, 11, 21, 204, '王常乡');

/* 河北省 衡水市 武邑县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 11, 22, 100, '武邑镇'),
	(13, 11, 22, 101, '清凉店镇'),
	(13, 11, 22, 102, '审坡镇'),
	(13, 11, 22, 103, '赵桥镇'),
	(13, 11, 22, 104, '韩庄镇'),
	(13, 11, 22, 105, '肖桥头镇'),
	(13, 11, 22, 200, '龙店乡'),
	(13, 11, 22, 201, '圈头乡'),
	(13, 11, 22, 203, '大紫塔乡');

/* 河北省 衡水市 武强县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 11, 23, 100, '武强镇'),
	(13, 11, 23, 101, '街关镇'),
	(13, 11, 23, 102, '周窝镇'),
	(13, 11, 23, 200, '豆村乡'),
	(13, 11, 23, 201, '北代乡'),
	(13, 11, 23, 202, '孙庄乡');

/* 河北省 衡水市 饶阳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 11, 24, 100, '饶阳镇'),
	(13, 11, 24, 101, '大尹村镇'),
	(13, 11, 24, 102, '五公镇'),
	(13, 11, 24, 103, '大官亭镇'),
	(13, 11, 24, 200, '王同岳乡'),
	(13, 11, 24, 202, '留楚乡'),
	(13, 11, 24, 203, '东里满乡');

/* 河北省 衡水市 安平县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 11, 25, 100, '安平镇'),
	(13, 11, 25, 101, '马店镇'),
	(13, 11, 25, 102, '南王庄镇'),
	(13, 11, 25, 200, '大何庄乡'),
	(13, 11, 25, 201, '程油子乡'),
	(13, 11, 25, 202, '西两洼乡'),
	(13, 11, 25, 203, '大子文乡'),
	(13, 11, 25, 204, '东黄城乡');

/* 河北省 衡水市 故城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 11, 26, 100, '郑口镇'),
	(13, 11, 26, 101, '夏庄镇'),
	(13, 11, 26, 102, '青罕镇'),
	(13, 11, 26, 103, '故城镇'),
	(13, 11, 26, 104, '武官寨镇'),
	(13, 11, 26, 105, '饶阳店镇'),
	(13, 11, 26, 106, '军屯镇'),
	(13, 11, 26, 107, '建国镇'),
	(13, 11, 26, 108, '西半屯镇'),
	(13, 11, 26, 200, '辛庄乡'),
	(13, 11, 26, 201, '里老乡'),
	(13, 11, 26, 202, '房庄乡'),
	(13, 11, 26, 203, '三朗乡');

/* 河北省 衡水市 景县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 11, 27, 100, '景州镇'),
	(13, 11, 27, 101, '龙华镇'),
	(13, 11, 27, 102, '广川镇'),
	(13, 11, 27, 103, '王瞳镇'),
	(13, 11, 27, 104, '洚河流镇'),
	(13, 11, 27, 105, '安陵镇'),
	(13, 11, 27, 106, '杜桥镇'),
	(13, 11, 27, 107, '王谦寺镇'),
	(13, 11, 27, 108, '北留智镇'),
	(13, 11, 27, 109, '留智庙镇'),
	(13, 11, 27, 200, '刘集乡'),
	(13, 11, 27, 201, '连镇乡'),
	(13, 11, 27, 202, '梁集乡'),
	(13, 11, 27, 203, '温城乡'),
	(13, 11, 27, 204, '后留名府乡'),
	(13, 11, 27, 205, '青兰乡');

/* 河北省 衡水市 阜城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 11, 28, 100, '阜城镇'),
	(13, 11, 28, 101, '古城镇'),
	(13, 11, 28, 102, '码头镇'),
	(13, 11, 28, 103, '霞口镇'),
	(13, 11, 28, 104, '崔家庙镇'),
	(13, 11, 28, 200, '漫河乡'),
	(13, 11, 28, 201, '建桥乡'),
	(13, 11, 28, 202, '蒋坊乡'),
	(13, 11, 28, 203, '大白乡'),
	(13, 11, 28, 204, '王集乡');

/* 河北省 衡水市 冀州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 11, 81, 100, '冀州镇'),
	(13, 11, 81, 102, '官道李镇'),
	(13, 11, 81, 103, '南午村镇'),
	(13, 11, 81, 104, '周村镇'),
	(13, 11, 81, 105, '码头李镇'),
	(13, 11, 81, 106, '西王镇'),
	(13, 11, 81, 200, '门家庄乡'),
	(13, 11, 81, 201, '徐家庄乡'),
	(13, 11, 81, 202, '北漳淮乡'),
	(13, 11, 81, 203, '小寨乡');

/* 河北省 衡水市 深州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 11, 82, 100, '唐奉镇'),
	(13, 11, 82, 101, '深州镇'),
	(13, 11, 82, 102, '辰时镇'),
	(13, 11, 82, 103, '榆科镇'),
	(13, 11, 82, 104, '魏家桥镇'),
	(13, 11, 82, 105, '大堤镇'),
	(13, 11, 82, 106, '前磨头镇'),
	(13, 11, 82, 107, '王家井镇'),
	(13, 11, 82, 108, '护驾迟镇'),
	(13, 11, 82, 109, '大屯镇'),
	(13, 11, 82, 110, '高古庄镇'),
	(13, 11, 82, 200, '兵曹乡'),
	(13, 11, 82, 201, '穆村乡'),
	(13, 11, 82, 202, '东安庄乡'),
	(13, 11, 82, 203, '北溪村乡'),
	(13, 11, 82, 204, '大冯营乡'),
	(13, 11, 82, 206, '乔屯乡');

/* 河北省 省直辖县级行政区划 定州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 90, 01, 001, '南城区街道办事处'),
	(13, 90, 01, 002, '北城区街道办事处'),
	(13, 90, 01, 003, '西城区街道办事处'),
	(13, 90, 01, 004, '长安路街道办事处'),
	(13, 90, 01, 100, '留早镇'),
	(13, 90, 01, 101, '清风店镇'),
	(13, 90, 01, 102, '庞村镇'),
	(13, 90, 01, 103, '砖路镇'),
	(13, 90, 01, 104, '明月店镇'),
	(13, 90, 01, 105, '叮咛店镇'),
	(13, 90, 01, 106, '东亭镇'),
	(13, 90, 01, 107, '大辛庄镇'),
	(13, 90, 01, 108, '东旺镇'),
	(13, 90, 01, 109, '高蓬镇'),
	(13, 90, 01, 110, '邢邑镇'),
	(13, 90, 01, 111, '李亲顾镇'),
	(13, 90, 01, 112, '子位镇'),
	(13, 90, 01, 113, '开元镇'),
	(13, 90, 01, 115, '周村镇'),
	(13, 90, 01, 116, '息冢镇'),
	(13, 90, 01, 203, '东留春乡'),
	(13, 90, 01, 204, '号头庄回族乡'),
	(13, 90, 01, 205, '杨家庄乡'),
	(13, 90, 01, 206, '大鹿庄乡'),
	(13, 90, 01, 208, '西城乡');

/* 河北省 省直辖县级行政区划 辛集市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(13, 90, 02, 100, '辛集镇'),
	(13, 90, 02, 101, '旧城镇'),
	(13, 90, 02, 102, '张古庄镇'),
	(13, 90, 02, 103, '位伯镇'),
	(13, 90, 02, 104, '新垒头镇'),
	(13, 90, 02, 105, '新城镇'),
	(13, 90, 02, 106, '南智邱镇'),
	(13, 90, 02, 107, '王口镇'),
	(13, 90, 02, 200, '天宫营乡'),
	(13, 90, 02, 201, '前营乡'),
	(13, 90, 02, 202, '马庄乡'),
	(13, 90, 02, 203, '和睦井乡'),
	(13, 90, 02, 204, '田家庄乡'),
	(13, 90, 02, 205, '中里厢乡'),
	(13, 90, 02, 206, '小辛庄乡');


/* 山西省 太原市 小店区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 01, 05, 001, '坞城街道办事处'),
	(14, 01, 05, 002, '营盘街道办事处'),
	(14, 01, 05, 003, '北营街道办事处'),
	(14, 01, 05, 004, '平阳路街道办事处'),
	(14, 01, 05, 005, '黄陵街道办事处'),
	(14, 01, 05, 006, '小店街道办事处'),
	(14, 01, 05, 007, '龙城街道办事处'),
	(14, 01, 05, 100, '北格镇'),
	(14, 01, 05, 200, '西温庄乡'),
	(14, 01, 05, 201, '刘家堡乡');

/* 山西省 太原市 迎泽区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 01, 06, 001, '柳巷街道办事处'),
	(14, 01, 06, 002, '文庙街道办事处'),
	(14, 01, 06, 003, '庙前街道办事处'),
	(14, 01, 06, 004, '迎泽街道办事处'),
	(14, 01, 06, 005, '桥东街道办事处'),
	(14, 01, 06, 006, '老军营街道办事处'),
	(14, 01, 06, 100, '郝庄镇');

/* 山西省 太原市 杏花岭区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 01, 07, 001, '巨轮街道办事处'),
	(14, 01, 07, 002, '三桥街道办事处'),
	(14, 01, 07, 003, '鼓楼街道办事处'),
	(14, 01, 07, 004, '杏花岭街道办事处'),
	(14, 01, 07, 005, '坝陵桥街道办事处'),
	(14, 01, 07, 006, '大东关街道办事处'),
	(14, 01, 07, 007, '职工新街街道办事处'),
	(14, 01, 07, 008, '敦化坊街道办事处'),
	(14, 01, 07, 009, '涧河街道办事处'),
	(14, 01, 07, 010, '杨家峪街道办事处'),
	(14, 01, 07, 200, '中涧河乡'),
	(14, 01, 07, 201, '小返乡');

/* 山西省 太原市 尖草坪区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 01, 08, 001, '尖草坪街道办事处'),
	(14, 01, 08, 002, '光社街道办事处'),
	(14, 01, 08, 003, '上兰街道办事处'),
	(14, 01, 08, 004, '南寨街道办事处'),
	(14, 01, 08, 005, '迎新街道办事处'),
	(14, 01, 08, 006, '古城街道办事处'),
	(14, 01, 08, 007, '汇丰街道办事处'),
	(14, 01, 08, 008, '柴村街道办事处'),
	(14, 01, 08, 009, '新城街道办事处'),
	(14, 01, 08, 100, '向阳镇'),
	(14, 01, 08, 101, '阳曲镇'),
	(14, 01, 08, 200, '马头水乡'),
	(14, 01, 08, 201, '柏板乡'),
	(14, 01, 08, 202, '西焉乡');

/* 山西省 太原市 万柏林区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 01, 09, 001, '千峰街道办事处'),
	(14, 01, 09, 002, '下元街道办事处'),
	(14, 01, 09, 003, '和平街道办事处'),
	(14, 01, 09, 004, '兴华街道办事处'),
	(14, 01, 09, 005, '万柏林街道办事处'),
	(14, 01, 09, 006, '杜儿坪街道办事处'),
	(14, 01, 09, 007, '白家庄街道办事处'),
	(14, 01, 09, 008, '南寒街道办事处'),
	(14, 01, 09, 009, '东社街道办事处'),
	(14, 01, 09, 010, '化客头街道办事处'),
	(14, 01, 09, 011, '小井峪街道办事处'),
	(14, 01, 09, 012, '西铭街道办事处'),
	(14, 01, 09, 013, '长风西街街道办事处'),
	(14, 01, 09, 014, '神堂沟街道办事处'),
	(14, 01, 09, 200, '王封乡');

/* 山西省 太原市 晋源区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 01, 10, 001, '义井街道办事处'),
	(14, 01, 10, 002, '罗城街道办事处'),
	(14, 01, 10, 003, '晋源街道办事处'),
	(14, 01, 10, 100, '金胜镇'),
	(14, 01, 10, 101, '晋祠镇'),
	(14, 01, 10, 102, '姚村镇');

/* 山西省 太原市 清徐县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 01, 21, 100, '清源镇'),
	(14, 01, 21, 101, '徐沟镇'),
	(14, 01, 21, 102, '东于镇'),
	(14, 01, 21, 103, '孟封镇'),
	(14, 01, 21, 200, '马峪乡'),
	(14, 01, 21, 201, '柳杜乡'),
	(14, 01, 21, 202, '西谷乡'),
	(14, 01, 21, 203, '王答乡'),
	(14, 01, 21, 204, '集义乡');

/* 山西省 太原市 阳曲县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 01, 22, 100, '黄寨镇'),
	(14, 01, 22, 101, '大盂镇'),
	(14, 01, 22, 102, '东黄水镇'),
	(14, 01, 22, 103, '泥屯镇'),
	(14, 01, 22, 104, '中心镇建设管理办公室'),
	(14, 01, 22, 200, '高村乡'),
	(14, 01, 22, 201, '侯村乡'),
	(14, 01, 22, 202, '凌井店乡'),
	(14, 01, 22, 203, '西凌井乡'),
	(14, 01, 22, 204, '北小店乡'),
	(14, 01, 22, 205, '杨兴乡');

/* 山西省 太原市 娄烦县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 01, 23, 100, '娄烦镇'),
	(14, 01, 23, 101, '静游镇'),
	(14, 01, 23, 102, '杜交曲镇'),
	(14, 01, 23, 200, '庙湾乡'),
	(14, 01, 23, 201, '马家庄乡'),
	(14, 01, 23, 202, '盖家庄乡'),
	(14, 01, 23, 203, '米峪镇乡'),
	(14, 01, 23, 204, '天池店乡');

/* 山西省 太原市 古交市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 01, 81, 001, '东曲街道办事处'),
	(14, 01, 81, 002, '西曲街道办事处'),
	(14, 01, 81, 003, '桃园街道办事处'),
	(14, 01, 81, 004, '屯兰街道办事处'),
	(14, 01, 81, 100, '河口镇'),
	(14, 01, 81, 101, '镇城底镇'),
	(14, 01, 81, 102, '马兰镇'),
	(14, 01, 81, 200, '阁上乡'),
	(14, 01, 81, 201, '加乐泉乡'),
	(14, 01, 81, 202, '梭峪乡'),
	(14, 01, 81, 203, '岔口乡'),
	(14, 01, 81, 204, '常安乡'),
	(14, 01, 81, 205, '原相乡'),
	(14, 01, 81, 206, '邢家社乡');

/* 山西省 大同市 城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 02, 02, 001, '南关街道办事处'),
	(14, 02, 02, 002, '北关街道办事处'),
	(14, 02, 02, 003, '东街街道办事处'),
	(14, 02, 02, 004, '西街街道办事处'),
	(14, 02, 02, 005, '南街街道办事处'),
	(14, 02, 02, 006, '北街街道办事处'),
	(14, 02, 02, 007, '新建南路街道办事处'),
	(14, 02, 02, 008, '新建北路街道办事处'),
	(14, 02, 02, 009, '大庆路街道办事处'),
	(14, 02, 02, 010, '新华街街道办事处'),
	(14, 02, 02, 011, '西花园街道办事处'),
	(14, 02, 02, 012, '老平旺街道办事处'),
	(14, 02, 02, 013, '向阳里街道办事处'),
	(14, 02, 02, 014, '振华南街街道办事处'),
	(14, 02, 02, 015, '开源街街道办事处');

/* 山西省 大同市 矿区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 02, 03, 001, '新胜街道办事处'),
	(14, 02, 03, 002, '新平旺街道办事处'),
	(14, 02, 03, 003, '煤峪口街道办事处'),
	(14, 02, 03, 004, '永定庄街道办事处'),
	(14, 02, 03, 005, '同家梁街道办事处'),
	(14, 02, 03, 006, '四老沟街道办事处'),
	(14, 02, 03, 007, '忻州窑街道办事处'),
	(14, 02, 03, 008, '白洞街道办事处'),
	(14, 02, 03, 009, '雁崖街道办事处'),
	(14, 02, 03, 010, '挖金湾街道办事处'),
	(14, 02, 03, 011, '晋华宫街道办事处'),
	(14, 02, 03, 012, '马脊梁街道办事处'),
	(14, 02, 03, 013, '大斗沟街道办事处'),
	(14, 02, 03, 014, '王村街道办事处'),
	(14, 02, 03, 015, '姜家湾街道办事处'),
	(14, 02, 03, 016, '新泉路街道办事处'),
	(14, 02, 03, 017, '民胜街道办事处'),
	(14, 02, 03, 018, '口泉街道办事处'),
	(14, 02, 03, 019, '马口街道办事处'),
	(14, 02, 03, 020, '燕子山街道办事处'),
	(14, 02, 03, 021, '杏儿沟街道办事处'),
	(14, 02, 03, 022, '青磁窑街道办事处'),
	(14, 02, 03, 023, '平泉路街道办事处'),
	(14, 02, 03, 024, '四台沟街道办事处'),
	(14, 02, 03, 025, '和顺街道办事处'),
	(14, 02, 03, 026, '和瑞街道办事处'),
	(14, 02, 03, 027, '平盛路街道办事处'),
	(14, 02, 03, 028, '清泉街街道办事处');

/* 山西省 大同市 南郊区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 02, 11, 100, '古店镇'),
	(14, 02, 11, 101, '高山镇'),
	(14, 02, 11, 102, '云冈镇'),
	(14, 02, 11, 200, '口泉乡'),
	(14, 02, 11, 201, '新旺乡'),
	(14, 02, 11, 202, '水泊寺乡'),
	(14, 02, 11, 205, '马军营乡'),
	(14, 02, 11, 206, '西韩岭乡'),
	(14, 02, 11, 207, '平旺乡'),
	(14, 02, 11, 210, '鸦儿崖乡');

/* 山西省 大同市 新荣区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 02, 12, 100, '新荣镇'),
	(14, 02, 12, 200, '破鲁堡乡'),
	(14, 02, 12, 202, '郭家窑乡'),
	(14, 02, 12, 203, '花元屯乡'),
	(14, 02, 12, 206, '西村乡'),
	(14, 02, 12, 207, '上深涧乡'),
	(14, 02, 12, 209, '堡子湾乡');

/* 山西省 大同市 阳高县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 02, 21, 100, '龙泉镇'),
	(14, 02, 21, 101, '罗文皂镇'),
	(14, 02, 21, 102, '大白登镇'),
	(14, 02, 21, 103, '王官屯镇'),
	(14, 02, 21, 104, '古城镇'),
	(14, 02, 21, 105, '东小村镇'),
	(14, 02, 21, 106, '友宰镇'),
	(14, 02, 21, 201, '长城乡'),
	(14, 02, 21, 202, '北徐屯乡'),
	(14, 02, 21, 204, '狮子屯乡'),
	(14, 02, 21, 209, '下深井乡'),
	(14, 02, 21, 211, '马家皂乡'),
	(14, 02, 21, 212, '鳌石乡');

/* 山西省 大同市 天镇县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 02, 22, 100, '玉泉镇'),
	(14, 02, 22, 101, '谷前堡镇'),
	(14, 02, 22, 102, '米薪关镇'),
	(14, 02, 22, 103, '逯家湾镇'),
	(14, 02, 22, 104, '新平镇'),
	(14, 02, 22, 200, '卅里铺乡'),
	(14, 02, 22, 202, '南河堡乡'),
	(14, 02, 22, 204, '贾家屯乡'),
	(14, 02, 22, 206, '赵家沟乡'),
	(14, 02, 22, 208, '南高崖乡'),
	(14, 02, 22, 209, '张西河乡');

/* 山西省 大同市 广灵县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 02, 23, 100, '壶泉镇'),
	(14, 02, 23, 101, '南村镇'),
	(14, 02, 23, 200, '一斗泉乡'),
	(14, 02, 23, 202, '蕉山乡'),
	(14, 02, 23, 203, '加斗乡'),
	(14, 02, 23, 206, '宜兴乡'),
	(14, 02, 23, 207, '作疃乡'),
	(14, 02, 23, 209, '梁庄乡'),
	(14, 02, 23, 211, '望狐乡');

/* 山西省 大同市 灵丘县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 02, 24, 100, '武灵镇'),
	(14, 02, 24, 101, '东河南镇'),
	(14, 02, 24, 102, '上寨镇'),
	(14, 02, 24, 200, '落水河乡'),
	(14, 02, 24, 203, '史庄乡'),
	(14, 02, 24, 205, '赵北乡'),
	(14, 02, 24, 206, '石家田乡'),
	(14, 02, 24, 207, '柳科乡'),
	(14, 02, 24, 208, '白崖台乡'),
	(14, 02, 24, 210, '红石塄乡'),
	(14, 02, 24, 212, '下关乡'),
	(14, 02, 24, 213, '独峪乡');

/* 山西省 大同市 浑源县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 02, 25, 100, '永安镇'),
	(14, 02, 25, 101, '西坊城镇'),
	(14, 02, 25, 102, '蔡村镇'),
	(14, 02, 25, 103, '沙圪坨镇'),
	(14, 02, 25, 104, '王庄堡镇'),
	(14, 02, 25, 105, '大磁窑镇'),
	(14, 02, 25, 201, '东坊城乡'),
	(14, 02, 25, 203, '裴村乡'),
	(14, 02, 25, 204, '驼峰乡'),
	(14, 02, 25, 205, '西留村乡'),
	(14, 02, 25, 206, '下韩村乡'),
	(14, 02, 25, 208, '南榆林乡'),
	(14, 02, 25, 210, '吴城乡'),
	(14, 02, 25, 212, '黄花滩乡'),
	(14, 02, 25, 213, '大仁庄乡'),
	(14, 02, 25, 215, '千佛岭乡'),
	(14, 02, 25, 218, '官儿乡'),
	(14, 02, 25, 220, '青磁窑乡');

/* 山西省 大同市 左云县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 02, 26, 100, '云兴镇'),
	(14, 02, 26, 101, '鹊儿山镇'),
	(14, 02, 26, 102, '店湾镇'),
	(14, 02, 26, 200, '管家堡乡'),
	(14, 02, 26, 201, '张家场乡'),
	(14, 02, 26, 205, '三屯乡'),
	(14, 02, 26, 206, '马道头乡'),
	(14, 02, 26, 207, '小京庄乡'),
	(14, 02, 26, 209, '水窑乡');

/* 山西省 大同市 大同县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 02, 27, 100, '西坪镇'),
	(14, 02, 27, 101, '倍加造镇'),
	(14, 02, 27, 102, '周士庄镇'),
	(14, 02, 27, 201, '吉家庄乡'),
	(14, 02, 27, 202, '峰峪乡'),
	(14, 02, 27, 204, '杜庄乡'),
	(14, 02, 27, 205, '党留庄乡'),
	(14, 02, 27, 207, '瓜园乡'),
	(14, 02, 27, 209, '巨乐乡'),
	(14, 02, 27, 211, '许堡乡');

/* 山西省 阳泉市 城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 03, 02, 001, '上站街道办事处'),
	(14, 03, 02, 002, '下站街道办事处'),
	(14, 03, 02, 003, '北大街街道办事处'),
	(14, 03, 02, 004, '南山路街道办事处'),
	(14, 03, 02, 005, '义井街道办事处'),
	(14, 03, 02, 006, '坡底街道办事处');

/* 山西省 阳泉市 矿区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 03, 03, 001, '平潭街街道办事处'),
	(14, 03, 03, 003, '蔡洼街道办事处'),
	(14, 03, 03, 004, '赛鱼街道办事处'),
	(14, 03, 03, 005, '沙坪街道办事处'),
	(14, 03, 03, 006, '贵石沟街道办事处'),
	(14, 03, 03, 198, '县区直属镇');

/* 山西省 阳泉市 郊区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 03, 11, 100, '荫营镇'),
	(14, 03, 11, 101, '河底镇'),
	(14, 03, 11, 102, '义井镇'),
	(14, 03, 11, 103, '平坦镇'),
	(14, 03, 11, 200, '西南舁乡'),
	(14, 03, 11, 201, '杨家庄乡'),
	(14, 03, 11, 202, '李家庄乡'),
	(14, 03, 11, 203, '旧街乡');

/* 山西省 阳泉市 平定县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 03, 21, 100, '冠山镇'),
	(14, 03, 21, 101, '冶西镇'),
	(14, 03, 21, 102, '锁簧镇'),
	(14, 03, 21, 103, '张庄镇'),
	(14, 03, 21, 104, '东回镇'),
	(14, 03, 21, 105, '柏井镇'),
	(14, 03, 21, 106, '娘子关镇'),
	(14, 03, 21, 107, '巨城镇'),
	(14, 03, 21, 200, '石门口乡'),
	(14, 03, 21, 201, '岔口乡');

/* 山西省 阳泉市 盂县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 03, 22, 100, '秀水镇'),
	(14, 03, 22, 101, '孙家庄镇'),
	(14, 03, 22, 102, '路家村镇'),
	(14, 03, 22, 103, '南娄镇'),
	(14, 03, 22, 104, '牛村镇'),
	(14, 03, 22, 105, '苌池镇'),
	(14, 03, 22, 106, '上社镇'),
	(14, 03, 22, 107, '西烟镇'),
	(14, 03, 22, 200, '仙人乡'),
	(14, 03, 22, 201, '北下庄乡'),
	(14, 03, 22, 202, '下社乡'),
	(14, 03, 22, 203, '梁家寨乡'),
	(14, 03, 22, 204, '西潘乡'),
	(14, 03, 22, 205, '东梁乡');

/* 山西省 长治市 城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 02, 001, '东街街道办事处'),
	(14, 04, 02, 002, '西街街道办事处'),
	(14, 04, 02, 003, '英雄南路街道办事处'),
	(14, 04, 02, 004, '英雄中路街道办事处'),
	(14, 04, 02, 005, '紫金街街道办事处'),
	(14, 04, 02, 006, '太行东街街道办事处'),
	(14, 04, 02, 007, '太行西街街道办事处'),
	(14, 04, 02, 008, '延安南路街道办事处'),
	(14, 04, 02, 009, '常青街道办事处'),
	(14, 04, 02, 010, '五马街道办事处');

/* 山西省 长治市 郊区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 11, 001, '长北街道办事处'),
	(14, 04, 11, 002, '故县街道办事处'),
	(14, 04, 11, 100, '老顶山镇'),
	(14, 04, 11, 101, '堠北庄镇'),
	(14, 04, 11, 102, '大辛庄镇'),
	(14, 04, 11, 103, '马厂镇'),
	(14, 04, 11, 104, '黄碾镇'),
	(14, 04, 11, 200, '西白兔乡');

/* 山西省 长治市 长治县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 21, 100, '韩店镇'),
	(14, 04, 21, 101, '苏店镇'),
	(14, 04, 21, 102, '荫城镇'),
	(14, 04, 21, 103, '西火镇'),
	(14, 04, 21, 104, '八义镇'),
	(14, 04, 21, 105, '贾掌镇'),
	(14, 04, 21, 200, '郝家庄乡'),
	(14, 04, 21, 201, '西池乡'),
	(14, 04, 21, 202, '北呈乡'),
	(14, 04, 21, 203, '东和乡'),
	(14, 04, 21, 204, '南宋乡');

/* 山西省 长治市 襄垣县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 23, 100, '古韩镇'),
	(14, 04, 23, 101, '王桥镇'),
	(14, 04, 23, 102, '侯堡镇'),
	(14, 04, 23, 103, '夏店镇'),
	(14, 04, 23, 104, '虒亭镇'),
	(14, 04, 23, 105, '西营镇'),
	(14, 04, 23, 106, '王村镇'),
	(14, 04, 23, 107, '下良镇'),
	(14, 04, 23, 200, '善福乡'),
	(14, 04, 23, 201, '北底乡'),
	(14, 04, 23, 202, '上马乡');

/* 山西省 长治市 屯留县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 24, 100, '麟绛镇'),
	(14, 04, 24, 101, '上村镇'),
	(14, 04, 24, 102, '渔泽镇'),
	(14, 04, 24, 103, '余吾镇'),
	(14, 04, 24, 104, '吾元镇'),
	(14, 04, 24, 105, '张店镇'),
	(14, 04, 24, 106, '丰宜镇'),
	(14, 04, 24, 200, '李高乡'),
	(14, 04, 24, 201, '路村乡'),
	(14, 04, 24, 202, '河神庙乡'),
	(14, 04, 24, 203, '西贾乡');

/* 山西省 长治市 平顺县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 25, 100, '青羊镇'),
	(14, 04, 25, 101, '龙溪镇'),
	(14, 04, 25, 102, '石城镇'),
	(14, 04, 25, 103, '苗庄镇'),
	(14, 04, 25, 104, '杏城镇'),
	(14, 04, 25, 200, '西沟乡'),
	(14, 04, 25, 201, '东寺头乡'),
	(14, 04, 25, 202, '虹梯关乡'),
	(14, 04, 25, 203, '阳高乡'),
	(14, 04, 25, 204, '北耽车乡'),
	(14, 04, 25, 205, '中五井乡'),
	(14, 04, 25, 206, '北社乡');

/* 山西省 长治市 黎城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 26, 100, '黎侯镇'),
	(14, 04, 26, 101, '东阳关镇'),
	(14, 04, 26, 102, '上遥镇'),
	(14, 04, 26, 103, '西井镇'),
	(14, 04, 26, 104, '黄崖洞镇'),
	(14, 04, 26, 200, '西仵乡'),
	(14, 04, 26, 201, '停河铺乡'),
	(14, 04, 26, 202, '程家山乡'),
	(14, 04, 26, 203, '洪井乡');

/* 山西省 长治市 壶关县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 27, 100, '龙泉镇'),
	(14, 04, 27, 101, '百尺镇'),
	(14, 04, 27, 102, '店上镇'),
	(14, 04, 27, 103, '晋庄镇'),
	(14, 04, 27, 104, '树掌镇'),
	(14, 04, 27, 200, '集店乡'),
	(14, 04, 27, 201, '黄山乡'),
	(14, 04, 27, 202, '东井岭乡'),
	(14, 04, 27, 203, '石坡乡'),
	(14, 04, 27, 204, '五龙山乡'),
	(14, 04, 27, 205, '鹅屋乡'),
	(14, 04, 27, 206, '桥上乡');

/* 山西省 长治市 长子县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 28, 100, '丹朱镇'),
	(14, 04, 28, 101, '鲍店镇'),
	(14, 04, 28, 102, '石哲镇'),
	(14, 04, 28, 103, '大堡头镇'),
	(14, 04, 28, 104, '慈林镇'),
	(14, 04, 28, 105, '色头镇'),
	(14, 04, 28, 106, '南漳镇'),
	(14, 04, 28, 200, '岚水乡'),
	(14, 04, 28, 201, '碾张乡'),
	(14, 04, 28, 202, '常张乡'),
	(14, 04, 28, 203, '南陈乡'),
	(14, 04, 28, 204, '宋村乡');

/* 山西省 长治市 武乡县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 29, 100, '丰州镇'),
	(14, 04, 29, 101, '洪水镇'),
	(14, 04, 29, 102, '蟠龙镇'),
	(14, 04, 29, 103, '监漳镇'),
	(14, 04, 29, 104, '故城镇'),
	(14, 04, 29, 200, '墨镫乡'),
	(14, 04, 29, 201, '韩北乡'),
	(14, 04, 29, 202, '大有乡'),
	(14, 04, 29, 203, '贾豁乡'),
	(14, 04, 29, 204, '故县乡'),
	(14, 04, 29, 205, '上司乡'),
	(14, 04, 29, 206, '石北乡'),
	(14, 04, 29, 207, '涌泉乡'),
	(14, 04, 29, 208, '分水岭乡');

/* 山西省 长治市 沁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 30, 100, '定昌镇'),
	(14, 04, 30, 101, '郭村镇'),
	(14, 04, 30, 102, '故县镇'),
	(14, 04, 30, 103, '新店镇'),
	(14, 04, 30, 104, '漳源镇'),
	(14, 04, 30, 105, '册村镇'),
	(14, 04, 30, 200, '段柳乡'),
	(14, 04, 30, 201, '松村乡'),
	(14, 04, 30, 202, '次村乡'),
	(14, 04, 30, 203, '牛寺乡'),
	(14, 04, 30, 204, '南里乡'),
	(14, 04, 30, 205, '南泉乡'),
	(14, 04, 30, 206, '杨安乡');

/* 山西省 长治市 沁源县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 31, 100, '沁河镇'),
	(14, 04, 31, 101, '郭道镇'),
	(14, 04, 31, 102, '灵空山镇'),
	(14, 04, 31, 103, '王和镇'),
	(14, 04, 31, 104, '李元镇'),
	(14, 04, 31, 200, '中峪乡'),
	(14, 04, 31, 201, '法中乡'),
	(14, 04, 31, 202, '交口乡'),
	(14, 04, 31, 203, '聪子峪乡'),
	(14, 04, 31, 204, '韩洪乡'),
	(14, 04, 31, 205, '官滩乡'),
	(14, 04, 31, 206, '景凤乡'),
	(14, 04, 31, 207, '赤石桥乡'),
	(14, 04, 31, 208, '王陶乡');

/* 山西省 长治市 潞城市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 04, 81, 001, '潞华街道办事处'),
	(14, 04, 81, 002, '成家川街道办事处'),
	(14, 04, 81, 100, '店上镇'),
	(14, 04, 81, 101, '微子镇'),
	(14, 04, 81, 102, '辛安泉镇'),
	(14, 04, 81, 103, '翟店镇'),
	(14, 04, 81, 200, '合室乡'),
	(14, 04, 81, 201, '黄牛蹄乡'),
	(14, 04, 81, 202, '史回乡');

/* 山西省 晋城市 城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 05, 02, 001, '东街街道办事处'),
	(14, 05, 02, 002, '西街街道办事处'),
	(14, 05, 02, 003, '南街街道办事处'),
	(14, 05, 02, 004, '北街街道办事处'),
	(14, 05, 02, 005, '矿区街道办事处'),
	(14, 05, 02, 006, '钟家庄办事处'),
	(14, 05, 02, 007, '西上庄办事处'),
	(14, 05, 02, 100, '北石店镇');

/* 山西省 晋城市 沁水县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 05, 21, 100, '龙港镇'),
	(14, 05, 21, 101, '中村镇'),
	(14, 05, 21, 102, '郑庄镇'),
	(14, 05, 21, 103, '端氏镇'),
	(14, 05, 21, 104, '嘉峰镇'),
	(14, 05, 21, 105, '郑村镇'),
	(14, 05, 21, 106, '柿庄镇'),
	(14, 05, 21, 200, '樊村河乡'),
	(14, 05, 21, 201, '土沃乡'),
	(14, 05, 21, 202, '张村乡'),
	(14, 05, 21, 203, '苏庄乡'),
	(14, 05, 21, 204, '胡底乡'),
	(14, 05, 21, 205, '固县乡'),
	(14, 05, 21, 206, '十里乡');

/* 山西省 晋城市 阳城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 05, 22, 100, '凤城镇'),
	(14, 05, 22, 101, '北留镇'),
	(14, 05, 22, 102, '润城镇'),
	(14, 05, 22, 103, '町店镇'),
	(14, 05, 22, 104, '芹池镇'),
	(14, 05, 22, 105, '次营镇'),
	(14, 05, 22, 106, '横河镇'),
	(14, 05, 22, 107, '河北镇'),
	(14, 05, 22, 108, '蟒河镇'),
	(14, 05, 22, 109, '东冶镇'),
	(14, 05, 22, 200, '白桑乡'),
	(14, 05, 22, 201, '寺头乡'),
	(14, 05, 22, 202, '西河乡'),
	(14, 05, 22, 203, '演礼乡'),
	(14, 05, 22, 204, '固隆乡'),
	(14, 05, 22, 205, '董封乡'),
	(14, 05, 22, 206, '驾岭乡');

/* 山西省 晋城市 陵川县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 05, 24, 100, '崇文镇'),
	(14, 05, 24, 101, '礼义镇'),
	(14, 05, 24, 102, '附城镇'),
	(14, 05, 24, 103, '西河底镇'),
	(14, 05, 24, 104, '平城镇'),
	(14, 05, 24, 105, '杨村镇'),
	(14, 05, 24, 106, '潞城镇'),
	(14, 05, 24, 204, '夺火乡'),
	(14, 05, 24, 206, '马圪当乡'),
	(14, 05, 24, 207, '古郊乡'),
	(14, 05, 24, 209, '六泉乡'),
	(14, 05, 24, 212, '秦家庄乡');

/* 山西省 晋城市 泽州县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 05, 25, 100, '南村镇'),
	(14, 05, 25, 101, '下村镇'),
	(14, 05, 25, 102, '大东沟镇'),
	(14, 05, 25, 103, '周村镇'),
	(14, 05, 25, 104, '犁川镇'),
	(14, 05, 25, 105, '晋庙铺镇'),
	(14, 05, 25, 106, '金村镇'),
	(14, 05, 25, 107, '高都镇'),
	(14, 05, 25, 108, '巴公镇'),
	(14, 05, 25, 109, '大阳镇'),
	(14, 05, 25, 110, '山河镇'),
	(14, 05, 25, 111, '大箕镇'),
	(14, 05, 25, 112, '柳树口镇'),
	(14, 05, 25, 113, '北义城镇'),
	(14, 05, 25, 200, '川底乡'),
	(14, 05, 25, 201, '李寨乡'),
	(14, 05, 25, 202, '南岭乡');

/* 山西省 晋城市 高平市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 05, 81, 001, '北城街道办事处'),
	(14, 05, 81, 002, '东城街道办事处'),
	(14, 05, 81, 003, '南城街道办事处'),
	(14, 05, 81, 101, '米山镇'),
	(14, 05, 81, 102, '三甲镇'),
	(14, 05, 81, 103, '神农镇'),
	(14, 05, 81, 104, '陈区镇'),
	(14, 05, 81, 105, '北诗镇'),
	(14, 05, 81, 106, '河西镇'),
	(14, 05, 81, 107, '马村镇'),
	(14, 05, 81, 108, '野川镇'),
	(14, 05, 81, 109, '寺庄镇'),
	(14, 05, 81, 201, '建宁乡'),
	(14, 05, 81, 202, '石末乡'),
	(14, 05, 81, 203, '原村乡'),
	(14, 05, 81, 204, '永录乡');

/* 山西省 朔州市 朔城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 06, 02, 001, '北城街道办事处'),
	(14, 06, 02, 002, '南城街道办事处'),
	(14, 06, 02, 003, '神头街道办事处'),
	(14, 06, 02, 004, '北旺庄街道办事处'),
	(14, 06, 02, 100, '神头镇'),
	(14, 06, 02, 101, '利民镇'),
	(14, 06, 02, 200, '下团堡乡'),
	(14, 06, 02, 201, '小平易乡'),
	(14, 06, 02, 202, '滋润乡'),
	(14, 06, 02, 203, '福善庄乡'),
	(14, 06, 02, 204, '南榆林乡'),
	(14, 06, 02, 205, '贾庄乡'),
	(14, 06, 02, 206, '沙塄河乡'),
	(14, 06, 02, 207, '窑子头乡'),
	(14, 06, 02, 208, '张蔡庄乡');

/* 山西省 朔州市 平鲁区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 06, 03, 100, '井坪镇'),
	(14, 06, 03, 101, '凤凰城镇'),
	(14, 06, 03, 200, '白堂乡'),
	(14, 06, 03, 201, '陶村乡'),
	(14, 06, 03, 202, '下水头乡'),
	(14, 06, 03, 203, '双碾乡'),
	(14, 06, 03, 204, '阻虎乡'),
	(14, 06, 03, 205, '高石庄乡'),
	(14, 06, 03, 206, '西水界乡'),
	(14, 06, 03, 207, '下面高乡'),
	(14, 06, 03, 208, '下木角乡'),
	(14, 06, 03, 209, '向阳堡乡'),
	(14, 06, 03, 210, '榆岭乡');

/* 山西省 朔州市 山阴县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 06, 21, 001, '东城管理委员会'),
	(14, 06, 21, 002, '西城管理委员会'),
	(14, 06, 21, 100, '玉井镇'),
	(14, 06, 21, 101, '北周庄镇'),
	(14, 06, 21, 102, '古城镇'),
	(14, 06, 21, 103, '岱岳镇'),
	(14, 06, 21, 200, '吴马营乡'),
	(14, 06, 21, 201, '马营乡'),
	(14, 06, 21, 202, '下喇叭乡'),
	(14, 06, 21, 203, '合盛堡乡'),
	(14, 06, 21, 205, '安荣乡'),
	(14, 06, 21, 206, '薛圐圙乡'),
	(14, 06, 21, 207, '后所乡'),
	(14, 06, 21, 208, '张家庄乡'),
	(14, 06, 21, 209, '马营庄乡');

/* 山西省 朔州市 应县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 06, 22, 100, '金城镇'),
	(14, 06, 22, 101, '南河种镇'),
	(14, 06, 22, 102, '下社镇'),
	(14, 06, 22, 200, '镇子梁乡'),
	(14, 06, 22, 201, '义井乡'),
	(14, 06, 22, 202, '藏寨乡'),
	(14, 06, 22, 203, '大黄巍乡'),
	(14, 06, 22, 204, '杏寨乡'),
	(14, 06, 22, 205, '下马峪乡'),
	(14, 06, 22, 206, '南泉乡'),
	(14, 06, 22, 207, '大临河乡'),
	(14, 06, 22, 208, '白马石乡');

/* 山西省 朔州市 右玉县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 06, 23, 100, '新城镇'),
	(14, 06, 23, 101, '右卫镇'),
	(14, 06, 23, 102, '威远镇'),
	(14, 06, 23, 103, '元堡子镇'),
	(14, 06, 23, 200, '牛心堡乡'),
	(14, 06, 23, 201, '白头里乡'),
	(14, 06, 23, 202, '高家堡乡'),
	(14, 06, 23, 203, '丁家窑乡'),
	(14, 06, 23, 204, '杨千河乡'),
	(14, 06, 23, 205, '李达窑乡');

/* 山西省 朔州市 怀仁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 06, 24, 100, '云中镇'),
	(14, 06, 24, 101, '吴家窑镇'),
	(14, 06, 24, 102, '金沙滩镇'),
	(14, 06, 24, 103, '毛家皂镇'),
	(14, 06, 24, 200, '何家堡乡'),
	(14, 06, 24, 201, '新家园乡'),
	(14, 06, 24, 202, '亲和乡'),
	(14, 06, 24, 203, '海北头乡'),
	(14, 06, 24, 204, '马辛庄乡'),
	(14, 06, 24, 205, '河头乡');

/* 山西省 晋中市 榆次区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 07, 02, 001, '北关街道办事处'),
	(14, 07, 02, 002, '锦纶街道办事处'),
	(14, 07, 02, 003, '新华街道办事处'),
	(14, 07, 02, 004, '西南街道办事处'),
	(14, 07, 02, 005, '路西街道办事处'),
	(14, 07, 02, 006, '经纬街道办事处'),
	(14, 07, 02, 007, '安宁街道办事处'),
	(14, 07, 02, 008, '新建街道办事处'),
	(14, 07, 02, 009, '晋华街道办事处'),
	(14, 07, 02, 100, '乌金山镇'),
	(14, 07, 02, 101, '东阳镇'),
	(14, 07, 02, 102, '什贴镇'),
	(14, 07, 02, 103, '长凝镇'),
	(14, 07, 02, 104, '北田镇'),
	(14, 07, 02, 105, '修文镇'),
	(14, 07, 02, 200, '郭家堡乡'),
	(14, 07, 02, 201, '张庆乡'),
	(14, 07, 02, 202, '庄子乡'),
	(14, 07, 02, 203, '东赵乡');

/* 山西省 晋中市 榆社县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 07, 21, 100, '箕城镇'),
	(14, 07, 21, 101, '云簇镇'),
	(14, 07, 21, 102, '郝北镇'),
	(14, 07, 21, 103, '社城镇'),
	(14, 07, 21, 200, '河峪乡'),
	(14, 07, 21, 201, '北寨乡'),
	(14, 07, 21, 202, '西马乡'),
	(14, 07, 21, 203, '岚峪乡'),
	(14, 07, 21, 204, '讲堂乡');

/* 山西省 晋中市 左权县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 07, 22, 001, '城区街道管理委员会'),
	(14, 07, 22, 100, '辽阳镇'),
	(14, 07, 22, 101, '桐峪镇'),
	(14, 07, 22, 102, '麻田镇'),
	(14, 07, 22, 103, '芹泉镇'),
	(14, 07, 22, 104, '拐儿镇'),
	(14, 07, 22, 200, '寒王乡'),
	(14, 07, 22, 201, '石匣乡'),
	(14, 07, 22, 202, '龙泉乡'),
	(14, 07, 22, 203, '粟城乡'),
	(14, 07, 22, 204, '羊角乡');

/* 山西省 晋中市 和顺县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 07, 23, 001, '城区管理委员会'),
	(14, 07, 23, 100, '义兴镇'),
	(14, 07, 23, 101, '李阳镇'),
	(14, 07, 23, 102, '松烟镇'),
	(14, 07, 23, 103, '青城镇'),
	(14, 07, 23, 104, '横岭镇'),
	(14, 07, 23, 200, '喂马乡'),
	(14, 07, 23, 201, '平松乡'),
	(14, 07, 23, 202, '牛川乡'),
	(14, 07, 23, 203, '马坊乡'),
	(14, 07, 23, 204, '阳光占乡');

/* 山西省 晋中市 昔阳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 07, 24, 100, '乐平镇'),
	(14, 07, 24, 101, '皋落镇'),
	(14, 07, 24, 102, '冶头镇'),
	(14, 07, 24, 103, '沾尚镇'),
	(14, 07, 24, 104, '大寨镇'),
	(14, 07, 24, 200, '李家庄乡'),
	(14, 07, 24, 201, '界都乡'),
	(14, 07, 24, 202, '三都乡'),
	(14, 07, 24, 203, '赵壁乡'),
	(14, 07, 24, 204, '孔氏乡'),
	(14, 07, 24, 205, '闫庄乡'),
	(14, 07, 24, 206, '西寨乡');

/* 山西省 晋中市 寿阳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 07, 25, 100, '朝阳镇'),
	(14, 07, 25, 101, '南燕竹镇'),
	(14, 07, 25, 102, '宗艾镇'),
	(14, 07, 25, 103, '平头镇'),
	(14, 07, 25, 104, '松塔镇'),
	(14, 07, 25, 105, '西洛镇'),
	(14, 07, 25, 106, '尹灵芝镇'),
	(14, 07, 25, 200, '平舒乡'),
	(14, 07, 25, 201, '解愁乡'),
	(14, 07, 25, 202, '温家庄乡'),
	(14, 07, 25, 203, '景尚乡'),
	(14, 07, 25, 204, '上湖乡'),
	(14, 07, 25, 205, '羊头崖乡'),
	(14, 07, 25, 206, '马首乡');

/* 山西省 晋中市 太谷县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 07, 26, 100, '明星镇'),
	(14, 07, 26, 101, '胡村镇'),
	(14, 07, 26, 102, '范村镇'),
	(14, 07, 26, 200, '侯城乡'),
	(14, 07, 26, 201, '北汪乡'),
	(14, 07, 26, 202, '水秀乡'),
	(14, 07, 26, 203, '阳邑乡'),
	(14, 07, 26, 204, '小白乡'),
	(14, 07, 26, 205, '任村乡');

/* 山西省 晋中市 祁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 07, 27, 001, '昌源城区管理委员会'),
	(14, 07, 27, 002, '丹枫城区管理委员会'),
	(14, 07, 27, 003, '麓台城区管理委员会'),
	(14, 07, 27, 100, '昭馀镇'),
	(14, 07, 27, 101, '东观镇'),
	(14, 07, 27, 102, '古县镇'),
	(14, 07, 27, 103, '贾令镇'),
	(14, 07, 27, 104, '城赵镇'),
	(14, 07, 27, 105, '来远镇'),
	(14, 07, 27, 200, '西六支乡'),
	(14, 07, 27, 201, '峪口乡');

/* 山西省 晋中市 平遥县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 07, 28, 001, '古城街道办事处'),
	(14, 07, 28, 002, '城东街道办事处'),
	(14, 07, 28, 003, '城西街道办事处'),
	(14, 07, 28, 100, '古陶镇'),
	(14, 07, 28, 101, '段村镇'),
	(14, 07, 28, 102, '东泉镇'),
	(14, 07, 28, 103, '洪善镇'),
	(14, 07, 28, 104, '宁固镇'),
	(14, 07, 28, 200, '南政乡'),
	(14, 07, 28, 201, '中都乡'),
	(14, 07, 28, 202, '岳壁乡'),
	(14, 07, 28, 203, '卜宜乡'),
	(14, 07, 28, 204, '孟山乡'),
	(14, 07, 28, 205, '朱坑乡'),
	(14, 07, 28, 206, '襄垣乡'),
	(14, 07, 28, 207, '杜家庄乡'),
	(14, 07, 28, 208, '香乐乡');

/* 山西省 晋中市 灵石县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 07, 29, 001, '东城管理委员会'),
	(14, 07, 29, 002, '西城管理委员会'),
	(14, 07, 29, 003, '北城管理委员会'),
	(14, 07, 29, 100, '翠峰镇'),
	(14, 07, 29, 101, '静升镇'),
	(14, 07, 29, 102, '两渡镇'),
	(14, 07, 29, 103, '夏门镇'),
	(14, 07, 29, 104, '南关镇'),
	(14, 07, 29, 105, '段纯镇'),
	(14, 07, 29, 200, '马和乡'),
	(14, 07, 29, 201, '英武乡'),
	(14, 07, 29, 202, '王禹乡'),
	(14, 07, 29, 203, '坛镇乡'),
	(14, 07, 29, 204, '梁家焉乡'),
	(14, 07, 29, 205, '交口乡');

/* 山西省 晋中市 介休市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 07, 81, 001, '北关街道办事处'),
	(14, 07, 81, 002, '西关街道办事处'),
	(14, 07, 81, 003, '东南街道办事处'),
	(14, 07, 81, 004, '西南街道办事处'),
	(14, 07, 81, 005, '北坛街道办事处'),
	(14, 07, 81, 100, '义安镇'),
	(14, 07, 81, 101, '张兰镇'),
	(14, 07, 81, 102, '连福镇'),
	(14, 07, 81, 103, '洪山镇'),
	(14, 07, 81, 104, '龙凤镇'),
	(14, 07, 81, 105, '绵山镇'),
	(14, 07, 81, 106, '义棠镇'),
	(14, 07, 81, 200, '城关乡'),
	(14, 07, 81, 201, '宋古乡'),
	(14, 07, 81, 202, '三佳乡');

/* 山西省 运城市 盐湖区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 02, 001, '中城街道办事处'),
	(14, 08, 02, 002, '东城街道办事处'),
	(14, 08, 02, 003, '西城街道办事处'),
	(14, 08, 02, 004, '南城街道办事处'),
	(14, 08, 02, 005, '北城街道办事处'),
	(14, 08, 02, 006, '安邑街道办事处'),
	(14, 08, 02, 007, '大渠街道办事处'),
	(14, 08, 02, 008, '姚孟街道办事处'),
	(14, 08, 02, 100, '解州镇'),
	(14, 08, 02, 101, '龙居镇'),
	(14, 08, 02, 102, '北相镇'),
	(14, 08, 02, 103, '泓芝驿镇'),
	(14, 08, 02, 104, '三路里镇'),
	(14, 08, 02, 105, '陶村镇'),
	(14, 08, 02, 106, '东郭镇'),
	(14, 08, 02, 200, '席张乡'),
	(14, 08, 02, 201, '金井乡'),
	(14, 08, 02, 202, '王范乡'),
	(14, 08, 02, 203, '冯村乡'),
	(14, 08, 02, 204, '上郭乡'),
	(14, 08, 02, 205, '上王乡');

/* 山西省 运城市 临猗县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 21, 100, '猗氏镇'),
	(14, 08, 21, 101, '嵋阳镇'),
	(14, 08, 21, 102, '临晋镇'),
	(14, 08, 21, 103, '七级镇'),
	(14, 08, 21, 104, '东张镇'),
	(14, 08, 21, 105, '孙吉镇'),
	(14, 08, 21, 106, '三管镇'),
	(14, 08, 21, 107, '牛杜镇'),
	(14, 08, 21, 108, '耽子镇'),
	(14, 08, 21, 200, '楚侯乡'),
	(14, 08, 21, 201, '庙上乡'),
	(14, 08, 21, 202, '角杯乡'),
	(14, 08, 21, 203, '北辛乡'),
	(14, 08, 21, 204, '北景乡');

/* 山西省 运城市 万荣县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 22, 100, '解店镇'),
	(14, 08, 22, 101, '通化镇'),
	(14, 08, 22, 102, '汉薛镇'),
	(14, 08, 22, 103, '荣河镇'),
	(14, 08, 22, 200, '万泉乡'),
	(14, 08, 22, 201, '里望乡'),
	(14, 08, 22, 202, '西村乡'),
	(14, 08, 22, 203, '南张乡'),
	(14, 08, 22, 204, '高村乡'),
	(14, 08, 22, 205, '皇甫乡'),
	(14, 08, 22, 206, '贾村乡'),
	(14, 08, 22, 207, '王显乡'),
	(14, 08, 22, 208, '光华乡'),
	(14, 08, 22, 209, '裴庄乡');

/* 山西省 运城市 闻喜县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 23, 100, '桐城镇'),
	(14, 08, 23, 101, '郭家庄镇'),
	(14, 08, 23, 102, '畖底镇'),
	(14, 08, 23, 103, '薛店镇'),
	(14, 08, 23, 104, '东镇镇'),
	(14, 08, 23, 105, '礼元镇'),
	(14, 08, 23, 106, '河底镇'),
	(14, 08, 23, 200, '神柏乡'),
	(14, 08, 23, 201, '阳隅乡'),
	(14, 08, 23, 202, '侯村乡'),
	(14, 08, 23, 203, '裴社乡'),
	(14, 08, 23, 204, '后宫乡'),
	(14, 08, 23, 205, '石门乡');

/* 山西省 运城市 稷山县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 24, 100, '稷峰镇'),
	(14, 08, 24, 101, '西社镇'),
	(14, 08, 24, 102, '化峪镇'),
	(14, 08, 24, 103, '翟店镇'),
	(14, 08, 24, 104, '清河镇'),
	(14, 08, 24, 200, '蔡村乡'),
	(14, 08, 24, 201, '太阳乡');

/* 山西省 运城市 新绛县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 25, 100, '龙兴镇'),
	(14, 08, 25, 101, '三泉镇'),
	(14, 08, 25, 102, '泽掌镇'),
	(14, 08, 25, 103, '北张镇'),
	(14, 08, 25, 104, '古交镇'),
	(14, 08, 25, 105, '万安镇'),
	(14, 08, 25, 106, '阳王镇'),
	(14, 08, 25, 107, '泉掌镇'),
	(14, 08, 25, 200, '横桥乡');

/* 山西省 运城市 绛县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 26, 100, '古绛镇'),
	(14, 08, 26, 101, '横水镇'),
	(14, 08, 26, 102, '陈村镇'),
	(14, 08, 26, 103, '卫庄镇'),
	(14, 08, 26, 104, '么里镇'),
	(14, 08, 26, 105, '南樊镇'),
	(14, 08, 26, 106, '安峪镇'),
	(14, 08, 26, 107, '大交镇'),
	(14, 08, 26, 200, '郝庄乡'),
	(14, 08, 26, 201, '冷口乡');

/* 山西省 运城市 垣曲县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 27, 100, '新城镇'),
	(14, 08, 27, 101, '历山镇'),
	(14, 08, 27, 102, '古城镇'),
	(14, 08, 27, 103, '王茅镇'),
	(14, 08, 27, 104, '毛家湾镇'),
	(14, 08, 27, 200, '蒲掌乡'),
	(14, 08, 27, 201, '英言乡'),
	(14, 08, 27, 202, '解峪乡'),
	(14, 08, 27, 203, '华峰乡'),
	(14, 08, 27, 204, '长直乡'),
	(14, 08, 27, 205, '皋落乡');

/* 山西省 运城市 夏县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 28, 100, '瑶峰镇'),
	(14, 08, 28, 101, '庙前镇'),
	(14, 08, 28, 102, '裴介镇'),
	(14, 08, 28, 103, '水头镇'),
	(14, 08, 28, 104, '埝掌镇'),
	(14, 08, 28, 105, '泗交镇'),
	(14, 08, 28, 200, '尉郭乡'),
	(14, 08, 28, 201, '禹王乡'),
	(14, 08, 28, 202, '胡张乡'),
	(14, 08, 28, 203, '南大里乡'),
	(14, 08, 28, 204, '祁家河乡');

/* 山西省 运城市 平陆县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 29, 100, '圣人涧镇'),
	(14, 08, 29, 101, '常乐镇'),
	(14, 08, 29, 102, '张店镇'),
	(14, 08, 29, 103, '张村镇'),
	(14, 08, 29, 104, '曹川镇'),
	(14, 08, 29, 105, '三门镇'),
	(14, 08, 29, 200, '洪池乡'),
	(14, 08, 29, 201, '杜马乡'),
	(14, 08, 29, 202, '部官乡'),
	(14, 08, 29, 203, '坡底乡');

/* 山西省 运城市 芮城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 30, 100, '古魏镇'),
	(14, 08, 30, 101, '风陵渡镇'),
	(14, 08, 30, 102, '陌南镇'),
	(14, 08, 30, 103, '西陌镇'),
	(14, 08, 30, 104, '永乐镇'),
	(14, 08, 30, 105, '大王镇'),
	(14, 08, 30, 106, '阳城镇'),
	(14, 08, 30, 200, '东垆乡'),
	(14, 08, 30, 201, '南卫乡'),
	(14, 08, 30, 202, '学张乡');

/* 山西省 运城市 永济市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 81, 001, '城西街道办事处'),
	(14, 08, 81, 002, '城北街道办事处'),
	(14, 08, 81, 003, '城东街道办事处'),
	(14, 08, 81, 100, '虞乡镇'),
	(14, 08, 81, 101, '卿头镇'),
	(14, 08, 81, 102, '开张镇'),
	(14, 08, 81, 103, '栲栳镇'),
	(14, 08, 81, 104, '蒲州镇'),
	(14, 08, 81, 105, '韩阳镇'),
	(14, 08, 81, 106, '张营镇');

/* 山西省 运城市 河津市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 08, 82, 001, '城区街道办事处'),
	(14, 08, 82, 002, '清涧街道办事处'),
	(14, 08, 82, 100, '樊村镇'),
	(14, 08, 82, 101, '僧楼镇'),
	(14, 08, 82, 200, '小梁乡'),
	(14, 08, 82, 201, '柴家乡'),
	(14, 08, 82, 202, '赵家庄乡'),
	(14, 08, 82, 203, '下化乡'),
	(14, 08, 82, 204, '阳村乡');

/* 山西省 忻州市 忻府区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 02, 001, '秀容街道办事处'),
	(14, 09, 02, 002, '长征街街道办事处'),
	(14, 09, 02, 003, '新建路街道办事处'),
	(14, 09, 02, 100, '播明镇'),
	(14, 09, 02, 101, '奇村镇'),
	(14, 09, 02, 102, '三交镇'),
	(14, 09, 02, 103, '庄磨镇'),
	(14, 09, 02, 104, '豆罗镇'),
	(14, 09, 02, 105, '董村镇'),
	(14, 09, 02, 200, '曹张乡'),
	(14, 09, 02, 201, '高城乡'),
	(14, 09, 02, 202, '秦城乡'),
	(14, 09, 02, 203, '解原乡'),
	(14, 09, 02, 204, '合索乡'),
	(14, 09, 02, 205, '阳坡乡'),
	(14, 09, 02, 206, '兰村乡'),
	(14, 09, 02, 207, '紫岩乡'),
	(14, 09, 02, 208, '西张乡'),
	(14, 09, 02, 209, '东楼乡'),
	(14, 09, 02, 210, '北义井乡');

/* 山西省 忻州市 定襄县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 21, 100, '晋昌镇'),
	(14, 09, 21, 101, '河边镇'),
	(14, 09, 21, 102, '宏道镇'),
	(14, 09, 21, 200, '杨芳乡'),
	(14, 09, 21, 201, '南王乡'),
	(14, 09, 21, 202, '蒋村乡'),
	(14, 09, 21, 203, '神山乡'),
	(14, 09, 21, 204, '季庄乡'),
	(14, 09, 21, 205, '受禄乡');

/* 山西省 忻州市 五台县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 22, 100, '台城镇'),
	(14, 09, 22, 101, '台怀镇'),
	(14, 09, 22, 102, '耿镇镇'),
	(14, 09, 22, 103, '豆村镇'),
	(14, 09, 22, 104, '白家庄镇'),
	(14, 09, 22, 105, '东冶镇'),
	(14, 09, 22, 200, '沟南乡'),
	(14, 09, 22, 201, '东雷乡'),
	(14, 09, 22, 202, '高洪口乡'),
	(14, 09, 22, 203, '门限石乡'),
	(14, 09, 22, 204, '陈家庄乡'),
	(14, 09, 22, 205, '建安乡'),
	(14, 09, 22, 206, '神西乡'),
	(14, 09, 22, 207, '蒋坊乡'),
	(14, 09, 22, 208, '灵境乡'),
	(14, 09, 22, 209, '阳白乡'),
	(14, 09, 22, 210, '茹村乡'),
	(14, 09, 22, 211, '石咀乡'),
	(14, 09, 22, 212, '金岗库乡');

/* 山西省 忻州市 代县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 23, 100, '上馆镇'),
	(14, 09, 23, 101, '阳明堡镇'),
	(14, 09, 23, 102, '峨口镇'),
	(14, 09, 23, 103, '聂营镇'),
	(14, 09, 23, 104, '枣林镇'),
	(14, 09, 23, 105, '滩上镇'),
	(14, 09, 23, 200, '新高乡'),
	(14, 09, 23, 201, '峪口乡'),
	(14, 09, 23, 202, '上磨坊乡'),
	(14, 09, 23, 203, '胡峪乡'),
	(14, 09, 23, 204, '雁门关乡');

/* 山西省 忻州市 繁峙县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 24, 100, '繁城镇'),
	(14, 09, 24, 101, '砂河镇'),
	(14, 09, 24, 102, '大营镇'),
	(14, 09, 24, 200, '下茹越乡'),
	(14, 09, 24, 201, '杏园乡'),
	(14, 09, 24, 202, '光裕堡乡'),
	(14, 09, 24, 203, '集义庄乡'),
	(14, 09, 24, 204, '东山乡'),
	(14, 09, 24, 205, '金山铺乡'),
	(14, 09, 24, 206, '柏家庄乡'),
	(14, 09, 24, 207, '横涧乡'),
	(14, 09, 24, 208, '神堂堡乡'),
	(14, 09, 24, 209, '岩头乡');

/* 山西省 忻州市 宁武县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 25, 100, '凤凰镇'),
	(14, 09, 25, 101, '阳方口镇'),
	(14, 09, 25, 102, '东寨镇'),
	(14, 09, 25, 103, '石家庄镇'),
	(14, 09, 25, 200, '薛家洼乡'),
	(14, 09, 25, 201, '余庄乡'),
	(14, 09, 25, 202, '涔山乡'),
	(14, 09, 25, 203, '化北屯乡'),
	(14, 09, 25, 204, '西马坊乡'),
	(14, 09, 25, 205, '新堡乡'),
	(14, 09, 25, 206, '迭台寺乡'),
	(14, 09, 25, 207, '圪廖乡'),
	(14, 09, 25, 208, '怀道乡'),
	(14, 09, 25, 209, '东马坊乡');

/* 山西省 忻州市 静乐县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 26, 100, '鹅城镇'),
	(14, 09, 26, 101, '杜家村镇'),
	(14, 09, 26, 102, '康家会镇'),
	(14, 09, 26, 103, '丰润镇'),
	(14, 09, 26, 201, '堂尔上乡'),
	(14, 09, 26, 202, '中庄乡'),
	(14, 09, 26, 203, '双路乡'),
	(14, 09, 26, 204, '段家寨乡'),
	(14, 09, 26, 205, '辛村乡'),
	(14, 09, 26, 206, '王村乡'),
	(14, 09, 26, 207, '神峪沟乡'),
	(14, 09, 26, 208, '娘子神乡'),
	(14, 09, 26, 209, '娑婆乡'),
	(14, 09, 26, 210, '赤泥洼乡');

/* 山西省 忻州市 神池县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 27, 100, '龙泉镇'),
	(14, 09, 27, 101, '义井镇'),
	(14, 09, 27, 102, '八角镇'),
	(14, 09, 27, 200, '东湖乡'),
	(14, 09, 27, 201, '太平庄乡'),
	(14, 09, 27, 202, '虎北乡'),
	(14, 09, 27, 203, '贺职乡'),
	(14, 09, 27, 204, '长畛乡'),
	(14, 09, 27, 205, '烈堡乡'),
	(14, 09, 27, 206, '大严备乡');

/* 山西省 忻州市 五寨县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 28, 100, '砚城镇'),
	(14, 09, 28, 101, '小河头镇'),
	(14, 09, 28, 102, '三岔镇'),
	(14, 09, 28, 200, '前所乡'),
	(14, 09, 28, 201, '李家坪乡'),
	(14, 09, 28, 202, '孙家坪乡'),
	(14, 09, 28, 203, '梁家坪乡'),
	(14, 09, 28, 204, '胡会乡'),
	(14, 09, 28, 205, '新寨乡'),
	(14, 09, 28, 206, '韩家楼乡'),
	(14, 09, 28, 207, '东秀庄乡'),
	(14, 09, 28, 208, '杏岭子乡');

/* 山西省 忻州市 岢岚县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 29, 100, '岚漪镇'),
	(14, 09, 29, 101, '三井镇'),
	(14, 09, 29, 200, '神堂坪乡'),
	(14, 09, 29, 201, '高家会乡'),
	(14, 09, 29, 202, '李家沟乡'),
	(14, 09, 29, 203, '水峪贯乡'),
	(14, 09, 29, 204, '西豹峪乡'),
	(14, 09, 29, 205, '温泉乡'),
	(14, 09, 29, 206, '阳坪乡'),
	(14, 09, 29, 207, '大涧乡'),
	(14, 09, 29, 208, '宋家沟乡'),
	(14, 09, 29, 209, '王家岔乡');

/* 山西省 忻州市 河曲县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 30, 100, '文笔镇'),
	(14, 09, 30, 101, '楼子营镇'),
	(14, 09, 30, 102, '刘家塔镇'),
	(14, 09, 30, 103, '巡镇镇'),
	(14, 09, 30, 200, '鹿固乡'),
	(14, 09, 30, 201, '前川乡'),
	(14, 09, 30, 202, '单寨乡'),
	(14, 09, 30, 203, '土沟乡'),
	(14, 09, 30, 204, '旧县乡'),
	(14, 09, 30, 205, '沙坪乡'),
	(14, 09, 30, 206, '社梁乡'),
	(14, 09, 30, 207, '沙泉乡'),
	(14, 09, 30, 208, '赵家沟乡');

/* 山西省 忻州市 保德县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 31, 100, '东关镇'),
	(14, 09, 31, 101, '义门镇'),
	(14, 09, 31, 102, '桥头镇'),
	(14, 09, 31, 103, '杨家湾镇'),
	(14, 09, 31, 200, '腰庄乡'),
	(14, 09, 31, 201, '韩家川乡'),
	(14, 09, 31, 202, '林遮峪乡'),
	(14, 09, 31, 203, '冯家川乡'),
	(14, 09, 31, 204, '土崖塔乡'),
	(14, 09, 31, 205, '孙家沟乡'),
	(14, 09, 31, 206, '窑洼乡'),
	(14, 09, 31, 207, '窑圪台乡'),
	(14, 09, 31, 208, '南河沟乡');

/* 山西省 忻州市 偏关县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 32, 100, '新关镇'),
	(14, 09, 32, 101, '天峰坪镇'),
	(14, 09, 32, 102, '老营镇'),
	(14, 09, 32, 103, '万家寨镇'),
	(14, 09, 32, 200, '窑头乡'),
	(14, 09, 32, 201, '楼沟乡'),
	(14, 09, 32, 202, '尚峪乡'),
	(14, 09, 32, 203, '南堡子乡'),
	(14, 09, 32, 204, '水泉乡'),
	(14, 09, 32, 205, '陈家营乡');

/* 山西省 忻州市 原平市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 09, 81, 001, '北城街道办事处'),
	(14, 09, 81, 002, '南城街道办事处'),
	(14, 09, 81, 003, '轩煤矿区街道办事处'),
	(14, 09, 81, 100, '东社镇'),
	(14, 09, 81, 101, '苏龙口镇'),
	(14, 09, 81, 102, '崞阳镇'),
	(14, 09, 81, 103, '大牛店镇'),
	(14, 09, 81, 104, '闫庄镇'),
	(14, 09, 81, 105, '长梁沟镇'),
	(14, 09, 81, 106, '轩岗镇'),
	(14, 09, 81, 200, '新原乡'),
	(14, 09, 81, 201, '南白乡'),
	(14, 09, 81, 202, '子干乡'),
	(14, 09, 81, 203, '中阳乡'),
	(14, 09, 81, 204, '沿沟乡'),
	(14, 09, 81, 205, '大林乡'),
	(14, 09, 81, 206, '西镇乡'),
	(14, 09, 81, 207, '解村乡'),
	(14, 09, 81, 208, '王家庄乡'),
	(14, 09, 81, 209, '楼板寨乡'),
	(14, 09, 81, 210, '段家堡乡');

/* 山西省 临汾市 尧都区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 02, 001, '解放路街道办事处'),
	(14, 10, 02, 002, '鼓楼西街街道办事处'),
	(14, 10, 02, 003, '水塔街街道办事处'),
	(14, 10, 02, 004, '南街街道办事处'),
	(14, 10, 02, 005, '乡贤街街道办事处'),
	(14, 10, 02, 006, '辛寺街街道办事处'),
	(14, 10, 02, 007, '铁路东街道办事处'),
	(14, 10, 02, 008, '车站街街道办事处'),
	(14, 10, 02, 009, '汾河街道办事处'),
	(14, 10, 02, 010, '滨河办事处'),
	(14, 10, 02, 100, '屯里镇'),
	(14, 10, 02, 101, '乔李镇'),
	(14, 10, 02, 102, '大阳镇'),
	(14, 10, 02, 103, '县底镇'),
	(14, 10, 02, 104, '刘村镇'),
	(14, 10, 02, 105, '金殿镇'),
	(14, 10, 02, 106, '吴村镇'),
	(14, 10, 02, 107, '土门镇'),
	(14, 10, 02, 108, '魏村镇'),
	(14, 10, 02, 109, '尧庙镇'),
	(14, 10, 02, 200, '段店乡'),
	(14, 10, 02, 201, '贾得乡'),
	(14, 10, 02, 202, '贺家庄乡'),
	(14, 10, 02, 203, '一平垣乡'),
	(14, 10, 02, 204, '枕头乡'),
	(14, 10, 02, 205, '河底乡');

/* 山西省 临汾市 曲沃县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 21, 100, '乐昌镇'),
	(14, 10, 21, 101, '史村镇'),
	(14, 10, 21, 102, '曲村镇'),
	(14, 10, 21, 103, '高显镇'),
	(14, 10, 21, 104, '里村镇'),
	(14, 10, 21, 200, '北董乡'),
	(14, 10, 21, 201, '杨谈乡');

/* 山西省 临汾市 翼城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 22, 100, '唐兴镇'),
	(14, 10, 22, 101, '南梁镇'),
	(14, 10, 22, 102, '里砦镇'),
	(14, 10, 22, 103, '隆化镇'),
	(14, 10, 22, 104, '桥上镇'),
	(14, 10, 22, 105, '西阎镇'),
	(14, 10, 22, 200, '中卫乡'),
	(14, 10, 22, 201, '南唐乡'),
	(14, 10, 22, 202, '王庄乡'),
	(14, 10, 22, 203, '浇底乡');

/* 山西省 临汾市 襄汾县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 23, 100, '新城镇'),
	(14, 10, 23, 101, '赵康镇'),
	(14, 10, 23, 102, '汾城镇'),
	(14, 10, 23, 103, '南贾镇'),
	(14, 10, 23, 104, '古城镇'),
	(14, 10, 23, 105, '襄陵镇'),
	(14, 10, 23, 106, '邓庄镇'),
	(14, 10, 23, 200, '陶寺乡'),
	(14, 10, 23, 201, '永固乡'),
	(14, 10, 23, 202, '景毛乡'),
	(14, 10, 23, 203, '西贾乡'),
	(14, 10, 23, 204, '南辛店乡'),
	(14, 10, 23, 205, '大邓乡');

/* 山西省 临汾市 洪洞县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 24, 100, '大槐树镇'),
	(14, 10, 24, 101, '甘亭镇'),
	(14, 10, 24, 102, '曲亭镇'),
	(14, 10, 24, 103, '苏堡镇'),
	(14, 10, 24, 104, '广胜寺镇'),
	(14, 10, 24, 105, '明姜镇'),
	(14, 10, 24, 106, '赵城镇'),
	(14, 10, 24, 107, '万安镇'),
	(14, 10, 24, 108, '刘家垣镇'),
	(14, 10, 24, 200, '淹底乡'),
	(14, 10, 24, 201, '兴唐寺乡'),
	(14, 10, 24, 202, '堤村乡'),
	(14, 10, 24, 203, '辛村乡'),
	(14, 10, 24, 204, '龙马乡'),
	(14, 10, 24, 205, '山头乡'),
	(14, 10, 24, 206, '左木乡');

/* 山西省 临汾市 古县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 25, 100, '岳阳镇'),
	(14, 10, 25, 101, '北平镇'),
	(14, 10, 25, 102, '古阳镇'),
	(14, 10, 25, 103, '旧县镇'),
	(14, 10, 25, 200, '石壁乡'),
	(14, 10, 25, 201, '永乐乡'),
	(14, 10, 25, 202, '南垣乡');

/* 山西省 临汾市 安泽县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 26, 100, '府城镇'),
	(14, 10, 26, 101, '和川镇'),
	(14, 10, 26, 102, '唐城镇'),
	(14, 10, 26, 103, '冀氏镇'),
	(14, 10, 26, 200, '马必乡'),
	(14, 10, 26, 201, '杜村乡'),
	(14, 10, 26, 202, '良马乡');

/* 山西省 临汾市 浮山县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 27, 100, '天坛镇'),
	(14, 10, 27, 101, '响水河镇'),
	(14, 10, 27, 200, '张庄乡'),
	(14, 10, 27, 201, '东张乡'),
	(14, 10, 27, 202, '槐埝乡'),
	(14, 10, 27, 203, '北王乡'),
	(14, 10, 27, 204, '北韩乡'),
	(14, 10, 27, 205, '米家垣乡'),
	(14, 10, 27, 206, '寨圪塔乡');

/* 山西省 临汾市 吉县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 28, 100, '吉昌镇'),
	(14, 10, 28, 101, '屯里镇'),
	(14, 10, 28, 102, '壶口镇'),
	(14, 10, 28, 200, '车城乡'),
	(14, 10, 28, 201, '文城乡'),
	(14, 10, 28, 202, '东城乡'),
	(14, 10, 28, 203, '柏山寺乡'),
	(14, 10, 28, 204, '中垛乡');

/* 山西省 临汾市 乡宁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 29, 100, '昌宁镇'),
	(14, 10, 29, 101, '光华镇'),
	(14, 10, 29, 102, '台头镇'),
	(14, 10, 29, 103, '管头镇'),
	(14, 10, 29, 104, '西坡镇'),
	(14, 10, 29, 200, '双鹤乡'),
	(14, 10, 29, 201, '关王庙乡'),
	(14, 10, 29, 202, '尉庄乡'),
	(14, 10, 29, 203, '西交口乡'),
	(14, 10, 29, 204, '枣岭乡');

/* 山西省 临汾市 大宁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 30, 100, '昕水镇'),
	(14, 10, 30, 101, '曲峨镇'),
	(14, 10, 30, 200, '三多乡'),
	(14, 10, 30, 201, '太德乡'),
	(14, 10, 30, 202, '徐家垛乡'),
	(14, 10, 30, 203, '太古乡');

/* 山西省 临汾市 隰县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 31, 100, '龙泉镇'),
	(14, 10, 31, 101, '午城镇'),
	(14, 10, 31, 102, '黄土镇'),
	(14, 10, 31, 200, '阳头升乡'),
	(14, 10, 31, 201, '寨子乡'),
	(14, 10, 31, 202, '陡坡乡'),
	(14, 10, 31, 203, '下李乡'),
	(14, 10, 31, 204, '城南乡');

/* 山西省 临汾市 永和县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 32, 100, '芝河镇'),
	(14, 10, 32, 101, '桑壁镇'),
	(14, 10, 32, 200, '阁底乡'),
	(14, 10, 32, 201, '南庄乡'),
	(14, 10, 32, 202, '打石腰乡'),
	(14, 10, 32, 203, '坡头乡'),
	(14, 10, 32, 204, '交口乡');

/* 山西省 临汾市 蒲县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 33, 100, '蒲城镇'),
	(14, 10, 33, 101, '薛关镇'),
	(14, 10, 33, 102, '黑龙关镇'),
	(14, 10, 33, 103, '克城镇'),
	(14, 10, 33, 200, '山中乡'),
	(14, 10, 33, 201, '古县乡'),
	(14, 10, 33, 202, '红道乡'),
	(14, 10, 33, 203, '乔家湾乡'),
	(14, 10, 33, 204, '太林乡');

/* 山西省 临汾市 汾西县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 34, 100, '永安镇'),
	(14, 10, 34, 101, '对竹镇'),
	(14, 10, 34, 102, '勍香镇'),
	(14, 10, 34, 103, '和平镇'),
	(14, 10, 34, 104, '僧念镇'),
	(14, 10, 34, 200, '佃坪乡'),
	(14, 10, 34, 201, '团柏乡'),
	(14, 10, 34, 202, '邢家要乡');

/* 山西省 临汾市 侯马市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 81, 001, '路东街道办事处'),
	(14, 10, 81, 002, '路西街道办事处'),
	(14, 10, 81, 003, '浍滨街道办事处'),
	(14, 10, 81, 004, '上马街道办事处'),
	(14, 10, 81, 005, '张村街道办事处'),
	(14, 10, 81, 200, '新田乡'),
	(14, 10, 81, 201, '高村乡'),
	(14, 10, 81, 202, '凤城乡');

/* 山西省 临汾市 霍州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 10, 82, 001, '鼓楼街道办事处'),
	(14, 10, 82, 002, '北环路街道办事处'),
	(14, 10, 82, 003, '南环路街道办事处'),
	(14, 10, 82, 004, '开元街道办事处'),
	(14, 10, 82, 005, '退沙街道办事处'),
	(14, 10, 82, 100, '白龙镇'),
	(14, 10, 82, 101, '辛置镇'),
	(14, 10, 82, 102, '大张镇'),
	(14, 10, 82, 103, '李曹镇'),
	(14, 10, 82, 200, '陶唐峪乡'),
	(14, 10, 82, 201, '三教乡'),
	(14, 10, 82, 202, '师庄乡');

/* 山西省 吕梁市 离石区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 02, 001, '滨河街道办事处'),
	(14, 11, 02, 002, '凤山街道办事处'),
	(14, 11, 02, 003, '莲花池街道办事处'),
	(14, 11, 02, 004, '城北街道办事处'),
	(14, 11, 02, 005, '田家会街道办事处'),
	(14, 11, 02, 006, '交口街道办事处'),
	(14, 11, 02, 007, '西属巴街道办事处'),
	(14, 11, 02, 100, '吴城镇'),
	(14, 11, 02, 101, '信义镇'),
	(14, 11, 02, 200, '红眼川乡'),
	(14, 11, 02, 201, '枣林乡'),
	(14, 11, 02, 202, '坪头乡');

/* 山西省 吕梁市 文水县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 21, 100, '凤城镇'),
	(14, 11, 21, 101, '开栅镇'),
	(14, 11, 21, 102, '南庄镇'),
	(14, 11, 21, 103, '南安镇'),
	(14, 11, 21, 104, '刘胡兰镇'),
	(14, 11, 21, 105, '下曲镇'),
	(14, 11, 21, 106, '孝义镇'),
	(14, 11, 21, 200, '南武乡'),
	(14, 11, 21, 201, '西城乡'),
	(14, 11, 21, 202, '北张乡'),
	(14, 11, 21, 203, '马西乡'),
	(14, 11, 21, 204, '西槽头乡');

/* 山西省 吕梁市 交城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 22, 100, '天宁镇'),
	(14, 11, 22, 101, '夏家营镇'),
	(14, 11, 22, 102, '西营镇'),
	(14, 11, 22, 103, '水峪贯镇'),
	(14, 11, 22, 104, '西社镇'),
	(14, 11, 22, 105, '庞泉沟镇'),
	(14, 11, 22, 200, '洪相乡'),
	(14, 11, 22, 201, '岭底乡'),
	(14, 11, 22, 202, '东坡底乡'),
	(14, 11, 22, 203, '会立乡');

/* 山西省 吕梁市 兴县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 23, 100, '蔚汾镇'),
	(14, 11, 23, 101, '魏家滩镇'),
	(14, 11, 23, 102, '瓦塘镇'),
	(14, 11, 23, 103, '康宁镇'),
	(14, 11, 23, 104, '高家村镇'),
	(14, 11, 23, 105, '罗峪口镇'),
	(14, 11, 23, 106, '蔡家会镇'),
	(14, 11, 23, 200, '交楼申乡'),
	(14, 11, 23, 201, '恶虎滩乡'),
	(14, 11, 23, 202, '东会乡'),
	(14, 11, 23, 203, '固贤乡'),
	(14, 11, 23, 204, '奥家湾乡'),
	(14, 11, 23, 205, '蔡家崖乡'),
	(14, 11, 23, 206, '贺家会乡'),
	(14, 11, 23, 207, '孟家坪乡'),
	(14, 11, 23, 208, '赵家坪乡'),
	(14, 11, 23, 209, '圪垯上乡');

/* 山西省 吕梁市 临县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 24, 100, '临泉镇'),
	(14, 11, 24, 101, '白文镇'),
	(14, 11, 24, 102, '城庄镇'),
	(14, 11, 24, 103, '兔坂镇'),
	(14, 11, 24, 104, '克虎镇'),
	(14, 11, 24, 105, '三交镇'),
	(14, 11, 24, 106, '湍水头镇'),
	(14, 11, 24, 107, '林家坪镇'),
	(14, 11, 24, 108, '招贤镇'),
	(14, 11, 24, 109, '碛口镇'),
	(14, 11, 24, 110, '刘家会镇'),
	(14, 11, 24, 111, '丛罗峪镇'),
	(14, 11, 24, 112, '曲峪镇'),
	(14, 11, 24, 200, '木瓜坪乡'),
	(14, 11, 24, 201, '安业乡'),
	(14, 11, 24, 202, '玉坪乡'),
	(14, 11, 24, 203, '青凉寺乡'),
	(14, 11, 24, 204, '石白头乡'),
	(14, 11, 24, 205, '雷家碛乡'),
	(14, 11, 24, 206, '八堡乡'),
	(14, 11, 24, 207, '大禹乡'),
	(14, 11, 24, 208, '车赶乡'),
	(14, 11, 24, 209, '安家庄乡');

/* 山西省 吕梁市 柳林县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 25, 100, '柳林镇'),
	(14, 11, 25, 101, '穆村镇'),
	(14, 11, 25, 102, '薛村镇'),
	(14, 11, 25, 103, '庄上镇'),
	(14, 11, 25, 104, '留誉镇'),
	(14, 11, 25, 105, '三交镇'),
	(14, 11, 25, 106, '成家庄镇'),
	(14, 11, 25, 107, '孟门镇'),
	(14, 11, 25, 200, '李家湾乡'),
	(14, 11, 25, 201, '贾家垣乡'),
	(14, 11, 25, 202, '陈家湾乡'),
	(14, 11, 25, 203, '金家庄乡'),
	(14, 11, 25, 204, '高家沟乡'),
	(14, 11, 25, 205, '石西乡'),
	(14, 11, 25, 206, '王家沟乡');

/* 山西省 吕梁市 石楼县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 26, 100, '灵泉镇'),
	(14, 11, 26, 101, '罗村镇'),
	(14, 11, 26, 102, '义牒镇'),
	(14, 11, 26, 103, '小蒜镇'),
	(14, 11, 26, 200, '龙交乡'),
	(14, 11, 26, 201, '和合乡'),
	(14, 11, 26, 202, '前山乡'),
	(14, 11, 26, 203, '曹家垣乡'),
	(14, 11, 26, 204, '裴沟乡');

/* 山西省 吕梁市 岚县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 27, 100, '东村镇'),
	(14, 11, 27, 101, '岚城镇'),
	(14, 11, 27, 102, '普明镇'),
	(14, 11, 27, 103, '界河口镇'),
	(14, 11, 27, 200, '土峪乡'),
	(14, 11, 27, 201, '上明乡'),
	(14, 11, 27, 202, '王狮乡'),
	(14, 11, 27, 203, '梁家庄乡'),
	(14, 11, 27, 204, '顺会乡'),
	(14, 11, 27, 205, '河口乡'),
	(14, 11, 27, 206, '社科乡'),
	(14, 11, 27, 207, '大蛇头乡');

/* 山西省 吕梁市 方山县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 28, 100, '圪洞镇'),
	(14, 11, 28, 101, '马坊镇'),
	(14, 11, 28, 102, '峪口镇'),
	(14, 11, 28, 103, '大武镇'),
	(14, 11, 28, 104, '北武当镇'),
	(14, 11, 28, 200, '积翠乡'),
	(14, 11, 28, 201, '麻地会乡');

/* 山西省 吕梁市 中阳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 29, 100, '宁乡镇'),
	(14, 11, 29, 101, '金罗镇'),
	(14, 11, 29, 102, '枝柯镇'),
	(14, 11, 29, 103, '武家庄镇'),
	(14, 11, 29, 104, '暖泉镇'),
	(14, 11, 29, 201, '下枣林乡'),
	(14, 11, 29, 202, '车鸣峪乡');

/* 山西省 吕梁市 交口县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 30, 100, '水头镇'),
	(14, 11, 30, 101, '康城镇'),
	(14, 11, 30, 102, '双池镇'),
	(14, 11, 30, 103, '桃红坡镇'),
	(14, 11, 30, 200, '石口乡'),
	(14, 11, 30, 201, '回龙乡'),
	(14, 11, 30, 202, '温泉乡');

/* 山西省 吕梁市 孝义市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 81, 001, '新义街道办事处'),
	(14, 11, 81, 002, '中阳楼街道办事处'),
	(14, 11, 81, 003, '振兴街道办事处'),
	(14, 11, 81, 004, '胜溪湖街道办事处'),
	(14, 11, 81, 005, '崇文街道办事处'),
	(14, 11, 81, 100, '兑镇镇'),
	(14, 11, 81, 101, '阳泉曲镇'),
	(14, 11, 81, 102, '下堡镇'),
	(14, 11, 81, 103, '西辛庄镇'),
	(14, 11, 81, 104, '高阳镇'),
	(14, 11, 81, 105, '梧桐镇'),
	(14, 11, 81, 106, '柱濮镇'),
	(14, 11, 81, 200, '大孝堡乡'),
	(14, 11, 81, 201, '下栅乡'),
	(14, 11, 81, 202, '驿马乡'),
	(14, 11, 81, 203, '南阳乡'),
	(14, 11, 81, 204, '杜村乡');

/* 山西省 吕梁市 汾阳市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(14, 11, 82, 001, '文峰街道办事处'),
	(14, 11, 82, 002, '太和桥街道办事处'),
	(14, 11, 82, 100, '贾家庄镇'),
	(14, 11, 82, 101, '杏花村镇'),
	(14, 11, 82, 102, '冀村镇'),
	(14, 11, 82, 103, '肖家庄镇'),
	(14, 11, 82, 104, '演武镇'),
	(14, 11, 82, 105, '三泉镇'),
	(14, 11, 82, 106, '石庄镇'),
	(14, 11, 82, 107, '杨家庄镇'),
	(14, 11, 82, 108, '峪道河镇'),
	(14, 11, 82, 200, '西河乡'),
	(14, 11, 82, 201, '阳城乡'),
	(14, 11, 82, 202, '栗家庄乡');


/* 内蒙古自治区 呼和浩特市 新城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 01, 02, 001, '海拉尔东路街道办事处'),
	(15, 01, 02, 002, '锡林路街道办事处'),
	(15, 01, 02, 003, '中山东路街道办事处'),
	(15, 01, 02, 004, '东街街道办事处'),
	(15, 01, 02, 005, '西街街道办事处'),
	(15, 01, 02, 006, '东风路街道办事处'),
	(15, 01, 02, 007, '迎新路街道办事处'),
	(15, 01, 02, 008, '成吉思汗大街街道办事处'),
	(15, 01, 02, 101, '保合少镇');

/* 内蒙古自治区 呼和浩特市 回民区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 01, 03, 001, '新华西路办事处'),
	(15, 01, 03, 002, '中山西路办事处'),
	(15, 01, 03, 003, '光明路办事处'),
	(15, 01, 03, 004, '海拉尔西路办事处'),
	(15, 01, 03, 005, '环河街办事处'),
	(15, 01, 03, 006, '通道街办事处'),
	(15, 01, 03, 007, '钢铁路办事处'),
	(15, 01, 03, 100, '攸攸板镇');

/* 内蒙古自治区 呼和浩特市 玉泉区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 01, 04, 001, '小召前街办事处'),
	(15, 01, 04, 002, '兴隆巷办事处'),
	(15, 01, 04, 003, '长和廊办事处'),
	(15, 01, 04, 004, '石东路办事处'),
	(15, 01, 04, 005, '大南街办事处'),
	(15, 01, 04, 006, '鄂尔多斯路办事处'),
	(15, 01, 04, 007, '西菜园办事处'),
	(15, 01, 04, 008, '昭君路办事处'),
	(15, 01, 04, 100, '小黑河镇');

/* 内蒙古自治区 呼和浩特市 赛罕区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 01, 05, 001, '人民路街道办事处'),
	(15, 01, 05, 002, '大学西路街道办事处'),
	(15, 01, 05, 003, '乌兰察布东路街道办事处'),
	(15, 01, 05, 004, '大学东路街道办事处'),
	(15, 01, 05, 005, '中专路街道办事处'),
	(15, 01, 05, 006, '昭乌达路街道办事处'),
	(15, 01, 05, 007, '巴彦街道办事处'),
	(15, 01, 05, 008, '敕勒川路街道办事处'),
	(15, 01, 05, 101, '榆林镇'),
	(15, 01, 05, 103, '黄合少镇'),
	(15, 01, 05, 104, '金河镇');

/* 内蒙古自治区 呼和浩特市 土默特左旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 01, 21, 100, '察素齐镇'),
	(15, 01, 21, 101, '毕克齐镇'),
	(15, 01, 21, 102, '善岱镇'),
	(15, 01, 21, 103, '台阁牧镇'),
	(15, 01, 21, 104, '白庙子镇'),
	(15, 01, 21, 105, '沙尔沁镇'),
	(15, 01, 21, 106, '敕勒川镇'),
	(15, 01, 21, 207, '北什轴乡'),
	(15, 01, 21, 208, '塔布赛乡');

/* 内蒙古自治区 呼和浩特市 托克托县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 01, 22, 100, '双河镇'),
	(15, 01, 22, 101, '新营子镇'),
	(15, 01, 22, 102, '五申镇'),
	(15, 01, 22, 103, '伍什家镇'),
	(15, 01, 22, 104, '古城镇');

/* 内蒙古自治区 呼和浩特市 和林格尔县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 01, 23, 100, '城关镇'),
	(15, 01, 23, 101, '盛乐镇'),
	(15, 01, 23, 102, '新店子镇'),
	(15, 01, 23, 203, '舍必崖乡'),
	(15, 01, 23, 205, '大红城乡'),
	(15, 01, 23, 206, '羊群沟乡'),
	(15, 01, 23, 207, '黑老夭乡'),
	(15, 01, 23, 208, '巧什营乡');

/* 内蒙古自治区 呼和浩特市 清水河县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 01, 24, 100, '城关镇'),
	(15, 01, 24, 101, '宏河镇'),
	(15, 01, 24, 102, '喇嘛湾镇'),
	(15, 01, 24, 103, '老牛湾镇'),
	(15, 01, 24, 200, '窑沟乡'),
	(15, 01, 24, 201, '北堡乡'),
	(15, 01, 24, 202, '韮菜庄乡'),
	(15, 01, 24, 203, '五良太乡');

/* 内蒙古自治区 呼和浩特市 武川县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 01, 25, 100, '可镇'),
	(15, 01, 25, 101, '哈乐镇'),
	(15, 01, 25, 102, '西乌兰不浪镇'),
	(15, 01, 25, 200, '大青山乡'),
	(15, 01, 25, 205, '上秃亥乡'),
	(15, 01, 25, 207, '德胜沟乡'),
	(15, 01, 25, 211, '二份子乡'),
	(15, 01, 25, 213, '哈拉合少乡'),
	(15, 01, 25, 214, '耗赖山乡');

/* 内蒙古自治区 包头市 东河区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 02, 02, 001, '和平街道办事处'),
	(15, 02, 02, 002, '财神庙街道办事处'),
	(15, 02, 02, 003, '西脑包街道办事处'),
	(15, 02, 02, 004, '南门外街道办事处'),
	(15, 02, 02, 005, '南圪洞街道办事处'),
	(15, 02, 02, 006, '东站街道办事处'),
	(15, 02, 02, 007, '回民街道办事处'),
	(15, 02, 02, 008, '二里半街道办事处'),
	(15, 02, 02, 009, '河东街道办事处'),
	(15, 02, 02, 010, '铁西街道办事处'),
	(15, 02, 02, 011, '东兴街道办事处'),
	(15, 02, 02, 012, '杨圪楞街道办事处'),
	(15, 02, 02, 100, '河东镇'),
	(15, 02, 02, 101, '沙尔沁镇'),
	(15, 02, 02, 198, '县级单位直辖村级单位（特殊镇）');

/* 内蒙古自治区 包头市 昆都仑区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 02, 03, 001, '少先路街道办事处'),
	(15, 02, 03, 003, '沼潭街道办事处'),
	(15, 02, 03, 004, '林荫路街道办事处'),
	(15, 02, 03, 005, '友谊大街街道办事处'),
	(15, 02, 03, 006, '阿尔丁大街街道办事处'),
	(15, 02, 03, 007, '团结大街街道办事处'),
	(15, 02, 03, 008, '鞍山道街道办事处'),
	(15, 02, 03, 009, '前进道街道办事处'),
	(15, 02, 03, 010, '市府东路街道办事处'),
	(15, 02, 03, 011, '白云路街道办事处'),
	(15, 02, 03, 012, '黄河西路街道办事处'),
	(15, 02, 03, 013, '昆工路街道办事处'),
	(15, 02, 03, 014, '昆北街道办事处'),
	(15, 02, 03, 100, '昆河镇'),
	(15, 02, 03, 102, '卜尔汉图镇');

/* 内蒙古自治区 包头市 青山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 02, 04, 001, '先锋道街道办事处'),
	(15, 02, 04, 002, '幸福路街道办事处'),
	(15, 02, 04, 003, '万青路街道办事处'),
	(15, 02, 04, 004, '富强路街道办事处'),
	(15, 02, 04, 005, '科学路街道办事处'),
	(15, 02, 04, 006, '青山路街道办事处'),
	(15, 02, 04, 007, '自由路街道办事处'),
	(15, 02, 04, 008, '乌素图街道办事处'),
	(15, 02, 04, 100, '青福镇'),
	(15, 02, 04, 101, '兴胜镇');

/* 内蒙古自治区 包头市 石拐区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 02, 05, 001, '石拐街道办事处'),
	(15, 02, 05, 002, '大发街道办事处'),
	(15, 02, 05, 003, '大磁街道办事处'),
	(15, 02, 05, 004, '五当沟街道办事处'),
	(15, 02, 05, 005, '白狐沟街道办事处'),
	(15, 02, 05, 006, '大德恒办事处'),
	(15, 02, 05, 101, '五当召镇'),
	(15, 02, 05, 202, '吉忽伦图苏木');

/* 内蒙古自治区 包头市 白云鄂博矿区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 02, 06, 001, '矿山路街道办事处'),
	(15, 02, 06, 002, '通阳道街道办事处');

/* 内蒙古自治区 包头市 九原区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 02, 07, 001, '沙河街道办事处'),
	(15, 02, 07, 002, '赛汗街道办事处'),
	(15, 02, 07, 003, '萨如拉街道办事处'),
	(15, 02, 07, 004, '白音席勒街道办事处'),
	(15, 02, 07, 103, '麻池镇'),
	(15, 02, 07, 105, '哈林格尔镇'),
	(15, 02, 07, 110, '哈业胡同镇'),
	(15, 02, 07, 202, '阿嘎如泰苏木乡');

/* 内蒙古自治区 包头市 土默特右旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 02, 21, 104, '萨拉齐镇'),
	(15, 02, 21, 105, '双龙镇'),
	(15, 02, 21, 106, '美岱召镇'),
	(15, 02, 21, 107, '沟门镇'),
	(15, 02, 21, 108, '将军尧镇'),
	(15, 02, 21, 213, '海子乡'),
	(15, 02, 21, 214, '明沙淖乡'),
	(15, 02, 21, 215, '苏波盖乡');

/* 内蒙古自治区 包头市 固阳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 02, 22, 102, '金山镇'),
	(15, 02, 22, 103, '西斗铺镇'),
	(15, 02, 22, 104, '下湿壕镇'),
	(15, 02, 22, 105, '银号镇'),
	(15, 02, 22, 106, '怀朔镇'),
	(15, 02, 22, 107, '兴顺西镇');

/* 内蒙古自治区 包头市 达尔罕茂明安联合旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 02, 23, 102, '满都拉镇'),
	(15, 02, 23, 103, '希拉穆仁镇'),
	(15, 02, 23, 104, '百灵庙镇'),
	(15, 02, 23, 105, '石宝镇'),
	(15, 02, 23, 106, '乌克忽洞镇'),
	(15, 02, 23, 107, '明安镇'),
	(15, 02, 23, 108, '巴音花镇'),
	(15, 02, 23, 213, '达尔罕苏木乡'),
	(15, 02, 23, 214, '查干哈达苏木'),
	(15, 02, 23, 215, '巴音敖包苏木'),
	(15, 02, 23, 216, '西河乡'),
	(15, 02, 23, 217, '小文公乡');

/* 内蒙古自治区 乌海市 海勃湾区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 03, 02, 001, '凤凰岭街道办事处'),
	(15, 03, 02, 002, '海北街道办事处'),
	(15, 03, 02, 003, '新华街道办事处'),
	(15, 03, 02, 004, '新华西街道办事处'),
	(15, 03, 02, 005, '卡布其街道办事处'),
	(15, 03, 02, 007, '滨河街道办事处'),
	(15, 03, 02, 101, '千里山镇');

/* 内蒙古自治区 乌海市 海南区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 03, 03, 001, '拉僧仲街道办事处'),
	(15, 03, 03, 002, '西卓子山街道办事处'),
	(15, 03, 03, 102, '公乌素镇'),
	(15, 03, 03, 103, '拉僧庙镇'),
	(15, 03, 03, 104, '巴音陶亥镇');

/* 内蒙古自治区 乌海市 乌达区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 03, 04, 002, '三道坎街道办事处'),
	(15, 03, 04, 003, '五虎山街道办事处'),
	(15, 03, 04, 008, '新达街道办事处'),
	(15, 03, 04, 009, '巴音赛街道办事处'),
	(15, 03, 04, 010, '梁家沟街道办事处'),
	(15, 03, 04, 011, '苏海图街道办事处'),
	(15, 03, 04, 012, '滨海街道办事处'),
	(15, 03, 04, 101, '乌兰淖尔镇');

/* 内蒙古自治区 赤峰市 红山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 02, 001, '西屯街道办事处'),
	(15, 04, 02, 002, '三中街街道办事处'),
	(15, 04, 02, 003, '永巨街道办事处'),
	(15, 04, 02, 004, '东城街道办事处'),
	(15, 04, 02, 005, '南新街街道办事处'),
	(15, 04, 02, 006, '站前街道办事处'),
	(15, 04, 02, 007, '铁南街道办事处'),
	(15, 04, 02, 008, '长青街道办事处'),
	(15, 04, 02, 009, '哈达街道办事处'),
	(15, 04, 02, 010, '西城街道办事处'),
	(15, 04, 02, 011, '桥北街道办事处'),
	(15, 04, 02, 100, '红庙子镇'),
	(15, 04, 02, 102, '文钟镇');

/* 内蒙古自治区 赤峰市 元宝山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 03, 001, '西露天街道办事处'),
	(15, 04, 03, 002, '平庄城区街道办事处'),
	(15, 04, 03, 003, '平庄东城街道办事处'),
	(15, 04, 03, 004, '平庄西城街道办事处'),
	(15, 04, 03, 005, '马林街道办事处'),
	(15, 04, 03, 006, '云杉路街道办事处'),
	(15, 04, 03, 100, '风水沟镇'),
	(15, 04, 03, 101, '元宝山镇'),
	(15, 04, 03, 102, '美丽河镇'),
	(15, 04, 03, 103, '平庄镇'),
	(15, 04, 03, 104, '五家镇'),
	(15, 04, 03, 200, '小五家乡');

/* 内蒙古自治区 赤峰市 松山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 04, 001, '振兴街道办事处'),
	(15, 04, 04, 002, '向阳街道办事处'),
	(15, 04, 04, 003, '松州街道办事处'),
	(15, 04, 04, 004, '铁东街道办事处'),
	(15, 04, 04, 100, '穆家营子镇'),
	(15, 04, 04, 101, '初头朗镇'),
	(15, 04, 04, 102, '大庙镇'),
	(15, 04, 04, 103, '王府镇'),
	(15, 04, 04, 104, '老府镇'),
	(15, 04, 04, 105, '哈拉道口镇'),
	(15, 04, 04, 106, '上官地镇'),
	(15, 04, 04, 107, '安庆镇'),
	(15, 04, 04, 108, '太平地镇'),
	(15, 04, 04, 200, '当铺地满族乡'),
	(15, 04, 04, 201, '夏家店乡'),
	(15, 04, 04, 202, '城子乡'),
	(15, 04, 04, 203, '大夫营子乡'),
	(15, 04, 04, 204, '岗子乡');

/* 内蒙古自治区 赤峰市 阿鲁科尔沁旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 21, 100, '天山镇'),
	(15, 04, 21, 101, '天山口镇'),
	(15, 04, 21, 102, '双胜镇'),
	(15, 04, 21, 103, '坤都镇'),
	(15, 04, 21, 104, '巴彦花镇'),
	(15, 04, 21, 105, '绍根镇'),
	(15, 04, 21, 106, '扎嘎斯台镇'),
	(15, 04, 21, 200, '新民乡'),
	(15, 04, 21, 201, '先锋乡'),
	(15, 04, 21, 202, '罕苏木苏木'),
	(15, 04, 21, 203, '赛汉塔拉苏木'),
	(15, 04, 21, 204, '巴拉奇如德苏木'),
	(15, 04, 21, 205, '乌兰哈达乡'),
	(15, 04, 21, 206, '巴彦温都尔苏木');

/* 内蒙古自治区 赤峰市 巴林左旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 22, 100, '林东镇'),
	(15, 04, 22, 101, '隆昌镇'),
	(15, 04, 22, 102, '十三敖包镇'),
	(15, 04, 22, 103, '碧流台镇'),
	(15, 04, 22, 104, '富河镇'),
	(15, 04, 22, 105, '白音勿拉镇'),
	(15, 04, 22, 106, '哈拉哈达镇'),
	(15, 04, 22, 200, '查干哈达苏木'),
	(15, 04, 22, 201, '乌兰达坝苏木'),
	(15, 04, 22, 202, '三山乡'),
	(15, 04, 22, 203, '花加拉嘎乡');

/* 内蒙古自治区 赤峰市 巴林右旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 23, 100, '大板镇'),
	(15, 04, 23, 101, '索博日嘎镇'),
	(15, 04, 23, 102, '宝日勿苏镇'),
	(15, 04, 23, 103, '查干诺尔镇'),
	(15, 04, 23, 105, '巴彦琥硕镇'),
	(15, 04, 23, 200, '西拉沐沦苏木'),
	(15, 04, 23, 201, '巴彦塔拉苏木'),
	(15, 04, 23, 202, '幸福之路苏木'),
	(15, 04, 23, 203, '查干沐沦苏木');

/* 内蒙古自治区 赤峰市 林西县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 24, 100, '林西镇'),
	(15, 04, 24, 101, '新城子镇'),
	(15, 04, 24, 102, '新林镇'),
	(15, 04, 24, 103, '五十家子镇'),
	(15, 04, 24, 104, '官地镇'),
	(15, 04, 24, 105, '大井镇'),
	(15, 04, 24, 106, '统部镇'),
	(15, 04, 24, 200, '大营子乡'),
	(15, 04, 24, 201, '十二吐乡');

/* 内蒙古自治区 赤峰市 克什克腾旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 25, 100, '经棚镇'),
	(15, 04, 25, 101, '宇宙地镇'),
	(15, 04, 25, 102, '土城子镇'),
	(15, 04, 25, 103, '同兴镇'),
	(15, 04, 25, 104, '万合永镇'),
	(15, 04, 25, 105, '芝瑞镇'),
	(15, 04, 25, 106, '达来诺日镇'),
	(15, 04, 25, 200, '新开地乡'),
	(15, 04, 25, 201, '红山子乡'),
	(15, 04, 25, 202, '达日罕乌拉苏木'),
	(15, 04, 25, 203, '巴彦查干苏木'),
	(15, 04, 25, 204, '浩来呼热苏木'),
	(15, 04, 25, 205, '乌兰布统苏木');

/* 内蒙古自治区 赤峰市 翁牛特旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 26, 100, '乌丹镇'),
	(15, 04, 26, 101, '乌敦套海镇'),
	(15, 04, 26, 102, '五分地镇'),
	(15, 04, 26, 103, '桥头镇'),
	(15, 04, 26, 104, '广德公镇'),
	(15, 04, 26, 105, '梧桐花镇'),
	(15, 04, 26, 106, '海拉苏镇'),
	(15, 04, 26, 107, '亿合公镇'),
	(15, 04, 26, 200, '解放营子乡'),
	(15, 04, 26, 201, '阿什罕苏木'),
	(15, 04, 26, 202, '新苏莫苏木'),
	(15, 04, 26, 203, '白音套海苏木'),
	(15, 04, 26, 204, '毛山东乡'),
	(15, 04, 26, 205, '格日僧苏木');

/* 内蒙古自治区 赤峰市 喀喇沁旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 28, 100, '锦山镇'),
	(15, 04, 28, 101, '美林镇'),
	(15, 04, 28, 102, '王爷府镇'),
	(15, 04, 28, 103, '小牛群镇'),
	(15, 04, 28, 104, '牛家营子镇'),
	(15, 04, 28, 105, '乃林镇'),
	(15, 04, 28, 106, '西桥镇'),
	(15, 04, 28, 200, '十家满族乡'),
	(15, 04, 28, 201, '南台子乡');

/* 内蒙古自治区 赤峰市 宁城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 29, 100, '天义镇'),
	(15, 04, 29, 101, '小城子镇'),
	(15, 04, 29, 102, '大城子镇'),
	(15, 04, 29, 103, '八里罕镇'),
	(15, 04, 29, 104, '黑里河镇'),
	(15, 04, 29, 105, '甸子镇'),
	(15, 04, 29, 106, '大双庙镇'),
	(15, 04, 29, 107, '汐子镇'),
	(15, 04, 29, 108, '大明镇'),
	(15, 04, 29, 109, '忙农镇'),
	(15, 04, 29, 110, '五化镇'),
	(15, 04, 29, 111, '三座店镇'),
	(15, 04, 29, 112, '必斯营子镇'),
	(15, 04, 29, 202, '一肯中乡'),
	(15, 04, 29, 203, '存金沟乡');

/* 内蒙古自治区 赤峰市 敖汉旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 04, 30, 100, '新惠镇'),
	(15, 04, 30, 101, '四家子镇'),
	(15, 04, 30, 102, '长胜镇'),
	(15, 04, 30, 103, '贝子府镇'),
	(15, 04, 30, 104, '四道湾子镇'),
	(15, 04, 30, 105, '下洼镇'),
	(15, 04, 30, 106, '金厂沟梁镇'),
	(15, 04, 30, 107, '兴隆洼镇'),
	(15, 04, 30, 201, '牛古吐乡'),
	(15, 04, 30, 202, '木头营子乡'),
	(15, 04, 30, 203, '古鲁板蒿乡'),
	(15, 04, 30, 204, '丰收乡'),
	(15, 04, 30, 205, '玛尼罕乡'),
	(15, 04, 30, 206, '萨力巴乡'),
	(15, 04, 30, 207, '敖润苏莫苏木'),
	(15, 04, 30, 208, '林家地乡');

/* 内蒙古自治区 通辽市 科尔沁区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 05, 02, 001, '科尔沁街道办事处'),
	(15, 05, 02, 002, '西门街道办事处'),
	(15, 05, 02, 003, '永清街道办事处'),
	(15, 05, 02, 004, '明仁街道办事处'),
	(15, 05, 02, 005, '施介街道办事处'),
	(15, 05, 02, 006, '清真街道办事处'),
	(15, 05, 02, 007, '东郊街道办事处'),
	(15, 05, 02, 008, '铁路街道办事处'),
	(15, 05, 02, 009, '红星街道办事处'),
	(15, 05, 02, 010, '霍林街道办事处'),
	(15, 05, 02, 011, '建国街道办事处'),
	(15, 05, 02, 100, '大林镇'),
	(15, 05, 02, 101, '钱家店镇'),
	(15, 05, 02, 102, '余粮堡镇'),
	(15, 05, 02, 103, '木里图镇'),
	(15, 05, 02, 104, '丰田镇'),
	(15, 05, 02, 105, '清河镇'),
	(15, 05, 02, 106, '育新镇'),
	(15, 05, 02, 107, '庆和镇'),
	(15, 05, 02, 108, '敖力布皋镇'),
	(15, 05, 02, 200, '莫力庙苏木');

/* 内蒙古自治区 通辽市 科尔沁左翼中旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 05, 21, 100, '保康镇'),
	(15, 05, 21, 101, '宝龙山镇'),
	(15, 05, 21, 102, '舍伯吐镇'),
	(15, 05, 21, 103, '巴彦塔拉镇'),
	(15, 05, 21, 104, '门达镇'),
	(15, 05, 21, 105, '架玛吐镇'),
	(15, 05, 21, 106, '腰林毛都镇'),
	(15, 05, 21, 107, '希伯花镇'),
	(15, 05, 21, 108, '花吐古拉镇'),
	(15, 05, 21, 109, '代力吉镇'),
	(15, 05, 21, 110, '努日木镇'),
	(15, 05, 21, 200, '花胡硕苏木乡'),
	(15, 05, 21, 201, '协代苏木乡'),
	(15, 05, 21, 202, '白兴吐苏木乡'),
	(15, 05, 21, 203, '图布信苏木乡'),
	(15, 05, 21, 204, '敖包苏木'),
	(15, 05, 21, 205, '胜利乡');

/* 内蒙古自治区 通辽市 科尔沁左翼后旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 05, 22, 100, '甘旗卡镇'),
	(15, 05, 22, 101, '吉尔嘎朗镇'),
	(15, 05, 22, 102, '金宝屯镇'),
	(15, 05, 22, 103, '常胜镇'),
	(15, 05, 22, 104, '查日苏镇'),
	(15, 05, 22, 105, '双胜镇'),
	(15, 05, 22, 106, '阿古拉镇'),
	(15, 05, 22, 107, '朝鲁吐镇'),
	(15, 05, 22, 108, '努古斯台镇'),
	(15, 05, 22, 109, '海鲁吐镇'),
	(15, 05, 22, 200, '阿都沁苏木'),
	(15, 05, 22, 201, '茂道吐苏木'),
	(15, 05, 22, 202, '巴嘎塔拉苏木'),
	(15, 05, 22, 203, '散都苏木'),
	(15, 05, 22, 204, '巴彦毛都苏木');

/* 内蒙古自治区 通辽市 开鲁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 05, 23, 100, '开鲁镇'),
	(15, 05, 23, 101, '大榆树镇'),
	(15, 05, 23, 102, '黑龙坝镇'),
	(15, 05, 23, 103, '麦新镇'),
	(15, 05, 23, 104, '义和塔拉镇'),
	(15, 05, 23, 105, '建华镇'),
	(15, 05, 23, 106, '小街基镇'),
	(15, 05, 23, 107, '东风镇'),
	(15, 05, 23, 108, '吉日嘎郎吐镇'),
	(15, 05, 23, 109, '东来镇');

/* 内蒙古自治区 通辽市 库伦旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 05, 24, 100, '库伦镇'),
	(15, 05, 24, 101, '扣河子镇'),
	(15, 05, 24, 102, '白音花镇'),
	(15, 05, 24, 103, '六家子镇'),
	(15, 05, 24, 104, '额勒顺镇'),
	(15, 05, 24, 200, '茫汗苏木'),
	(15, 05, 24, 201, '先进苏木'),
	(15, 05, 24, 202, '水泉乡');

/* 内蒙古自治区 通辽市 奈曼旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 05, 25, 100, '大沁他拉镇'),
	(15, 05, 25, 101, '八仙筒镇'),
	(15, 05, 25, 102, '青龙山镇'),
	(15, 05, 25, 103, '新镇'),
	(15, 05, 25, 104, '治安镇'),
	(15, 05, 25, 105, '东明镇'),
	(15, 05, 25, 106, '沙日浩来镇'),
	(15, 05, 25, 107, '义隆永镇'),
	(15, 05, 25, 200, '固日班花苏木'),
	(15, 05, 25, 201, '白音他拉苏木'),
	(15, 05, 25, 202, '明仁苏木'),
	(15, 05, 25, 203, '黄花塔拉苏木'),
	(15, 05, 25, 204, '土城子乡'),
	(15, 05, 25, 205, '苇莲苏乡');

/* 内蒙古自治区 通辽市 扎鲁特旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 05, 26, 100, '鲁北镇'),
	(15, 05, 26, 101, '黄花山镇'),
	(15, 05, 26, 102, '嘎亥图镇'),
	(15, 05, 26, 103, '巨日合镇'),
	(15, 05, 26, 104, '巴雅尔图胡硕镇'),
	(15, 05, 26, 105, '香山镇'),
	(15, 05, 26, 106, '阿日昆都楞镇'),
	(15, 05, 26, 200, '巴彦塔拉苏木乡'),
	(15, 05, 26, 201, '乌力吉木仁苏木乡'),
	(15, 05, 26, 202, '道老杜苏木乡'),
	(15, 05, 26, 203, '格日朝鲁苏木乡'),
	(15, 05, 26, 204, '前德门苏木'),
	(15, 05, 26, 205, '乌兰哈达苏木'),
	(15, 05, 26, 206, '查布嘎图苏木'),
	(15, 05, 26, 207, '乌额格其苏木');

/* 内蒙古自治区 通辽市 霍林郭勒市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 05, 81, 001, '珠斯花街道办事处'),
	(15, 05, 81, 002, '莫斯台街道办事处'),
	(15, 05, 81, 003, '宝日呼吉尔街道办事处'),
	(15, 05, 81, 004, '沙尔呼热街道办事处'),
	(15, 05, 81, 200, '达来胡硕苏木');

/* 内蒙古自治区 鄂尔多斯市 东胜区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 06, 02, 001, '交通街道办事处'),
	(15, 06, 02, 002, '公园街道办事处'),
	(15, 06, 02, 003, '林荫街道办事处'),
	(15, 06, 02, 004, '建设街道办事处'),
	(15, 06, 02, 005, '富兴街道办事处'),
	(15, 06, 02, 006, '天骄街道办事处'),
	(15, 06, 02, 007, '诃额伦街道办事处'),
	(15, 06, 02, 008, '巴音门克街道办事处'),
	(15, 06, 02, 010, '幸福街道办事处'),
	(15, 06, 02, 011, '纺织街道办事处'),
	(15, 06, 02, 012, '兴盛街道办事处'),
	(15, 06, 02, 013, '民族街道办事处'),
	(15, 06, 02, 100, '泊尔江海子镇'),
	(15, 06, 02, 101, '罕台镇'),
	(15, 06, 02, 102, '铜川镇');

/* 内蒙古自治区 鄂尔多斯市 达拉特旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 06, 21, 001, '工业街道办事处'),
	(15, 06, 21, 002, '昭君街道办事处'),
	(15, 06, 21, 003, '锡尼街道办事处'),
	(15, 06, 21, 004, '白塔街道办事处'),
	(15, 06, 21, 005, '西园街道办事处'),
	(15, 06, 21, 006, '平原街道办事处'),
	(15, 06, 21, 100, '树林召镇'),
	(15, 06, 21, 101, '吉格斯太镇'),
	(15, 06, 21, 102, '白泥井镇'),
	(15, 06, 21, 103, '王爱召镇'),
	(15, 06, 21, 104, '昭君镇'),
	(15, 06, 21, 105, '恩格贝镇'),
	(15, 06, 21, 106, '中和西镇'),
	(15, 06, 21, 200, '展旦召苏木乡');

/* 内蒙古自治区 鄂尔多斯市 准格尔旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 06, 22, 001, '兴隆街道'),
	(15, 06, 22, 002, '迎泽街道'),
	(15, 06, 22, 003, '蓝天街道'),
	(15, 06, 22, 004, '友谊街道'),
	(15, 06, 22, 100, '薛家湾镇'),
	(15, 06, 22, 101, '沙圪堵镇'),
	(15, 06, 22, 102, '大路镇'),
	(15, 06, 22, 103, '纳日松镇'),
	(15, 06, 22, 104, '龙口镇'),
	(15, 06, 22, 105, '准格尔召镇'),
	(15, 06, 22, 200, '暖水乡'),
	(15, 06, 22, 201, '十二连城乡'),
	(15, 06, 22, 202, '布尔陶亥苏木乡');

/* 内蒙古自治区 鄂尔多斯市 鄂托克前旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 06, 23, 100, '敖勒召其镇'),
	(15, 06, 23, 101, '上海庙镇'),
	(15, 06, 23, 102, '城川镇'),
	(15, 06, 23, 103, '昂素镇');

/* 内蒙古自治区 鄂尔多斯市 鄂托克旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 06, 24, 100, '乌兰镇'),
	(15, 06, 24, 101, '棋盘井镇'),
	(15, 06, 24, 102, '蒙西镇'),
	(15, 06, 24, 103, '木凯淖尔镇'),
	(15, 06, 24, 200, '苏米图苏木乡'),
	(15, 06, 24, 201, '阿尔巴斯苏木乡');

/* 内蒙古自治区 鄂尔多斯市 杭锦旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 06, 25, 100, '锡尼镇'),
	(15, 06, 25, 101, '巴拉贡镇'),
	(15, 06, 25, 102, '吉日嘎朗图镇'),
	(15, 06, 25, 103, '独贵特拉镇'),
	(15, 06, 25, 104, '呼和木独镇'),
	(15, 06, 25, 200, '伊和乌素苏木乡');

/* 内蒙古自治区 鄂尔多斯市 乌审旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 06, 26, 100, '嘎鲁图镇'),
	(15, 06, 26, 101, '乌审召镇'),
	(15, 06, 26, 102, '图克镇'),
	(15, 06, 26, 103, '乌兰陶勒盖镇'),
	(15, 06, 26, 104, '无定河镇'),
	(15, 06, 26, 200, '苏力德苏木乡');

/* 内蒙古自治区 鄂尔多斯市 伊金霍洛旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 06, 27, 100, '阿勒腾席热镇'),
	(15, 06, 27, 101, '札萨克镇'),
	(15, 06, 27, 102, '乌兰木伦镇'),
	(15, 06, 27, 103, '纳林陶亥镇'),
	(15, 06, 27, 104, '苏布尔嘎镇'),
	(15, 06, 27, 105, '红庆河镇'),
	(15, 06, 27, 106, '伊金霍洛镇');

/* 内蒙古自治区 呼伦贝尔市 海拉尔区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 02, 001, '正阳办事处'),
	(15, 07, 02, 002, '健康街道办事处'),
	(15, 07, 02, 003, '靠山街道办事处'),
	(15, 07, 02, 004, '胜利街道办事处'),
	(15, 07, 02, 005, '呼伦街道办事处'),
	(15, 07, 02, 007, '建设街道办事处'),
	(15, 07, 02, 100, '哈克镇'),
	(15, 07, 02, 101, '奋斗镇');

/* 内蒙古自治区 呼伦贝尔市 扎赉诺尔区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 03, 001, '第三街道办事处'),
	(15, 07, 03, 002, '第一街道办事处'),
	(15, 07, 03, 003, '第二街道办事处'),
	(15, 07, 03, 004, '第四街道办事处'),
	(15, 07, 03, 005, '第五街道办事处'),
	(15, 07, 03, 100, '灵泉镇');

/* 内蒙古自治区 呼伦贝尔市 阿荣旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 21, 100, '那吉镇'),
	(15, 07, 21, 101, '六合镇'),
	(15, 07, 21, 102, '亚东镇'),
	(15, 07, 21, 103, '霍尔奇镇'),
	(15, 07, 21, 104, '向阳峪镇'),
	(15, 07, 21, 105, '三岔河镇'),
	(15, 07, 21, 106, '复兴镇'),
	(15, 07, 21, 200, '得力其鄂温克民族乡'),
	(15, 07, 21, 201, '查巴奇鄂温克民族乡'),
	(15, 07, 21, 202, '音河达斡尔鄂温克民族乡'),
	(15, 07, 21, 203, '新发朝鲜民族乡');

/* 内蒙古自治区 呼伦贝尔市 莫力达瓦达斡尔族自治旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 22, 100, '尼尔基镇'),
	(15, 07, 22, 101, '红彦镇'),
	(15, 07, 22, 102, '宝山镇'),
	(15, 07, 22, 103, '哈达阳镇'),
	(15, 07, 22, 104, '阿尔拉镇'),
	(15, 07, 22, 105, '汉古尔河镇'),
	(15, 07, 22, 106, '西瓦尔图镇'),
	(15, 07, 22, 108, '腾克镇'),
	(15, 07, 22, 109, '奎勒河镇'),
	(15, 07, 22, 110, '塔温敖宝镇'),
	(15, 07, 22, 200, '巴彦鄂温克民族乡'),
	(15, 07, 22, 201, '库如奇乡'),
	(15, 07, 22, 203, '杜拉尔鄂温克民族乡');

/* 内蒙古自治区 呼伦贝尔市 鄂伦春自治旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 23, 100, '阿里河镇'),
	(15, 07, 23, 101, '大杨树镇'),
	(15, 07, 23, 102, '甘河镇'),
	(15, 07, 23, 103, '吉文镇'),
	(15, 07, 23, 104, '诺敏镇'),
	(15, 07, 23, 105, '乌鲁布铁镇'),
	(15, 07, 23, 106, '宜里镇'),
	(15, 07, 23, 107, '克一河镇'),
	(15, 07, 23, 200, '古里乡'),
	(15, 07, 23, 201, '托扎敏乡');

/* 内蒙古自治区 呼伦贝尔市 鄂温克族自治旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 24, 100, '巴彦托海镇'),
	(15, 07, 24, 110, '大雁镇'),
	(15, 07, 24, 111, '伊敏河镇'),
	(15, 07, 24, 112, '红花尔基镇'),
	(15, 07, 24, 210, '巴彦查岗苏木'),
	(15, 07, 24, 211, '锡尼河西苏木'),
	(15, 07, 24, 212, '锡尼河东苏木'),
	(15, 07, 24, 213, '巴彦塔拉达斡尔民族乡'),
	(15, 07, 24, 214, '伊敏苏木'),
	(15, 07, 24, 215, '辉苏木');

/* 内蒙古自治区 呼伦贝尔市 陈巴尔虎旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 25, 100, '陈旗巴彦库仁镇'),
	(15, 07, 25, 101, '陈旗宝日希勒镇'),
	(15, 07, 25, 102, '陈旗呼和诺尔镇'),
	(15, 07, 25, 200, '陈旗西乌珠尔苏木'),
	(15, 07, 25, 201, '陈旗鄂温克民族苏木'),
	(15, 07, 25, 202, '陈旗东乌珠尔苏木'),
	(15, 07, 25, 203, '陈旗巴彦哈达苏木');

/* 内蒙古自治区 呼伦贝尔市 新巴尔虎左旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 26, 101, '嵯岗镇'),
	(15, 07, 26, 102, '阿木古郎镇'),
	(15, 07, 26, 202, '新宝力格苏木乡'),
	(15, 07, 26, 203, '乌布尔宝力格苏木乡'),
	(15, 07, 26, 204, '罕达盖苏木'),
	(15, 07, 26, 205, '吉布胡郎图苏木'),
	(15, 07, 26, 206, '甘珠尔苏木');

/* 内蒙古自治区 呼伦贝尔市 新巴尔虎右旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 27, 100, '阿拉坦额莫勒镇'),
	(15, 07, 27, 101, '阿日哈沙特镇'),
	(15, 07, 27, 102, '呼伦镇'),
	(15, 07, 27, 200, '贝尔苏木'),
	(15, 07, 27, 201, '克尔伦苏木'),
	(15, 07, 27, 202, '达赉苏木'),
	(15, 07, 27, 203, '宝格德乌拉苏木');

/* 内蒙古自治区 呼伦贝尔市 满洲里市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 81, 001, '东山街道办事处'),
	(15, 07, 81, 002, '道南街道办事处'),
	(15, 07, 81, 003, '道北街道办事处'),
	(15, 07, 81, 004, '兴华街道办事处'),
	(15, 07, 81, 100, '新开河镇');

/* 内蒙古自治区 呼伦贝尔市 牙克石市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 82, 001, '胜利街道办事处'),
	(15, 07, 82, 002, '红旗街道办事处'),
	(15, 07, 82, 003, '新工街道办事处'),
	(15, 07, 82, 004, '永兴街道办事处'),
	(15, 07, 82, 005, '建设街道办事处'),
	(15, 07, 82, 006, '暖泉街道办事处'),
	(15, 07, 82, 007, '东兴街道办事处'),
	(15, 07, 82, 100, '免渡河镇'),
	(15, 07, 82, 101, '博克图镇'),
	(15, 07, 82, 102, '绰河源镇'),
	(15, 07, 82, 103, '乌尔其汉镇'),
	(15, 07, 82, 104, '库都尔镇'),
	(15, 07, 82, 105, '图里河镇'),
	(15, 07, 82, 106, '乌奴耳镇'),
	(15, 07, 82, 107, '塔尔气镇'),
	(15, 07, 82, 108, '伊图里河镇');

/* 内蒙古自治区 呼伦贝尔市 扎兰屯市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 83, 001, '兴华街道办事处'),
	(15, 07, 83, 002, '正阳街道办事处'),
	(15, 07, 83, 003, '繁荣街道办事处'),
	(15, 07, 83, 004, '向阳街道办事处'),
	(15, 07, 83, 005, '高台子街道办事处'),
	(15, 07, 83, 006, '铁东街道办事处'),
	(15, 07, 83, 007, '河西街道办事处'),
	(15, 07, 83, 100, '磨菇气镇'),
	(15, 07, 83, 102, '卧牛河镇'),
	(15, 07, 83, 103, '成吉思汗镇'),
	(15, 07, 83, 104, '大河湾镇'),
	(15, 07, 83, 105, '浩饶山镇'),
	(15, 07, 83, 106, '柴河镇'),
	(15, 07, 83, 107, '中和镇'),
	(15, 07, 83, 108, '哈多河镇'),
	(15, 07, 83, 200, '达斡尔民族乡'),
	(15, 07, 83, 201, '鄂伦春民族乡'),
	(15, 07, 83, 202, '萨马街鄂温克民族乡'),
	(15, 07, 83, 203, '洼堤乡');

/* 内蒙古自治区 呼伦贝尔市 额尔古纳市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 84, 001, '拉布达林街道办事处'),
	(15, 07, 84, 002, '上库力街道办事处'),
	(15, 07, 84, 101, '黑山头镇'),
	(15, 07, 84, 103, '莫尔道嘎镇'),
	(15, 07, 84, 104, '恩和哈达镇'),
	(15, 07, 84, 200, '三河回族乡'),
	(15, 07, 84, 210, '恩和俄罗斯族民族乡'),
	(15, 07, 84, 211, '蒙兀室韦苏木'),
	(15, 07, 84, 212, '奇乾乡');

/* 内蒙古自治区 呼伦贝尔市 根河市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 07, 85, 001, '河东街道办事处'),
	(15, 07, 85, 002, '河西街道办事处'),
	(15, 07, 85, 003, '森工街道办事处'),
	(15, 07, 85, 101, '金河镇'),
	(15, 07, 85, 102, '阿龙山镇'),
	(15, 07, 85, 103, '满归镇'),
	(15, 07, 85, 104, '得耳布尔镇'),
	(15, 07, 85, 200, '敖鲁古雅乡');

/* 内蒙古自治区 巴彦淖尔市 临河区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 08, 02, 001, '团结办事处'),
	(15, 08, 02, 002, '车站办事处'),
	(15, 08, 02, 003, '先锋办事处'),
	(15, 08, 02, 004, '解放办事处'),
	(15, 08, 02, 005, '新华办事处'),
	(15, 08, 02, 006, '东环路办事处'),
	(15, 08, 02, 007, '铁南办事处'),
	(15, 08, 02, 008, '西环路办事处'),
	(15, 08, 02, 009, '北环路办事处'),
	(15, 08, 02, 100, '狼山镇'),
	(15, 08, 02, 101, '新华镇'),
	(15, 08, 02, 102, '干召庙镇'),
	(15, 08, 02, 103, '乌兰图克镇'),
	(15, 08, 02, 104, '双河镇'),
	(15, 08, 02, 105, '城关镇'),
	(15, 08, 02, 106, '白脑包镇'),
	(15, 08, 02, 200, '曙光乡'),
	(15, 08, 02, 201, '八一乡');

/* 内蒙古自治区 巴彦淖尔市 五原县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 08, 21, 100, '隆兴昌镇'),
	(15, 08, 21, 101, '塔尔湖镇'),
	(15, 08, 21, 102, '套海镇'),
	(15, 08, 21, 103, '新公中镇'),
	(15, 08, 21, 104, '天吉太镇'),
	(15, 08, 21, 105, '胜丰镇'),
	(15, 08, 21, 106, '银定图镇'),
	(15, 08, 21, 107, '复兴镇'),
	(15, 08, 21, 200, '和胜乡');

/* 内蒙古自治区 巴彦淖尔市 磴口县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 08, 22, 100, '巴彦高勒镇'),
	(15, 08, 22, 101, '隆盛合镇'),
	(15, 08, 22, 102, '渡口镇'),
	(15, 08, 22, 103, '补隆淖镇'),
	(15, 08, 22, 200, '沙金套海苏木');

/* 内蒙古自治区 巴彦淖尔市 乌拉特前旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 08, 23, 100, '乌拉山镇'),
	(15, 08, 23, 101, '白彦花镇'),
	(15, 08, 23, 102, '先锋镇'),
	(15, 08, 23, 103, '新安镇'),
	(15, 08, 23, 104, '西小召镇'),
	(15, 08, 23, 105, '大佘太镇'),
	(15, 08, 23, 106, '明安镇'),
	(15, 08, 23, 107, '小佘太镇'),
	(15, 08, 23, 108, '苏独仑镇'),
	(15, 08, 23, 200, '额尔登布拉格苏木'),
	(15, 08, 23, 201, '沙德格苏木');

/* 内蒙古自治区 巴彦淖尔市 乌拉特中旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 08, 24, 100, '海流图镇'),
	(15, 08, 24, 101, '乌加河镇'),
	(15, 08, 24, 102, '德岭山镇'),
	(15, 08, 24, 103, '石哈河镇'),
	(15, 08, 24, 104, '甘其毛都镇'),
	(15, 08, 24, 105, '温更镇'),
	(15, 08, 24, 200, '呼鲁斯太苏木'),
	(15, 08, 24, 201, '川井苏木'),
	(15, 08, 24, 202, '巴音乌兰苏木'),
	(15, 08, 24, 203, '新忽热苏木');

/* 内蒙古自治区 巴彦淖尔市 乌拉特后旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 08, 25, 100, '巴音宝力格镇'),
	(15, 08, 25, 101, '呼和温都尔镇'),
	(15, 08, 25, 102, '潮格温都尔镇'),
	(15, 08, 25, 200, '获各琦苏木'),
	(15, 08, 25, 201, '巴音前达门苏木'),
	(15, 08, 25, 202, '乌盖苏木');

/* 内蒙古自治区 巴彦淖尔市 杭锦后旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 08, 26, 100, '陕坝镇'),
	(15, 08, 26, 101, '头道桥镇'),
	(15, 08, 26, 102, '二道桥镇'),
	(15, 08, 26, 103, '三道桥镇'),
	(15, 08, 26, 104, '蛮会镇'),
	(15, 08, 26, 105, '团结镇'),
	(15, 08, 26, 106, '双庙镇'),
	(15, 08, 26, 107, '沙海镇'),
	(15, 08, 26, 108, '蒙海镇');

/* 内蒙古自治区 乌兰察布市 集宁区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 09, 02, 001, '新体路街道办事处'),
	(15, 09, 02, 002, '桥东街道办事处'),
	(15, 09, 02, 003, '前进路街道办事处'),
	(15, 09, 02, 004, '常青街道办事处'),
	(15, 09, 02, 005, '虎山街道办事处'),
	(15, 09, 02, 006, '桥西街道办事处'),
	(15, 09, 02, 007, '新华街街道办事处'),
	(15, 09, 02, 008, '泉山街道办事处'),
	(15, 09, 02, 105, '白海子镇'),
	(15, 09, 02, 205, '马莲渠乡');

/* 内蒙古自治区 乌兰察布市 卓资县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 09, 21, 106, '卓资山镇'),
	(15, 09, 21, 107, '旗下营镇'),
	(15, 09, 21, 108, '卓资县十八台镇'),
	(15, 09, 21, 109, '卓资县巴音锡勒镇'),
	(15, 09, 21, 110, '卓资县梨花镇'),
	(15, 09, 21, 210, '卓资县大榆树乡'),
	(15, 09, 21, 211, '卓资县红召乡'),
	(15, 09, 21, 212, '卓资县复兴乡');

/* 内蒙古自治区 乌兰察布市 化德县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 09, 22, 103, '化德县长顺镇'),
	(15, 09, 22, 104, '化德县朝阳镇'),
	(15, 09, 22, 105, '化德县七号镇'),
	(15, 09, 22, 200, '化德县德包图乡'),
	(15, 09, 22, 201, '化德县公腊胡洞乡'),
	(15, 09, 22, 218, '化德县白音特拉乡');

/* 内蒙古自治区 乌兰察布市 商都县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 09, 23, 101, '七台镇'),
	(15, 09, 23, 102, '十八顷镇'),
	(15, 09, 23, 103, '大黑沙土镇'),
	(15, 09, 23, 104, '西井子镇'),
	(15, 09, 23, 105, '屯垦队镇'),
	(15, 09, 23, 106, '小海子镇'),
	(15, 09, 23, 200, '大库伦乡'),
	(15, 09, 23, 201, '卯都乡'),
	(15, 09, 23, 202, '玻璃忽镜乡'),
	(15, 09, 23, 203, '三大顷乡');

/* 内蒙古自治区 乌兰察布市 兴和县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 09, 24, 106, '城关镇'),
	(15, 09, 24, 107, '张皋镇'),
	(15, 09, 24, 108, '赛乌素镇'),
	(15, 09, 24, 109, '鄂尔栋镇'),
	(15, 09, 24, 110, '店子镇'),
	(15, 09, 24, 209, '大库联乡'),
	(15, 09, 24, 210, '民族团结乡'),
	(15, 09, 24, 211, '大同夭乡'),
	(15, 09, 24, 212, '五股泉乡');

/* 内蒙古自治区 乌兰察布市 凉城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 09, 25, 103, '岱海镇'),
	(15, 09, 25, 104, '六苏木镇'),
	(15, 09, 25, 105, '麦胡图镇'),
	(15, 09, 25, 106, '永兴镇'),
	(15, 09, 25, 107, '蛮汉镇'),
	(15, 09, 25, 218, '天成乡'),
	(15, 09, 25, 219, '曹碾满族乡'),
	(15, 09, 25, 220, '厂汉营乡');

/* 内蒙古自治区 乌兰察布市 察哈尔右翼前旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 09, 26, 105, '土贵乌拉镇'),
	(15, 09, 26, 106, '平地泉镇'),
	(15, 09, 26, 107, '玫瑰营镇'),
	(15, 09, 26, 108, '巴音塔拉镇'),
	(15, 09, 26, 109, '黄旗海镇'),
	(15, 09, 26, 209, '乌拉哈乌拉乡'),
	(15, 09, 26, 210, '黄茂营乡'),
	(15, 09, 26, 211, '三岔口乡'),
	(15, 09, 26, 212, '老圈沟乡');

/* 内蒙古自治区 乌兰察布市 察哈尔右翼中旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 09, 27, 103, '科布尔镇'),
	(15, 09, 27, 104, '铁沙盖镇'),
	(15, 09, 27, 105, '黄羊城镇'),
	(15, 09, 27, 106, '广益隆镇'),
	(15, 09, 27, 107, '乌素图镇'),
	(15, 09, 27, 216, '大滩乡'),
	(15, 09, 27, 217, '宏盘乡'),
	(15, 09, 27, 218, '巴音乡'),
	(15, 09, 27, 219, '库联苏木'),
	(15, 09, 27, 220, '乌兰哈页苏木'),
	(15, 09, 27, 221, '察右中旗土城子乡');

/* 内蒙古自治区 乌兰察布市 察哈尔右翼后旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 09, 28, 105, '白音察干镇'),
	(15, 09, 28, 106, '察哈尔右翼后旗土牧尔台镇'),
	(15, 09, 28, 107, '察哈尔右翼后旗红格尔图镇'),
	(15, 09, 28, 108, '察哈尔右翼后旗贲红镇'),
	(15, 09, 28, 109, '察哈尔右翼后旗大六号镇'),
	(15, 09, 28, 209, '察哈尔右翼后旗当郎忽洞苏木'),
	(15, 09, 28, 210, '察哈尔右翼后旗乌兰哈达苏木'),
	(15, 09, 28, 211, '察哈尔右翼后旗锡勒乡');

/* 内蒙古自治区 乌兰察布市 四子王旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 09, 29, 100, '四子王旗乌兰花镇'),
	(15, 09, 29, 101, '四子王旗吉生太镇'),
	(15, 09, 29, 102, '四子王旗库伦图镇'),
	(15, 09, 29, 103, '四子王旗供济堂镇'),
	(15, 09, 29, 104, '四子王旗白音朝克图镇'),
	(15, 09, 29, 200, '四子王旗红格尔苏木'),
	(15, 09, 29, 201, '四子王旗江岸苏木'),
	(15, 09, 29, 202, '四子王旗查干补力格苏木'),
	(15, 09, 29, 203, '四子王旗脑木更苏木'),
	(15, 09, 29, 204, '四子王旗东八号乡'),
	(15, 09, 29, 205, '四子王旗忽鸡图乡'),
	(15, 09, 29, 206, '四子王旗大黑河乡'),
	(15, 09, 29, 207, '四子王旗巴音敖包苏木');

/* 内蒙古自治区 乌兰察布市 丰镇市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 09, 81, 005, '新城区街道办事处'),
	(15, 09, 81, 006, '旧城区街道办事处'),
	(15, 09, 81, 007, '北城区街道办事处'),
	(15, 09, 81, 008, '工业区街道办事处'),
	(15, 09, 81, 009, '南城区街道办事处'),
	(15, 09, 81, 107, '隆盛庄镇'),
	(15, 09, 81, 108, '黑土台镇'),
	(15, 09, 81, 109, '红砂坝镇'),
	(15, 09, 81, 110, '巨宝庄镇'),
	(15, 09, 81, 111, '三义泉镇'),
	(15, 09, 81, 207, '浑源窑乡'),
	(15, 09, 81, 208, '元山子乡'),
	(15, 09, 81, 209, '官屯堡乡');

/* 内蒙古自治区 兴安盟 乌兰浩特市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 22, 01, 001, '爱国办事处'),
	(15, 22, 01, 002, '和平办事处'),
	(15, 22, 01, 003, '兴安办事处'),
	(15, 22, 01, 004, '胜利办事处'),
	(15, 22, 01, 005, '铁西办事处'),
	(15, 22, 01, 006, '都林办事处'),
	(15, 22, 01, 007, '五一办事处'),
	(15, 22, 01, 008, '城郊办事处'),
	(15, 22, 01, 100, '乌兰哈达镇'),
	(15, 22, 01, 101, '葛根庙镇'),
	(15, 22, 01, 102, '太本站镇'),
	(15, 22, 01, 103, '义勒力特镇');

/* 内蒙古自治区 兴安盟 阿尔山市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 22, 02, 001, '阿尔山市林海街道'),
	(15, 22, 02, 002, '阿尔山市新城街道'),
	(15, 22, 02, 003, '阿尔山市温泉街道'),
	(15, 22, 02, 004, '伊尔施街道办事处'),
	(15, 22, 02, 100, '阿尔山市天池镇'),
	(15, 22, 02, 101, '阿尔山市白狼镇'),
	(15, 22, 02, 102, '阿尔山市五岔沟镇'),
	(15, 22, 02, 103, '明水河镇');

/* 内蒙古自治区 兴安盟 科尔沁右翼前旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 22, 21, 100, '科尔沁镇'),
	(15, 22, 21, 101, '索伦镇'),
	(15, 22, 21, 102, '德佰斯镇'),
	(15, 22, 21, 103, '大石寨镇'),
	(15, 22, 21, 104, '归流河镇'),
	(15, 22, 21, 105, '居力很镇'),
	(15, 22, 21, 106, '察尔森镇'),
	(15, 22, 21, 107, '额尔格图镇'),
	(15, 22, 21, 108, '俄体镇'),
	(15, 22, 21, 200, '满族屯满族乡'),
	(15, 22, 21, 201, '乌兰毛都苏木乡'),
	(15, 22, 21, 202, '阿力得尔苏木乡'),
	(15, 22, 21, 203, '巴拉格歹乡'),
	(15, 22, 21, 204, '桃合木苏木');

/* 内蒙古自治区 兴安盟 科尔沁右翼中旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 22, 22, 100, '巴彦呼舒镇'),
	(15, 22, 22, 101, '巴仁哲里木镇'),
	(15, 22, 22, 102, '吐列毛都镇'),
	(15, 22, 22, 103, '杜尔基镇'),
	(15, 22, 22, 104, '高力板镇'),
	(15, 22, 22, 105, '好腰苏木镇'),
	(15, 22, 22, 200, '代钦塔拉苏木'),
	(15, 22, 22, 201, '新佳木苏木'),
	(15, 22, 22, 202, '哈日诺尔苏木'),
	(15, 22, 22, 203, '额木庭高勒苏木'),
	(15, 22, 22, 204, '巴彦茫哈苏木'),
	(15, 22, 22, 205, '巴彦淖尔苏木');

/* 内蒙古自治区 兴安盟 扎赉特旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 22, 23, 100, '音德尔镇'),
	(15, 22, 23, 101, '新林镇'),
	(15, 22, 23, 102, '巴彦高勒镇'),
	(15, 22, 23, 103, '胡尔勒镇'),
	(15, 22, 23, 104, '阿尔本格勒镇'),
	(15, 22, 23, 105, '巴达尔胡镇'),
	(15, 22, 23, 106, '图牧吉镇'),
	(15, 22, 23, 200, '好力保乡'),
	(15, 22, 23, 201, '巴彦乌兰苏木'),
	(15, 22, 23, 202, '宝力根花苏木'),
	(15, 22, 23, 203, '阿拉达尔吐苏木'),
	(15, 22, 23, 204, '巴彦扎拉嘎乡'),
	(15, 22, 23, 205, '努文木仁乡');

/* 内蒙古自治区 兴安盟 突泉县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 22, 24, 100, '突泉镇'),
	(15, 22, 24, 101, '六户镇'),
	(15, 22, 24, 102, '东杜尔基镇'),
	(15, 22, 24, 103, '永安镇'),
	(15, 22, 24, 104, '水泉镇'),
	(15, 22, 24, 105, '宝石镇'),
	(15, 22, 24, 200, '学田乡'),
	(15, 22, 24, 201, '九龙乡'),
	(15, 22, 24, 202, '太平乡');

/* 内蒙古自治区 锡林郭勒盟 二连浩特市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 01, 200, '格日勒敖都苏木');

/* 内蒙古自治区 锡林郭勒盟 锡林浩特市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 02, 001, '希日塔拉街道办事处'),
	(15, 25, 02, 002, '宝力根街道办事处'),
	(15, 25, 02, 003, '杭盖街道办事处'),
	(15, 25, 02, 004, '楚古兰街道办事处'),
	(15, 25, 02, 005, '额尔敦街道办事处'),
	(15, 25, 02, 006, '南郊街道办事处'),
	(15, 25, 02, 007, '巴彦查干街道办事处'),
	(15, 25, 02, 100, '阿尔善宝拉格镇'),
	(15, 25, 02, 200, '宝力根苏木'),
	(15, 25, 02, 201, '朝克乌拉苏木'),
	(15, 25, 02, 202, '巴彦锡勒办事处乡'),
	(15, 25, 02, 203, '巴彦宝拉格苏木');

/* 内蒙古自治区 锡林郭勒盟 阿巴嘎旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 22, 100, '别力古台镇'),
	(15, 25, 22, 101, '洪格尔高勒镇'),
	(15, 25, 22, 102, '查干淖尔镇'),
	(15, 25, 22, 200, '那仁宝拉格苏木乡'),
	(15, 25, 22, 201, '伊和高勒苏木乡乡'),
	(15, 25, 22, 202, '吉尔嘎郎图苏木乡'),
	(15, 25, 22, 203, '巴彦图嘎苏木');

/* 内蒙古自治区 锡林郭勒盟 苏尼特左旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 23, 100, '满都拉图镇'),
	(15, 25, 23, 101, '查干敖包镇'),
	(15, 25, 23, 102, '巴彦淖尔镇'),
	(15, 25, 23, 200, '巴彦乌拉苏木'),
	(15, 25, 23, 201, '赛罕高毕苏木'),
	(15, 25, 23, 202, '洪格尔苏木'),
	(15, 25, 23, 203, '达来苏木');

/* 内蒙古自治区 锡林郭勒盟 苏尼特右旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 24, 100, '赛汉塔拉镇'),
	(15, 25, 24, 101, '朱日和镇'),
	(15, 25, 24, 102, '乌日根塔拉镇'),
	(15, 25, 24, 200, '桑宝拉格苏木乡'),
	(15, 25, 24, 201, '额仁淖尔苏木'),
	(15, 25, 24, 202, '赛罕乌力吉苏木'),
	(15, 25, 24, 203, '阿其图乌拉苏木');

/* 内蒙古自治区 锡林郭勒盟 东乌珠穆沁旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 25, 100, '乌里雅斯太镇'),
	(15, 25, 25, 101, '道特淖尔镇'),
	(15, 25, 25, 102, '嘎达布其镇'),
	(15, 25, 25, 103, '满都胡宝拉格镇'),
	(15, 25, 25, 104, '额吉淖尔镇'),
	(15, 25, 25, 200, '呼热图淖尔苏木'),
	(15, 25, 25, 201, '萨麦苏木'),
	(15, 25, 25, 202, '嘎海乐苏木'),
	(15, 25, 25, 203, '阿拉坦合力苏木');

/* 内蒙古自治区 锡林郭勒盟 西乌珠穆沁旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 26, 100, '巴拉嘎尔高勒镇'),
	(15, 25, 26, 101, '巴彦花镇'),
	(15, 25, 26, 102, '吉仁高勒镇'),
	(15, 25, 26, 103, '浩勒图高勒镇'),
	(15, 25, 26, 104, '高日罕镇'),
	(15, 25, 26, 200, '巴彦胡舒苏木乡'),
	(15, 25, 26, 201, '乌兰哈拉嘎苏木');

/* 内蒙古自治区 锡林郭勒盟 太仆寺旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 27, 100, '宝昌镇'),
	(15, 25, 27, 101, '千斤沟镇'),
	(15, 25, 27, 102, '红旗镇'),
	(15, 25, 27, 103, '骆驼山镇'),
	(15, 25, 27, 104, '永丰镇'),
	(15, 25, 27, 200, '幸福乡'),
	(15, 25, 27, 201, '贡宝拉格苏木乡');

/* 内蒙古自治区 锡林郭勒盟 镶黄旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 28, 100, '新宝拉格镇'),
	(15, 25, 28, 101, '巴彦塔拉镇'),
	(15, 25, 28, 200, '翁贡乌拉苏木乡'),
	(15, 25, 28, 201, '宝格达音髙勒苏木');

/* 内蒙古自治区 锡林郭勒盟 正镶白旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 29, 100, '明安图镇'),
	(15, 25, 29, 101, '星耀镇'),
	(15, 25, 29, 200, '伊和淖尔苏木乡'),
	(15, 25, 29, 201, '乌兰查布苏木乡'),
	(15, 25, 29, 202, '宝拉根陶海苏木');

/* 内蒙古自治区 锡林郭勒盟 正蓝旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 30, 100, '上都镇'),
	(15, 25, 30, 101, '桑根达来镇'),
	(15, 25, 30, 102, '哈毕日嘎镇'),
	(15, 25, 30, 200, '宝绍代苏木乡'),
	(15, 25, 30, 201, '那日图苏木乡'),
	(15, 25, 30, 202, '赛音呼都嘎苏木乡'),
	(15, 25, 30, 203, '扎格斯台苏木');

/* 内蒙古自治区 锡林郭勒盟 多伦县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 25, 31, 100, '大北沟镇'),
	(15, 25, 31, 101, '多伦诺尔镇'),
	(15, 25, 31, 200, '大河口乡'),
	(15, 25, 31, 201, '蔡木山乡'),
	(15, 25, 31, 202, '西干沟乡');

/* 内蒙古自治区 阿拉善盟 阿拉善左旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 29, 21, 102, '温都尔勒图镇'),
	(15, 29, 21, 105, '巴润别立镇'),
	(15, 29, 21, 110, '巴彦浩特镇'),
	(15, 29, 21, 111, '嘉尔嘎勒赛汉镇'),
	(15, 29, 21, 112, '吉兰泰镇'),
	(15, 29, 21, 113, '宗别立镇'),
	(15, 29, 21, 114, '敖伦布拉格镇'),
	(15, 29, 21, 115, '腾格里额里斯镇'),
	(15, 29, 21, 203, '巴彦木仁苏木乡'),
	(15, 29, 21, 213, '乌力吉苏木乡'),
	(15, 29, 21, 214, '巴彦诺日公苏木乡'),
	(15, 29, 21, 215, '额尔克哈什哈苏木乡'),
	(15, 29, 21, 216, '银根苏木'),
	(15, 29, 21, 217, '超格图呼热苏木');

/* 内蒙古自治区 阿拉善盟 阿拉善右旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 29, 22, 103, '巴丹吉林镇'),
	(15, 29, 22, 104, '雅布赖镇'),
	(15, 29, 22, 105, '阿拉腾敖包镇'),
	(15, 29, 22, 211, '曼德拉苏木'),
	(15, 29, 22, 212, '阿拉腾朝格苏木'),
	(15, 29, 22, 213, '巴音高勒苏木'),
	(15, 29, 22, 214, '塔木素布拉格苏木');

/* 内蒙古自治区 阿拉善盟 额济纳旗 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(15, 29, 23, 100, '达来呼布镇'),
	(15, 29, 23, 101, '额济纳旗东风镇'),
	(15, 29, 23, 102, '哈日布日格德音乌拉镇'),
	(15, 29, 23, 200, '额济纳旗赛汉陶来苏木'),
	(15, 29, 23, 201, '额济纳旗马鬃山苏木'),
	(15, 29, 23, 202, '额济纳旗苏泊淖尔苏木'),
	(15, 29, 23, 203, '巴彦陶来苏木'),
	(15, 29, 23, 204, '温图高勒苏木');
