/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */


/*
 * 《2015年统计用区划代码和城乡划分代码（截止2015年09月30日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2015/index.html）
 * 数据范围：福建省(35)、江西省(36)、山东省(37)。
 */

/* 福建省 福州市 鼓楼区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 02, 001, '鼓东街道'),
	(35, 01, 02, 002, '鼓西街道'),
	(35, 01, 02, 003, '温泉街道'),
	(35, 01, 02, 004, '东街街道'),
	(35, 01, 02, 005, '南街街道'),
	(35, 01, 02, 006, '安泰街道'),
	(35, 01, 02, 007, '华大街道'),
	(35, 01, 02, 008, '水部街道'),
	(35, 01, 02, 009, '五凤街道'),
	(35, 01, 02, 100, '洪山镇');

/* 福建省 福州市 台江区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 03, 001, '瀛洲街道'),
	(35, 01, 03, 002, '后洲街道'),
	(35, 01, 03, 003, '义洲街道'),
	(35, 01, 03, 004, '新港街道'),
	(35, 01, 03, 005, '上海街道'),
	(35, 01, 03, 007, '苍霞街道'),
	(35, 01, 03, 009, '茶亭街道'),
	(35, 01, 03, 010, '洋中街道'),
	(35, 01, 03, 011, '鳌峰街道'),
	(35, 01, 03, 012, '宁化街道');

/* 福建省 福州市 仓山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 04, 001, '仓前街道'),
	(35, 01, 04, 002, '东升街道'),
	(35, 01, 04, 003, '对湖街道'),
	(35, 01, 04, 004, '临江街道'),
	(35, 01, 04, 005, '三叉街街道'),
	(35, 01, 04, 006, '上渡街道'),
	(35, 01, 04, 007, '下渡街道'),
	(35, 01, 04, 008, '金山街道'),
	(35, 01, 04, 100, '仓山镇'),
	(35, 01, 04, 101, '城门镇'),
	(35, 01, 04, 102, '盖山镇'),
	(35, 01, 04, 103, '建新镇'),
	(35, 01, 04, 104, '螺洲镇');

/* 福建省 福州市 马尾区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 05, 001, '罗星街道'),
	(35, 01, 05, 100, '马尾镇'),
	(35, 01, 05, 101, '亭江镇'),
	(35, 01, 05, 102, '琅岐镇');

/* 福建省 福州市 晋安区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 11, 001, '茶园街道'),
	(35, 01, 11, 002, '王庄街道'),
	(35, 01, 11, 003, '象园街道'),
	(35, 01, 11, 100, '鼓山镇'),
	(35, 01, 11, 101, '新店镇'),
	(35, 01, 11, 102, '岳峰镇'),
	(35, 01, 11, 103, '宦溪镇'),
	(35, 01, 11, 201, '寿山乡'),
	(35, 01, 11, 202, '日溪乡');

/* 福建省 福州市 闽侯县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 21, 001, '甘蔗街道'),
	(35, 01, 21, 101, '白沙镇'),
	(35, 01, 21, 102, '南屿镇'),
	(35, 01, 21, 103, '尚干镇'),
	(35, 01, 21, 104, '祥谦镇'),
	(35, 01, 21, 105, '青口镇'),
	(35, 01, 21, 106, '南通镇'),
	(35, 01, 21, 107, '上街镇'),
	(35, 01, 21, 108, '荆溪镇'),
	(35, 01, 21, 200, '竹岐乡'),
	(35, 01, 21, 201, '鸿尾乡'),
	(35, 01, 21, 202, '洋里乡'),
	(35, 01, 21, 203, '大湖乡'),
	(35, 01, 21, 204, '廷坪乡'),
	(35, 01, 21, 206, '小箬乡');

/* 福建省 福州市 连江县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 22, 100, '凤城镇'),
	(35, 01, 22, 101, '敖江镇'),
	(35, 01, 22, 102, '东岱镇'),
	(35, 01, 22, 103, '琯头镇'),
	(35, 01, 22, 104, '晓澳镇'),
	(35, 01, 22, 105, '东湖镇'),
	(35, 01, 22, 106, '丹阳镇'),
	(35, 01, 22, 107, '长龙镇'),
	(35, 01, 22, 108, '透堡镇'),
	(35, 01, 22, 109, '马鼻镇'),
	(35, 01, 22, 110, '官坂镇'),
	(35, 01, 22, 111, '筱埕镇'),
	(35, 01, 22, 112, '黄岐镇'),
	(35, 01, 22, 113, '苔菉镇'),
	(35, 01, 22, 114, '浦口镇'),
	(35, 01, 22, 115, '坑园镇'),
	(35, 01, 22, 200, '潘渡乡'),
	(35, 01, 22, 201, '江南乡'),
	(35, 01, 22, 202, '蓼沿乡'),
	(35, 01, 22, 203, '安凯乡'),
	(35, 01, 22, 204, '下宫乡'),
	(35, 01, 22, 205, '小沧畲族乡');

/* 福建省 福州市 罗源县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 23, 100, '凤山镇'),
	(35, 01, 23, 101, '松山镇'),
	(35, 01, 23, 102, '起步镇'),
	(35, 01, 23, 103, '中房镇'),
	(35, 01, 23, 104, '飞竹镇'),
	(35, 01, 23, 105, '鉴江镇'),
	(35, 01, 23, 200, '白塔乡'),
	(35, 01, 23, 201, '洪洋乡'),
	(35, 01, 23, 202, '西兰乡'),
	(35, 01, 23, 203, '霍口畲族乡'),
	(35, 01, 23, 204, '碧里乡');

/* 福建省 福州市 闽清县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 24, 100, '梅城镇'),
	(35, 01, 24, 101, '梅溪镇'),
	(35, 01, 24, 102, '白樟镇'),
	(35, 01, 24, 103, '金沙镇'),
	(35, 01, 24, 104, '白中镇'),
	(35, 01, 24, 105, '池园镇'),
	(35, 01, 24, 106, '坂东镇'),
	(35, 01, 24, 107, '塔庄镇'),
	(35, 01, 24, 108, '省璜镇'),
	(35, 01, 24, 109, '雄江镇'),
	(35, 01, 24, 110, '东桥镇'),
	(35, 01, 24, 200, '云龙乡'),
	(35, 01, 24, 201, '上莲乡'),
	(35, 01, 24, 204, '三溪乡'),
	(35, 01, 24, 205, '桔林乡'),
	(35, 01, 24, 206, '下祝乡');

/* 福建省 福州市 永泰县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 25, 100, '樟城镇'),
	(35, 01, 25, 101, '嵩口镇'),
	(35, 01, 25, 102, '梧桐镇'),
	(35, 01, 25, 103, '葛岭镇'),
	(35, 01, 25, 104, '城峰镇'),
	(35, 01, 25, 105, '清凉镇'),
	(35, 01, 25, 106, '长庆镇'),
	(35, 01, 25, 107, '同安镇'),
	(35, 01, 25, 108, '大洋镇'),
	(35, 01, 25, 200, '塘前乡'),
	(35, 01, 25, 201, '富泉乡'),
	(35, 01, 25, 202, '岭路乡'),
	(35, 01, 25, 203, '赤锡乡'),
	(35, 01, 25, 204, '洑口乡'),
	(35, 01, 25, 205, '盖洋乡'),
	(35, 01, 25, 206, '东洋乡'),
	(35, 01, 25, 207, '霞拔乡'),
	(35, 01, 25, 208, '盘谷乡'),
	(35, 01, 25, 209, '红星乡'),
	(35, 01, 25, 210, '白云乡'),
	(35, 01, 25, 211, '丹云乡');

/* 福建省 福州市 平潭县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 28, 100, '潭城镇'),
	(35, 01, 28, 101, '苏澳镇'),
	(35, 01, 28, 102, '流水镇'),
	(35, 01, 28, 103, '澳前镇'),
	(35, 01, 28, 104, '北厝镇'),
	(35, 01, 28, 105, '平原镇'),
	(35, 01, 28, 106, '敖东镇'),
	(35, 01, 28, 200, '白青乡'),
	(35, 01, 28, 201, '屿头乡'),
	(35, 01, 28, 202, '大练乡'),
	(35, 01, 28, 203, '芦洋乡'),
	(35, 01, 28, 204, '中楼乡'),
	(35, 01, 28, 205, '东庠乡'),
	(35, 01, 28, 206, '岚城乡'),
	(35, 01, 28, 207, '南海乡');

/* 福建省 福州市 福清市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 81, 002, '玉屏街道'),
	(35, 01, 81, 003, '龙山街道'),
	(35, 01, 81, 004, '龙江街道'),
	(35, 01, 81, 005, '宏路街道'),
	(35, 01, 81, 006, '石竹街道'),
	(35, 01, 81, 007, '音西街道'),
	(35, 01, 81, 008, '阳下街道'),
	(35, 01, 81, 103, '海口镇'),
	(35, 01, 81, 104, '城头镇'),
	(35, 01, 81, 105, '南岭镇'),
	(35, 01, 81, 106, '龙田镇'),
	(35, 01, 81, 107, '江镜镇'),
	(35, 01, 81, 108, '港头镇'),
	(35, 01, 81, 109, '高山镇'),
	(35, 01, 81, 110, '沙埔镇'),
	(35, 01, 81, 111, '三山镇'),
	(35, 01, 81, 112, '东瀚镇'),
	(35, 01, 81, 113, '渔溪镇'),
	(35, 01, 81, 114, '上迳镇'),
	(35, 01, 81, 115, '新厝镇'),
	(35, 01, 81, 116, '江阴镇'),
	(35, 01, 81, 117, '东张镇'),
	(35, 01, 81, 118, '镜洋镇'),
	(35, 01, 81, 119, '一都镇');

/* 福建省 福州市 长乐市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 01, 82, 001, '吴航街道'),
	(35, 01, 82, 002, '航城街道'),
	(35, 01, 82, 003, '营前街道'),
	(35, 01, 82, 004, '漳港街道'),
	(35, 01, 82, 102, '首占镇'),
	(35, 01, 82, 103, '玉田镇'),
	(35, 01, 82, 104, '松下镇'),
	(35, 01, 82, 105, '江田镇'),
	(35, 01, 82, 106, '古槐镇'),
	(35, 01, 82, 107, '文武砂镇'),
	(35, 01, 82, 108, '鹤上镇'),
	(35, 01, 82, 110, '湖南镇'),
	(35, 01, 82, 111, '金峰镇'),
	(35, 01, 82, 112, '文岭镇'),
	(35, 01, 82, 113, '梅花镇'),
	(35, 01, 82, 114, '潭头镇'),
	(35, 01, 82, 200, '罗联乡'),
	(35, 01, 82, 201, '猴屿乡');

/* 福建省 厦门市 思明区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 02, 03, 001, '厦港街道'),
	(35, 02, 03, 003, '中华街道'),
	(35, 02, 03, 005, '滨海街道'),
	(35, 02, 03, 006, '鹭江街道'),
	(35, 02, 03, 007, '开元街道'),
	(35, 02, 03, 008, '梧村街道'),
	(35, 02, 03, 009, '筼筜街道'),
	(35, 02, 03, 010, '莲前街道'),
	(35, 02, 03, 011, '嘉莲街道'),
	(35, 02, 03, 012, '鼓浪屿街道');

/* 福建省 厦门市 海沧区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 02, 05, 001, '海沧街道'),
	(35, 02, 05, 002, '新阳街道'),
	(35, 02, 05, 003, '嵩屿街道'),
	(35, 02, 05, 004, '东孚街道');

/* 福建省 厦门市 湖里区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 02, 06, 001, '湖里街道'),
	(35, 02, 06, 002, '殿前街道'),
	(35, 02, 06, 003, '禾山街道'),
	(35, 02, 06, 004, '江头街道'),
	(35, 02, 06, 005, '金山街道');

/* 福建省 厦门市 集美区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 02, 11, 001, '集美街道'),
	(35, 02, 11, 002, '侨英街道'),
	(35, 02, 11, 003, '杏林街道'),
	(35, 02, 11, 004, '杏滨街道'),
	(35, 02, 11, 102, '灌口镇'),
	(35, 02, 11, 103, '后溪镇');

/* 福建省 厦门市 同安区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 02, 12, 001, '大同街道'),
	(35, 02, 12, 002, '祥平街道'),
	(35, 02, 12, 105, '莲花镇'),
	(35, 02, 12, 106, '新民镇'),
	(35, 02, 12, 107, '洪塘镇'),
	(35, 02, 12, 108, '西柯镇'),
	(35, 02, 12, 109, '汀溪镇'),
	(35, 02, 12, 110, '五显镇');

/* 福建省 厦门市 翔安区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 02, 13, 001, '大嶝街道'),
	(35, 02, 13, 102, '马巷镇'),
	(35, 02, 13, 103, '新圩镇'),
	(35, 02, 13, 104, '新店镇'),
	(35, 02, 13, 111, '内厝镇');

/* 福建省 莆田市 城厢区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 03, 02, 001, '龙桥街道'),
	(35, 03, 02, 002, '凤凰山街道'),
	(35, 03, 02, 003, '霞林街道'),
	(35, 03, 02, 100, '常太镇'),
	(35, 03, 02, 101, '华亭镇'),
	(35, 03, 02, 102, '灵川镇'),
	(35, 03, 02, 103, '东海镇');

/* 福建省 莆田市 涵江区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 03, 03, 001, '涵东街道'),
	(35, 03, 03, 002, '涵西街道'),
	(35, 03, 03, 100, '三江口镇'),
	(35, 03, 03, 101, '白塘镇'),
	(35, 03, 03, 102, '国欢镇'),
	(35, 03, 03, 103, '梧塘镇'),
	(35, 03, 03, 104, '江口镇'),
	(35, 03, 03, 105, '萩芦镇'),
	(35, 03, 03, 106, '白沙镇'),
	(35, 03, 03, 107, '庄边镇'),
	(35, 03, 03, 108, '新县镇'),
	(35, 03, 03, 200, '大洋乡');

/* 福建省 莆田市 荔城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 03, 04, 001, '镇海街道'),
	(35, 03, 04, 002, '拱辰街道'),
	(35, 03, 04, 100, '西天尾镇'),
	(35, 03, 04, 101, '黄石镇'),
	(35, 03, 04, 102, '新度镇'),
	(35, 03, 04, 103, '北高镇');

/* 福建省 莆田市 秀屿区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 03, 05, 100, '笏石镇'),
	(35, 03, 05, 101, '东庄镇'),
	(35, 03, 05, 102, '忠门镇'),
	(35, 03, 05, 103, '东埔镇'),
	(35, 03, 05, 104, '东峤镇'),
	(35, 03, 05, 105, '埭头镇'),
	(35, 03, 05, 106, '平海镇'),
	(35, 03, 05, 107, '南日镇'),
	(35, 03, 05, 108, '湄洲镇'),
	(35, 03, 05, 109, '山亭镇'),
	(35, 03, 05, 200, '月塘乡');

/* 福建省 莆田市 仙游县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 03, 22, 001, '鲤城街道'),
	(35, 03, 22, 100, '枫亭镇'),
	(35, 03, 22, 101, '榜头镇'),
	(35, 03, 22, 102, '郊尾镇'),
	(35, 03, 22, 103, '度尾镇'),
	(35, 03, 22, 104, '鲤南镇'),
	(35, 03, 22, 105, '赖店镇'),
	(35, 03, 22, 106, '盖尾镇'),
	(35, 03, 22, 107, '园庄镇'),
	(35, 03, 22, 108, '大济镇'),
	(35, 03, 22, 109, '龙华镇'),
	(35, 03, 22, 110, '钟山镇'),
	(35, 03, 22, 111, '游洋镇'),
	(35, 03, 22, 200, '西苑乡'),
	(35, 03, 22, 201, '石苍乡'),
	(35, 03, 22, 202, '社硎乡'),
	(35, 03, 22, 203, '书峰乡'),
	(35, 03, 22, 204, '菜溪乡');

/* 福建省 三明市 梅列区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 02, 001, '列东街道'),
	(35, 04, 02, 002, '列西街道'),
	(35, 04, 02, 003, '徐碧街道'),
	(35, 04, 02, 100, '陈大镇'),
	(35, 04, 02, 101, '洋溪镇');

/* 福建省 三明市 三元区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 03, 001, '城关街道'),
	(35, 04, 03, 002, '白沙街道'),
	(35, 04, 03, 003, '富兴堡街道'),
	(35, 04, 03, 004, '荆西街道'),
	(35, 04, 03, 100, '莘口镇'),
	(35, 04, 03, 101, '岩前镇'),
	(35, 04, 03, 200, '城东乡'),
	(35, 04, 03, 201, '中村乡');

/* 福建省 三明市 明溪县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 21, 100, '雪峰镇'),
	(35, 04, 21, 101, '盖洋镇'),
	(35, 04, 21, 102, '胡坊镇'),
	(35, 04, 21, 103, '瀚仙镇'),
	(35, 04, 21, 200, '城关乡'),
	(35, 04, 21, 201, '沙溪乡'),
	(35, 04, 21, 202, '夏阳乡'),
	(35, 04, 21, 203, '枫溪乡'),
	(35, 04, 21, 204, '夏坊乡');

/* 福建省 三明市 清流县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 23, 100, '龙津镇'),
	(35, 04, 23, 101, '嵩溪镇'),
	(35, 04, 23, 102, '嵩口镇'),
	(35, 04, 23, 103, '灵地镇'),
	(35, 04, 23, 104, '长校镇'),
	(35, 04, 23, 201, '温郊乡'),
	(35, 04, 23, 202, '林畲乡'),
	(35, 04, 23, 203, '田源乡'),
	(35, 04, 23, 204, '沙芜乡'),
	(35, 04, 23, 205, '赖坊乡'),
	(35, 04, 23, 206, '余朋乡'),
	(35, 04, 23, 208, '李家乡'),
	(35, 04, 23, 209, '里田乡');

/* 福建省 三明市 宁化县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 24, 100, '翠江镇'),
	(35, 04, 24, 101, '泉上镇'),
	(35, 04, 24, 102, '湖村镇'),
	(35, 04, 24, 103, '石壁镇'),
	(35, 04, 24, 104, '曹坊镇'),
	(35, 04, 24, 105, '安远镇'),
	(35, 04, 24, 106, '淮土镇'),
	(35, 04, 24, 200, '城郊乡'),
	(35, 04, 24, 201, '城南乡'),
	(35, 04, 24, 202, '济村乡'),
	(35, 04, 24, 204, '方田乡'),
	(35, 04, 24, 205, '安乐乡'),
	(35, 04, 24, 207, '治平畲族乡'),
	(35, 04, 24, 208, '中沙乡'),
	(35, 04, 24, 209, '河龙乡'),
	(35, 04, 24, 210, '水茜乡');

/* 福建省 三明市 大田县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 25, 100, '均溪镇'),
	(35, 04, 25, 101, '石牌镇'),
	(35, 04, 25, 102, '上京镇'),
	(35, 04, 25, 103, '广平镇'),
	(35, 04, 25, 104, '桃源镇'),
	(35, 04, 25, 105, '太华镇'),
	(35, 04, 25, 106, '建设镇'),
	(35, 04, 25, 107, '奇韬镇'),
	(35, 04, 25, 200, '华兴乡'),
	(35, 04, 25, 201, '屏山乡'),
	(35, 04, 25, 202, '吴山乡'),
	(35, 04, 25, 203, '济阳乡'),
	(35, 04, 25, 204, '武陵乡'),
	(35, 04, 25, 205, '谢洋乡'),
	(35, 04, 25, 206, '文江乡'),
	(35, 04, 25, 207, '梅山乡'),
	(35, 04, 25, 208, '湖美乡'),
	(35, 04, 25, 209, '前坪乡');

/* 福建省 三明市 尤溪县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 26, 100, '城关镇'),
	(35, 04, 26, 101, '梅仙镇'),
	(35, 04, 26, 102, '西滨镇'),
	(35, 04, 26, 103, '洋中镇'),
	(35, 04, 26, 104, '新阳镇'),
	(35, 04, 26, 105, '管前镇'),
	(35, 04, 26, 106, '西城镇'),
	(35, 04, 26, 107, '尤溪口镇'),
	(35, 04, 26, 108, '坂面镇'),
	(35, 04, 26, 200, '联合乡'),
	(35, 04, 26, 201, '汤川乡'),
	(35, 04, 26, 202, '溪尾乡'),
	(35, 04, 26, 203, '中仙乡'),
	(35, 04, 26, 204, '台溪乡'),
	(35, 04, 26, 206, '八字桥乡');

/* 福建省 三明市 沙县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 27, 001, '凤岗街道'),
	(35, 04, 27, 002, '虬江街道'),
	(35, 04, 27, 101, '青州镇'),
	(35, 04, 27, 102, '夏茂镇'),
	(35, 04, 27, 104, '高砂镇'),
	(35, 04, 27, 105, '高桥镇'),
	(35, 04, 27, 106, '富口镇'),
	(35, 04, 27, 107, '大洛镇'),
	(35, 04, 27, 201, '南霞乡'),
	(35, 04, 27, 203, '南阳乡'),
	(35, 04, 27, 204, '郑湖乡'),
	(35, 04, 27, 205, '湖源乡');

/* 福建省 三明市 将乐县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 28, 100, '古镛镇'),
	(35, 04, 28, 101, '万安镇'),
	(35, 04, 28, 102, '高唐镇'),
	(35, 04, 28, 103, '白莲镇'),
	(35, 04, 28, 104, '黄潭镇'),
	(35, 04, 28, 105, '水南镇'),
	(35, 04, 28, 200, '光明乡'),
	(35, 04, 28, 201, '漠源乡'),
	(35, 04, 28, 202, '南口乡'),
	(35, 04, 28, 203, '万全乡'),
	(35, 04, 28, 204, '安仁乡'),
	(35, 04, 28, 205, '大源乡'),
	(35, 04, 28, 206, '余坊乡');

/* 福建省 三明市 泰宁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 29, 100, '杉城镇'),
	(35, 04, 29, 101, '朱口镇'),
	(35, 04, 29, 200, '新桥乡'),
	(35, 04, 29, 201, '上青乡'),
	(35, 04, 29, 202, '大田乡'),
	(35, 04, 29, 203, '梅口乡'),
	(35, 04, 29, 204, '下渠乡'),
	(35, 04, 29, 205, '开善乡'),
	(35, 04, 29, 208, '大龙乡');

/* 福建省 三明市 建宁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 30, 100, '濉溪镇'),
	(35, 04, 30, 101, '里心镇'),
	(35, 04, 30, 102, '溪口镇'),
	(35, 04, 30, 103, '均口镇'),
	(35, 04, 30, 201, '伊家乡'),
	(35, 04, 30, 202, '黄坊乡'),
	(35, 04, 30, 203, '溪源乡'),
	(35, 04, 30, 204, '客坊乡'),
	(35, 04, 30, 205, '黄埠乡');

/* 福建省 三明市 永安市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 04, 81, 001, '燕东街道'),
	(35, 04, 81, 002, '燕西街道'),
	(35, 04, 81, 003, '燕南街道'),
	(35, 04, 81, 004, '燕北街道'),
	(35, 04, 81, 100, '西洋镇'),
	(35, 04, 81, 101, '贡川镇'),
	(35, 04, 81, 102, '安砂镇'),
	(35, 04, 81, 103, '小陶镇'),
	(35, 04, 81, 104, '大湖镇'),
	(35, 04, 81, 105, '曹远镇'),
	(35, 04, 81, 106, '洪田镇'),
	(35, 04, 81, 107, '槐南镇'),
	(35, 04, 81, 202, '上坪乡'),
	(35, 04, 81, 203, '罗坊乡'),
	(35, 04, 81, 204, '青水乡');

/* 福建省 泉州市 鲤城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 02, 001, '海滨街道'),
	(35, 05, 02, 002, '临江街道'),
	(35, 05, 02, 003, '鲤中街道'),
	(35, 05, 02, 004, '开元街道'),
	(35, 05, 02, 005, '浮桥街道'),
	(35, 05, 02, 006, '江南街道'),
	(35, 05, 02, 007, '金龙街道'),
	(35, 05, 02, 008, '常泰街道');

/* 福建省 泉州市 丰泽区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 03, 001, '东湖街道'),
	(35, 05, 03, 002, '丰泽街道'),
	(35, 05, 03, 003, '泉秀街道'),
	(35, 05, 03, 004, '清源街道'),
	(35, 05, 03, 005, '华大街道'),
	(35, 05, 03, 006, '城东街道'),
	(35, 05, 03, 007, '东海街道'),
	(35, 05, 03, 008, '北峰街道');

/* 福建省 泉州市 洛江区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 04, 001, '万安街道'),
	(35, 05, 04, 002, '双阳街道'),
	(35, 05, 04, 100, '罗溪镇'),
	(35, 05, 04, 101, '马甲镇'),
	(35, 05, 04, 102, '河市镇'),
	(35, 05, 04, 200, '虹山乡');

/* 福建省 泉州市 泉港区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 05, 001, '山腰街道办事处'),
	(35, 05, 05, 100, '南埔镇'),
	(35, 05, 05, 101, '界山镇'),
	(35, 05, 05, 102, '后龙镇'),
	(35, 05, 05, 103, '峰尾镇'),
	(35, 05, 05, 105, '前黄镇'),
	(35, 05, 05, 106, '涂岭镇');

/* 福建省 泉州市 惠安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 21, 100, '螺城镇'),
	(35, 05, 21, 101, '螺阳镇'),
	(35, 05, 21, 102, '黄塘镇'),
	(35, 05, 21, 103, '紫山镇'),
	(35, 05, 21, 104, '洛阳镇'),
	(35, 05, 21, 105, '东园镇'),
	(35, 05, 21, 106, '张坂镇'),
	(35, 05, 21, 107, '崇武镇'),
	(35, 05, 21, 108, '山霞镇'),
	(35, 05, 21, 109, '涂寨镇'),
	(35, 05, 21, 110, '东岭镇'),
	(35, 05, 21, 111, '东桥镇'),
	(35, 05, 21, 112, '净峰镇'),
	(35, 05, 21, 113, '小岞镇'),
	(35, 05, 21, 114, '辋川镇'),
	(35, 05, 21, 200, '百崎回族乡');

/* 福建省 泉州市 安溪县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 24, 100, '凤城镇'),
	(35, 05, 24, 101, '蓬莱镇'),
	(35, 05, 24, 102, '湖头镇'),
	(35, 05, 24, 103, '官桥镇'),
	(35, 05, 24, 104, '剑斗镇'),
	(35, 05, 24, 105, '城厢镇'),
	(35, 05, 24, 106, '金谷镇'),
	(35, 05, 24, 107, '龙门镇'),
	(35, 05, 24, 108, '虎邱镇'),
	(35, 05, 24, 109, '芦田镇'),
	(35, 05, 24, 110, '感德镇'),
	(35, 05, 24, 111, '魁斗镇'),
	(35, 05, 24, 112, '西坪镇'),
	(35, 05, 24, 200, '参内乡'),
	(35, 05, 24, 201, '白濑乡'),
	(35, 05, 24, 202, '湖上乡'),
	(35, 05, 24, 203, '尚卿乡'),
	(35, 05, 24, 204, '大坪乡'),
	(35, 05, 24, 205, '龙涓乡'),
	(35, 05, 24, 206, '长坑乡'),
	(35, 05, 24, 207, '蓝田乡'),
	(35, 05, 24, 208, '祥华乡'),
	(35, 05, 24, 209, '桃舟乡'),
	(35, 05, 24, 210, '福田乡');

/* 福建省 泉州市 永春县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 25, 100, '桃城镇'),
	(35, 05, 25, 101, '五里街镇'),
	(35, 05, 25, 102, '一都镇'),
	(35, 05, 25, 103, '下洋镇'),
	(35, 05, 25, 104, '蓬壶镇'),
	(35, 05, 25, 105, '达埔镇'),
	(35, 05, 25, 106, '吾峰镇'),
	(35, 05, 25, 107, '石鼓镇'),
	(35, 05, 25, 108, '岵山镇'),
	(35, 05, 25, 109, '东平镇'),
	(35, 05, 25, 110, '湖洋镇'),
	(35, 05, 25, 111, '坑仔口镇'),
	(35, 05, 25, 112, '玉斗镇'),
	(35, 05, 25, 113, '锦斗镇'),
	(35, 05, 25, 114, '东关镇'),
	(35, 05, 25, 115, '桂洋镇'),
	(35, 05, 25, 116, '苏坑镇'),
	(35, 05, 25, 117, '仙夹镇'),
	(35, 05, 25, 200, '横口乡'),
	(35, 05, 25, 201, '呈祥乡'),
	(35, 05, 25, 202, '介福乡'),
	(35, 05, 25, 204, '外山乡');

/* 福建省 泉州市 德化县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 26, 100, '浔中镇'),
	(35, 05, 26, 101, '龙浔镇'),
	(35, 05, 26, 102, '三班镇'),
	(35, 05, 26, 103, '龙门滩镇'),
	(35, 05, 26, 104, '雷峰镇'),
	(35, 05, 26, 105, '南埕镇'),
	(35, 05, 26, 106, '水口镇'),
	(35, 05, 26, 107, '赤水镇'),
	(35, 05, 26, 108, '上涌镇'),
	(35, 05, 26, 109, '葛坑镇'),
	(35, 05, 26, 110, '盖德镇'),
	(35, 05, 26, 111, '美湖镇'),
	(35, 05, 26, 200, '杨梅乡'),
	(35, 05, 26, 202, '汤头乡'),
	(35, 05, 26, 204, '桂阳乡'),
	(35, 05, 26, 206, '国宝乡'),
	(35, 05, 26, 208, '大铭乡'),
	(35, 05, 26, 209, '春美乡');

/* 福建省 泉州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 27, 000, '金门县');

/* 福建省 泉州市 石狮市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 81, 001, '湖滨街道'),
	(35, 05, 81, 002, '凤里街道'),
	(35, 05, 81, 100, '灵秀镇'),
	(35, 05, 81, 101, '宝盖镇'),
	(35, 05, 81, 102, '蚶江镇'),
	(35, 05, 81, 103, '祥芝镇'),
	(35, 05, 81, 104, '鸿山镇'),
	(35, 05, 81, 105, '锦尚镇'),
	(35, 05, 81, 106, '永宁镇');

/* 福建省 泉州市 晋江市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 82, 001, '青阳街道办事处'),
	(35, 05, 82, 002, '梅岭街道办事处'),
	(35, 05, 82, 003, '西园街道办事处'),
	(35, 05, 82, 004, '罗山街道办事处'),
	(35, 05, 82, 005, '新塘街道办事处'),
	(35, 05, 82, 006, '灵源街道办事处'),
	(35, 05, 82, 101, '安海镇'),
	(35, 05, 82, 102, '磁灶镇'),
	(35, 05, 82, 103, '陈埭镇'),
	(35, 05, 82, 104, '东石镇'),
	(35, 05, 82, 105, '深沪镇'),
	(35, 05, 82, 106, '金井镇'),
	(35, 05, 82, 107, '池店镇'),
	(35, 05, 82, 109, '内坑镇'),
	(35, 05, 82, 110, '龙湖镇'),
	(35, 05, 82, 111, '永和镇'),
	(35, 05, 82, 112, '英林镇'),
	(35, 05, 82, 113, '紫帽镇'),
	(35, 05, 82, 114, '西滨镇');

/* 福建省 泉州市 南安市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 05, 83, 001, '溪美街道'),
	(35, 05, 83, 002, '柳城街道'),
	(35, 05, 83, 003, '美林街道'),
	(35, 05, 83, 100, '省新镇'),
	(35, 05, 83, 101, '仑苍镇'),
	(35, 05, 83, 102, '东田镇'),
	(35, 05, 83, 103, '英都镇'),
	(35, 05, 83, 104, '翔云镇'),
	(35, 05, 83, 105, '金淘镇'),
	(35, 05, 83, 106, '诗山镇'),
	(35, 05, 83, 107, '蓬华镇'),
	(35, 05, 83, 108, '码头镇'),
	(35, 05, 83, 109, '九都镇'),
	(35, 05, 83, 110, '乐峰镇'),
	(35, 05, 83, 111, '罗东镇'),
	(35, 05, 83, 112, '梅山镇'),
	(35, 05, 83, 113, '洪濑镇'),
	(35, 05, 83, 114, '洪梅镇'),
	(35, 05, 83, 115, '康美镇'),
	(35, 05, 83, 116, '丰州镇'),
	(35, 05, 83, 117, '霞美镇'),
	(35, 05, 83, 118, '官桥镇'),
	(35, 05, 83, 119, '水头镇'),
	(35, 05, 83, 120, '石井镇'),
	(35, 05, 83, 200, '眉山乡'),
	(35, 05, 83, 201, '向阳乡');

/* 福建省 漳州市 芗城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 06, 02, 001, '东铺头街道'),
	(35, 06, 02, 002, '西桥街道'),
	(35, 06, 02, 003, '新桥街道'),
	(35, 06, 02, 004, '巷口街道'),
	(35, 06, 02, 005, '南坑街道'),
	(35, 06, 02, 006, '通北街道'),
	(35, 06, 02, 100, '浦南镇'),
	(35, 06, 02, 101, '天宝镇'),
	(35, 06, 02, 102, '芝山镇'),
	(35, 06, 02, 103, '石亭镇');

/* 福建省 漳州市 龙文区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 06, 03, 100, '蓝田镇'),
	(35, 06, 03, 101, '步文镇'),
	(35, 06, 03, 102, '朝阳镇'),
	(35, 06, 03, 103, '郭坑镇');

/* 福建省 漳州市 云霄县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 06, 22, 100, '云陵镇'),
	(35, 06, 22, 101, '陈岱镇'),
	(35, 06, 22, 102, '东厦镇'),
	(35, 06, 22, 103, '莆美镇'),
	(35, 06, 22, 104, '列屿镇'),
	(35, 06, 22, 105, '火田镇'),
	(35, 06, 22, 200, '下河乡'),
	(35, 06, 22, 201, '马铺乡'),
	(35, 06, 22, 202, '和平乡');

/* 福建省 漳州市 漳浦县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 06, 23, 100, '绥安镇'),
	(35, 06, 23, 101, '旧镇镇'),
	(35, 06, 23, 102, '佛昙镇'),
	(35, 06, 23, 103, '赤湖镇'),
	(35, 06, 23, 104, '杜浔镇'),
	(35, 06, 23, 105, '霞美镇'),
	(35, 06, 23, 106, '官浔镇'),
	(35, 06, 23, 107, '石榴镇'),
	(35, 06, 23, 108, '盘陀镇'),
	(35, 06, 23, 109, '长桥镇'),
	(35, 06, 23, 110, '前亭镇'),
	(35, 06, 23, 111, '马坪镇'),
	(35, 06, 23, 112, '深土镇'),
	(35, 06, 23, 113, '六鳌镇'),
	(35, 06, 23, 114, '沙西镇'),
	(35, 06, 23, 115, '古雷镇'),
	(35, 06, 23, 116, '大南坂镇'),
	(35, 06, 23, 200, '南浦乡'),
	(35, 06, 23, 201, '赤岭畲族乡'),
	(35, 06, 23, 202, '湖西畲族乡'),
	(35, 06, 23, 203, '赤土乡');

/* 福建省 漳州市 诏安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 06, 24, 100, '南诏镇'),
	(35, 06, 24, 101, '四都镇'),
	(35, 06, 24, 102, '梅岭镇'),
	(35, 06, 24, 103, '桥东镇'),
	(35, 06, 24, 104, '深桥镇'),
	(35, 06, 24, 105, '太平镇'),
	(35, 06, 24, 106, '霞葛镇'),
	(35, 06, 24, 107, '官陂镇'),
	(35, 06, 24, 108, '秀篆镇'),
	(35, 06, 24, 200, '金星乡'),
	(35, 06, 24, 201, '西潭乡'),
	(35, 06, 24, 202, '白洋乡'),
	(35, 06, 24, 203, '建设乡'),
	(35, 06, 24, 204, '红星乡'),
	(35, 06, 24, 205, '梅洲乡');

/* 福建省 漳州市 长泰县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 06, 25, 100, '武安镇'),
	(35, 06, 25, 101, '岩溪镇'),
	(35, 06, 25, 102, '陈巷镇'),
	(35, 06, 25, 103, '枋洋镇'),
	(35, 06, 25, 200, '坂里乡');

/* 福建省 漳州市 东山县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 06, 26, 100, '西埔镇'),
	(35, 06, 26, 101, '樟塘镇'),
	(35, 06, 26, 102, '康美镇'),
	(35, 06, 26, 103, '杏陈镇'),
	(35, 06, 26, 104, '陈城镇'),
	(35, 06, 26, 105, '前楼镇'),
	(35, 06, 26, 106, '铜陵镇');

/* 福建省 漳州市 南靖县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 06, 27, 100, '山城镇'),
	(35, 06, 27, 101, '丰田镇'),
	(35, 06, 27, 102, '靖城镇'),
	(35, 06, 27, 103, '龙山镇'),
	(35, 06, 27, 104, '金山镇'),
	(35, 06, 27, 105, '和溪镇'),
	(35, 06, 27, 106, '奎洋镇'),
	(35, 06, 27, 107, '梅林镇'),
	(35, 06, 27, 108, '书洋镇'),
	(35, 06, 27, 109, '船场镇'),
	(35, 06, 27, 110, '南坑镇');

/* 福建省 漳州市 平和县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 06, 28, 100, '小溪镇'),
	(35, 06, 28, 101, '山格镇'),
	(35, 06, 28, 102, '文峰镇'),
	(35, 06, 28, 103, '南胜镇'),
	(35, 06, 28, 104, '坂仔镇'),
	(35, 06, 28, 105, '安厚镇'),
	(35, 06, 28, 106, '大溪镇'),
	(35, 06, 28, 107, '霞寨镇'),
	(35, 06, 28, 108, '九峰镇'),
	(35, 06, 28, 109, '芦溪镇'),
	(35, 06, 28, 200, '五寨乡'),
	(35, 06, 28, 201, '国强乡'),
	(35, 06, 28, 202, '崎岭乡'),
	(35, 06, 28, 203, '长乐乡'),
	(35, 06, 28, 204, '秀峰乡');

/* 福建省 漳州市 华安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 06, 29, 100, '华丰镇'),
	(35, 06, 29, 101, '丰山镇'),
	(35, 06, 29, 102, '沙建镇'),
	(35, 06, 29, 103, '新圩镇'),
	(35, 06, 29, 104, '高安镇'),
	(35, 06, 29, 105, '仙都镇'),
	(35, 06, 29, 200, '高车乡'),
	(35, 06, 29, 201, '马坑乡'),
	(35, 06, 29, 203, '湖林乡');

/* 福建省 漳州市 龙海市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 06, 81, 100, '石码镇'),
	(35, 06, 81, 101, '海澄镇'),
	(35, 06, 81, 102, '角美镇'),
	(35, 06, 81, 103, '白水镇'),
	(35, 06, 81, 104, '浮宫镇'),
	(35, 06, 81, 105, '程溪镇'),
	(35, 06, 81, 106, '港尾镇'),
	(35, 06, 81, 107, '九湖镇'),
	(35, 06, 81, 108, '颜厝镇'),
	(35, 06, 81, 109, '榜山镇'),
	(35, 06, 81, 110, '紫泥镇'),
	(35, 06, 81, 111, '东园镇'),
	(35, 06, 81, 200, '东泗乡'),
	(35, 06, 81, 201, '隆教畲族乡');

/* 福建省 南平市 延平区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 07, 02, 001, '梅山街道'),
	(35, 07, 02, 002, '黄墩街道'),
	(35, 07, 02, 003, '紫云街道'),
	(35, 07, 02, 004, '四鹤街道'),
	(35, 07, 02, 005, '水南街道'),
	(35, 07, 02, 006, '水东街道'),
	(35, 07, 02, 100, '来舟镇'),
	(35, 07, 02, 101, '樟湖镇'),
	(35, 07, 02, 102, '夏道镇'),
	(35, 07, 02, 103, '西芹镇'),
	(35, 07, 02, 104, '峡阳镇'),
	(35, 07, 02, 105, '南山镇'),
	(35, 07, 02, 106, '大横镇'),
	(35, 07, 02, 107, '王台镇'),
	(35, 07, 02, 108, '太平镇'),
	(35, 07, 02, 109, '塔前镇'),
	(35, 07, 02, 110, '茫荡镇'),
	(35, 07, 02, 111, '洋后镇'),
	(35, 07, 02, 112, '炉下镇'),
	(35, 07, 02, 200, '巨口乡'),
	(35, 07, 02, 202, '赤门乡');

/* 福建省 南平市 建阳区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 07, 03, 001, '潭城街道'),
	(35, 07, 03, 002, '童游街道'),
	(35, 07, 03, 102, '将口镇'),
	(35, 07, 03, 103, '徐市镇'),
	(35, 07, 03, 104, '莒口镇'),
	(35, 07, 03, 105, '麻沙镇'),
	(35, 07, 03, 106, '黄坑镇'),
	(35, 07, 03, 107, '水吉镇'),
	(35, 07, 03, 108, '漳墩镇'),
	(35, 07, 03, 109, '小湖镇'),
	(35, 07, 03, 200, '崇雒乡'),
	(35, 07, 03, 201, '书坊乡'),
	(35, 07, 03, 202, '回龙乡');

/* 福建省 南平市 顺昌县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 07, 21, 001, '双溪街道'),
	(35, 07, 21, 100, '建西镇'),
	(35, 07, 21, 101, '洋口镇'),
	(35, 07, 21, 102, '元坑镇'),
	(35, 07, 21, 103, '埔上镇'),
	(35, 07, 21, 104, '大历镇'),
	(35, 07, 21, 105, '大干镇'),
	(35, 07, 21, 106, '仁寿镇'),
	(35, 07, 21, 107, '郑坊镇'),
	(35, 07, 21, 200, '洋墩乡'),
	(35, 07, 21, 202, '岚下乡'),
	(35, 07, 21, 203, '高阳乡');

/* 福建省 南平市 浦城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 07, 22, 001, '南浦街道'),
	(35, 07, 22, 002, '河滨街道'),
	(35, 07, 22, 101, '富岭镇'),
	(35, 07, 22, 102, '石陂镇'),
	(35, 07, 22, 103, '临江镇'),
	(35, 07, 22, 104, '仙阳镇'),
	(35, 07, 22, 105, '水北街镇'),
	(35, 07, 22, 106, '永兴镇'),
	(35, 07, 22, 107, '忠信镇'),
	(35, 07, 22, 108, '莲塘镇'),
	(35, 07, 22, 109, '九牧镇'),
	(35, 07, 22, 200, '万安乡'),
	(35, 07, 22, 201, '古楼乡'),
	(35, 07, 22, 202, '山下乡'),
	(35, 07, 22, 203, '枫溪乡'),
	(35, 07, 22, 204, '濠村乡'),
	(35, 07, 22, 205, '管厝乡'),
	(35, 07, 22, 206, '盘亭乡'),
	(35, 07, 22, 207, '官路乡');

/* 福建省 南平市 光泽县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 07, 23, 100, '杭川镇'),
	(35, 07, 23, 101, '寨里镇'),
	(35, 07, 23, 102, '止马镇'),
	(35, 07, 23, 200, '鸾风乡'),
	(35, 07, 23, 201, '崇仁乡'),
	(35, 07, 23, 202, '李坊乡'),
	(35, 07, 23, 203, '华桥乡'),
	(35, 07, 23, 204, '司前乡');

/* 福建省 南平市 松溪县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 07, 24, 001, '松源街道'),
	(35, 07, 24, 101, '郑墩镇'),
	(35, 07, 24, 102, '渭田镇'),
	(35, 07, 24, 200, '河东乡'),
	(35, 07, 24, 201, '茶平乡'),
	(35, 07, 24, 202, '旧县乡'),
	(35, 07, 24, 203, '溪东乡'),
	(35, 07, 24, 204, '花桥乡'),
	(35, 07, 24, 205, '祖墩乡');

/* 福建省 南平市 政和县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 07, 25, 001, '熊山街道'),
	(35, 07, 25, 101, '东平镇'),
	(35, 07, 25, 102, '石屯镇'),
	(35, 07, 25, 103, '铁山镇'),
	(35, 07, 25, 104, '镇前镇'),
	(35, 07, 25, 200, '星溪乡'),
	(35, 07, 25, 201, '外屯乡'),
	(35, 07, 25, 202, '杨源乡'),
	(35, 07, 25, 203, '澄源乡'),
	(35, 07, 25, 204, '岭腰乡');

/* 福建省 南平市 邵武市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 07, 81, 001, '昭阳街道办事处'),
	(35, 07, 81, 002, '通泰街道办事处'),
	(35, 07, 81, 003, '水北街道办事处'),
	(35, 07, 81, 004, '晒口街道办事处'),
	(35, 07, 81, 100, '城郊镇'),
	(35, 07, 81, 101, '水北镇'),
	(35, 07, 81, 102, '下沙镇'),
	(35, 07, 81, 103, '卫闽镇'),
	(35, 07, 81, 104, '沿山镇'),
	(35, 07, 81, 105, '拿口镇'),
	(35, 07, 81, 106, '洪墩镇'),
	(35, 07, 81, 107, '大埠岗镇'),
	(35, 07, 81, 108, '和平镇'),
	(35, 07, 81, 109, '肖家坊镇'),
	(35, 07, 81, 110, '大竹镇'),
	(35, 07, 81, 111, '吴家塘镇'),
	(35, 07, 81, 200, '桂林乡'),
	(35, 07, 81, 201, '张厝乡'),
	(35, 07, 81, 202, '金坑乡');

/* 福建省 南平市 武夷山市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 07, 82, 001, '崇安街道'),
	(35, 07, 82, 002, '新丰街道'),
	(35, 07, 82, 003, '武夷街道'),
	(35, 07, 82, 100, '星村镇'),
	(35, 07, 82, 101, '兴田镇'),
	(35, 07, 82, 102, '五夫镇'),
	(35, 07, 82, 200, '上梅乡'),
	(35, 07, 82, 201, '吴屯乡'),
	(35, 07, 82, 202, '岚谷乡'),
	(35, 07, 82, 203, '洋庄乡');

/* 福建省 南平市 建瓯市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 07, 83, 001, '建安街道'),
	(35, 07, 83, 002, '通济街道'),
	(35, 07, 83, 003, '瓯宁街道'),
	(35, 07, 83, 004, '芝山街道'),
	(35, 07, 83, 100, '徐墩镇'),
	(35, 07, 83, 101, '吉阳镇'),
	(35, 07, 83, 102, '房道镇'),
	(35, 07, 83, 103, '南雅镇'),
	(35, 07, 83, 104, '迪口镇'),
	(35, 07, 83, 105, '小桥镇'),
	(35, 07, 83, 106, '玉山镇'),
	(35, 07, 83, 107, '东游镇'),
	(35, 07, 83, 108, '东峰镇'),
	(35, 07, 83, 109, '小松镇'),
	(35, 07, 83, 200, '顺阳乡'),
	(35, 07, 83, 201, '水源乡'),
	(35, 07, 83, 202, '川石乡'),
	(35, 07, 83, 203, '龙村乡');

/* 福建省 龙岩市 新罗区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 08, 02, 001, '东城街道'),
	(35, 08, 02, 002, '南城街道'),
	(35, 08, 02, 003, '西城街道'),
	(35, 08, 02, 004, '中城街道'),
	(35, 08, 02, 005, '西陂街道'),
	(35, 08, 02, 006, '曹溪街道'),
	(35, 08, 02, 007, '东肖街道'),
	(35, 08, 02, 008, '龙门街道'),
	(35, 08, 02, 009, '铁山街道'),
	(35, 08, 02, 010, '北城街道'),
	(35, 08, 02, 100, '红坊镇'),
	(35, 08, 02, 101, '适中镇'),
	(35, 08, 02, 102, '雁石镇'),
	(35, 08, 02, 103, '白沙镇'),
	(35, 08, 02, 104, '万安镇'),
	(35, 08, 02, 105, '大池镇'),
	(35, 08, 02, 106, '小池镇'),
	(35, 08, 02, 107, '江山镇'),
	(35, 08, 02, 108, '岩山镇'),
	(35, 08, 02, 109, '苏坂镇');

/* 福建省 龙岩市 永定区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 08, 03, 001, '凤城街道办事处'),
	(35, 08, 03, 101, '坎市镇'),
	(35, 08, 03, 102, '下洋镇'),
	(35, 08, 03, 103, '湖雷镇'),
	(35, 08, 03, 104, '高陂镇'),
	(35, 08, 03, 105, '抚市镇'),
	(35, 08, 03, 106, '湖坑镇'),
	(35, 08, 03, 107, '培丰镇'),
	(35, 08, 03, 108, '龙潭镇'),
	(35, 08, 03, 109, '峰市镇'),
	(35, 08, 03, 110, '城郊镇'),
	(35, 08, 03, 111, '仙师镇'),
	(35, 08, 03, 112, '虎岗镇'),
	(35, 08, 03, 201, '西溪乡'),
	(35, 08, 03, 202, '金砂乡'),
	(35, 08, 03, 204, '洪山乡'),
	(35, 08, 03, 205, '湖山乡'),
	(35, 08, 03, 206, '岐岭乡'),
	(35, 08, 03, 207, '古竹乡'),
	(35, 08, 03, 208, '堂堡乡'),
	(35, 08, 03, 209, '合溪乡'),
	(35, 08, 03, 211, '大溪乡'),
	(35, 08, 03, 212, '陈东乡'),
	(35, 08, 03, 213, '高头乡');

/* 福建省 龙岩市 长汀县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 08, 21, 100, '汀州镇'),
	(35, 08, 21, 101, '大同镇'),
	(35, 08, 21, 102, '古城镇'),
	(35, 08, 21, 103, '新桥镇'),
	(35, 08, 21, 104, '馆前镇'),
	(35, 08, 21, 105, '童坊镇'),
	(35, 08, 21, 106, '河田镇'),
	(35, 08, 21, 107, '南山镇'),
	(35, 08, 21, 108, '濯田镇'),
	(35, 08, 21, 109, '四都镇'),
	(35, 08, 21, 110, '涂坊镇'),
	(35, 08, 21, 111, '策武镇'),
	(35, 08, 21, 112, '三洲镇'),
	(35, 08, 21, 201, '铁长乡'),
	(35, 08, 21, 202, '庵杰乡'),
	(35, 08, 21, 204, '宣成乡'),
	(35, 08, 21, 205, '红山乡'),
	(35, 08, 21, 206, '羊牯乡');

/* 福建省 龙岩市 上杭县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 08, 23, 100, '临江镇'),
	(35, 08, 23, 101, '临城镇'),
	(35, 08, 23, 102, '中都镇'),
	(35, 08, 23, 103, '蓝溪镇'),
	(35, 08, 23, 104, '稔田镇'),
	(35, 08, 23, 105, '白砂镇'),
	(35, 08, 23, 106, '古田镇'),
	(35, 08, 23, 107, '才溪镇'),
	(35, 08, 23, 108, '南阳镇'),
	(35, 08, 23, 109, '蛟洋镇'),
	(35, 08, 23, 110, '旧县镇'),
	(35, 08, 23, 111, '湖洋镇'),
	(35, 08, 23, 112, '溪口镇'),
	(35, 08, 23, 113, '太拔镇'),
	(35, 08, 23, 114, '通贤镇'),
	(35, 08, 23, 115, '下都镇'),
	(35, 08, 23, 116, '茶地镇'),
	(35, 08, 23, 202, '庐丰畲族乡'),
	(35, 08, 23, 206, '泮境乡'),
	(35, 08, 23, 208, '步云乡'),
	(35, 08, 23, 211, '官庄畲族乡'),
	(35, 08, 23, 212, '珊瑚乡');

/* 福建省 龙岩市 武平县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 08, 24, 100, '平川镇'),
	(35, 08, 24, 101, '中山镇'),
	(35, 08, 24, 102, '岩前镇'),
	(35, 08, 24, 103, '十方镇'),
	(35, 08, 24, 104, '中堡镇'),
	(35, 08, 24, 105, '桃溪镇'),
	(35, 08, 24, 106, '城厢镇'),
	(35, 08, 24, 107, '东留镇'),
	(35, 08, 24, 108, '武东镇'),
	(35, 08, 24, 109, '万安镇'),
	(35, 08, 24, 110, '永平镇'),
	(35, 08, 24, 111, '象洞镇'),
	(35, 08, 24, 203, '民主乡'),
	(35, 08, 24, 204, '下坝乡'),
	(35, 08, 24, 205, '中赤乡'),
	(35, 08, 24, 209, '湘店乡'),
	(35, 08, 24, 210, '大禾乡');

/* 福建省 龙岩市 连城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 08, 25, 100, '莲峰镇'),
	(35, 08, 25, 101, '北团镇'),
	(35, 08, 25, 102, '姑田镇'),
	(35, 08, 25, 103, '朋口镇'),
	(35, 08, 25, 104, '莒溪镇'),
	(35, 08, 25, 105, '新泉镇'),
	(35, 08, 25, 106, '庙前镇'),
	(35, 08, 25, 107, '文亨镇'),
	(35, 08, 25, 200, '揭乐乡'),
	(35, 08, 25, 201, '塘前乡'),
	(35, 08, 25, 202, '隔川乡'),
	(35, 08, 25, 203, '四堡乡'),
	(35, 08, 25, 204, '罗坊乡'),
	(35, 08, 25, 205, '林坊乡'),
	(35, 08, 25, 208, '曲溪乡'),
	(35, 08, 25, 209, '赖源乡'),
	(35, 08, 25, 210, '宣和乡');

/* 福建省 龙岩市 漳平市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 08, 81, 001, '菁城街道'),
	(35, 08, 81, 002, '桂林街道'),
	(35, 08, 81, 100, '新桥镇'),
	(35, 08, 81, 101, '双洋镇'),
	(35, 08, 81, 102, '永福镇'),
	(35, 08, 81, 103, '溪南镇'),
	(35, 08, 81, 104, '和平镇'),
	(35, 08, 81, 105, '拱桥镇'),
	(35, 08, 81, 106, '象湖镇'),
	(35, 08, 81, 107, '赤水镇'),
	(35, 08, 81, 108, '西园镇'),
	(35, 08, 81, 109, '南洋镇'),
	(35, 08, 81, 110, '芦芝镇'),
	(35, 08, 81, 203, '官田乡'),
	(35, 08, 81, 204, '吾祠乡'),
	(35, 08, 81, 205, '灵地乡');

/* 福建省 宁德市 蕉城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 09, 02, 001, '蕉南街道'),
	(35, 09, 02, 002, '蕉北街道'),
	(35, 09, 02, 100, '城南镇'),
	(35, 09, 02, 101, '漳湾镇'),
	(35, 09, 02, 102, '七都镇'),
	(35, 09, 02, 103, '八都镇'),
	(35, 09, 02, 104, '九都镇'),
	(35, 09, 02, 105, '霍童镇'),
	(35, 09, 02, 106, '赤溪镇'),
	(35, 09, 02, 107, '洋中镇'),
	(35, 09, 02, 108, '飞鸾镇'),
	(35, 09, 02, 109, '三都镇'),
	(35, 09, 02, 200, '金涵畲族乡'),
	(35, 09, 02, 201, '洪口乡'),
	(35, 09, 02, 202, '石后乡'),
	(35, 09, 02, 203, '虎贝乡');

/* 福建省 宁德市 霞浦县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 09, 21, 001, '松城街道'),
	(35, 09, 21, 002, '松港街道'),
	(35, 09, 21, 101, '长春镇'),
	(35, 09, 21, 102, '牙城镇'),
	(35, 09, 21, 103, '溪南镇'),
	(35, 09, 21, 104, '沙江镇'),
	(35, 09, 21, 105, '下浒镇'),
	(35, 09, 21, 106, '三沙镇'),
	(35, 09, 21, 200, '盐田畲族乡'),
	(35, 09, 21, 201, '水门畲族乡'),
	(35, 09, 21, 202, '崇儒畲族乡'),
	(35, 09, 21, 203, '柏洋乡'),
	(35, 09, 21, 204, '北壁乡'),
	(35, 09, 21, 205, '海岛乡');

/* 福建省 宁德市 古田县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 09, 22, 001, '城东街道办事处'),
	(35, 09, 22, 002, '城西街道办事处'),
	(35, 09, 22, 101, '平湖镇'),
	(35, 09, 22, 102, '大桥镇'),
	(35, 09, 22, 103, '黄田镇'),
	(35, 09, 22, 104, '鹤塘镇'),
	(35, 09, 22, 105, '杉洋镇'),
	(35, 09, 22, 106, '凤都镇'),
	(35, 09, 22, 107, '水口镇'),
	(35, 09, 22, 108, '大甲镇'),
	(35, 09, 22, 201, '吉巷乡'),
	(35, 09, 22, 203, '泮洋乡'),
	(35, 09, 22, 204, '凤埔乡'),
	(35, 09, 22, 205, '卓洋乡');

/* 福建省 宁德市 屏南县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 09, 23, 100, '古峰镇'),
	(35, 09, 23, 101, '双溪镇'),
	(35, 09, 23, 102, '黛溪镇'),
	(35, 09, 23, 103, '长桥镇'),
	(35, 09, 23, 200, '屏城乡'),
	(35, 09, 23, 201, '棠口乡'),
	(35, 09, 23, 202, '甘棠乡'),
	(35, 09, 23, 203, '熙岭乡'),
	(35, 09, 23, 204, '路下乡'),
	(35, 09, 23, 205, '寿山乡'),
	(35, 09, 23, 206, '岭下乡');

/* 福建省 宁德市 寿宁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 09, 24, 100, '鳌阳镇'),
	(35, 09, 24, 101, '斜滩镇'),
	(35, 09, 24, 102, '南阳镇'),
	(35, 09, 24, 103, '武曲镇'),
	(35, 09, 24, 104, '犀溪镇'),
	(35, 09, 24, 105, '平溪镇'),
	(35, 09, 24, 200, '大安乡'),
	(35, 09, 24, 201, '坑底乡'),
	(35, 09, 24, 202, '清源乡'),
	(35, 09, 24, 203, '竹管垅乡'),
	(35, 09, 24, 205, '芹洋乡'),
	(35, 09, 24, 206, '托溪乡'),
	(35, 09, 24, 208, '凤阳乡'),
	(35, 09, 24, 209, '下党乡');

/* 福建省 宁德市 周宁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 09, 25, 100, '狮城镇'),
	(35, 09, 25, 101, '咸村镇'),
	(35, 09, 25, 102, '浦源镇'),
	(35, 09, 25, 103, '七步镇'),
	(35, 09, 25, 104, '李墩镇'),
	(35, 09, 25, 105, '纯池镇'),
	(35, 09, 25, 200, '泗桥乡'),
	(35, 09, 25, 201, '礼门乡'),
	(35, 09, 25, 202, '玛坑乡');

/* 福建省 宁德市 柘荣县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 09, 26, 100, '双城镇'),
	(35, 09, 26, 101, '富溪镇'),
	(35, 09, 26, 200, '城郊乡'),
	(35, 09, 26, 201, '乍洋乡'),
	(35, 09, 26, 202, '东源乡'),
	(35, 09, 26, 203, '黄柏乡'),
	(35, 09, 26, 204, '宅中乡'),
	(35, 09, 26, 205, '楮坪乡'),
	(35, 09, 26, 206, '英山乡');

/* 福建省 宁德市 福安市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 09, 81, 001, '城南街道'),
	(35, 09, 81, 002, '城北街道'),
	(35, 09, 81, 003, '阳头街道'),
	(35, 09, 81, 004, '罗江街道办事处'),
	(35, 09, 81, 100, '赛岐镇'),
	(35, 09, 81, 101, '穆阳镇'),
	(35, 09, 81, 102, '上白石镇'),
	(35, 09, 81, 103, '潭头镇'),
	(35, 09, 81, 104, '社口镇'),
	(35, 09, 81, 105, '晓阳镇'),
	(35, 09, 81, 106, '溪潭镇'),
	(35, 09, 81, 107, '甘棠镇'),
	(35, 09, 81, 108, '下白石镇'),
	(35, 09, 81, 109, '溪尾镇'),
	(35, 09, 81, 110, '溪柄镇'),
	(35, 09, 81, 111, '湾坞镇'),
	(35, 09, 81, 112, '城阳镇'),
	(35, 09, 81, 201, '坂中畲族乡'),
	(35, 09, 81, 202, '范坑乡'),
	(35, 09, 81, 203, '穆云畲族乡'),
	(35, 09, 81, 204, '康厝畲族乡'),
	(35, 09, 81, 206, '松罗乡');

/* 福建省 宁德市 福鼎市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(35, 09, 82, 001, '桐山街道'),
	(35, 09, 82, 002, '桐城街道'),
	(35, 09, 82, 003, '山前街道'),
	(35, 09, 82, 100, '贯岭镇'),
	(35, 09, 82, 101, '前岐镇'),
	(35, 09, 82, 102, '沙埕镇'),
	(35, 09, 82, 103, '店下镇'),
	(35, 09, 82, 104, '太姥山镇'),
	(35, 09, 82, 105, '磻溪镇'),
	(35, 09, 82, 106, '白琳镇'),
	(35, 09, 82, 107, '点头镇'),
	(35, 09, 82, 108, '管阳镇'),
	(35, 09, 82, 109, '嵛山镇'),
	(35, 09, 82, 200, '硖门畲族乡'),
	(35, 09, 82, 201, '叠石乡'),
	(35, 09, 82, 202, '佳阳乡');


/* 江西省 南昌市 东湖区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 01, 02, 001, '公园街道办事处'),
	(36, 01, 02, 002, '滕王阁街道办事处'),
	(36, 01, 02, 003, '八一桥街道办事处'),
	(36, 01, 02, 004, '百花洲街道办事处'),
	(36, 01, 02, 005, '墩子塘街道办事处'),
	(36, 01, 02, 006, '大院街道办事处'),
	(36, 01, 02, 007, '豫章街道办事处'),
	(36, 01, 02, 008, '董家窑街道办事处'),
	(36, 01, 02, 009, '彭家桥街道办事处'),
	(36, 01, 02, 050, '沙井街道办事处（红谷滩新区）'),
	(36, 01, 02, 100, '扬子洲镇');

/* 江西省 南昌市 西湖区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 01, 03, 001, '南浦街道办事处'),
	(36, 01, 03, 002, '朝阳洲街道办事处'),
	(36, 01, 03, 004, '广润门街道办事处'),
	(36, 01, 03, 005, '西湖街道办事处'),
	(36, 01, 03, 006, '系马桩街道办事处'),
	(36, 01, 03, 007, '绳金塔街道办事处'),
	(36, 01, 03, 009, '丁公路街道办事处'),
	(36, 01, 03, 010, '南站街道办事处'),
	(36, 01, 03, 011, '桃源街道办事处'),
	(36, 01, 03, 012, '十字街街道办事处'),
	(36, 01, 03, 101, '桃花镇');

/* 江西省 南昌市 青云谱区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 01, 04, 002, '洪都街道办事处'),
	(36, 01, 04, 006, '京山街道办事处'),
	(36, 01, 04, 007, '三家店街道办事处'),
	(36, 01, 04, 008, '岱山街道办事处'),
	(36, 01, 04, 009, '徐家坊街道办事处'),
	(36, 01, 04, 100, '青云谱镇');

/* 江西省 南昌市 湾里区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 01, 05, 001, '站前街道办事处'),
	(36, 01, 05, 002, '幸福街道办事处'),
	(36, 01, 05, 100, '招贤镇'),
	(36, 01, 05, 101, '梅岭镇'),
	(36, 01, 05, 102, '罗亭镇'),
	(36, 01, 05, 103, '太平镇');

/* 江西省 南昌市 青山湖区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 01, 11, 001, '青山路街道办事处'),
	(36, 01, 11, 003, '上海路街道办事处'),
	(36, 01, 11, 004, '南钢街道办事处'),
	(36, 01, 11, 100, '京东镇'),
	(36, 01, 11, 103, '罗家镇'),
	(36, 01, 11, 104, '湖坊镇'),
	(36, 01, 11, 105, '塘山镇'),
	(36, 01, 11, 180, '蛟桥镇（南昌经济技术开发区）');

/* 江西省 南昌市 新建区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 01, 12, 100, '长堎镇'),
	(36, 01, 12, 101, '望城镇'),
	(36, 01, 12, 102, '生米镇（红谷滩新区）'),
	(36, 01, 12, 103, '西山镇'),
	(36, 01, 12, 104, '石岗镇'),
	(36, 01, 12, 105, '松湖镇'),
	(36, 01, 12, 106, '樵舍镇'),
	(36, 01, 12, 107, '乐化镇'),
	(36, 01, 12, 108, '溪霞镇'),
	(36, 01, 12, 109, '象山镇'),
	(36, 01, 12, 110, '石埠镇'),
	(36, 01, 12, 111, '联圩镇'),
	(36, 01, 12, 112, '流湖镇'),
	(36, 01, 12, 202, '厚田乡'),
	(36, 01, 12, 204, '金桥乡'),
	(36, 01, 12, 205, '铁河乡'),
	(36, 01, 12, 206, '大塘坪乡'),
	(36, 01, 12, 207, '昌邑乡'),
	(36, 01, 12, 208, '南矶乡');

/* 江西省 南昌市 南昌县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 01, 21, 100, '莲塘镇'),
	(36, 01, 21, 101, '向塘镇'),
	(36, 01, 21, 102, '三江镇'),
	(36, 01, 21, 103, '塘南镇'),
	(36, 01, 21, 104, '幽兰镇'),
	(36, 01, 21, 105, '蒋巷镇'),
	(36, 01, 21, 106, '武阳镇'),
	(36, 01, 21, 107, '冈上镇'),
	(36, 01, 21, 108, '广福镇'),
	(36, 01, 21, 191, '昌东镇（南昌高新开发区）'),
	(36, 01, 21, 192, '麻丘镇（南昌高新开发区）'),
	(36, 01, 21, 200, '泾口乡'),
	(36, 01, 21, 201, '南新乡'),
	(36, 01, 21, 202, '塔城乡'),
	(36, 01, 21, 203, '黄马乡'),
	(36, 01, 21, 204, '富山乡'),
	(36, 01, 21, 205, '东新乡'),
	(36, 01, 21, 206, '八一乡');

/* 江西省 南昌市 安义县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 01, 23, 100, '龙津镇'),
	(36, 01, 23, 101, '万埠镇'),
	(36, 01, 23, 102, '石鼻镇'),
	(36, 01, 23, 103, '鼎湖镇'),
	(36, 01, 23, 104, '长埠镇'),
	(36, 01, 23, 105, '东阳镇'),
	(36, 01, 23, 106, '黄洲镇'),
	(36, 01, 23, 200, '乔乐乡'),
	(36, 01, 23, 201, '长均乡'),
	(36, 01, 23, 202, '新民乡');

/* 江西省 南昌市 进贤县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 01, 24, 100, '民和镇'),
	(36, 01, 24, 101, '李渡镇'),
	(36, 01, 24, 102, '温圳镇'),
	(36, 01, 24, 103, '文港镇'),
	(36, 01, 24, 104, '梅庄镇'),
	(36, 01, 24, 105, '张公镇'),
	(36, 01, 24, 106, '罗溪镇'),
	(36, 01, 24, 107, '架桥镇'),
	(36, 01, 24, 108, '前坊镇'),
	(36, 01, 24, 200, '三里乡'),
	(36, 01, 24, 201, '二塘乡'),
	(36, 01, 24, 202, '钟陵乡'),
	(36, 01, 24, 203, '池溪乡'),
	(36, 01, 24, 204, '南台乡'),
	(36, 01, 24, 205, '三阳集乡'),
	(36, 01, 24, 206, '七里乡'),
	(36, 01, 24, 207, '下埠集乡'),
	(36, 01, 24, 208, '衙前乡'),
	(36, 01, 24, 209, '白圩乡'),
	(36, 01, 24, 210, '长山晏乡'),
	(36, 01, 24, 211, '泉岭乡');

/* 江西省 景德镇市 昌江区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 02, 02, 001, '西郊街道'),
	(36, 02, 02, 002, '新枫街道'),
	(36, 02, 02, 101, '鲇鱼山镇'),
	(36, 02, 02, 102, '丽阳镇'),
	(36, 02, 02, 202, '荷塘乡'),
	(36, 02, 02, 250, '吕蒙乡');

/* 江西省 景德镇市 珠山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 02, 03, 001, '石狮埠街道办事处'),
	(36, 02, 03, 002, '新厂街道办事处'),
	(36, 02, 03, 003, '里村街道办事处'),
	(36, 02, 03, 004, '周路口街道办事处'),
	(36, 02, 03, 005, '昌江街道办事处'),
	(36, 02, 03, 006, '新村街道办事处'),
	(36, 02, 03, 007, '珠山街道办事处'),
	(36, 02, 03, 008, '太白园街道办事处'),
	(36, 02, 03, 009, '昌河街道办事处'),
	(36, 02, 03, 100, '竟成镇');

/* 江西省 景德镇市 浮梁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 02, 22, 100, '浮梁镇'),
	(36, 02, 22, 101, '鹅湖镇'),
	(36, 02, 22, 102, '经公桥镇'),
	(36, 02, 22, 103, '蛟潭镇'),
	(36, 02, 22, 104, '湘湖镇'),
	(36, 02, 22, 105, '瑶里镇'),
	(36, 02, 22, 106, '洪源镇'),
	(36, 02, 22, 107, '寿安镇'),
	(36, 02, 22, 108, '三龙镇'),
	(36, 02, 22, 109, '峙滩镇'),
	(36, 02, 22, 200, '王港乡'),
	(36, 02, 22, 201, '庄湾乡'),
	(36, 02, 22, 203, '黄坛乡'),
	(36, 02, 22, 204, '兴田乡'),
	(36, 02, 22, 205, '江村乡'),
	(36, 02, 22, 207, '勒功乡'),
	(36, 02, 22, 208, '西湖乡'),
	(36, 02, 22, 209, '罗家桥乡');

/* 江西省 景德镇市 乐平市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 02, 81, 001, '洎阳街道办事处'),
	(36, 02, 81, 002, '塔山街道办事处'),
	(36, 02, 81, 100, '镇桥镇'),
	(36, 02, 81, 101, '乐港镇'),
	(36, 02, 81, 102, '涌山镇'),
	(36, 02, 81, 103, '众埠镇'),
	(36, 02, 81, 104, '接渡镇'),
	(36, 02, 81, 105, '洪岩镇'),
	(36, 02, 81, 106, '礼林镇'),
	(36, 02, 81, 107, '后港镇'),
	(36, 02, 81, 108, '塔前镇'),
	(36, 02, 81, 109, '双田镇'),
	(36, 02, 81, 110, '临港镇'),
	(36, 02, 81, 111, '高家镇'),
	(36, 02, 81, 112, '名口镇'),
	(36, 02, 81, 113, '浯口镇'),
	(36, 02, 81, 114, '十里岗镇'),
	(36, 02, 81, 200, '鸬鹚乡');

/* 江西省 萍乡市 安源区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 03, 02, 001, '东大街街道办事处'),
	(36, 03, 02, 002, '凤凰街街道办事处'),
	(36, 03, 02, 003, '八一街街道办事处'),
	(36, 03, 02, 004, '后埠街街道办事处'),
	(36, 03, 02, 005, '丹江街街道办事处'),
	(36, 03, 02, 006, '白源街街道办事处'),
	(36, 03, 02, 100, '安源镇'),
	(36, 03, 02, 101, '高坑镇'),
	(36, 03, 02, 102, '五陂镇'),
	(36, 03, 02, 103, '青山镇');

/* 江西省 萍乡市 湘东区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 03, 13, 001, '峡山口街道办事处'),
	(36, 03, 13, 101, '湘东镇'),
	(36, 03, 13, 102, '荷尧镇'),
	(36, 03, 13, 103, '老关镇'),
	(36, 03, 13, 104, '腊市镇'),
	(36, 03, 13, 105, '下埠镇'),
	(36, 03, 13, 106, '排上镇'),
	(36, 03, 13, 107, '东桥镇'),
	(36, 03, 13, 108, '麻山镇'),
	(36, 03, 13, 200, '广寒寨乡'),
	(36, 03, 13, 201, '白竺乡');

/* 江西省 萍乡市 莲花县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 03, 21, 101, '琴亭镇'),
	(36, 03, 21, 102, '路口镇'),
	(36, 03, 21, 103, '良坊镇'),
	(36, 03, 21, 104, '升坊镇'),
	(36, 03, 21, 105, '坊楼镇'),
	(36, 03, 21, 200, '闪石乡'),
	(36, 03, 21, 201, '湖上乡'),
	(36, 03, 21, 202, '三板桥乡'),
	(36, 03, 21, 203, '神泉乡'),
	(36, 03, 21, 204, '六市乡'),
	(36, 03, 21, 205, '高洲乡'),
	(36, 03, 21, 206, '荷塘乡'),
	(36, 03, 21, 207, '南岭乡');

/* 江西省 萍乡市 上栗县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 03, 22, 101, '上栗镇'),
	(36, 03, 22, 102, '桐木镇'),
	(36, 03, 22, 103, '金山镇'),
	(36, 03, 22, 104, '福田镇'),
	(36, 03, 22, 105, '彭高镇'),
	(36, 03, 22, 106, '赤山镇'),
	(36, 03, 22, 200, '鸡冠山乡'),
	(36, 03, 22, 201, '长平乡'),
	(36, 03, 22, 202, '东源乡'),
	(36, 03, 22, 203, '杨岐乡');

/* 江西省 萍乡市 芦溪县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 03, 23, 101, '芦溪镇'),
	(36, 03, 23, 102, '宣风镇'),
	(36, 03, 23, 103, '上埠镇'),
	(36, 03, 23, 104, '南坑镇'),
	(36, 03, 23, 105, '银河镇'),
	(36, 03, 23, 200, '源南乡'),
	(36, 03, 23, 201, '长丰乡'),
	(36, 03, 23, 202, '张佳坊乡'),
	(36, 03, 23, 203, '新泉乡'),
	(36, 03, 23, 204, '万龙山乡');

/* 江西省 九江市 庐山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 02, 001, '十里街道办事处'),
	(36, 04, 02, 002, '五里街道办事处'),
	(36, 04, 02, 090, '七里湖街道办事处（九江经济技术开发区）'),
	(36, 04, 02, 100, '姑塘镇'),
	(36, 04, 02, 101, '威家镇'),
	(36, 04, 02, 102, '新港镇'),
	(36, 04, 02, 103, '莲花镇'),
	(36, 04, 02, 104, '海会镇'),
	(36, 04, 02, 105, '赛阳镇'),
	(36, 04, 02, 176, '牯岭镇'),
	(36, 04, 02, 200, '虞家河乡');

/* 江西省 九江市 浔阳区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 03, 001, '甘棠街道'),
	(36, 04, 03, 002, '湓浦街道'),
	(36, 04, 03, 003, '人民路街道'),
	(36, 04, 03, 004, '白水湖街道'),
	(36, 04, 03, 005, '金鸡坡街道'),
	(36, 04, 03, 091, '向阳街道办事处（九江经济技术开发区）'),
	(36, 04, 03, 092, '滨兴街道办事处（九江经济技术开发区）');

/* 江西省 九江市 九江县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 21, 100, '沙河街镇'),
	(36, 04, 21, 101, '马回岭镇'),
	(36, 04, 21, 102, '江洲镇'),
	(36, 04, 21, 103, '城子镇'),
	(36, 04, 21, 104, '港口街镇'),
	(36, 04, 21, 105, '新合镇'),
	(36, 04, 21, 106, '狮子镇'),
	(36, 04, 21, 200, '永安乡'),
	(36, 04, 21, 201, '涌泉乡'),
	(36, 04, 21, 202, '新塘乡'),
	(36, 04, 21, 203, '城门乡'),
	(36, 04, 21, 204, '岷山乡');

/* 江西省 九江市 武宁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 23, 001, '豫宁街道办事处'),
	(36, 04, 23, 100, '新宁镇'),
	(36, 04, 23, 101, '泉口镇'),
	(36, 04, 23, 102, '鲁溪镇'),
	(36, 04, 23, 103, '船滩镇'),
	(36, 04, 23, 104, '澧溪镇'),
	(36, 04, 23, 105, '罗坪镇'),
	(36, 04, 23, 106, '石门楼镇'),
	(36, 04, 23, 107, '宋溪镇'),
	(36, 04, 23, 200, '大洞乡'),
	(36, 04, 23, 201, '横路乡'),
	(36, 04, 23, 202, '官莲乡'),
	(36, 04, 23, 203, '巾口乡'),
	(36, 04, 23, 204, '东林乡'),
	(36, 04, 23, 205, '上汤乡'),
	(36, 04, 23, 206, '甫田乡'),
	(36, 04, 23, 207, '清江乡'),
	(36, 04, 23, 208, '石渡乡'),
	(36, 04, 23, 209, '杨洲乡'),
	(36, 04, 23, 210, '罗溪乡');

/* 江西省 九江市 修水县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 24, 100, '义宁镇'),
	(36, 04, 24, 101, '白岭镇'),
	(36, 04, 24, 102, '全丰镇'),
	(36, 04, 24, 103, '古市镇'),
	(36, 04, 24, 104, '大桥镇'),
	(36, 04, 24, 105, '渣津镇'),
	(36, 04, 24, 106, '马坳镇'),
	(36, 04, 24, 107, '杭口镇'),
	(36, 04, 24, 108, '港口镇'),
	(36, 04, 24, 109, '溪口镇'),
	(36, 04, 24, 110, '西港镇'),
	(36, 04, 24, 111, '山口镇'),
	(36, 04, 24, 112, '黄沙镇'),
	(36, 04, 24, 113, '黄港镇'),
	(36, 04, 24, 114, '何市镇'),
	(36, 04, 24, 115, '上奉镇'),
	(36, 04, 24, 116, '四都镇'),
	(36, 04, 24, 117, '太阳升镇'),
	(36, 04, 24, 118, '宁州镇'),
	(36, 04, 24, 200, '路口乡'),
	(36, 04, 24, 201, '黄龙乡'),
	(36, 04, 24, 202, '上衫乡'),
	(36, 04, 24, 203, '余段乡'),
	(36, 04, 24, 204, '水源乡'),
	(36, 04, 24, 205, '石坳乡'),
	(36, 04, 24, 206, '东港乡'),
	(36, 04, 24, 207, '上杭乡'),
	(36, 04, 24, 209, '新湾乡'),
	(36, 04, 24, 210, '布甲乡'),
	(36, 04, 24, 211, '漫江乡'),
	(36, 04, 24, 212, '复原乡'),
	(36, 04, 24, 213, '竹坪乡'),
	(36, 04, 24, 214, '征村乡'),
	(36, 04, 24, 215, '庙岭乡'),
	(36, 04, 24, 216, '黄坳乡'),
	(36, 04, 24, 217, '大椿乡');

/* 江西省 九江市 永修县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 25, 100, '涂埠镇'),
	(36, 04, 25, 101, '吴城镇'),
	(36, 04, 25, 102, '三溪桥镇'),
	(36, 04, 25, 103, '虬津镇'),
	(36, 04, 25, 104, '艾城镇'),
	(36, 04, 25, 105, '滩溪镇'),
	(36, 04, 25, 106, '白槎镇'),
	(36, 04, 25, 107, '梅棠镇'),
	(36, 04, 25, 108, '燕坊镇'),
	(36, 04, 25, 109, '马口镇'),
	(36, 04, 25, 110, '柘林镇'),
	(36, 04, 25, 200, '三角乡'),
	(36, 04, 25, 201, '九合乡'),
	(36, 04, 25, 202, '立新乡'),
	(36, 04, 25, 203, '江上乡');

/* 江西省 九江市 德安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 26, 100, '蒲亭镇'),
	(36, 04, 26, 101, '聂桥镇'),
	(36, 04, 26, 102, '车桥镇'),
	(36, 04, 26, 103, '丰林镇'),
	(36, 04, 26, 104, '吴山镇'),
	(36, 04, 26, 200, '宝塔乡'),
	(36, 04, 26, 201, '河东乡'),
	(36, 04, 26, 202, '高塘乡'),
	(36, 04, 26, 203, '林泉乡'),
	(36, 04, 26, 205, '磨溪乡'),
	(36, 04, 26, 206, '爱民乡'),
	(36, 04, 26, 207, '邹桥乡'),
	(36, 04, 26, 208, '塘山乡');

/* 江西省 九江市 星子县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 27, 100, '南康镇'),
	(36, 04, 27, 101, '白鹿镇'),
	(36, 04, 27, 102, '温泉镇'),
	(36, 04, 27, 103, '蓼花镇'),
	(36, 04, 27, 104, '华林镇'),
	(36, 04, 27, 105, '蛟塘镇'),
	(36, 04, 27, 106, '横塘镇'),
	(36, 04, 27, 200, '蓼南乡');

/* 江西省 九江市 都昌县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 28, 100, '都昌镇'),
	(36, 04, 28, 101, '周溪镇'),
	(36, 04, 28, 102, '三汊港镇'),
	(36, 04, 28, 103, '中馆镇'),
	(36, 04, 28, 104, '大沙镇'),
	(36, 04, 28, 105, '万户镇'),
	(36, 04, 28, 106, '南峰镇'),
	(36, 04, 28, 107, '土塘镇'),
	(36, 04, 28, 108, '大港镇'),
	(36, 04, 28, 109, '蔡岭镇'),
	(36, 04, 28, 110, '徐埠镇'),
	(36, 04, 28, 111, '左里镇'),
	(36, 04, 28, 200, '和合乡'),
	(36, 04, 28, 201, '阳峰乡'),
	(36, 04, 28, 202, '西源乡'),
	(36, 04, 28, 203, '芗溪乡'),
	(36, 04, 28, 204, '狮山乡'),
	(36, 04, 28, 205, '鸣山乡'),
	(36, 04, 28, 206, '春桥乡'),
	(36, 04, 28, 207, '苏山乡'),
	(36, 04, 28, 208, '多宝乡'),
	(36, 04, 28, 209, '汪墩乡'),
	(36, 04, 28, 210, '北山乡'),
	(36, 04, 28, 211, '大树乡');

/* 江西省 九江市 湖口县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 29, 100, '双钟镇'),
	(36, 04, 29, 101, '流泗镇'),
	(36, 04, 29, 102, '马影镇'),
	(36, 04, 29, 103, '武山镇'),
	(36, 04, 29, 104, '城山镇'),
	(36, 04, 29, 105, '均桥镇'),
	(36, 04, 29, 200, '大垅乡'),
	(36, 04, 29, 201, '凰村乡'),
	(36, 04, 29, 202, '张青乡'),
	(36, 04, 29, 204, '付垅乡'),
	(36, 04, 29, 205, '舜德乡'),
	(36, 04, 29, 206, '流芳乡');

/* 江西省 九江市 彭泽县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 30, 100, '龙城镇'),
	(36, 04, 30, 101, '棉船镇'),
	(36, 04, 30, 102, '马垱镇'),
	(36, 04, 30, 103, '芙蓉墩镇'),
	(36, 04, 30, 104, '定山镇'),
	(36, 04, 30, 105, '天红镇'),
	(36, 04, 30, 106, '杨梓镇'),
	(36, 04, 30, 107, '东升镇'),
	(36, 04, 30, 108, '瀼溪镇'),
	(36, 04, 30, 109, '黄花镇'),
	(36, 04, 30, 200, '太平关乡'),
	(36, 04, 30, 201, '黄岭乡'),
	(36, 04, 30, 202, '浩山乡');

/* 江西省 九江市 瑞昌市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 81, 001, '湓城街道办事处'),
	(36, 04, 81, 002, '桂林街道办事处'),
	(36, 04, 81, 100, '码头镇'),
	(36, 04, 81, 101, '白杨镇'),
	(36, 04, 81, 102, '南义镇'),
	(36, 04, 81, 103, '横港镇'),
	(36, 04, 81, 104, '范镇'),
	(36, 04, 81, 105, '肇陈镇'),
	(36, 04, 81, 106, '高丰镇'),
	(36, 04, 81, 107, '夏畈镇'),
	(36, 04, 81, 200, '乐园乡'),
	(36, 04, 81, 201, '洪一乡'),
	(36, 04, 81, 202, '花园乡'),
	(36, 04, 81, 203, '洪下乡'),
	(36, 04, 81, 204, '武蛟乡'),
	(36, 04, 81, 205, '横立山乡'),
	(36, 04, 81, 206, '黄金乡'),
	(36, 04, 81, 207, '南阳乡');

/* 江西省 九江市 共青城市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 04, 82, 001, '茶山街道'),
	(36, 04, 82, 100, '甘露镇'),
	(36, 04, 82, 101, '江益镇'),
	(36, 04, 82, 200, '金湖乡'),
	(36, 04, 82, 201, '苏家垱乡'),
	(36, 04, 82, 202, '泽泉乡');

/* 江西省 新余市 渝水区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 05, 02, 001, '城南街道办事处'),
	(36, 05, 02, 002, '城北街道办事处'),
	(36, 05, 02, 003, '袁河街道办事处'),
	(36, 05, 02, 100, '水北镇'),
	(36, 05, 02, 101, '下村镇'),
	(36, 05, 02, 102, '良山镇'),
	(36, 05, 02, 103, '罗坊镇'),
	(36, 05, 02, 104, '姚圩镇'),
	(36, 05, 02, 105, '珠珊镇'),
	(36, 05, 02, 170, '河下镇'),
	(36, 05, 02, 180, '观巢镇'),
	(36, 05, 02, 181, '欧里镇'),
	(36, 05, 02, 190, '水西镇'),
	(36, 05, 02, 200, '鹄山乡'),
	(36, 05, 02, 201, '人和乡'),
	(36, 05, 02, 202, '界水乡'),
	(36, 05, 02, 203, '南安乡'),
	(36, 05, 02, 204, '新溪乡'),
	(36, 05, 02, 250, '九龙山乡');

/* 江西省 新余市 分宜县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 05, 21, 001, '钤东街道办事处'),
	(36, 05, 21, 100, '分宜镇'),
	(36, 05, 21, 101, '杨桥镇'),
	(36, 05, 21, 102, '湖泽镇'),
	(36, 05, 21, 103, '双林镇'),
	(36, 05, 21, 104, '钤山镇'),
	(36, 05, 21, 105, '洋江镇'),
	(36, 05, 21, 106, '凤阳镇'),
	(36, 05, 21, 201, '洞村乡'),
	(36, 05, 21, 202, '高岚乡'),
	(36, 05, 21, 203, '操场乡');

/* 江西省 鹰潭市 月湖区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 06, 02, 001, '江边街道办事处'),
	(36, 06, 02, 002, '交通街道办事处'),
	(36, 06, 02, 003, '东湖街道办事处'),
	(36, 06, 02, 004, '梅园街道办事处'),
	(36, 06, 02, 005, '四青街道办事处'),
	(36, 06, 02, 006, '白露街道办事处'),
	(36, 06, 02, 100, '童家镇'),
	(36, 06, 02, 200, '夏埠乡');

/* 江西省 鹰潭市 余江县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 06, 22, 100, '邓埠镇'),
	(36, 06, 22, 101, '锦江镇'),
	(36, 06, 22, 102, '潢溪镇'),
	(36, 06, 22, 103, '中童镇'),
	(36, 06, 22, 104, '马荃镇'),
	(36, 06, 22, 105, '画桥镇'),
	(36, 06, 22, 106, '春涛镇'),
	(36, 06, 22, 200, '平定乡'),
	(36, 06, 22, 202, '杨溪乡'),
	(36, 06, 22, 203, '洪湖乡'),
	(36, 06, 22, 204, '黄庄乡'),
	(36, 06, 22, 205, '刘家站乡');

/* 江西省 鹰潭市 贵溪市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 06, 81, 001, '花园街道'),
	(36, 06, 81, 002, '雄石街道'),
	(36, 06, 81, 003, '东门街道'),
	(36, 06, 81, 100, '泗沥镇'),
	(36, 06, 81, 101, '河潭镇'),
	(36, 06, 81, 102, '周坊镇'),
	(36, 06, 81, 103, '鸿塘镇'),
	(36, 06, 81, 104, '志光镇'),
	(36, 06, 81, 105, '流口镇'),
	(36, 06, 81, 106, '罗河镇'),
	(36, 06, 81, 107, '金屯镇'),
	(36, 06, 81, 108, '塘湾镇'),
	(36, 06, 81, 109, '文坊镇'),
	(36, 06, 81, 110, '冷水镇'),
	(36, 06, 81, 111, '滨江镇'),
	(36, 06, 81, 112, '天禄镇'),
	(36, 06, 81, 113, '雷溪镇'),
	(36, 06, 81, 190, '龙虎山镇（龙虎山风景旅游区管委会）'),
	(36, 06, 81, 191, '上清镇（龙虎山风景旅游区管委会）'),
	(36, 06, 81, 201, '白田乡'),
	(36, 06, 81, 203, '彭湾乡'),
	(36, 06, 81, 204, '樟坪畲族乡'),
	(36, 06, 81, 205, '耳口乡');

/* 江西省 赣州市 章贡区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 02, 001, '解放街道办事处'),
	(36, 07, 02, 002, '赣江街道办事处'),
	(36, 07, 02, 003, '南外街道办事处'),
	(36, 07, 02, 004, '东外街道办事处'),
	(36, 07, 02, 091, '黄金岭街道办事处（赣州经济技术开发区）'),
	(36, 07, 02, 100, '沙石镇'),
	(36, 07, 02, 101, '水东镇'),
	(36, 07, 02, 102, '水南镇'),
	(36, 07, 02, 103, '湖边镇（赣州经济技术开发区）'),
	(36, 07, 02, 104, '沙河镇'),
	(36, 07, 02, 105, '水西镇'),
	(36, 07, 02, 190, '蟠龙镇（赣州经济技术开发区）'),
	(36, 07, 02, 191, '潭口镇（赣州经济技术开发区）'),
	(36, 07, 02, 192, '潭东镇（赣州经济技术开发区）');

/* 江西省 赣州市 南康区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 03, 001, '蓉江街道办事处'),
	(36, 07, 03, 002, '东山街道办事处'),
	(36, 07, 03, 100, '唐江镇'),
	(36, 07, 03, 101, '凤岗镇'),
	(36, 07, 03, 103, '龙岭镇'),
	(36, 07, 03, 104, '龙回镇'),
	(36, 07, 03, 105, '镜坝镇'),
	(36, 07, 03, 106, '横市镇'),
	(36, 07, 03, 200, '浮石乡'),
	(36, 07, 03, 201, '赤土畲族乡'),
	(36, 07, 03, 202, '横寨乡'),
	(36, 07, 03, 203, '朱坊乡'),
	(36, 07, 03, 204, '太窝乡'),
	(36, 07, 03, 205, '三江乡'),
	(36, 07, 03, 206, '龙华乡'),
	(36, 07, 03, 207, '十八塘乡'),
	(36, 07, 03, 208, '麻双乡'),
	(36, 07, 03, 209, '大坪乡'),
	(36, 07, 03, 210, '坪市乡'),
	(36, 07, 03, 211, '隆木乡');

/* 江西省 赣州市 赣县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 21, 100, '梅林镇'),
	(36, 07, 21, 101, '王母渡镇'),
	(36, 07, 21, 102, '沙地镇'),
	(36, 07, 21, 103, '江口镇'),
	(36, 07, 21, 104, '田村镇'),
	(36, 07, 21, 105, '南塘镇'),
	(36, 07, 21, 106, '茅店镇'),
	(36, 07, 21, 107, '吉埠镇'),
	(36, 07, 21, 108, '五云镇'),
	(36, 07, 21, 109, '湖江镇'),
	(36, 07, 21, 110, '储潭镇'),
	(36, 07, 21, 111, '韩坊镇'),
	(36, 07, 21, 201, '阳埠乡'),
	(36, 07, 21, 202, '大埠乡'),
	(36, 07, 21, 203, '长洛乡'),
	(36, 07, 21, 204, '大田乡'),
	(36, 07, 21, 207, '石芫乡'),
	(36, 07, 21, 208, '三溪乡'),
	(36, 07, 21, 209, '白鹭乡');

/* 江西省 赣州市 信丰县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 22, 100, '嘉定镇'),
	(36, 07, 22, 101, '大塘埠镇'),
	(36, 07, 22, 102, '古陂镇'),
	(36, 07, 22, 103, '大桥镇'),
	(36, 07, 22, 104, '新田镇'),
	(36, 07, 22, 105, '安西镇'),
	(36, 07, 22, 106, '小江镇'),
	(36, 07, 22, 107, '铁石口镇'),
	(36, 07, 22, 108, '大阿镇'),
	(36, 07, 22, 109, '油山镇'),
	(36, 07, 22, 110, '小河镇'),
	(36, 07, 22, 111, '西牛镇'),
	(36, 07, 22, 112, '正平镇'),
	(36, 07, 22, 200, '虎山乡'),
	(36, 07, 22, 201, '崇仙乡'),
	(36, 07, 22, 202, '万隆乡');

/* 江西省 赣州市 大余县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 23, 100, '南安镇'),
	(36, 07, 23, 101, '新城镇'),
	(36, 07, 23, 102, '樟斗镇'),
	(36, 07, 23, 103, '池江镇'),
	(36, 07, 23, 104, '青龙镇'),
	(36, 07, 23, 105, '左拔镇'),
	(36, 07, 23, 106, '黄龙镇'),
	(36, 07, 23, 107, '吉村镇'),
	(36, 07, 23, 200, '浮江乡'),
	(36, 07, 23, 201, '河洞乡'),
	(36, 07, 23, 202, '内良乡');

/* 江西省 赣州市 上犹县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 24, 100, '东山镇'),
	(36, 07, 24, 101, '陡水镇'),
	(36, 07, 24, 102, '社溪镇'),
	(36, 07, 24, 103, '营前镇'),
	(36, 07, 24, 104, '黄埠镇'),
	(36, 07, 24, 105, '寺下镇'),
	(36, 07, 24, 200, '梅水乡'),
	(36, 07, 24, 201, '油石乡'),
	(36, 07, 24, 202, '安和乡'),
	(36, 07, 24, 204, '双溪乡'),
	(36, 07, 24, 205, '水岩乡'),
	(36, 07, 24, 206, '平富乡'),
	(36, 07, 24, 207, '五指峰乡'),
	(36, 07, 24, 208, '紫阳乡');

/* 江西省 赣州市 崇义县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 25, 100, '横水镇'),
	(36, 07, 25, 101, '扬眉镇'),
	(36, 07, 25, 102, '过埠镇'),
	(36, 07, 25, 103, '铅厂镇'),
	(36, 07, 25, 104, '长龙镇'),
	(36, 07, 25, 105, '关田镇'),
	(36, 07, 25, 200, '龙勾乡'),
	(36, 07, 25, 201, '杰坝乡'),
	(36, 07, 25, 202, '金坑乡'),
	(36, 07, 25, 203, '思顺乡'),
	(36, 07, 25, 204, '麟潭乡'),
	(36, 07, 25, 205, '上堡乡'),
	(36, 07, 25, 206, '聂都乡'),
	(36, 07, 25, 207, '文英乡'),
	(36, 07, 25, 208, '乐洞乡'),
	(36, 07, 25, 209, '丰州乡');

/* 江西省 赣州市 安远县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 26, 100, '欣山镇'),
	(36, 07, 26, 101, '孔田镇'),
	(36, 07, 26, 102, '版石镇'),
	(36, 07, 26, 103, '天心镇'),
	(36, 07, 26, 104, '龙布镇'),
	(36, 07, 26, 105, '鹤子镇'),
	(36, 07, 26, 106, '三百山镇'),
	(36, 07, 26, 107, '车头镇'),
	(36, 07, 26, 200, '镇岗乡'),
	(36, 07, 26, 201, '凤山乡'),
	(36, 07, 26, 202, '新龙乡'),
	(36, 07, 26, 203, '蔡坊乡'),
	(36, 07, 26, 204, '重石乡'),
	(36, 07, 26, 205, '长沙乡'),
	(36, 07, 26, 206, '浮槎乡'),
	(36, 07, 26, 207, '双芫乡'),
	(36, 07, 26, 208, '塘村乡'),
	(36, 07, 26, 209, '高云山乡');

/* 江西省 赣州市 龙南县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 27, 100, '龙南镇'),
	(36, 07, 27, 101, '武当镇'),
	(36, 07, 27, 102, '杨村镇'),
	(36, 07, 27, 103, '汶龙镇'),
	(36, 07, 27, 104, '程龙镇'),
	(36, 07, 27, 105, '关西镇'),
	(36, 07, 27, 106, '里仁镇'),
	(36, 07, 27, 107, '渡江镇'),
	(36, 07, 27, 200, '桃江乡'),
	(36, 07, 27, 201, '东江乡'),
	(36, 07, 27, 202, '临塘乡'),
	(36, 07, 27, 203, '南亨乡'),
	(36, 07, 27, 204, '夹湖乡');

/* 江西省 赣州市 定南县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 28, 100, '历市镇'),
	(36, 07, 28, 101, '岿美山镇'),
	(36, 07, 28, 102, '老城镇'),
	(36, 07, 28, 103, '天九镇'),
	(36, 07, 28, 104, '龙塘镇'),
	(36, 07, 28, 105, '岭北镇'),
	(36, 07, 28, 106, '鹅公镇');

/* 江西省 赣州市 全南县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 29, 100, '城厢镇'),
	(36, 07, 29, 101, '大吉山镇'),
	(36, 07, 29, 102, '陂头镇'),
	(36, 07, 29, 103, '金龙镇'),
	(36, 07, 29, 104, '南迳镇'),
	(36, 07, 29, 105, '龙源坝镇'),
	(36, 07, 29, 200, '中寨乡'),
	(36, 07, 29, 201, '社迳乡'),
	(36, 07, 29, 202, '龙下乡');

/* 江西省 赣州市 宁都县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 30, 100, '梅江镇'),
	(36, 07, 30, 101, '青塘镇'),
	(36, 07, 30, 102, '长胜镇'),
	(36, 07, 30, 103, '黄陂镇'),
	(36, 07, 30, 104, '固村镇'),
	(36, 07, 30, 105, '赖村镇'),
	(36, 07, 30, 106, '石上镇'),
	(36, 07, 30, 107, '东山坝镇'),
	(36, 07, 30, 108, '洛口镇'),
	(36, 07, 30, 109, '小布镇'),
	(36, 07, 30, 110, '黄石镇'),
	(36, 07, 30, 111, '田头镇'),
	(36, 07, 30, 200, '竹笮乡'),
	(36, 07, 30, 201, '对坊乡'),
	(36, 07, 30, 202, '固厚乡'),
	(36, 07, 30, 203, '田埠乡'),
	(36, 07, 30, 204, '会同乡'),
	(36, 07, 30, 205, '湛田乡'),
	(36, 07, 30, 206, '安福乡'),
	(36, 07, 30, 207, '东韶乡'),
	(36, 07, 30, 208, '肖田乡'),
	(36, 07, 30, 209, '钓峰乡'),
	(36, 07, 30, 210, '大沽乡'),
	(36, 07, 30, 211, '蔡江乡');

/* 江西省 赣州市 于都县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 31, 100, '贡江镇'),
	(36, 07, 31, 101, '铁山垅镇'),
	(36, 07, 31, 102, '盘古山镇'),
	(36, 07, 31, 103, '禾丰镇'),
	(36, 07, 31, 104, '祁禄山镇'),
	(36, 07, 31, 105, '梓山镇'),
	(36, 07, 31, 106, '银坑镇'),
	(36, 07, 31, 107, '岭背镇'),
	(36, 07, 31, 108, '罗坳镇'),
	(36, 07, 31, 200, '罗江乡'),
	(36, 07, 31, 201, '小溪乡'),
	(36, 07, 31, 202, '利村乡'),
	(36, 07, 31, 203, '新陂乡'),
	(36, 07, 31, 204, '靖石乡'),
	(36, 07, 31, 205, '黄麟乡'),
	(36, 07, 31, 206, '沙心乡'),
	(36, 07, 31, 207, '宽田乡'),
	(36, 07, 31, 208, '葛坳乡'),
	(36, 07, 31, 209, '桥头乡'),
	(36, 07, 31, 210, '马安乡'),
	(36, 07, 31, 211, '仙下乡'),
	(36, 07, 31, 212, '车溪乡'),
	(36, 07, 31, 213, '段屋乡');

/* 江西省 赣州市 兴国县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 32, 100, '潋江镇'),
	(36, 07, 32, 101, '江背镇'),
	(36, 07, 32, 102, '古龙冈镇'),
	(36, 07, 32, 103, '梅窖镇'),
	(36, 07, 32, 104, '高兴镇'),
	(36, 07, 32, 105, '良村镇'),
	(36, 07, 32, 106, '龙口镇'),
	(36, 07, 32, 200, '兴江乡'),
	(36, 07, 32, 201, '樟木乡'),
	(36, 07, 32, 202, '东村乡'),
	(36, 07, 32, 203, '兴莲乡'),
	(36, 07, 32, 204, '杰村乡'),
	(36, 07, 32, 205, '社富乡'),
	(36, 07, 32, 206, '埠头乡'),
	(36, 07, 32, 207, '永丰乡'),
	(36, 07, 32, 208, '隆坪乡'),
	(36, 07, 32, 209, '均村乡'),
	(36, 07, 32, 210, '茶园乡'),
	(36, 07, 32, 211, '崇贤乡'),
	(36, 07, 32, 212, '枫边乡'),
	(36, 07, 32, 213, '南坑乡'),
	(36, 07, 32, 214, '城岗乡'),
	(36, 07, 32, 215, '方太乡'),
	(36, 07, 32, 216, '鼎龙乡'),
	(36, 07, 32, 217, '长冈乡');

/* 江西省 赣州市 会昌县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 33, 100, '文武坝镇'),
	(36, 07, 33, 101, '筠门岭镇'),
	(36, 07, 33, 102, '西江镇'),
	(36, 07, 33, 103, '周田镇'),
	(36, 07, 33, 104, '麻州镇'),
	(36, 07, 33, 105, '庄口镇'),
	(36, 07, 33, 200, '清溪乡'),
	(36, 07, 33, 201, '右水乡'),
	(36, 07, 33, 202, '高排乡'),
	(36, 07, 33, 203, '晓龙乡'),
	(36, 07, 33, 204, '珠兰乡'),
	(36, 07, 33, 205, '洞头乡'),
	(36, 07, 33, 206, '中村乡'),
	(36, 07, 33, 207, '站塘乡'),
	(36, 07, 33, 208, '永隆乡'),
	(36, 07, 33, 209, '富城乡'),
	(36, 07, 33, 210, '小密乡'),
	(36, 07, 33, 211, '庄埠乡'),
	(36, 07, 33, 212, '白鹅乡');

/* 江西省 赣州市 寻乌县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 34, 100, '长宁镇'),
	(36, 07, 34, 101, '晨光镇'),
	(36, 07, 34, 102, '留车镇'),
	(36, 07, 34, 103, '南桥镇'),
	(36, 07, 34, 104, '吉潭镇'),
	(36, 07, 34, 105, '澄江镇'),
	(36, 07, 34, 106, '桂竹帽镇'),
	(36, 07, 34, 200, '文峰乡'),
	(36, 07, 34, 201, '三标乡'),
	(36, 07, 34, 202, '菖蒲乡'),
	(36, 07, 34, 203, '龙廷乡'),
	(36, 07, 34, 204, '丹溪乡'),
	(36, 07, 34, 205, '项山乡'),
	(36, 07, 34, 206, '水源乡'),
	(36, 07, 34, 207, '罗珊乡');

/* 江西省 赣州市 石城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 35, 100, '琴江镇'),
	(36, 07, 35, 101, '小松镇'),
	(36, 07, 35, 102, '屏山镇'),
	(36, 07, 35, 103, '横江镇'),
	(36, 07, 35, 104, '高田镇'),
	(36, 07, 35, 200, '木兰乡'),
	(36, 07, 35, 201, '丰山乡'),
	(36, 07, 35, 202, '大由乡'),
	(36, 07, 35, 203, '龙岗乡'),
	(36, 07, 35, 204, '珠坑乡');

/* 江西省 赣州市 瑞金市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 07, 81, 100, '象湖镇'),
	(36, 07, 81, 101, '瑞林镇'),
	(36, 07, 81, 102, '壬田镇'),
	(36, 07, 81, 103, '九堡镇'),
	(36, 07, 81, 104, '沙洲坝镇'),
	(36, 07, 81, 105, '谢坊镇'),
	(36, 07, 81, 106, '武阳镇'),
	(36, 07, 81, 200, '叶坪乡'),
	(36, 07, 81, 201, '丁陂乡'),
	(36, 07, 81, 202, '大柏地乡'),
	(36, 07, 81, 203, '岗面乡'),
	(36, 07, 81, 204, '日东乡'),
	(36, 07, 81, 205, '万田乡'),
	(36, 07, 81, 206, '黄柏乡'),
	(36, 07, 81, 207, '云石山乡'),
	(36, 07, 81, 208, '泽覃乡'),
	(36, 07, 81, 209, '拔英乡');

/* 江西省 吉安市 吉州区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 02, 001, '古南街道办事处'),
	(36, 08, 02, 002, '永叔街道办事处'),
	(36, 08, 02, 003, '文山街道办事处'),
	(36, 08, 02, 004, '习溪桥街道办事处'),
	(36, 08, 02, 005, '北门街道办事处'),
	(36, 08, 02, 006, '白塘街道办事处'),
	(36, 08, 02, 007, '禾埠街道办事处'),
	(36, 08, 02, 100, '兴桥镇'),
	(36, 08, 02, 101, '樟山镇'),
	(36, 08, 02, 102, '长塘镇'),
	(36, 08, 02, 103, '曲濑镇');

/* 江西省 吉安市 青原区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 03, 001, '河东街道办事处'),
	(36, 08, 03, 002, '滨江街道办事处'),
	(36, 08, 03, 100, '天玉镇'),
	(36, 08, 03, 101, '值夏镇'),
	(36, 08, 03, 102, '新圩镇'),
	(36, 08, 03, 103, '富滩镇'),
	(36, 08, 03, 104, '富田镇'),
	(36, 08, 03, 105, '文陂镇'),
	(36, 08, 03, 201, '东固畲族少数民族乡');

/* 江西省 吉安市 吉安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 21, 001, '高新街道办事处'),
	(36, 08, 21, 002, '金鸡湖街道办事处'),
	(36, 08, 21, 100, '敦厚镇'),
	(36, 08, 21, 101, '永阳镇'),
	(36, 08, 21, 102, '天河镇'),
	(36, 08, 21, 103, '横江镇'),
	(36, 08, 21, 104, '固江镇'),
	(36, 08, 21, 105, '万福镇'),
	(36, 08, 21, 106, '永和镇'),
	(36, 08, 21, 107, '桐坪镇'),
	(36, 08, 21, 108, '凤凰镇'),
	(36, 08, 21, 109, '油田镇'),
	(36, 08, 21, 110, '敖城镇'),
	(36, 08, 21, 111, '梅塘镇'),
	(36, 08, 21, 112, '浬田镇'),
	(36, 08, 21, 200, '北源乡'),
	(36, 08, 21, 201, '大冲乡'),
	(36, 08, 21, 204, '登龙乡'),
	(36, 08, 21, 205, '安塘乡'),
	(36, 08, 21, 206, '官田乡'),
	(36, 08, 21, 207, '指阳乡');

/* 江西省 吉安市 吉水县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 22, 100, '文峰镇'),
	(36, 08, 22, 101, '阜田镇'),
	(36, 08, 22, 102, '盘谷镇'),
	(36, 08, 22, 103, '枫江镇'),
	(36, 08, 22, 104, '黄桥镇'),
	(36, 08, 22, 105, '金滩镇'),
	(36, 08, 22, 106, '八都镇'),
	(36, 08, 22, 107, '双村镇'),
	(36, 08, 22, 108, '醪桥镇'),
	(36, 08, 22, 109, '螺田镇'),
	(36, 08, 22, 110, '白沙镇'),
	(36, 08, 22, 111, '白水镇'),
	(36, 08, 22, 112, '丁江镇'),
	(36, 08, 22, 113, '乌江镇'),
	(36, 08, 22, 114, '水南镇'),
	(36, 08, 22, 200, '尚贤乡'),
	(36, 08, 22, 201, '水田乡'),
	(36, 08, 22, 202, '冠山乡');

/* 江西省 吉安市 峡江县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 23, 100, '水边镇'),
	(36, 08, 23, 101, '马埠镇'),
	(36, 08, 23, 102, '巴邱镇'),
	(36, 08, 23, 103, '仁和镇'),
	(36, 08, 23, 104, '砚溪镇'),
	(36, 08, 23, 105, '罗田镇'),
	(36, 08, 23, 200, '桐林乡'),
	(36, 08, 23, 201, '福民乡'),
	(36, 08, 23, 202, '戈坪乡'),
	(36, 08, 23, 203, '金江乡'),
	(36, 08, 23, 204, '金坪民族乡');

/* 江西省 吉安市 新干县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 24, 001, '洋峰街道办'),
	(36, 08, 24, 100, '金川镇'),
	(36, 08, 24, 101, '三湖镇'),
	(36, 08, 24, 102, '大洋洲镇'),
	(36, 08, 24, 103, '七琴镇'),
	(36, 08, 24, 104, '麦斜镇'),
	(36, 08, 24, 105, '界埠镇'),
	(36, 08, 24, 106, '溧江镇'),
	(36, 08, 24, 201, '桃溪乡'),
	(36, 08, 24, 202, '城上乡'),
	(36, 08, 24, 203, '潭丘乡'),
	(36, 08, 24, 204, '神政桥乡'),
	(36, 08, 24, 205, '沂江乡'),
	(36, 08, 24, 207, '荷浦乡');

/* 江西省 吉安市 永丰县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 25, 100, '恩江镇'),
	(36, 08, 25, 101, '坑田镇'),
	(36, 08, 25, 102, '沿陂镇'),
	(36, 08, 25, 103, '古县镇'),
	(36, 08, 25, 104, '瑶田镇'),
	(36, 08, 25, 105, '藤田镇'),
	(36, 08, 25, 106, '石马镇'),
	(36, 08, 25, 107, '沙溪镇'),
	(36, 08, 25, 200, '佐龙乡'),
	(36, 08, 25, 201, '八江乡'),
	(36, 08, 25, 202, '潭城乡'),
	(36, 08, 25, 203, '鹿冈乡'),
	(36, 08, 25, 204, '七都乡'),
	(36, 08, 25, 205, '陶塘乡'),
	(36, 08, 25, 206, '中村乡'),
	(36, 08, 25, 207, '上溪乡'),
	(36, 08, 25, 208, '潭头乡'),
	(36, 08, 25, 209, '三坊乡'),
	(36, 08, 25, 210, '上固乡'),
	(36, 08, 25, 211, '君埠乡'),
	(36, 08, 25, 212, '龙冈畲族乡');

/* 江西省 吉安市 泰和县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 26, 100, '澄江镇'),
	(36, 08, 26, 101, '碧溪镇'),
	(36, 08, 26, 102, '桥头镇'),
	(36, 08, 26, 103, '禾市镇'),
	(36, 08, 26, 104, '螺溪镇'),
	(36, 08, 26, 105, '苏溪镇'),
	(36, 08, 26, 106, '马市镇'),
	(36, 08, 26, 107, '塘洲镇'),
	(36, 08, 26, 108, '冠朝镇'),
	(36, 08, 26, 109, '沙村镇'),
	(36, 08, 26, 110, '老营盘镇'),
	(36, 08, 26, 111, '小龙镇'),
	(36, 08, 26, 112, '灌溪镇'),
	(36, 08, 26, 113, '苑前镇'),
	(36, 08, 26, 114, '万合镇'),
	(36, 08, 26, 115, '沿溪镇'),
	(36, 08, 26, 200, '石山乡'),
	(36, 08, 26, 201, '南溪乡'),
	(36, 08, 26, 202, '上模乡'),
	(36, 08, 26, 203, '水槎乡'),
	(36, 08, 26, 204, '上圯乡'),
	(36, 08, 26, 205, '中龙乡');

/* 江西省 吉安市 遂川县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 27, 100, '泉江镇'),
	(36, 08, 27, 101, '雩田镇'),
	(36, 08, 27, 102, '碧洲镇'),
	(36, 08, 27, 103, '草林镇'),
	(36, 08, 27, 104, '堆子前镇'),
	(36, 08, 27, 105, '左安镇'),
	(36, 08, 27, 106, '高坪镇'),
	(36, 08, 27, 107, '大汾镇'),
	(36, 08, 27, 108, '衙前镇'),
	(36, 08, 27, 109, '禾源镇'),
	(36, 08, 27, 110, '汤湖镇'),
	(36, 08, 27, 200, '珠田乡'),
	(36, 08, 27, 201, '巾石乡'),
	(36, 08, 27, 202, '大坑乡'),
	(36, 08, 27, 203, '枚江乡'),
	(36, 08, 27, 204, '双桥乡'),
	(36, 08, 27, 205, '新江乡'),
	(36, 08, 27, 206, '五斗江乡'),
	(36, 08, 27, 207, '西溪乡'),
	(36, 08, 27, 208, '南江乡'),
	(36, 08, 27, 209, '黄坑乡'),
	(36, 08, 27, 210, '戴家埔乡'),
	(36, 08, 27, 211, '营盘圩乡');

/* 江西省 吉安市 万安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 28, 100, '芙蓉镇'),
	(36, 08, 28, 101, '五丰镇'),
	(36, 08, 28, 102, '枧头镇'),
	(36, 08, 28, 103, '窑头镇'),
	(36, 08, 28, 104, '百嘉镇'),
	(36, 08, 28, 105, '高陂镇'),
	(36, 08, 28, 106, '潞田镇'),
	(36, 08, 28, 107, '沙坪镇'),
	(36, 08, 28, 108, '夏造镇'),
	(36, 08, 28, 200, '罗塘乡'),
	(36, 08, 28, 201, '弹前乡'),
	(36, 08, 28, 202, '武术乡'),
	(36, 08, 28, 203, '宝山乡'),
	(36, 08, 28, 204, '涧田乡'),
	(36, 08, 28, 205, '顺峰乡'),
	(36, 08, 28, 206, '韶口乡');

/* 江西省 吉安市 安福县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 29, 100, '平都镇'),
	(36, 08, 29, 101, '浒坑镇'),
	(36, 08, 29, 102, '洲湖镇'),
	(36, 08, 29, 103, '横龙镇'),
	(36, 08, 29, 104, '洋溪镇'),
	(36, 08, 29, 105, '严田镇'),
	(36, 08, 29, 106, '枫田镇'),
	(36, 08, 29, 200, '竹江乡'),
	(36, 08, 29, 201, '瓜畲乡'),
	(36, 08, 29, 202, '钱山乡'),
	(36, 08, 29, 203, '赤谷乡'),
	(36, 08, 29, 204, '山庄乡'),
	(36, 08, 29, 205, '洋门乡'),
	(36, 08, 29, 206, '金田乡'),
	(36, 08, 29, 207, '彭坊乡'),
	(36, 08, 29, 208, '泰山乡'),
	(36, 08, 29, 209, '寮塘乡'),
	(36, 08, 29, 210, '甘洛乡'),
	(36, 08, 29, 211, '章庄乡');

/* 江西省 吉安市 永新县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 30, 100, '禾川镇'),
	(36, 08, 30, 101, '石桥镇'),
	(36, 08, 30, 102, '龙源口镇'),
	(36, 08, 30, 103, '浬田镇'),
	(36, 08, 30, 104, '龙门镇'),
	(36, 08, 30, 105, '沙市镇'),
	(36, 08, 30, 106, '文竹镇'),
	(36, 08, 30, 107, '埠前镇'),
	(36, 08, 30, 108, '怀忠镇'),
	(36, 08, 30, 109, '高桥楼镇'),
	(36, 08, 30, 200, '坳南乡'),
	(36, 08, 30, 201, '曲白乡'),
	(36, 08, 30, 202, '才丰乡'),
	(36, 08, 30, 203, '烟阁乡'),
	(36, 08, 30, 204, '在中乡'),
	(36, 08, 30, 205, '三湾乡'),
	(36, 08, 30, 206, '台岭乡'),
	(36, 08, 30, 207, '龙田乡'),
	(36, 08, 30, 208, '高溪乡'),
	(36, 08, 30, 209, '莲洲乡'),
	(36, 08, 30, 210, '高市乡'),
	(36, 08, 30, 211, '象形乡'),
	(36, 08, 30, 212, '芦溪乡');

/* 江西省 吉安市 井冈山市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 08, 81, 002, '红星街道办事处'),
	(36, 08, 81, 100, '厦坪镇'),
	(36, 08, 81, 101, '龙市镇'),
	(36, 08, 81, 102, '古城镇'),
	(36, 08, 81, 103, '新城镇'),
	(36, 08, 81, 104, '大陇镇'),
	(36, 08, 81, 105, '茨坪镇'),
	(36, 08, 81, 200, '拿山乡'),
	(36, 08, 81, 201, '黄垇乡'),
	(36, 08, 81, 202, '下七乡'),
	(36, 08, 81, 203, '长坪乡'),
	(36, 08, 81, 204, '坳里乡'),
	(36, 08, 81, 205, '鹅岭乡'),
	(36, 08, 81, 206, '柏露乡'),
	(36, 08, 81, 207, '茅坪乡'),
	(36, 08, 81, 208, '葛田乡'),
	(36, 08, 81, 209, '荷花乡'),
	(36, 08, 81, 210, '睦村乡'),
	(36, 08, 81, 211, '东上乡');

/* 江西省 宜春市 袁州区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 09, 02, 001, '灵泉街道'),
	(36, 09, 02, 002, '秀江街道'),
	(36, 09, 02, 004, '湛郎街道'),
	(36, 09, 02, 005, '珠泉街道'),
	(36, 09, 02, 006, '化成街道'),
	(36, 09, 02, 007, '官园街道'),
	(36, 09, 02, 008, '下浦街道'),
	(36, 09, 02, 009, '凤凰街道'),
	(36, 09, 02, 010, '金园街道'),
	(36, 09, 02, 100, '彬江镇'),
	(36, 09, 02, 101, '西村镇'),
	(36, 09, 02, 102, '金瑞镇'),
	(36, 09, 02, 103, '温汤镇'),
	(36, 09, 02, 104, '三阳镇'),
	(36, 09, 02, 105, '慈化镇'),
	(36, 09, 02, 106, '天台镇'),
	(36, 09, 02, 107, '洪塘镇'),
	(36, 09, 02, 108, '渥江镇'),
	(36, 09, 02, 109, '新坊镇'),
	(36, 09, 02, 110, '寨下镇'),
	(36, 09, 02, 111, '芦村镇'),
	(36, 09, 02, 112, '湖田镇'),
	(36, 09, 02, 113, '新田镇'),
	(36, 09, 02, 114, '南庙镇'),
	(36, 09, 02, 115, '竹亭镇'),
	(36, 09, 02, 116, '水江镇'),
	(36, 09, 02, 117, '辽市镇'),
	(36, 09, 02, 118, '洪江镇'),
	(36, 09, 02, 206, '楠木乡'),
	(36, 09, 02, 210, '柏木乡'),
	(36, 09, 02, 213, '飞剑潭乡');

/* 江西省 宜春市 奉新县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 09, 21, 100, '冯川镇'),
	(36, 09, 21, 101, '赤岸镇'),
	(36, 09, 21, 102, '赤田镇'),
	(36, 09, 21, 103, '宋埠镇'),
	(36, 09, 21, 104, '干洲镇'),
	(36, 09, 21, 105, '澡下镇'),
	(36, 09, 21, 106, '会埠镇'),
	(36, 09, 21, 107, '罗市镇'),
	(36, 09, 21, 108, '上富镇'),
	(36, 09, 21, 109, '甘坊镇'),
	(36, 09, 21, 200, '仰山乡'),
	(36, 09, 21, 201, '澡溪乡'),
	(36, 09, 21, 202, '柳溪乡');

/* 江西省 宜春市 万载县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 09, 22, 001, '康乐街道'),
	(36, 09, 22, 100, '株潭镇'),
	(36, 09, 22, 101, '黄茅镇'),
	(36, 09, 22, 102, '潭埠镇'),
	(36, 09, 22, 103, '双桥镇'),
	(36, 09, 22, 104, '高村镇'),
	(36, 09, 22, 105, '罗城镇'),
	(36, 09, 22, 106, '三兴镇'),
	(36, 09, 22, 107, '高城镇'),
	(36, 09, 22, 108, '白良镇'),
	(36, 09, 22, 200, '鹅峰乡'),
	(36, 09, 22, 201, '马步乡'),
	(36, 09, 22, 203, '赤兴乡'),
	(36, 09, 22, 204, '岭东乡'),
	(36, 09, 22, 205, '白水乡'),
	(36, 09, 22, 206, '仙源乡'),
	(36, 09, 22, 208, '茭湖乡');

/* 江西省 宜春市 上高县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 09, 23, 001, '敖阳街道'),
	(36, 09, 23, 100, '田心镇'),
	(36, 09, 23, 101, '徐家渡镇'),
	(36, 09, 23, 102, '锦江镇'),
	(36, 09, 23, 103, '泗溪镇'),
	(36, 09, 23, 104, '翰堂镇'),
	(36, 09, 23, 105, '南港镇'),
	(36, 09, 23, 106, '敖山镇'),
	(36, 09, 23, 107, '新界埠镇'),
	(36, 09, 23, 108, '蒙山镇'),
	(36, 09, 23, 200, '芦洲乡'),
	(36, 09, 23, 201, '塔下乡'),
	(36, 09, 23, 203, '镇渡乡'),
	(36, 09, 23, 204, '野市乡'),
	(36, 09, 23, 206, '墨山乡');

/* 江西省 宜春市 宜丰县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 09, 24, 100, '新昌镇'),
	(36, 09, 24, 101, '澄塘镇'),
	(36, 09, 24, 102, '棠浦镇'),
	(36, 09, 24, 103, '新庄镇'),
	(36, 09, 24, 104, '潭山镇'),
	(36, 09, 24, 105, '芳溪镇'),
	(36, 09, 24, 106, '石市镇'),
	(36, 09, 24, 107, '黄岗镇'),
	(36, 09, 24, 200, '花桥乡'),
	(36, 09, 24, 201, '同安乡'),
	(36, 09, 24, 202, '天宝乡'),
	(36, 09, 24, 204, '桥西乡');

/* 江西省 宜春市 靖安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 09, 25, 100, '双溪镇'),
	(36, 09, 25, 101, '仁首镇'),
	(36, 09, 25, 102, '宝峰镇'),
	(36, 09, 25, 103, '高湖镇'),
	(36, 09, 25, 104, '璪都镇'),
	(36, 09, 25, 200, '香田乡'),
	(36, 09, 25, 201, '水口乡'),
	(36, 09, 25, 202, '中源乡'),
	(36, 09, 25, 203, '罗湾乡'),
	(36, 09, 25, 205, '三爪仑乡'),
	(36, 09, 25, 206, '雷公尖乡');

/* 江西省 宜春市 铜鼓县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 09, 26, 100, '永宁镇'),
	(36, 09, 26, 101, '温泉镇'),
	(36, 09, 26, 102, '棋坪镇'),
	(36, 09, 26, 103, '排埠镇'),
	(36, 09, 26, 104, '三都镇'),
	(36, 09, 26, 105, '大塅镇'),
	(36, 09, 26, 200, '高桥乡'),
	(36, 09, 26, 201, '港口乡'),
	(36, 09, 26, 202, '带溪乡');

/* 江西省 宜春市 丰城市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 09, 81, 002, '剑光街道'),
	(36, 09, 81, 006, '河洲街道'),
	(36, 09, 81, 007, '剑南街道'),
	(36, 09, 81, 008, '孙渡街道'),
	(36, 09, 81, 009, '尚庄街道'),
	(36, 09, 81, 101, '白土镇'),
	(36, 09, 81, 102, '袁渡镇'),
	(36, 09, 81, 104, '张巷镇'),
	(36, 09, 81, 105, '杜市镇'),
	(36, 09, 81, 106, '淘沙镇'),
	(36, 09, 81, 107, '秀市镇'),
	(36, 09, 81, 109, '洛市镇'),
	(36, 09, 81, 110, '铁路镇'),
	(36, 09, 81, 111, '丽村镇'),
	(36, 09, 81, 115, '董家镇'),
	(36, 09, 81, 116, '隍城镇'),
	(36, 09, 81, 119, '小港镇'),
	(36, 09, 81, 120, '石滩镇'),
	(36, 09, 81, 121, '桥东镇'),
	(36, 09, 81, 122, '荣塘镇'),
	(36, 09, 81, 123, '拖船镇'),
	(36, 09, 81, 124, '泉港镇'),
	(36, 09, 81, 125, '梅林镇'),
	(36, 09, 81, 126, '曲江镇'),
	(36, 09, 81, 127, '上塘镇'),
	(36, 09, 81, 201, '筱塘乡'),
	(36, 09, 81, 202, '段潭乡'),
	(36, 09, 81, 203, '蕉坑乡'),
	(36, 09, 81, 204, '石江乡'),
	(36, 09, 81, 205, '荷湖乡'),
	(36, 09, 81, 206, '湖塘乡'),
	(36, 09, 81, 207, '同田乡');

/* 江西省 宜春市 樟树市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 09, 82, 001, '淦阳街道'),
	(36, 09, 82, 002, '鹿江街道'),
	(36, 09, 82, 003, '福城街道'),
	(36, 09, 82, 004, '大桥街道'),
	(36, 09, 82, 005, '张家山街道'),
	(36, 09, 82, 100, '临江镇'),
	(36, 09, 82, 101, '永泰镇'),
	(36, 09, 82, 102, '黄土岗镇'),
	(36, 09, 82, 103, '经楼镇'),
	(36, 09, 82, 104, '昌付镇'),
	(36, 09, 82, 105, '店下镇'),
	(36, 09, 82, 106, '阁山镇'),
	(36, 09, 82, 107, '刘公庙镇'),
	(36, 09, 82, 108, '观上镇'),
	(36, 09, 82, 109, '义成镇'),
	(36, 09, 82, 200, '中洲乡'),
	(36, 09, 82, 201, '洲上乡'),
	(36, 09, 82, 202, '洋湖乡'),
	(36, 09, 82, 203, '吴城乡');

/* 江西省 宜春市 高安市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 09, 83, 001, '瑞州街道'),
	(36, 09, 83, 002, '筠阳街道'),
	(36, 09, 83, 100, '蓝坊镇'),
	(36, 09, 83, 101, '荷岭镇'),
	(36, 09, 83, 102, '黄沙岗镇'),
	(36, 09, 83, 103, '新街镇'),
	(36, 09, 83, 104, '八景镇'),
	(36, 09, 83, 105, '独城镇'),
	(36, 09, 83, 106, '太阳镇'),
	(36, 09, 83, 107, '建山镇'),
	(36, 09, 83, 108, '田南镇'),
	(36, 09, 83, 109, '相城镇'),
	(36, 09, 83, 110, '灰埠镇'),
	(36, 09, 83, 111, '石脑镇'),
	(36, 09, 83, 112, '龙潭镇'),
	(36, 09, 83, 113, '杨圩镇'),
	(36, 09, 83, 114, '村前镇'),
	(36, 09, 83, 115, '伍桥镇'),
	(36, 09, 83, 116, '祥符镇'),
	(36, 09, 83, 117, '大城镇'),
	(36, 09, 83, 118, '华林山镇'),
	(36, 09, 83, 200, '上湖乡'),
	(36, 09, 83, 201, '汪家圩乡');

/* 江西省 抚州市 临川区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 10, 02, 001, '青云街道办事处'),
	(36, 10, 02, 002, '西大街街道办事处'),
	(36, 10, 02, 003, '荆公路街道办事处'),
	(36, 10, 02, 004, '六水桥街道办事处'),
	(36, 10, 02, 005, '文昌街道办事处'),
	(36, 10, 02, 091, '城西街道办事处（金巢开发区）'),
	(36, 10, 02, 092, '钟岭街道办事处（金巢开发区）'),
	(36, 10, 02, 100, '上顿渡镇'),
	(36, 10, 02, 101, '温泉镇'),
	(36, 10, 02, 102, '高坪镇'),
	(36, 10, 02, 103, '秋溪镇'),
	(36, 10, 02, 104, '荣山镇'),
	(36, 10, 02, 105, '龙溪镇'),
	(36, 10, 02, 107, '大岗镇'),
	(36, 10, 02, 108, '云山镇'),
	(36, 10, 02, 109, '唱凯镇'),
	(36, 10, 02, 110, '罗针镇'),
	(36, 10, 02, 111, '罗湖镇'),
	(36, 10, 02, 112, '太阳镇'),
	(36, 10, 02, 113, '东馆镇'),
	(36, 10, 02, 114, '腾桥镇'),
	(36, 10, 02, 115, '青泥镇'),
	(36, 10, 02, 116, '孝桥镇'),
	(36, 10, 02, 117, '抚北镇'),
	(36, 10, 02, 190, '崇岗镇（金巢开发区）'),
	(36, 10, 02, 200, '展坪乡'),
	(36, 10, 02, 201, '连城乡'),
	(36, 10, 02, 202, '桐源乡'),
	(36, 10, 02, 203, '湖南乡'),
	(36, 10, 02, 204, '七里岗乡'),
	(36, 10, 02, 205, '嵩湖乡'),
	(36, 10, 02, 206, '鹏田乡'),
	(36, 10, 02, 207, '茅排乡'),
	(36, 10, 02, 208, '河埠乡');

/* 江西省 抚州市 南城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 10, 21, 100, '建昌镇'),
	(36, 10, 21, 101, '株良镇'),
	(36, 10, 21, 102, '上唐镇'),
	(36, 10, 21, 103, '里塔镇'),
	(36, 10, 21, 104, '洪门镇'),
	(36, 10, 21, 105, '沙洲镇'),
	(36, 10, 21, 106, '龙湖镇'),
	(36, 10, 21, 107, '新丰街镇'),
	(36, 10, 21, 108, '万坊镇'),
	(36, 10, 21, 109, '徐家镇'),
	(36, 10, 21, 201, '天井源乡'),
	(36, 10, 21, 203, '浔溪乡');

/* 江西省 抚州市 黎川县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 10, 22, 100, '日峰镇'),
	(36, 10, 22, 101, '宏村镇'),
	(36, 10, 22, 102, '洵口镇'),
	(36, 10, 22, 103, '熊村镇'),
	(36, 10, 22, 104, '龙安镇'),
	(36, 10, 22, 105, '德胜镇'),
	(36, 10, 22, 106, '华山镇'),
	(36, 10, 22, 200, '潭溪乡'),
	(36, 10, 22, 201, '湖坊乡'),
	(36, 10, 22, 202, '荷源乡'),
	(36, 10, 22, 203, '厚村乡'),
	(36, 10, 22, 204, '社苹乡'),
	(36, 10, 22, 205, '樟溪乡'),
	(36, 10, 22, 206, '西城乡'),
	(36, 10, 22, 207, '中田乡');

/* 江西省 抚州市 南丰县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 10, 23, 100, '琴城镇'),
	(36, 10, 23, 101, '太和镇'),
	(36, 10, 23, 102, '白舍镇'),
	(36, 10, 23, 103, '市山镇'),
	(36, 10, 23, 104, '洽湾镇'),
	(36, 10, 23, 105, '桑田镇'),
	(36, 10, 23, 106, '紫霄镇'),
	(36, 10, 23, 200, '三溪乡'),
	(36, 10, 23, 201, '东坪乡'),
	(36, 10, 23, 202, '莱溪乡'),
	(36, 10, 23, 203, '太源乡'),
	(36, 10, 23, 204, '傅坊乡');

/* 江西省 抚州市 崇仁县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 10, 24, 100, '巴山镇'),
	(36, 10, 24, 101, '相山镇'),
	(36, 10, 24, 102, '航埠镇'),
	(36, 10, 24, 103, '孙坊镇'),
	(36, 10, 24, 104, '河上镇'),
	(36, 10, 24, 105, '礼陂镇'),
	(36, 10, 24, 106, '马鞍镇'),
	(36, 10, 24, 200, '石庄乡'),
	(36, 10, 24, 201, '六家桥乡'),
	(36, 10, 24, 202, '白鹭乡'),
	(36, 10, 24, 203, '三山乡'),
	(36, 10, 24, 204, '白陂乡'),
	(36, 10, 24, 205, '桃源乡'),
	(36, 10, 24, 206, '许坊乡'),
	(36, 10, 24, 207, '郭圩乡');

/* 江西省 抚州市 乐安县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 10, 25, 100, '鳌溪镇'),
	(36, 10, 25, 101, '公溪镇'),
	(36, 10, 25, 102, '山砀镇'),
	(36, 10, 25, 103, '龚坊镇'),
	(36, 10, 25, 104, '戴坊镇'),
	(36, 10, 25, 105, '牛田镇'),
	(36, 10, 25, 106, '万崇镇'),
	(36, 10, 25, 107, '增田镇'),
	(36, 10, 25, 108, '招携镇'),
	(36, 10, 25, 200, '湖溪乡'),
	(36, 10, 25, 201, '罗陂乡'),
	(36, 10, 25, 202, '湖坪乡'),
	(36, 10, 25, 203, '南村乡'),
	(36, 10, 25, 204, '谷岗乡'),
	(36, 10, 25, 205, '金竹畲族乡'),
	(36, 10, 25, 206, '大马头乡');

/* 江西省 抚州市 宜黄县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 10, 26, 100, '凤冈镇'),
	(36, 10, 26, 101, '棠阴镇'),
	(36, 10, 26, 102, '黄陂镇'),
	(36, 10, 26, 103, '东陂镇'),
	(36, 10, 26, 104, '梨溪镇'),
	(36, 10, 26, 105, '二都镇'),
	(36, 10, 26, 106, '中港镇'),
	(36, 10, 26, 107, '桃陂镇'),
	(36, 10, 26, 201, '新丰乡'),
	(36, 10, 26, 202, '神岗乡'),
	(36, 10, 26, 203, '圳口乡'),
	(36, 10, 26, 204, '南源乡');

/* 江西省 抚州市 金溪县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 10, 27, 100, '秀谷镇'),
	(36, 10, 27, 101, '浒湾镇'),
	(36, 10, 27, 102, '双塘镇'),
	(36, 10, 27, 103, '何源镇'),
	(36, 10, 27, 104, '合市镇'),
	(36, 10, 27, 105, '琅琚镇'),
	(36, 10, 27, 106, '左坊镇'),
	(36, 10, 27, 107, '对桥镇'),
	(36, 10, 27, 200, '黄通乡'),
	(36, 10, 27, 202, '陆坊乡'),
	(36, 10, 27, 203, '陈坊积乡'),
	(36, 10, 27, 204, '琉璃乡'),
	(36, 10, 27, 205, '石门乡');

/* 江西省 抚州市 资溪县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 10, 28, 100, '鹤城镇'),
	(36, 10, 28, 101, '马头山镇'),
	(36, 10, 28, 102, '高阜镇'),
	(36, 10, 28, 103, '嵩市镇'),
	(36, 10, 28, 104, '乌石镇'),
	(36, 10, 28, 200, '高田乡'),
	(36, 10, 28, 201, '石峡乡');

/* 江西省 抚州市 东乡县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 10, 29, 100, '孝岗镇'),
	(36, 10, 29, 101, '小璜镇'),
	(36, 10, 29, 102, '圩上桥镇'),
	(36, 10, 29, 103, '马圩镇'),
	(36, 10, 29, 104, '詹圩镇'),
	(36, 10, 29, 105, '岗上积镇'),
	(36, 10, 29, 106, '杨桥殿镇'),
	(36, 10, 29, 107, '黎圩镇'),
	(36, 10, 29, 108, '王桥镇'),
	(36, 10, 29, 200, '珀玕乡'),
	(36, 10, 29, 201, '邓家乡'),
	(36, 10, 29, 202, '虎圩乡'),
	(36, 10, 29, 203, '瑶圩乡');

/* 江西省 抚州市 广昌县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 10, 30, 100, '盱江镇'),
	(36, 10, 30, 101, '头陂镇'),
	(36, 10, 30, 103, '赤水镇'),
	(36, 10, 30, 104, '驿前镇'),
	(36, 10, 30, 105, '甘竹镇'),
	(36, 10, 30, 200, '千善乡'),
	(36, 10, 30, 201, '水南圩乡'),
	(36, 10, 30, 202, '长桥乡'),
	(36, 10, 30, 203, '杨溪乡'),
	(36, 10, 30, 204, '尖峰乡'),
	(36, 10, 30, 205, '塘坊乡');

/* 江西省 上饶市 信州区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 02, 001, '水南街道办事处'),
	(36, 11, 02, 002, '东市街道办事处'),
	(36, 11, 02, 003, '西市街道办事处'),
	(36, 11, 02, 004, '北门街道办事处'),
	(36, 11, 02, 005, '茅家岭街道'),
	(36, 11, 02, 006, '灵溪街道办事处'),
	(36, 11, 02, 100, '沙溪镇'),
	(36, 11, 02, 102, '朝阳镇'),
	(36, 11, 02, 103, '秦峰镇');

/* 江西省 上饶市 广丰区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 03, 001, '永丰街道办事处'),
	(36, 11, 03, 002, '芦林街道办事处'),
	(36, 11, 03, 003, '丰溪街道办事处'),
	(36, 11, 03, 101, '五都镇'),
	(36, 11, 03, 102, '洋口镇'),
	(36, 11, 03, 103, '横山镇'),
	(36, 11, 03, 104, '桐畈镇'),
	(36, 11, 03, 105, '湖丰镇'),
	(36, 11, 03, 106, '大南镇'),
	(36, 11, 03, 107, '排山镇'),
	(36, 11, 03, 108, '毛村镇'),
	(36, 11, 03, 109, '枧底镇'),
	(36, 11, 03, 110, '泉波镇'),
	(36, 11, 03, 111, '壶峤镇'),
	(36, 11, 03, 112, '霞峰镇'),
	(36, 11, 03, 113, '下溪镇'),
	(36, 11, 03, 114, '吴村镇'),
	(36, 11, 03, 115, '沙田镇'),
	(36, 11, 03, 116, '铜钹山镇'),
	(36, 11, 03, 200, '大石乡'),
	(36, 11, 03, 202, '东阳乡'),
	(36, 11, 03, 204, '嵩峰乡'),
	(36, 11, 03, 206, '少阳乡');

/* 江西省 上饶市 上饶县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 21, 001, '旭日街道办事处'),
	(36, 11, 21, 002, '罗桥街道办事处'),
	(36, 11, 21, 003, '兴园街道办事处'),
	(36, 11, 21, 101, '田墩镇'),
	(36, 11, 21, 102, '上泸镇'),
	(36, 11, 21, 103, '华坛山镇'),
	(36, 11, 21, 104, '茶亭镇'),
	(36, 11, 21, 105, '皂头镇'),
	(36, 11, 21, 106, '四十八镇'),
	(36, 11, 21, 107, '枫岭头镇'),
	(36, 11, 21, 108, '煌固镇'),
	(36, 11, 21, 109, '花厅镇'),
	(36, 11, 21, 110, '五府山镇'),
	(36, 11, 21, 111, '郑坊镇'),
	(36, 11, 21, 200, '望仙乡'),
	(36, 11, 21, 201, '石人乡'),
	(36, 11, 21, 202, '清水乡'),
	(36, 11, 21, 203, '石狮乡'),
	(36, 11, 21, 204, '湖村乡'),
	(36, 11, 21, 207, '尊桥乡'),
	(36, 11, 21, 209, '应家乡'),
	(36, 11, 21, 210, '黄沙岭乡'),
	(36, 11, 21, 211, '铁山乡'),
	(36, 11, 21, 250, '董团乡');

/* 江西省 上饶市 玉山县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 23, 001, '枫林办事处'),
	(36, 11, 23, 100, '冰溪镇'),
	(36, 11, 23, 101, '临湖镇'),
	(36, 11, 23, 102, '必姆镇'),
	(36, 11, 23, 103, '横街镇'),
	(36, 11, 23, 104, '文成镇'),
	(36, 11, 23, 105, '下镇镇'),
	(36, 11, 23, 107, '岩瑞镇'),
	(36, 11, 23, 108, '双明镇'),
	(36, 11, 23, 109, '紫湖镇'),
	(36, 11, 23, 110, '仙岩镇'),
	(36, 11, 23, 111, '樟村镇'),
	(36, 11, 23, 200, '南山乡'),
	(36, 11, 23, 201, '怀玉乡'),
	(36, 11, 23, 202, '下塘乡'),
	(36, 11, 23, 203, '四股桥乡'),
	(36, 11, 23, 204, '六都乡'),
	(36, 11, 23, 250, '三清乡');

/* 江西省 上饶市 铅山县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 24, 100, '河口镇'),
	(36, 11, 24, 101, '永平镇'),
	(36, 11, 24, 102, '石塘镇'),
	(36, 11, 24, 103, '鹅湖镇'),
	(36, 11, 24, 105, '湖坊镇'),
	(36, 11, 24, 106, '武夷山镇'),
	(36, 11, 24, 108, '汪二镇'),
	(36, 11, 24, 200, '陈坊乡'),
	(36, 11, 24, 201, '虹桥乡'),
	(36, 11, 24, 202, '新滩乡'),
	(36, 11, 24, 203, '葛仙山乡'),
	(36, 11, 24, 205, '稼轩乡'),
	(36, 11, 24, 206, '英将乡'),
	(36, 11, 24, 207, '紫溪乡'),
	(36, 11, 24, 208, '太源畲族乡'),
	(36, 11, 24, 209, '天柱山乡'),
	(36, 11, 24, 210, '篁碧畲族乡');

/* 江西省 上饶市 横峰县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 25, 001, '兴安街道办事处'),
	(36, 11, 25, 100, '岑阳镇'),
	(36, 11, 25, 101, '葛源镇'),
	(36, 11, 25, 200, '姚家乡'),
	(36, 11, 25, 201, '莲荷乡'),
	(36, 11, 25, 202, '司铺乡'),
	(36, 11, 25, 203, '港边乡'),
	(36, 11, 25, 204, '龙门畈乡'),
	(36, 11, 25, 205, '青板乡');

/* 江西省 上饶市 弋阳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 26, 001, '桃源街道办事处'),
	(36, 11, 26, 101, '曹溪镇'),
	(36, 11, 26, 102, '漆工镇'),
	(36, 11, 26, 103, '樟树墩镇'),
	(36, 11, 26, 104, '南岩镇'),
	(36, 11, 26, 105, '朱坑镇'),
	(36, 11, 26, 106, '圭峰镇'),
	(36, 11, 26, 107, '叠山镇'),
	(36, 11, 26, 108, '港口镇'),
	(36, 11, 26, 109, '弋江镇'),
	(36, 11, 26, 202, '中畈乡'),
	(36, 11, 26, 203, '葛溪乡'),
	(36, 11, 26, 204, '湾里乡'),
	(36, 11, 26, 206, '清湖乡'),
	(36, 11, 26, 207, '旭光乡');

/* 江西省 上饶市 余干县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 27, 100, '玉亭镇'),
	(36, 11, 27, 101, '瑞洪镇'),
	(36, 11, 27, 102, '黄金埠镇'),
	(36, 11, 27, 104, '古埠镇'),
	(36, 11, 27, 105, '乌泥镇'),
	(36, 11, 27, 106, '石口镇'),
	(36, 11, 27, 107, '杨埠镇'),
	(36, 11, 27, 108, '九龙镇'),
	(36, 11, 27, 109, '社赓镇'),
	(36, 11, 27, 200, '康山乡'),
	(36, 11, 27, 202, '东塘乡'),
	(36, 11, 27, 204, '大塘乡'),
	(36, 11, 27, 206, '鹭鸶港乡'),
	(36, 11, 27, 207, '三塘乡'),
	(36, 11, 27, 209, '洪家嘴乡'),
	(36, 11, 27, 210, '白马桥乡'),
	(36, 11, 27, 211, '江埠乡'),
	(36, 11, 27, 213, '枫港乡'),
	(36, 11, 27, 214, '大溪乡'),
	(36, 11, 27, 217, '梅港乡');

/* 江西省 上饶市 鄱阳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 28, 001, '饶州街道办事处'),
	(36, 11, 28, 100, '鄱阳镇'),
	(36, 11, 28, 101, '谢家滩镇'),
	(36, 11, 28, 102, '石门街镇'),
	(36, 11, 28, 103, '四十里街镇'),
	(36, 11, 28, 104, '油墩街镇'),
	(36, 11, 28, 105, '田畈街镇'),
	(36, 11, 28, 106, '金盘岭镇'),
	(36, 11, 28, 107, '高家岭镇'),
	(36, 11, 28, 108, '凰岗镇'),
	(36, 11, 28, 109, '双港镇'),
	(36, 11, 28, 110, '古县渡镇'),
	(36, 11, 28, 111, '饶丰镇'),
	(36, 11, 28, 112, '乐丰镇'),
	(36, 11, 28, 113, '饶埠镇'),
	(36, 11, 28, 201, '侯家岗乡'),
	(36, 11, 28, 202, '莲花山乡'),
	(36, 11, 28, 203, '响水滩乡'),
	(36, 11, 28, 206, '枧田街乡'),
	(36, 11, 28, 207, '柘港乡'),
	(36, 11, 28, 208, '鸦鹊湖乡'),
	(36, 11, 28, 209, '银宝湖乡'),
	(36, 11, 28, 210, '游城乡'),
	(36, 11, 28, 211, '珠湖乡'),
	(36, 11, 28, 212, '白沙洲乡'),
	(36, 11, 28, 213, '团林乡'),
	(36, 11, 28, 215, '昌洲乡'),
	(36, 11, 28, 216, '庙前乡'),
	(36, 11, 28, 217, '莲湖乡'),
	(36, 11, 28, 218, '芦田乡');

/* 江西省 上饶市 万年县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 29, 100, '陈营镇'),
	(36, 11, 29, 101, '石镇镇'),
	(36, 11, 29, 102, '青云镇'),
	(36, 11, 29, 103, '梓埠镇'),
	(36, 11, 29, 104, '大源镇'),
	(36, 11, 29, 105, '裴梅镇'),
	(36, 11, 29, 200, '湖云乡'),
	(36, 11, 29, 201, '齐埠乡'),
	(36, 11, 29, 203, '汪家乡'),
	(36, 11, 29, 205, '上坊乡'),
	(36, 11, 29, 206, '苏桥乡'),
	(36, 11, 29, 208, '珠田乡');

/* 江西省 上饶市 婺源县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 30, 001, '蚺城街道'),
	(36, 11, 30, 100, '紫阳镇'),
	(36, 11, 30, 101, '清华镇'),
	(36, 11, 30, 102, '秋口镇'),
	(36, 11, 30, 103, '江湾镇'),
	(36, 11, 30, 104, '思口镇'),
	(36, 11, 30, 106, '赋春镇'),
	(36, 11, 30, 107, '镇头镇'),
	(36, 11, 30, 109, '太白镇'),
	(36, 11, 30, 110, '中云镇'),
	(36, 11, 30, 111, '许村镇'),
	(36, 11, 30, 200, '溪头乡'),
	(36, 11, 30, 201, '段莘乡'),
	(36, 11, 30, 204, '浙源乡'),
	(36, 11, 30, 205, '沱川乡'),
	(36, 11, 30, 206, '大鄣山乡'),
	(36, 11, 30, 208, '珍珠山乡');

/* 江西省 上饶市 德兴市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(36, 11, 81, 001, '银城街道办事处'),
	(36, 11, 81, 002, '新营街道办事处'),
	(36, 11, 81, 003, '香屯街道办事处'),
	(36, 11, 81, 103, '绕二镇'),
	(36, 11, 81, 105, '海口镇'),
	(36, 11, 81, 106, '新岗山镇'),
	(36, 11, 81, 107, '泗洲镇'),
	(36, 11, 81, 190, '花桥镇'),
	(36, 11, 81, 200, '黄柏乡'),
	(36, 11, 81, 201, '万村乡'),
	(36, 11, 81, 202, '张村乡'),
	(36, 11, 81, 203, '昄大乡'),
	(36, 11, 81, 204, '李宅乡'),
	(36, 11, 81, 205, '龙头山乡');


/* 山东省 济南市 历下区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 01, 02, 001, '解放路街道办事处'),
	(37, 01, 02, 002, '千佛山街道办事处'),
	(37, 01, 02, 003, '趵突泉街道办事处'),
	(37, 01, 02, 004, '泉城路街道办事处'),
	(37, 01, 02, 005, '大明湖街道办事处'),
	(37, 01, 02, 006, '东关街道办事处'),
	(37, 01, 02, 007, '文东街道办事处'),
	(37, 01, 02, 008, '建新街道办事处'),
	(37, 01, 02, 009, '甸柳街道办事处'),
	(37, 01, 02, 010, '燕山街道办事处'),
	(37, 01, 02, 011, '姚家街道办事处'),
	(37, 01, 02, 012, '龙洞街道办事处'),
	(37, 01, 02, 013, '智远街道办事处'),
	(37, 01, 02, 014, '舜华路街道办事处');

/* 山东省 济南市 市中区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 01, 03, 002, '大观园街道办事处'),
	(37, 01, 03, 003, '杆石桥街道办事处'),
	(37, 01, 03, 004, '四里村街道办事处'),
	(37, 01, 03, 006, '魏家庄街道办事处'),
	(37, 01, 03, 008, '二七街道办事处'),
	(37, 01, 03, 009, '七里山街道办事处'),
	(37, 01, 03, 010, '六里山街道办事处'),
	(37, 01, 03, 012, '舜玉路街道办事处'),
	(37, 01, 03, 014, '泺源街道办事处'),
	(37, 01, 03, 015, '王官庄街道办事处'),
	(37, 01, 03, 016, '舜耕街道办事处'),
	(37, 01, 03, 017, '白马山街道办事处'),
	(37, 01, 03, 018, '七贤街道办事处'),
	(37, 01, 03, 019, '十六里河街道办事处'),
	(37, 01, 03, 020, '兴隆街道办事处'),
	(37, 01, 03, 021, '党家街道办事处'),
	(37, 01, 03, 022, '陡沟街道办事处');

/* 山东省 济南市 槐荫区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 01, 04, 001, '振兴街街道办事处'),
	(37, 01, 04, 002, '中大槐树街道办事处'),
	(37, 01, 04, 003, '道德街街道办事处'),
	(37, 01, 04, 004, '西市场街道办事处'),
	(37, 01, 04, 005, '五里沟街道办事处'),
	(37, 01, 04, 006, '营市街街道办事处'),
	(37, 01, 04, 007, '青年公园街道办事处'),
	(37, 01, 04, 008, '南辛庄街道办事处'),
	(37, 01, 04, 009, '段店北路街道办事处'),
	(37, 01, 04, 010, '张庄路街道办事处'),
	(37, 01, 04, 011, '匡山街道办事处'),
	(37, 01, 04, 012, '美里湖街道办事处'),
	(37, 01, 04, 013, '腊山街道办事处'),
	(37, 01, 04, 014, '兴福街道办事处'),
	(37, 01, 04, 015, '玉清湖街道办事处'),
	(37, 01, 04, 016, '吴家堡街道办事处');

/* 山东省 济南市 天桥区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 01, 05, 001, '无影山街道办事处'),
	(37, 01, 05, 003, '天桥东街街道办事处'),
	(37, 01, 05, 004, '北村街道办事处'),
	(37, 01, 05, 005, '南村街道办事处'),
	(37, 01, 05, 006, '堤口路街道办事处'),
	(37, 01, 05, 007, '北坦街道办事处'),
	(37, 01, 05, 009, '制锦市街道办事处'),
	(37, 01, 05, 010, '宝华街道办事处'),
	(37, 01, 05, 011, '官扎营街道办事处'),
	(37, 01, 05, 012, '纬北路街道办事处'),
	(37, 01, 05, 013, '药山街道办事处'),
	(37, 01, 05, 014, '北园街道办事处'),
	(37, 01, 05, 015, '泺口街道办事处'),
	(37, 01, 05, 101, '桑梓店镇'),
	(37, 01, 05, 102, '大桥镇');

/* 山东省 济南市 历城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 01, 12, 001, '山大路街道办事处'),
	(37, 01, 12, 002, '洪家楼街道办事处'),
	(37, 01, 12, 003, '东风街道办事处'),
	(37, 01, 12, 004, '全福街道办事处'),
	(37, 01, 12, 005, '孙村街道办事处'),
	(37, 01, 12, 006, '巨野河街道办事处'),
	(37, 01, 12, 007, '华山街道办事处'),
	(37, 01, 12, 008, '荷花路街道办事处'),
	(37, 01, 12, 009, '王舍人街道办事处'),
	(37, 01, 12, 010, '鲍山街道办事处'),
	(37, 01, 12, 011, '郭店街道办事处'),
	(37, 01, 12, 012, '唐冶街道办事处'),
	(37, 01, 12, 013, '港沟街道办事处'),
	(37, 01, 12, 014, '遥墙街道办事处'),
	(37, 01, 12, 015, '临港街道办事处'),
	(37, 01, 12, 101, '仲宫镇'),
	(37, 01, 12, 103, '柳埠镇'),
	(37, 01, 12, 106, '董家镇'),
	(37, 01, 12, 107, '唐王镇'),
	(37, 01, 12, 111, '西营镇'),
	(37, 01, 12, 112, '彩石镇');

/* 山东省 济南市 长清区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 01, 13, 001, '文昌街道办事处'),
	(37, 01, 13, 002, '崮云湖街道办事处'),
	(37, 01, 13, 003, '平安街道办事处'),
	(37, 01, 13, 004, '五峰山街道办事处'),
	(37, 01, 13, 101, '归德镇'),
	(37, 01, 13, 102, '孝里镇'),
	(37, 01, 13, 103, '万德镇'),
	(37, 01, 13, 106, '张夏镇'),
	(37, 01, 13, 107, '马山镇'),
	(37, 01, 13, 108, '双泉镇');

/* 山东省 济南市 平阴县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 01, 24, 001, '榆山街道办事处'),
	(37, 01, 24, 002, '锦水街道办事处'),
	(37, 01, 24, 102, '东阿镇'),
	(37, 01, 24, 103, '孝直镇'),
	(37, 01, 24, 104, '孔村镇'),
	(37, 01, 24, 105, '洪范池镇'),
	(37, 01, 24, 106, '玫瑰镇'),
	(37, 01, 24, 107, '安城镇');

/* 山东省 济南市 济阳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 01, 25, 001, '济阳街道办事处'),
	(37, 01, 25, 002, '济北街道办事处'),
	(37, 01, 25, 101, '垛石镇'),
	(37, 01, 25, 102, '孙耿镇'),
	(37, 01, 25, 103, '曲堤镇'),
	(37, 01, 25, 104, '仁风镇'),
	(37, 01, 25, 107, '崔寨镇'),
	(37, 01, 25, 108, '太平镇'),
	(37, 01, 25, 109, '回河镇'),
	(37, 01, 25, 110, '新市镇');

/* 山东省 济南市 商河县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 01, 26, 001, '许商街道办事处'),
	(37, 01, 26, 101, '殷巷镇'),
	(37, 01, 26, 102, '怀仁镇'),
	(37, 01, 26, 104, '龙桑寺镇'),
	(37, 01, 26, 105, '郑路镇'),
	(37, 01, 26, 106, '贾庄镇'),
	(37, 01, 26, 107, '玉皇庙镇'),
	(37, 01, 26, 108, '白桥镇'),
	(37, 01, 26, 109, '孙集镇'),
	(37, 01, 26, 110, '韩庙镇'),
	(37, 01, 26, 204, '沙河乡'),
	(37, 01, 26, 207, '张坊乡');

/* 山东省 济南市 章丘市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 01, 81, 001, '明水街道办事处'),
	(37, 01, 81, 002, '双山街道办事处'),
	(37, 01, 81, 003, '枣园街道办事处'),
	(37, 01, 81, 004, '龙山街道办事处'),
	(37, 01, 81, 005, '埠村街道办事处'),
	(37, 01, 81, 006, '圣井街道办事处'),
	(37, 01, 81, 007, '普集街道办事处'),
	(37, 01, 81, 008, '绣惠街道办事处'),
	(37, 01, 81, 009, '相公庄街道办事处'),
	(37, 01, 81, 010, '文祖街道办事处'),
	(37, 01, 81, 011, '官庄街道办事处'),
	(37, 01, 81, 105, '垛庄镇'),
	(37, 01, 81, 106, '水寨镇'),
	(37, 01, 81, 110, '刁镇'),
	(37, 01, 81, 111, '曹范镇'),
	(37, 01, 81, 113, '白云湖镇'),
	(37, 01, 81, 114, '高官寨镇'),
	(37, 01, 81, 115, '宁家埠镇'),
	(37, 01, 81, 122, '辛寨镇'),
	(37, 01, 81, 123, '黄河镇');

/* 山东省 青岛市 市南区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 02, 02, 001, '香港中路街道办事处'),
	(37, 02, 02, 002, '八大峡街道办事处'),
	(37, 02, 02, 004, '云南路街道办事处'),
	(37, 02, 02, 005, '中山路街道办事处'),
	(37, 02, 02, 007, '江苏路街道办事处'),
	(37, 02, 02, 009, '八大关街道办事处'),
	(37, 02, 02, 010, '湛山街道办事处'),
	(37, 02, 02, 012, '八大湖街道办事处'),
	(37, 02, 02, 013, '金门路街道办事处'),
	(37, 02, 02, 014, '珠海路街道办事处');

/* 山东省 青岛市 市北区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 02, 03, 005, '辽宁路街道办事处'),
	(37, 02, 03, 008, '延安路街道办事处'),
	(37, 02, 03, 011, '登州路街道办事处'),
	(37, 02, 03, 013, '宁夏路街道办事处'),
	(37, 02, 03, 014, '敦化路街道办事处'),
	(37, 02, 03, 015, '辽源路街道办事处'),
	(37, 02, 03, 016, '合肥路街道办事处'),
	(37, 02, 03, 019, '大港街道办事处'),
	(37, 02, 03, 020, '即墨路街道办事处'),
	(37, 02, 03, 021, '台东街道办事处'),
	(37, 02, 03, 022, '镇江路街道办事处'),
	(37, 02, 03, 025, '浮山新区街道办事处'),
	(37, 02, 03, 026, '阜新路街道办事处'),
	(37, 02, 03, 027, '海伦路街道办事处'),
	(37, 02, 03, 028, '四方街道办事处'),
	(37, 02, 03, 029, '兴隆路街道办事处'),
	(37, 02, 03, 030, '水清沟街道办事处'),
	(37, 02, 03, 031, '洛阳路街道办事处'),
	(37, 02, 03, 032, '河西街道办事处');

/* 山东省 青岛市 黄岛区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 02, 11, 001, '黄岛街道办事处'),
	(37, 02, 11, 002, '辛安街道办事处'),
	(37, 02, 11, 003, '薛家岛街道办事处'),
	(37, 02, 11, 004, '灵珠山街道办事处'),
	(37, 02, 11, 005, '长江路街道办事处'),
	(37, 02, 11, 006, '红石崖街道办事处'),
	(37, 02, 11, 007, '灵山卫街道办事处'),
	(37, 02, 11, 009, '珠海街道办事处'),
	(37, 02, 11, 010, '隐珠街道办事处'),
	(37, 02, 11, 011, '铁山街道办事处'),
	(37, 02, 11, 012, '滨海街道办事处'),
	(37, 02, 11, 013, '胶南街道办事处'),
	(37, 02, 11, 100, '王台镇'),
	(37, 02, 11, 101, '张家楼镇'),
	(37, 02, 11, 102, '琅琊镇'),
	(37, 02, 11, 103, '泊里镇'),
	(37, 02, 11, 104, '大场镇'),
	(37, 02, 11, 105, '大村镇'),
	(37, 02, 11, 106, '六汪镇'),
	(37, 02, 11, 107, '海青镇'),
	(37, 02, 11, 108, '宝山镇'),
	(37, 02, 11, 109, '藏南镇');

/* 山东省 青岛市 崂山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 02, 12, 001, '中韩街道'),
	(37, 02, 12, 002, '沙子口街道'),
	(37, 02, 12, 003, '王哥庄街道'),
	(37, 02, 12, 004, '北宅街道');

/* 山东省 青岛市 李沧区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 02, 13, 001, '振华路街道办事处'),
	(37, 02, 13, 003, '沧口街道办事处'),
	(37, 02, 13, 004, '兴华路街道办事处'),
	(37, 02, 13, 005, '兴城路街道办事处'),
	(37, 02, 13, 006, '李村街道办事处'),
	(37, 02, 13, 007, '虎山路街道办事处'),
	(37, 02, 13, 008, '浮山路街道办事处'),
	(37, 02, 13, 010, '湘潭路街道办事处'),
	(37, 02, 13, 011, '楼山街道办事处'),
	(37, 02, 13, 012, '九水街道办事处'),
	(37, 02, 13, 013, '世园街道办事处');

/* 山东省 青岛市 城阳区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 02, 14, 001, '城阳街道办事处'),
	(37, 02, 14, 002, '夏庄街道办事处'),
	(37, 02, 14, 003, '流亭街道办事处'),
	(37, 02, 14, 004, '棘洪滩街道办事处'),
	(37, 02, 14, 005, '上马街道办事处'),
	(37, 02, 14, 008, '惜福镇街道办事处');

/* 山东省 青岛市 胶州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 02, 81, 001, '阜安街道办事处'),
	(37, 02, 81, 002, '中云街道办事处'),
	(37, 02, 81, 004, '三里河街道办事处'),
	(37, 02, 81, 006, '九龙街道办事处'),
	(37, 02, 81, 007, '胶东街道办事处'),
	(37, 02, 81, 008, '胶北街道办事处'),
	(37, 02, 81, 100, '胶莱镇'),
	(37, 02, 81, 102, '李哥庄镇'),
	(37, 02, 81, 105, '铺集镇'),
	(37, 02, 81, 108, '里岔镇'),
	(37, 02, 81, 110, '胶西镇'),
	(37, 02, 81, 111, '洋河镇');

/* 山东省 青岛市 即墨市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 02, 82, 001, '环秀街道'),
	(37, 02, 82, 002, '潮海街道'),
	(37, 02, 82, 003, '通济街道办事处'),
	(37, 02, 82, 004, '北安街道'),
	(37, 02, 82, 005, '龙山街道办事处'),
	(37, 02, 82, 006, '龙泉街道办事处'),
	(37, 02, 82, 007, '鳌山卫街道办事处'),
	(37, 02, 82, 008, '温泉街道办事处'),
	(37, 02, 82, 105, '蓝村镇'),
	(37, 02, 82, 107, '灵山镇'),
	(37, 02, 82, 115, '段泊岚镇'),
	(37, 02, 82, 117, '移风店镇'),
	(37, 02, 82, 119, '大信镇'),
	(37, 02, 82, 121, '田横镇'),
	(37, 02, 82, 122, '金口镇');

/* 山东省 青岛市 平度市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 02, 83, 001, '东阁街道办事处'),
	(37, 02, 83, 002, '李园街道办事处'),
	(37, 02, 83, 003, '同和街道办事处'),
	(37, 02, 83, 004, '凤台街道办事处'),
	(37, 02, 83, 005, '白沙河街道办事处'),
	(37, 02, 83, 101, '古岘镇'),
	(37, 02, 83, 102, '仁兆镇'),
	(37, 02, 83, 105, '南村镇'),
	(37, 02, 83, 108, '蓼兰镇'),
	(37, 02, 83, 109, '崔家集镇'),
	(37, 02, 83, 110, '明村镇'),
	(37, 02, 83, 113, '田庄镇'),
	(37, 02, 83, 116, '新河镇'),
	(37, 02, 83, 119, '店子镇'),
	(37, 02, 83, 120, '大泽山镇'),
	(37, 02, 83, 122, '旧店镇'),
	(37, 02, 83, 124, '云山镇');

/* 山东省 青岛市 莱西市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 02, 85, 001, '水集街道办事处'),
	(37, 02, 85, 002, '望城街道办事处'),
	(37, 02, 85, 007, '沽河街道办事处'),
	(37, 02, 85, 101, '姜山镇'),
	(37, 02, 85, 102, '夏格庄镇'),
	(37, 02, 85, 104, '院上镇'),
	(37, 02, 85, 105, '日庄镇'),
	(37, 02, 85, 106, '南墅镇'),
	(37, 02, 85, 107, '河头店镇'),
	(37, 02, 85, 108, '店埠镇'),
	(37, 02, 85, 116, '马连庄镇');

/* 山东省 淄博市 淄川区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 03, 02, 001, '般阳路街道'),
	(37, 03, 02, 002, '松龄路街道'),
	(37, 03, 02, 004, '钟楼街道'),
	(37, 03, 02, 005, '将军路街道'),
	(37, 03, 02, 102, '昆仑镇'),
	(37, 03, 02, 104, '岭子镇'),
	(37, 03, 02, 111, '西河镇'),
	(37, 03, 02, 112, '龙泉镇'),
	(37, 03, 02, 113, '寨里镇'),
	(37, 03, 02, 114, '罗村镇'),
	(37, 03, 02, 115, '洪山镇'),
	(37, 03, 02, 116, '双杨镇'),
	(37, 03, 02, 117, '太河镇');

/* 山东省 淄博市 张店区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 03, 03, 001, '车站街道办事处'),
	(37, 03, 03, 002, '公园街道办事处'),
	(37, 03, 03, 003, '杏园街道办事处'),
	(37, 03, 03, 004, '和平街道'),
	(37, 03, 03, 005, '科苑街道办事处'),
	(37, 03, 03, 006, '体育场街道办事处'),
	(37, 03, 03, 008, '四宝山街道办事处'),
	(37, 03, 03, 100, '马尚镇'),
	(37, 03, 03, 101, '南定镇'),
	(37, 03, 03, 102, '沣水镇'),
	(37, 03, 03, 104, '傅家镇'),
	(37, 03, 03, 105, '中埠镇'),
	(37, 03, 03, 107, '房镇镇');

/* 山东省 淄博市 博山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 03, 04, 001, '城东街道办事处'),
	(37, 03, 04, 002, '城西街道办事处'),
	(37, 03, 04, 004, '山头街道办事处'),
	(37, 03, 04, 102, '域城镇'),
	(37, 03, 04, 103, '白塔镇'),
	(37, 03, 04, 106, '八陡镇'),
	(37, 03, 04, 108, '石马镇'),
	(37, 03, 04, 111, '源泉镇'),
	(37, 03, 04, 112, '池上镇'),
	(37, 03, 04, 113, '博山镇');

/* 山东省 淄博市 临淄区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 03, 05, 001, '闻韶街道'),
	(37, 03, 05, 002, '雪宫街道'),
	(37, 03, 05, 003, '辛店街道'),
	(37, 03, 05, 004, '稷下街道'),
	(37, 03, 05, 005, '齐陵街道'),
	(37, 03, 05, 100, '齐都镇'),
	(37, 03, 05, 102, '皇城镇'),
	(37, 03, 05, 103, '敬仲镇'),
	(37, 03, 05, 104, '朱台镇'),
	(37, 03, 05, 107, '金岭镇'),
	(37, 03, 05, 109, '凤凰镇'),
	(37, 03, 05, 111, '金山镇');

/* 山东省 淄博市 周村区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 03, 06, 001, '丝绸路街道办事处'),
	(37, 03, 06, 002, '大街街道办事处'),
	(37, 03, 06, 003, '青年路街道办事处'),
	(37, 03, 06, 004, '永安街道办事处'),
	(37, 03, 06, 005, '城北路街道办事处'),
	(37, 03, 06, 100, '北郊镇'),
	(37, 03, 06, 101, '南郊镇'),
	(37, 03, 06, 102, '王村镇'),
	(37, 03, 06, 103, '萌水镇'),
	(37, 03, 06, 104, '商家镇');

/* 山东省 淄博市 桓台县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 03, 21, 001, '索镇街道办事处'),
	(37, 03, 21, 002, '少海街道办事处'),
	(37, 03, 21, 101, '起凤镇'),
	(37, 03, 21, 103, '田庄镇'),
	(37, 03, 21, 104, '荆家镇'),
	(37, 03, 21, 105, '马桥镇'),
	(37, 03, 21, 107, '新城镇'),
	(37, 03, 21, 109, '唐山镇'),
	(37, 03, 21, 110, '果里镇');

/* 山东省 淄博市 高青县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 03, 22, 001, '田镇街道办事处'),
	(37, 03, 22, 002, '芦湖街道办事处'),
	(37, 03, 22, 101, '青城镇'),
	(37, 03, 22, 102, '高城镇'),
	(37, 03, 22, 103, '黑里寨镇'),
	(37, 03, 22, 104, '唐坊镇'),
	(37, 03, 22, 105, '常家镇'),
	(37, 03, 22, 106, '花沟镇'),
	(37, 03, 22, 108, '木李镇');

/* 山东省 淄博市 沂源县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 03, 23, 001, '历山街道办事处'),
	(37, 03, 23, 002, '南麻街道办事处'),
	(37, 03, 23, 102, '鲁村镇'),
	(37, 03, 23, 103, '东里镇'),
	(37, 03, 23, 104, '悦庄镇'),
	(37, 03, 23, 105, '西里镇'),
	(37, 03, 23, 106, '大张庄镇'),
	(37, 03, 23, 107, '中庄镇'),
	(37, 03, 23, 108, '张家坡镇'),
	(37, 03, 23, 109, '燕崖镇'),
	(37, 03, 23, 110, '石桥镇'),
	(37, 03, 23, 111, '南鲁山镇');

/* 山东省 枣庄市 市中区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 04, 02, 001, '中心街街道办事处'),
	(37, 04, 02, 002, '各塔埠街道办事处'),
	(37, 04, 02, 003, '矿区街道办事处'),
	(37, 04, 02, 004, '文化路街道办事'),
	(37, 04, 02, 005, '龙山路街道办事处'),
	(37, 04, 02, 006, '光明路街道办事'),
	(37, 04, 02, 101, '税郭镇'),
	(37, 04, 02, 102, '孟庄镇'),
	(37, 04, 02, 103, '齐村镇'),
	(37, 04, 02, 104, '永安镇'),
	(37, 04, 02, 105, '西王庄镇');

/* 山东省 枣庄市 薛城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 04, 03, 001, '临城街道办事处'),
	(37, 04, 03, 002, '兴仁街道办事处'),
	(37, 04, 03, 003, '兴城街道办事处'),
	(37, 04, 03, 004, '张范街道办事处'),
	(37, 04, 03, 101, '沙沟镇'),
	(37, 04, 03, 102, '周营镇'),
	(37, 04, 03, 103, '邹坞镇'),
	(37, 04, 03, 104, '陶庄镇'),
	(37, 04, 03, 106, '常庄镇');

/* 山东省 枣庄市 峄城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 04, 04, 001, '坛山街道办'),
	(37, 04, 04, 002, '吴林街道办'),
	(37, 04, 04, 100, '古邵镇'),
	(37, 04, 04, 101, '阴平镇'),
	(37, 04, 04, 102, '底阁镇'),
	(37, 04, 04, 103, '榴园镇'),
	(37, 04, 04, 104, '峨山镇');

/* 山东省 枣庄市 台儿庄区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 04, 05, 001, '运河街道办事处'),
	(37, 04, 05, 100, '邳庄镇'),
	(37, 04, 05, 101, '张山子镇'),
	(37, 04, 05, 102, '泥沟镇'),
	(37, 04, 05, 103, '涧头集镇'),
	(37, 04, 05, 104, '马兰屯镇');

/* 山东省 枣庄市 山亭区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 04, 06, 001, '山城街道办事处'),
	(37, 04, 06, 101, '店子镇'),
	(37, 04, 06, 102, '西集镇'),
	(37, 04, 06, 103, '桑村镇'),
	(37, 04, 06, 104, '北庄镇'),
	(37, 04, 06, 105, '城头镇'),
	(37, 04, 06, 106, '徐庄镇'),
	(37, 04, 06, 107, '水泉镇'),
	(37, 04, 06, 108, '冯卯镇'),
	(37, 04, 06, 109, '凫城镇');

/* 山东省 枣庄市 滕州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 04, 81, 001, '荆河街道'),
	(37, 04, 81, 002, '龙泉街道'),
	(37, 04, 81, 003, '北辛街道'),
	(37, 04, 81, 004, '善南街道'),
	(37, 04, 81, 100, '东沙河镇'),
	(37, 04, 81, 101, '洪绪镇'),
	(37, 04, 81, 102, '南沙河镇'),
	(37, 04, 81, 103, '大坞镇'),
	(37, 04, 81, 104, '滨湖镇'),
	(37, 04, 81, 105, '级索镇'),
	(37, 04, 81, 106, '西岗镇'),
	(37, 04, 81, 107, '姜屯镇'),
	(37, 04, 81, 108, '鲍沟镇'),
	(37, 04, 81, 109, '张汪镇'),
	(37, 04, 81, 110, '官桥镇'),
	(37, 04, 81, 111, '柴胡店镇'),
	(37, 04, 81, 112, '羊庄镇'),
	(37, 04, 81, 113, '木石镇'),
	(37, 04, 81, 114, '界河镇'),
	(37, 04, 81, 115, '龙阳镇'),
	(37, 04, 81, 116, '东郭镇');

/* 山东省 东营市 东营区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 05, 02, 001, '文汇街道办事处'),
	(37, 05, 02, 002, '黄河路街道办事处'),
	(37, 05, 02, 003, '东城街道办事处'),
	(37, 05, 02, 004, '辛店街道办事处'),
	(37, 05, 02, 005, '胜利街道办事处'),
	(37, 05, 02, 006, '胜园街道办事处'),
	(37, 05, 02, 102, '牛庄镇'),
	(37, 05, 02, 103, '六户镇'),
	(37, 05, 02, 104, '史口镇'),
	(37, 05, 02, 105, '龙居镇');

/* 山东省 东营市 河口区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 05, 03, 001, '河口街道'),
	(37, 05, 03, 002, '六合街道办事处'),
	(37, 05, 03, 100, '义和镇'),
	(37, 05, 03, 101, '仙河镇'),
	(37, 05, 03, 102, '孤岛镇'),
	(37, 05, 03, 103, '新户镇');

/* 山东省 东营市 垦利县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 05, 21, 001, '垦利街道办事处'),
	(37, 05, 21, 002, '兴隆街道办事处'),
	(37, 05, 21, 101, '胜坨镇'),
	(37, 05, 21, 102, '郝家镇'),
	(37, 05, 21, 104, '永安镇'),
	(37, 05, 21, 105, '黄河口镇'),
	(37, 05, 21, 106, '董集镇');

/* 山东省 东营市 利津县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 05, 22, 001, '利津街道办事处'),
	(37, 05, 22, 002, '凤凰城街道办事处'),
	(37, 05, 22, 101, '北宋镇'),
	(37, 05, 22, 102, '盐窝镇'),
	(37, 05, 22, 103, '陈庄镇'),
	(37, 05, 22, 104, '汀罗镇'),
	(37, 05, 22, 201, '明集乡'),
	(37, 05, 22, 206, '刁口乡');

/* 山东省 东营市 广饶县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 05, 23, 001, '广饶街道办事处'),
	(37, 05, 23, 002, '乐安街道办事处'),
	(37, 05, 23, 101, '大王镇'),
	(37, 05, 23, 102, '稻庄镇'),
	(37, 05, 23, 104, '丁庄镇'),
	(37, 05, 23, 106, '李鹊镇'),
	(37, 05, 23, 107, '大码头镇'),
	(37, 05, 23, 108, '花官镇'),
	(37, 05, 23, 109, '陈官镇');

/* 山东省 烟台市 芝罘区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 02, 001, '向阳街道'),
	(37, 06, 02, 002, '东山街道'),
	(37, 06, 02, 003, '毓璜顶街道'),
	(37, 06, 02, 004, '通伸街道'),
	(37, 06, 02, 005, '凤凰台街道'),
	(37, 06, 02, 006, '奇山街道'),
	(37, 06, 02, 007, '白石街道'),
	(37, 06, 02, 008, '芝罘岛街道'),
	(37, 06, 02, 009, '黄务街道'),
	(37, 06, 02, 010, '只楚街道'),
	(37, 06, 02, 011, '世回尧街道'),
	(37, 06, 02, 012, '幸福街道');

/* 山东省 烟台市 福山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 11, 001, '清洋街道'),
	(37, 06, 11, 002, '福新街道'),
	(37, 06, 11, 006, '东厅街道办事处'),
	(37, 06, 11, 007, '门楼街道办事处'),
	(37, 06, 11, 102, '高疃镇'),
	(37, 06, 11, 103, '张格庄镇'),
	(37, 06, 11, 104, '回里镇');

/* 山东省 烟台市 牟平区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 12, 001, '宁海街道'),
	(37, 06, 12, 002, '文化街道'),
	(37, 06, 12, 003, '养马岛街道'),
	(37, 06, 12, 004, '武宁街道办事处'),
	(37, 06, 12, 005, '大窑街道办事处'),
	(37, 06, 12, 006, '姜格庄街道办事处'),
	(37, 06, 12, 101, '观水镇'),
	(37, 06, 12, 105, '龙泉镇'),
	(37, 06, 12, 106, '玉林店镇'),
	(37, 06, 12, 107, '水道镇'),
	(37, 06, 12, 109, '高陵镇'),
	(37, 06, 12, 110, '王格庄镇'),
	(37, 06, 12, 111, '昆嵛镇');

/* 山东省 烟台市 莱山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 13, 001, '黄海路街道'),
	(37, 06, 13, 002, '初家街道'),
	(37, 06, 13, 003, '滨海路街道'),
	(37, 06, 13, 004, '解甲庄街道办事处'),
	(37, 06, 13, 005, '莱山街道办事处'),
	(37, 06, 13, 006, '院格庄街道办事处');

/* 山东省 烟台市 长岛县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 34, 001, '南长山街道办事处'),
	(37, 06, 34, 101, '砣矶镇'),
	(37, 06, 34, 201, '北长山乡'),
	(37, 06, 34, 202, '黑山乡'),
	(37, 06, 34, 203, '大钦岛乡'),
	(37, 06, 34, 204, '小钦岛乡'),
	(37, 06, 34, 205, '南隍城乡'),
	(37, 06, 34, 206, '北隍城乡');

/* 山东省 烟台市 龙口市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 81, 001, '东莱街道'),
	(37, 06, 81, 002, '龙港街道'),
	(37, 06, 81, 003, '新嘉街道'),
	(37, 06, 81, 004, '徐福街道办事处'),
	(37, 06, 81, 005, '东江街道办事处'),
	(37, 06, 81, 102, '黄山馆镇'),
	(37, 06, 81, 103, '北马镇'),
	(37, 06, 81, 104, '芦头镇'),
	(37, 06, 81, 106, '下丁家镇'),
	(37, 06, 81, 107, '七甲镇'),
	(37, 06, 81, 108, '石良镇'),
	(37, 06, 81, 109, '兰高镇'),
	(37, 06, 81, 110, '诸由观镇');

/* 山东省 烟台市 莱阳市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 82, 001, '城厢街道'),
	(37, 06, 82, 002, '古柳街道'),
	(37, 06, 82, 003, '龙旺庄街道'),
	(37, 06, 82, 004, '冯格庄街道'),
	(37, 06, 82, 005, '柏林庄街道'),
	(37, 06, 82, 101, '沐浴店镇'),
	(37, 06, 82, 102, '团旺镇'),
	(37, 06, 82, 103, '穴坊镇'),
	(37, 06, 82, 104, '羊郡镇'),
	(37, 06, 82, 105, '姜疃镇'),
	(37, 06, 82, 106, '万第镇'),
	(37, 06, 82, 107, '照旺庄镇'),
	(37, 06, 82, 108, '谭格庄镇'),
	(37, 06, 82, 110, '河洛镇'),
	(37, 06, 82, 111, '吕格庄镇'),
	(37, 06, 82, 112, '高格庄镇'),
	(37, 06, 82, 113, '大夼镇'),
	(37, 06, 82, 114, '山前店镇');

/* 山东省 烟台市 莱州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 83, 001, '文昌路街道'),
	(37, 06, 83, 002, '永安路街道'),
	(37, 06, 83, 003, '三山岛街道'),
	(37, 06, 83, 004, '城港路街道'),
	(37, 06, 83, 005, '文峰路街道'),
	(37, 06, 83, 006, '金仓街道'),
	(37, 06, 83, 101, '沙河镇'),
	(37, 06, 83, 102, '朱桥镇'),
	(37, 06, 83, 103, '郭家店镇'),
	(37, 06, 83, 104, '金城镇'),
	(37, 06, 83, 105, '平里店镇'),
	(37, 06, 83, 106, '驿道镇'),
	(37, 06, 83, 107, '程郭镇'),
	(37, 06, 83, 108, '虎头崖镇'),
	(37, 06, 83, 109, '柞村镇'),
	(37, 06, 83, 110, '夏邱镇'),
	(37, 06, 83, 111, '土山镇');

/* 山东省 烟台市 蓬莱市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 84, 001, '登州街道'),
	(37, 06, 84, 002, '紫荆山街道'),
	(37, 06, 84, 003, '新港街道'),
	(37, 06, 84, 004, '蓬莱阁街道'),
	(37, 06, 84, 005, '南王街道'),
	(37, 06, 84, 102, '刘家沟镇'),
	(37, 06, 84, 103, '潮水镇'),
	(37, 06, 84, 105, '大柳行镇'),
	(37, 06, 84, 106, '小门家镇'),
	(37, 06, 84, 107, '大辛店镇'),
	(37, 06, 84, 108, '村里集镇'),
	(37, 06, 84, 109, '北沟镇');

/* 山东省 烟台市 招远市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 85, 001, '罗峰街道办事处'),
	(37, 06, 85, 002, '泉山街道办事处'),
	(37, 06, 85, 003, '梦芝街道办事处'),
	(37, 06, 85, 004, '温泉街道办事处'),
	(37, 06, 85, 005, '大秦家街道办事处'),
	(37, 06, 85, 101, '辛庄镇'),
	(37, 06, 85, 102, '蚕庄镇'),
	(37, 06, 85, 103, '金岭镇'),
	(37, 06, 85, 104, '毕郭镇'),
	(37, 06, 85, 105, '玲珑镇'),
	(37, 06, 85, 106, '张星镇'),
	(37, 06, 85, 108, '夏甸镇'),
	(37, 06, 85, 109, '阜山镇'),
	(37, 06, 85, 110, '齐山镇');

/* 山东省 烟台市 栖霞市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 86, 001, '翠屏街道'),
	(37, 06, 86, 002, '庄园街道'),
	(37, 06, 86, 003, '松山街道'),
	(37, 06, 86, 101, '观里镇'),
	(37, 06, 86, 102, '蛇窝泊镇'),
	(37, 06, 86, 103, '唐家泊镇'),
	(37, 06, 86, 104, '桃村镇'),
	(37, 06, 86, 105, '亭口镇'),
	(37, 06, 86, 106, '臧家庄镇'),
	(37, 06, 86, 107, '寺口镇'),
	(37, 06, 86, 108, '苏家店镇'),
	(37, 06, 86, 109, '杨础镇'),
	(37, 06, 86, 110, '西城镇'),
	(37, 06, 86, 111, '官道镇'),
	(37, 06, 86, 113, '庙后镇');

/* 山东省 烟台市 海阳市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 06, 87, 001, '方圆街道'),
	(37, 06, 87, 002, '东村街道'),
	(37, 06, 87, 003, '凤城街道'),
	(37, 06, 87, 004, '龙山街道'),
	(37, 06, 87, 102, '留格庄镇'),
	(37, 06, 87, 103, '盘石店镇'),
	(37, 06, 87, 104, '郭城镇'),
	(37, 06, 87, 105, '徐家店镇'),
	(37, 06, 87, 106, '发城镇'),
	(37, 06, 87, 107, '小纪镇'),
	(37, 06, 87, 108, '行村镇'),
	(37, 06, 87, 109, '辛安镇'),
	(37, 06, 87, 110, '二十里店镇'),
	(37, 06, 87, 112, '朱吴镇');

/* 山东省 潍坊市 潍城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 02, 001, '城关街道办事处'),
	(37, 07, 02, 002, '南关街道办事处'),
	(37, 07, 02, 003, '西关街道办事处'),
	(37, 07, 02, 004, '北关街道办事处'),
	(37, 07, 02, 005, '于河街道办事处'),
	(37, 07, 02, 006, '望留街道办事处');

/* 山东省 潍坊市 寒亭区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 03, 001, '寒亭街道办事处'),
	(37, 07, 03, 002, '开元街道办事处'),
	(37, 07, 03, 003, '固堤街道'),
	(37, 07, 03, 004, '央子街道'),
	(37, 07, 03, 005, '大家洼街道办事处'),
	(37, 07, 03, 006, '高里街道办事处'),
	(37, 07, 03, 007, '朱里街道办事处');

/* 山东省 潍坊市 坊子区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 04, 003, '凤凰街道办事处'),
	(37, 07, 04, 004, '坊安街道办事处'),
	(37, 07, 04, 005, '坊城街道办事处'),
	(37, 07, 04, 006, '九龙街道办事处'),
	(37, 07, 04, 007, '黄旗堡街道办事处'),
	(37, 07, 04, 008, '太保庄街道办事处'),
	(37, 07, 04, 009, '王家庄街道办事处');

/* 山东省 潍坊市 奎文区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 05, 001, '东关街道办事处'),
	(37, 07, 05, 002, '大虞街道办事处'),
	(37, 07, 05, 003, '梨园街道办事处'),
	(37, 07, 05, 004, '廿里堡街道办事处'),
	(37, 07, 05, 005, '潍州路街道办事处'),
	(37, 07, 05, 006, '北苑街道办事处'),
	(37, 07, 05, 007, '广文街道办事处'),
	(37, 07, 05, 009, '新城街道办事处'),
	(37, 07, 05, 010, '清池街道办事处'),
	(37, 07, 05, 012, '北海路街道办事处');

/* 山东省 潍坊市 临朐县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 24, 001, '城关街道办事处'),
	(37, 07, 24, 002, '东城街道办事处'),
	(37, 07, 24, 101, '五井镇'),
	(37, 07, 24, 103, '冶源镇'),
	(37, 07, 24, 104, '寺头镇'),
	(37, 07, 24, 105, '九山镇'),
	(37, 07, 24, 107, '辛寨镇'),
	(37, 07, 24, 112, '山旺镇'),
	(37, 07, 24, 113, '柳山镇'),
	(37, 07, 24, 116, '蒋峪镇');

/* 山东省 潍坊市 昌乐县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 25, 001, '宝都街道办事处'),
	(37, 07, 25, 002, '宝城街道办事处'),
	(37, 07, 25, 003, '朱刘街道办事处'),
	(37, 07, 25, 005, '五图街道办事处'),
	(37, 07, 25, 107, '乔官镇'),
	(37, 07, 25, 108, '唐吾镇'),
	(37, 07, 25, 110, '红河镇'),
	(37, 07, 25, 116, '营丘镇');

/* 山东省 潍坊市 青州市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 81, 001, '王府街道办事处'),
	(37, 07, 81, 002, '益都街道办事处'),
	(37, 07, 81, 006, '云门山街道办事处'),
	(37, 07, 81, 007, '黄楼街道办事处'),
	(37, 07, 81, 100, '弥河镇'),
	(37, 07, 81, 101, '王坟镇'),
	(37, 07, 81, 103, '庙子镇'),
	(37, 07, 81, 105, '邵庄镇'),
	(37, 07, 81, 109, '高柳镇'),
	(37, 07, 81, 111, '何官镇'),
	(37, 07, 81, 113, '东夏镇'),
	(37, 07, 81, 115, '谭坊镇');

/* 山东省 潍坊市 诸城市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 82, 001, '密州街道办事处'),
	(37, 07, 82, 002, '龙都街道办事处'),
	(37, 07, 82, 003, '舜王街道办事处'),
	(37, 07, 82, 101, '枳沟镇'),
	(37, 07, 82, 102, '贾悦镇'),
	(37, 07, 82, 105, '石桥子镇'),
	(37, 07, 82, 108, '相州镇'),
	(37, 07, 82, 110, '昌城镇'),
	(37, 07, 82, 111, '百尺河镇'),
	(37, 07, 82, 112, '辛兴镇'),
	(37, 07, 82, 114, '林家村镇'),
	(37, 07, 82, 117, '皇华镇'),
	(37, 07, 82, 118, '桃林镇');

/* 山东省 潍坊市 寿光市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 83, 001, '圣城街道办事处'),
	(37, 07, 83, 003, '文家街道办事处'),
	(37, 07, 83, 004, '古城街道办事处'),
	(37, 07, 83, 005, '洛城街道办事处'),
	(37, 07, 83, 006, '孙家集街道办事处'),
	(37, 07, 83, 100, '化龙镇'),
	(37, 07, 83, 103, '营里镇'),
	(37, 07, 83, 104, '台头镇'),
	(37, 07, 83, 106, '田柳镇'),
	(37, 07, 83, 108, '上口镇'),
	(37, 07, 83, 109, '侯镇'),
	(37, 07, 83, 111, '纪台镇'),
	(37, 07, 83, 112, '稻田镇'),
	(37, 07, 83, 115, '羊口镇');

/* 山东省 潍坊市 安丘市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 84, 001, '兴安街道办事处'),
	(37, 07, 84, 003, '新安街道'),
	(37, 07, 84, 100, '景芝镇'),
	(37, 07, 84, 103, '凌河镇'),
	(37, 07, 84, 104, '官庄镇'),
	(37, 07, 84, 107, '大盛镇'),
	(37, 07, 84, 111, '石埠子镇'),
	(37, 07, 84, 112, '石堆镇'),
	(37, 07, 84, 118, '柘山镇'),
	(37, 07, 84, 119, '辉渠镇'),
	(37, 07, 84, 120, '吾山镇'),
	(37, 07, 84, 121, '金冢子镇');

/* 山东省 潍坊市 高密市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 85, 001, '高密市朝阳街道'),
	(37, 07, 85, 002, '高密市醴泉街道'),
	(37, 07, 85, 003, '高密市密水街道'),
	(37, 07, 85, 100, '柏城镇'),
	(37, 07, 85, 103, '夏庄镇'),
	(37, 07, 85, 104, '姜庄镇'),
	(37, 07, 85, 106, '大牟家镇'),
	(37, 07, 85, 109, '阚家镇'),
	(37, 07, 85, 111, '井沟镇'),
	(37, 07, 85, 114, '柴沟镇');

/* 山东省 潍坊市 昌邑市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 07, 86, 001, '奎聚街道办事处'),
	(37, 07, 86, 002, '都昌街道办事处'),
	(37, 07, 86, 003, '围子街道办事处'),
	(37, 07, 86, 101, '柳疃镇'),
	(37, 07, 86, 102, '龙池镇'),
	(37, 07, 86, 104, '卜庄镇'),
	(37, 07, 86, 108, '饮马镇'),
	(37, 07, 86, 109, '北孟镇'),
	(37, 07, 86, 112, '下营镇');

/* 山东省 济宁市 任城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 08, 11, 002, '许庄街道办事处'),
	(37, 08, 11, 005, '李营街道办事处'),
	(37, 08, 11, 006, '南张街道办事处'),
	(37, 08, 11, 007, '仙营街道办事处'),
	(37, 08, 11, 008, '金城街道办事处'),
	(37, 08, 11, 009, '廿里铺街道办事处'),
	(37, 08, 11, 011, '古槐街道办事处'),
	(37, 08, 11, 012, '济阳街道办事处'),
	(37, 08, 11, 013, '阜桥街道办事处'),
	(37, 08, 11, 014, '越河街道办事处'),
	(37, 08, 11, 015, '观音阁街道办事处'),
	(37, 08, 11, 016, '南苑街道办事处'),
	(37, 08, 11, 017, '安居街道办事处'),
	(37, 08, 11, 018, '唐口街道办事处'),
	(37, 08, 11, 102, '长沟镇'),
	(37, 08, 11, 109, '石桥镇'),
	(37, 08, 11, 111, '喻屯镇');

/* 山东省 济宁市 兖州区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 08, 12, 001, '鼓楼街道办事处'),
	(37, 08, 12, 003, '龙桥街道办事处'),
	(37, 08, 12, 006, '酒仙桥街道办事处'),
	(37, 08, 12, 101, '大安镇'),
	(37, 08, 12, 102, '新驿镇'),
	(37, 08, 12, 103, '颜店镇'),
	(37, 08, 12, 105, '新兖镇'),
	(37, 08, 12, 107, '漕河镇'),
	(37, 08, 12, 110, '兴隆庄镇'),
	(37, 08, 12, 111, '小孟镇');

/* 山东省 济宁市 微山县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 08, 26, 001, '夏镇街道办事处'),
	(37, 08, 26, 002, '昭阳街道办事处'),
	(37, 08, 26, 003, '傅村街道办事处'),
	(37, 08, 26, 101, '韩庄镇'),
	(37, 08, 26, 102, '欢城镇'),
	(37, 08, 26, 103, '南阳镇'),
	(37, 08, 26, 104, '鲁桥镇'),
	(37, 08, 26, 106, '留庄镇'),
	(37, 08, 26, 107, '两城镇'),
	(37, 08, 26, 108, '马坡镇'),
	(37, 08, 26, 109, '赵庙镇'),
	(37, 08, 26, 110, '张楼镇'),
	(37, 08, 26, 111, '微山岛镇'),
	(37, 08, 26, 112, '西平镇'),
	(37, 08, 26, 206, '高楼乡');

/* 山东省 济宁市 鱼台县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 08, 27, 001, '谷亭街道办事处'),
	(37, 08, 27, 002, '滨湖街道办事处'),
	(37, 08, 27, 101, '清河镇'),
	(37, 08, 27, 102, '鱼城镇'),
	(37, 08, 27, 103, '王鲁镇'),
	(37, 08, 27, 104, '张黄镇'),
	(37, 08, 27, 105, '王庙镇'),
	(37, 08, 27, 106, '李阁镇'),
	(37, 08, 27, 107, '唐马镇'),
	(37, 08, 27, 108, '老砦镇'),
	(37, 08, 27, 109, '罗屯镇');

/* 山东省 济宁市 金乡县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 08, 28, 001, '金乡街道办事处'),
	(37, 08, 28, 002, '高河街道办事处'),
	(37, 08, 28, 003, '鱼山街道办事处'),
	(37, 08, 28, 004, '王丕街道办事处'),
	(37, 08, 28, 101, '羊山镇'),
	(37, 08, 28, 102, '胡集镇'),
	(37, 08, 28, 103, '霄云镇'),
	(37, 08, 28, 104, '鸡黍镇'),
	(37, 08, 28, 107, '司马镇'),
	(37, 08, 28, 109, '马庙镇'),
	(37, 08, 28, 110, '化雨镇'),
	(37, 08, 28, 111, '卜集镇'),
	(37, 08, 28, 112, '兴隆镇');

/* 山东省 济宁市 嘉祥县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 08, 29, 001, '嘉祥镇街道办事处'),
	(37, 08, 29, 002, '卧龙山街道'),
	(37, 08, 29, 101, '纸坊镇'),
	(37, 08, 29, 102, '梁宝寺镇'),
	(37, 08, 29, 104, '疃里镇'),
	(37, 08, 29, 105, '马村镇'),
	(37, 08, 29, 106, '金屯镇'),
	(37, 08, 29, 107, '大张楼镇'),
	(37, 08, 29, 108, '马集镇'),
	(37, 08, 29, 109, '万张镇'),
	(37, 08, 29, 110, '孟姑集镇'),
	(37, 08, 29, 111, '老僧堂镇'),
	(37, 08, 29, 112, '仲山镇'),
	(37, 08, 29, 113, '满硐镇'),
	(37, 08, 29, 201, '黄垓乡');

/* 山东省 济宁市 汶上县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 08, 30, 001, '中都街道办事处'),
	(37, 08, 30, 002, '汶上街道办事处'),
	(37, 08, 30, 101, '南站镇'),
	(37, 08, 30, 102, '南旺镇'),
	(37, 08, 30, 103, '次丘镇'),
	(37, 08, 30, 104, '寅寺镇'),
	(37, 08, 30, 105, '郭楼镇'),
	(37, 08, 30, 106, '康驿镇'),
	(37, 08, 30, 107, '苑庄镇'),
	(37, 08, 30, 108, '义桥镇'),
	(37, 08, 30, 109, '郭仓镇'),
	(37, 08, 30, 110, '白石镇'),
	(37, 08, 30, 111, '杨店镇'),
	(37, 08, 30, 112, '刘楼镇'),
	(37, 08, 30, 205, '军屯乡');

/* 山东省 济宁市 泗水县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 08, 31, 001, '泗河街道办事处'),
	(37, 08, 31, 002, '济河街道办事处'),
	(37, 08, 31, 101, '泉林镇'),
	(37, 08, 31, 102, '星村镇'),
	(37, 08, 31, 103, '柘沟镇'),
	(37, 08, 31, 104, '金庄镇'),
	(37, 08, 31, 105, '苗馆镇'),
	(37, 08, 31, 106, '中册镇'),
	(37, 08, 31, 107, '杨柳镇'),
	(37, 08, 31, 108, '泗张镇'),
	(37, 08, 31, 109, '圣水峪镇'),
	(37, 08, 31, 110, '高峪镇'),
	(37, 08, 31, 205, '大黄沟乡');

/* 山东省 济宁市 梁山县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 08, 32, 001, '水泊街道办事处'),
	(37, 08, 32, 002, '梁山街道办事处'),
	(37, 08, 32, 101, '小路口镇'),
	(37, 08, 32, 102, '韩岗镇'),
	(37, 08, 32, 104, '拳铺镇'),
	(37, 08, 32, 105, '杨营镇'),
	(37, 08, 32, 106, '韩垓镇'),
	(37, 08, 32, 107, '馆驿镇'),
	(37, 08, 32, 108, '小安山镇'),
	(37, 08, 32, 109, '寿张集镇'),
	(37, 08, 32, 110, '黑虎庙镇'),
	(37, 08, 32, 111, '马营镇'),
	(37, 08, 32, 215, '赵堌堆乡'),
	(37, 08, 32, 217, '大路口乡');

/* 山东省 济宁市 曲阜市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 08, 81, 001, '鲁城街道办事处'),
	(37, 08, 81, 002, '书院街道办事处'),
	(37, 08, 81, 003, '时庄街道办事处'),
	(37, 08, 81, 004, '小雪街道办事处'),
	(37, 08, 81, 101, '吴村镇'),
	(37, 08, 81, 102, '姚村镇'),
	(37, 08, 81, 103, '陵城镇'),
	(37, 08, 81, 105, '尼山镇'),
	(37, 08, 81, 108, '王庄镇'),
	(37, 08, 81, 109, '息陬镇'),
	(37, 08, 81, 110, '石门山镇'),
	(37, 08, 81, 111, '防山镇');

/* 山东省 济宁市 邹城市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 08, 83, 001, '钢山街道办事处'),
	(37, 08, 83, 002, '千泉街道办事处'),
	(37, 08, 83, 003, '凫山街道办事处'),
	(37, 08, 83, 101, '香城镇'),
	(37, 08, 83, 102, '城前镇'),
	(37, 08, 83, 103, '大束镇'),
	(37, 08, 83, 104, '北宿镇'),
	(37, 08, 83, 105, '中心店镇'),
	(37, 08, 83, 106, '唐村镇'),
	(37, 08, 83, 107, '太平镇'),
	(37, 08, 83, 109, '石墙镇'),
	(37, 08, 83, 110, '峄山镇'),
	(37, 08, 83, 111, '看庄镇'),
	(37, 08, 83, 112, '张庄镇'),
	(37, 08, 83, 113, '田黄镇'),
	(37, 08, 83, 114, '郭里镇');

/* 山东省 泰安市 泰山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 09, 02, 001, '岱庙街道办事处'),
	(37, 09, 02, 002, '财源街道办事处'),
	(37, 09, 02, 003, '泰前街道办事处'),
	(37, 09, 02, 004, '上高街道办事处'),
	(37, 09, 02, 005, '徐家楼街道办事处'),
	(37, 09, 02, 100, '省庄镇'),
	(37, 09, 02, 101, '邱家店镇'),
	(37, 09, 02, 202, '大津口乡');

/* 山东省 泰安市 岱岳区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 09, 11, 001, '粥店街道'),
	(37, 09, 11, 002, '天平街道'),
	(37, 09, 11, 003, '北集坡街道'),
	(37, 09, 11, 100, '山口镇'),
	(37, 09, 11, 101, '祝阳镇'),
	(37, 09, 11, 102, '范镇'),
	(37, 09, 11, 103, '角峪镇'),
	(37, 09, 11, 104, '徂徕镇'),
	(37, 09, 11, 106, '满庄镇'),
	(37, 09, 11, 107, '夏张镇'),
	(37, 09, 11, 108, '道朗镇'),
	(37, 09, 11, 109, '黄前镇'),
	(37, 09, 11, 110, '大汶口镇'),
	(37, 09, 11, 111, '马庄镇'),
	(37, 09, 11, 112, '房村镇'),
	(37, 09, 11, 113, '良庄镇'),
	(37, 09, 11, 114, '下港镇'),
	(37, 09, 11, 201, '化马湾乡');

/* 山东省 泰安市 宁阳县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 09, 21, 001, '文庙街道办事处'),
	(37, 09, 21, 002, '八仙桥街道办事处'),
	(37, 09, 21, 101, '泗店镇'),
	(37, 09, 21, 102, '东疏镇'),
	(37, 09, 21, 103, '伏山镇'),
	(37, 09, 21, 105, '堽城镇'),
	(37, 09, 21, 107, '蒋集镇'),
	(37, 09, 21, 109, '磁窑镇'),
	(37, 09, 21, 110, '华丰镇'),
	(37, 09, 21, 111, '葛石镇'),
	(37, 09, 21, 112, '东庄镇'),
	(37, 09, 21, 201, '鹤山乡'),
	(37, 09, 21, 206, '乡饮乡');

/* 山东省 泰安市 东平县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 09, 23, 001, '东平街道办事处'),
	(37, 09, 23, 002, '州城街道办事处'),
	(37, 09, 23, 003, '彭集街道办事处'),
	(37, 09, 23, 101, '沙河站镇'),
	(37, 09, 23, 106, '老湖镇'),
	(37, 09, 23, 107, '银山镇'),
	(37, 09, 23, 108, '斑鸠店镇'),
	(37, 09, 23, 109, '接山镇'),
	(37, 09, 23, 110, '大羊镇'),
	(37, 09, 23, 111, '梯门镇'),
	(37, 09, 23, 112, '新湖镇'),
	(37, 09, 23, 113, '戴庙镇'),
	(37, 09, 23, 206, '商老庄乡'),
	(37, 09, 23, 208, '旧县乡');

/* 山东省 泰安市 新泰市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 09, 82, 001, '青云街道办事处'),
	(37, 09, 82, 002, '新汶街道办事处'),
	(37, 09, 82, 003, '新甫街道办事处'),
	(37, 09, 82, 101, '东都镇'),
	(37, 09, 82, 102, '小协镇'),
	(37, 09, 82, 103, '翟镇'),
	(37, 09, 82, 104, '泉沟镇'),
	(37, 09, 82, 105, '羊流镇'),
	(37, 09, 82, 106, '果都镇'),
	(37, 09, 82, 107, '西张庄镇'),
	(37, 09, 82, 108, '天宝镇'),
	(37, 09, 82, 110, '楼德镇'),
	(37, 09, 82, 111, '禹村镇'),
	(37, 09, 82, 112, '宫里镇'),
	(37, 09, 82, 113, '谷里镇'),
	(37, 09, 82, 114, '石莱镇'),
	(37, 09, 82, 115, '放城镇'),
	(37, 09, 82, 116, '刘杜镇'),
	(37, 09, 82, 117, '汶南镇'),
	(37, 09, 82, 119, '龙廷镇'),
	(37, 09, 82, 203, '岳家庄乡');

/* 山东省 泰安市 肥城市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 09, 83, 001, '新城街道'),
	(37, 09, 83, 002, '老城街道办事处'),
	(37, 09, 83, 003, '王瓜店街道办事处'),
	(37, 09, 83, 101, '潮泉镇'),
	(37, 09, 83, 103, '桃园镇'),
	(37, 09, 83, 104, '王庄镇'),
	(37, 09, 83, 105, '湖屯镇'),
	(37, 09, 83, 106, '石横镇'),
	(37, 09, 83, 107, '安临站镇'),
	(37, 09, 83, 108, '孙伯镇'),
	(37, 09, 83, 109, '安驾庄镇'),
	(37, 09, 83, 110, '汶阳镇'),
	(37, 09, 83, 111, '边院镇'),
	(37, 09, 83, 112, '仪阳镇');

/* 山东省 威海市 环翠区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 10, 02, 001, '环翠楼街道办事处'),
	(37, 10, 02, 002, '鲸园街道办事处'),
	(37, 10, 02, 003, '竹岛街道办事处'),
	(37, 10, 02, 011, '孙家疃街道办事处'),
	(37, 10, 02, 100, '张村镇'),
	(37, 10, 02, 101, '羊亭镇'),
	(37, 10, 02, 102, '温泉镇');

/* 山东省 威海市 文登区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 10, 03, 001, '龙山路街道办事处'),
	(37, 10, 03, 002, '天福路街道办事处'),
	(37, 10, 03, 003, '环山路街道办事处'),
	(37, 10, 03, 100, '文登营镇'),
	(37, 10, 03, 101, '大水泊镇'),
	(37, 10, 03, 102, '张家产镇'),
	(37, 10, 03, 103, '高村镇'),
	(37, 10, 03, 104, '泽库镇'),
	(37, 10, 03, 105, '侯家镇'),
	(37, 10, 03, 106, '宋村镇'),
	(37, 10, 03, 107, '泽头镇'),
	(37, 10, 03, 108, '小观镇'),
	(37, 10, 03, 109, '葛家镇'),
	(37, 10, 03, 110, '米山镇'),
	(37, 10, 03, 111, '界石镇');

/* 山东省 威海市 荣成市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 10, 82, 001, '宁津街道办事处'),
	(37, 10, 82, 002, '港湾街道办事处'),
	(37, 10, 82, 003, '桃园街道办事处'),
	(37, 10, 82, 004, '王连街道办事处'),
	(37, 10, 82, 005, '东山街道办事处'),
	(37, 10, 82, 006, '斥山街道办事处'),
	(37, 10, 82, 007, '崖头街道办事处'),
	(37, 10, 82, 008, '城西街道办事处'),
	(37, 10, 82, 009, '寻山街道办事处'),
	(37, 10, 82, 010, '崂山街道办事处'),
	(37, 10, 82, 101, '俚岛镇'),
	(37, 10, 82, 102, '成山镇'),
	(37, 10, 82, 103, '埠柳镇'),
	(37, 10, 82, 104, '港西镇'),
	(37, 10, 82, 105, '夏庄镇'),
	(37, 10, 82, 106, '崖西镇'),
	(37, 10, 82, 107, '荫子镇'),
	(37, 10, 82, 108, '滕家镇'),
	(37, 10, 82, 109, '大疃镇'),
	(37, 10, 82, 110, '上庄镇'),
	(37, 10, 82, 111, '虎山镇'),
	(37, 10, 82, 112, '人和镇');

/* 山东省 威海市 乳山市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 10, 83, 001, '城区街道办事处'),
	(37, 10, 83, 100, '夏村镇'),
	(37, 10, 83, 101, '乳山口镇'),
	(37, 10, 83, 102, '海阳所镇'),
	(37, 10, 83, 103, '白沙滩镇'),
	(37, 10, 83, 104, '大孤山镇'),
	(37, 10, 83, 105, '南黄镇'),
	(37, 10, 83, 106, '冯家镇'),
	(37, 10, 83, 107, '下初镇'),
	(37, 10, 83, 108, '午极镇'),
	(37, 10, 83, 109, '育黎镇'),
	(37, 10, 83, 110, '崖子镇'),
	(37, 10, 83, 111, '诸往镇'),
	(37, 10, 83, 112, '乳山寨镇'),
	(37, 10, 83, 114, '徐家镇');

/* 山东省 日照市 东港区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 11, 02, 001, '日照街道'),
	(37, 11, 02, 002, '石臼街道'),
	(37, 11, 02, 004, '秦楼街道'),
	(37, 11, 02, 008, '卧龙山街道'),
	(37, 11, 02, 009, '两城街道'),
	(37, 11, 02, 100, '河山镇'),
	(37, 11, 02, 104, '后村镇'),
	(37, 11, 02, 106, '西湖镇'),
	(37, 11, 02, 107, '陈疃镇'),
	(37, 11, 02, 108, '南湖镇'),
	(37, 11, 02, 109, '三庄镇');

/* 山东省 日照市 岚山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 11, 03, 001, '岚山头街道办事处'),
	(37, 11, 03, 002, '安东卫街道办事处'),
	(37, 11, 03, 100, '碑廓镇'),
	(37, 11, 03, 101, '虎山镇'),
	(37, 11, 03, 102, '巨峰镇'),
	(37, 11, 03, 103, '高兴镇'),
	(37, 11, 03, 105, '黄墩镇'),
	(37, 11, 03, 108, '中楼镇'),
	(37, 11, 03, 200, '前三岛乡');

/* 山东省 日照市 五莲县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 11, 21, 001, '洪凝街道'),
	(37, 11, 21, 102, '街头镇'),
	(37, 11, 21, 103, '潮河镇'),
	(37, 11, 21, 104, '许孟镇'),
	(37, 11, 21, 105, '于里镇'),
	(37, 11, 21, 106, '汪湖镇'),
	(37, 11, 21, 107, '叩官镇'),
	(37, 11, 21, 108, '中至镇'),
	(37, 11, 21, 109, '高泽镇'),
	(37, 11, 21, 110, '松柏镇'),
	(37, 11, 21, 201, '石场乡'),
	(37, 11, 21, 202, '户部乡');

/* 山东省 日照市 莒县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 11, 22, 001, '城阳街道办事处'),
	(37, 11, 22, 102, '招贤镇'),
	(37, 11, 22, 103, '阎庄镇'),
	(37, 11, 22, 104, '夏庄镇'),
	(37, 11, 22, 105, '刘官庄镇'),
	(37, 11, 22, 106, '峤山镇'),
	(37, 11, 22, 107, '小店镇'),
	(37, 11, 22, 109, '龙山镇'),
	(37, 11, 22, 110, '东莞镇'),
	(37, 11, 22, 111, '浮来山镇'),
	(37, 11, 22, 112, '陵阳镇'),
	(37, 11, 22, 113, '店子集镇'),
	(37, 11, 22, 114, '长岭镇'),
	(37, 11, 22, 115, '安庄镇'),
	(37, 11, 22, 116, '棋山镇'),
	(37, 11, 22, 117, '洛河镇'),
	(37, 11, 22, 118, '寨里河镇'),
	(37, 11, 22, 119, '桑园镇'),
	(37, 11, 22, 120, '果庄镇'),
	(37, 11, 22, 206, '库山乡');

/* 山东省 莱芜市 莱城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 12, 02, 001, '凤城街道办事处'),
	(37, 12, 02, 002, '张家洼街道办事处'),
	(37, 12, 02, 003, '高庄街道办事处'),
	(37, 12, 02, 004, '鹏泉街道办事处'),
	(37, 12, 02, 100, '口镇'),
	(37, 12, 02, 101, '羊里镇'),
	(37, 12, 02, 102, '方下镇'),
	(37, 12, 02, 103, '牛泉镇'),
	(37, 12, 02, 105, '苗山镇'),
	(37, 12, 02, 106, '雪野镇'),
	(37, 12, 02, 107, '大王庄镇'),
	(37, 12, 02, 108, '寨里镇'),
	(37, 12, 02, 109, '杨庄镇'),
	(37, 12, 02, 110, '茶业口镇'),
	(37, 12, 02, 111, '和庄镇');

/* 山东省 莱芜市 钢城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 12, 03, 001, '艾山街道办事处'),
	(37, 12, 03, 002, '里辛街道办事处'),
	(37, 12, 03, 003, '汶源街道办事处'),
	(37, 12, 03, 100, '颜庄镇'),
	(37, 12, 03, 103, '辛庄镇');

/* 山东省 临沂市 兰山区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 02, 001, '兰山街道'),
	(37, 13, 02, 002, '银雀山街道'),
	(37, 13, 02, 003, '金雀山街道'),
	(37, 13, 02, 004, '柳青街道'),
	(37, 13, 02, 101, '白沙埠镇'),
	(37, 13, 02, 102, '枣沟头镇'),
	(37, 13, 02, 103, '半程镇'),
	(37, 13, 02, 105, '义堂镇'),
	(37, 13, 02, 106, '马厂湖镇'),
	(37, 13, 02, 107, '李官镇'),
	(37, 13, 02, 109, '方城镇'),
	(37, 13, 02, 110, '汪沟镇');

/* 山东省 临沂市 罗庄区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 11, 001, '罗庄街道办事处'),
	(37, 13, 11, 002, '傅庄街道办事处'),
	(37, 13, 11, 003, '盛庄街道办事处'),
	(37, 13, 11, 006, '册山街道办事处'),
	(37, 13, 11, 007, '高都街道办事处'),
	(37, 13, 11, 008, '罗西街道办事处'),
	(37, 13, 11, 100, '沂堂镇'),
	(37, 13, 11, 101, '褚墩镇'),
	(37, 13, 11, 102, '黄山镇');

/* 山东省 临沂市 河东区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 12, 001, '九曲街道办事处'),
	(37, 13, 12, 002, '芝麻墩街道办事处'),
	(37, 13, 12, 003, '梅埠街道办事处'),
	(37, 13, 12, 004, '相公街道办事处'),
	(37, 13, 12, 005, '太平街道办事处'),
	(37, 13, 12, 006, '汤头街道办事处'),
	(37, 13, 12, 007, '凤凰岭街道办事处'),
	(37, 13, 12, 008, '朝阳街道办事处'),
	(37, 13, 12, 104, '汤河镇'),
	(37, 13, 12, 107, '八湖镇'),
	(37, 13, 12, 108, '郑旺镇');

/* 山东省 临沂市 沂南县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 21, 001, '界湖街道办事处'),
	(37, 13, 21, 101, '岸堤镇'),
	(37, 13, 21, 102, '孙祖镇'),
	(37, 13, 21, 103, '双堠镇'),
	(37, 13, 21, 104, '青驼镇'),
	(37, 13, 21, 105, '张庄镇'),
	(37, 13, 21, 106, '砖埠镇'),
	(37, 13, 21, 109, '大庄镇'),
	(37, 13, 21, 110, '辛集镇'),
	(37, 13, 21, 111, '蒲汪镇'),
	(37, 13, 21, 112, '湖头镇'),
	(37, 13, 21, 113, '苏村镇'),
	(37, 13, 21, 114, '铜井镇'),
	(37, 13, 21, 115, '依汶镇'),
	(37, 13, 21, 201, '马牧池乡');

/* 山东省 临沂市 郯城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 22, 001, '郯城街道办事处'),
	(37, 13, 22, 101, '马头镇'),
	(37, 13, 22, 102, '重坊镇'),
	(37, 13, 22, 103, '李庄镇'),
	(37, 13, 22, 105, '杨集镇'),
	(37, 13, 22, 107, '港上镇'),
	(37, 13, 22, 108, '高峰头镇'),
	(37, 13, 22, 109, '庙山镇'),
	(37, 13, 22, 111, '红花镇'),
	(37, 13, 22, 112, '胜利镇'),
	(37, 13, 22, 202, '花园乡'),
	(37, 13, 22, 203, '归昌乡'),
	(37, 13, 22, 205, '泉源乡');

/* 山东省 临沂市 沂水县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 23, 001, '沂城街道办事处'),
	(37, 13, 23, 101, '马站镇'),
	(37, 13, 23, 102, '高桥镇'),
	(37, 13, 23, 103, '许家湖镇'),
	(37, 13, 23, 104, '黄山铺镇'),
	(37, 13, 23, 106, '诸葛镇'),
	(37, 13, 23, 107, '崔家峪镇'),
	(37, 13, 23, 108, '四十里堡镇'),
	(37, 13, 23, 109, '杨庄镇'),
	(37, 13, 23, 110, '夏蔚镇'),
	(37, 13, 23, 111, '沙沟镇'),
	(37, 13, 23, 112, '高庄镇'),
	(37, 13, 23, 113, '院东头镇'),
	(37, 13, 23, 114, '龙家圈镇'),
	(37, 13, 23, 115, '富官庄镇'),
	(37, 13, 23, 116, '道托镇'),
	(37, 13, 23, 117, '泉庄镇'),
	(37, 13, 23, 201, '圈里乡');

/* 山东省 临沂市 兰陵县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 24, 001, '卞庄街道办事处'),
	(37, 13, 24, 101, '大仲村镇'),
	(37, 13, 24, 102, '兰陵镇'),
	(37, 13, 24, 103, '长城镇'),
	(37, 13, 24, 104, '磨山镇'),
	(37, 13, 24, 105, '神山镇'),
	(37, 13, 24, 106, '车辋镇'),
	(37, 13, 24, 107, '尚岩镇'),
	(37, 13, 24, 108, '向城镇'),
	(37, 13, 24, 109, '新兴镇'),
	(37, 13, 24, 110, '南桥镇'),
	(37, 13, 24, 112, '庄坞镇'),
	(37, 13, 24, 114, '鲁城镇'),
	(37, 13, 24, 115, '矿坑镇'),
	(37, 13, 24, 116, '金岭镇'),
	(37, 13, 24, 117, '芦柞镇'),
	(37, 13, 24, 202, '下村乡');

/* 山东省 临沂市 费县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 25, 001, '费城街道办事处'),
	(37, 13, 25, 101, '上冶镇'),
	(37, 13, 25, 102, '薛庄镇'),
	(37, 13, 25, 105, '探沂镇'),
	(37, 13, 25, 106, '朱田镇'),
	(37, 13, 25, 107, '梁邱镇'),
	(37, 13, 25, 108, '新庄镇'),
	(37, 13, 25, 109, '马庄镇'),
	(37, 13, 25, 112, '胡阳镇'),
	(37, 13, 25, 113, '石井镇'),
	(37, 13, 25, 200, '大田庄乡'),
	(37, 13, 25, 201, '南张庄乡');

/* 山东省 临沂市 平邑县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 26, 001, '平邑街道办事处'),
	(37, 13, 26, 101, '仲村镇'),
	(37, 13, 26, 102, '武台镇'),
	(37, 13, 26, 103, '保太镇'),
	(37, 13, 26, 104, '柏林镇'),
	(37, 13, 26, 105, '卞桥镇'),
	(37, 13, 26, 106, '地方镇'),
	(37, 13, 26, 107, '铜石镇'),
	(37, 13, 26, 108, '温水镇'),
	(37, 13, 26, 109, '流峪镇'),
	(37, 13, 26, 110, '郑城镇'),
	(37, 13, 26, 111, '白彦镇'),
	(37, 13, 26, 112, '临涧镇'),
	(37, 13, 26, 113, '丰阳镇');

/* 山东省 临沂市 莒南县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 27, 001, '十字路街道办事处'),
	(37, 13, 27, 101, '团林镇'),
	(37, 13, 27, 102, '大店镇'),
	(37, 13, 27, 103, '坊前镇'),
	(37, 13, 27, 104, '坪上镇'),
	(37, 13, 27, 106, '板泉镇'),
	(37, 13, 27, 107, '洙边镇'),
	(37, 13, 27, 108, '文疃镇'),
	(37, 13, 27, 109, '壮岗镇'),
	(37, 13, 27, 111, '石莲子镇'),
	(37, 13, 27, 112, '岭泉镇'),
	(37, 13, 27, 113, '筵宾镇'),
	(37, 13, 27, 114, '涝坡镇'),
	(37, 13, 27, 115, '朱芦镇'),
	(37, 13, 27, 116, '道口镇'),
	(37, 13, 27, 117, '相沟镇');

/* 山东省 临沂市 蒙阴县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 28, 001, '蒙阴街道办事处'),
	(37, 13, 28, 101, '常路镇'),
	(37, 13, 28, 102, '岱崮镇'),
	(37, 13, 28, 103, '坦埠镇'),
	(37, 13, 28, 104, '垛庄镇'),
	(37, 13, 28, 105, '高都镇'),
	(37, 13, 28, 106, '野店镇'),
	(37, 13, 28, 107, '桃墟镇'),
	(37, 13, 28, 109, '联城镇'),
	(37, 13, 28, 201, '旧寨乡');

/* 山东省 临沂市 临沭县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 13, 29, 001, '临沭街道办事处'),
	(37, 13, 29, 002, '郑山街道办事处'),
	(37, 13, 29, 101, '蛟龙镇'),
	(37, 13, 29, 102, '大兴镇'),
	(37, 13, 29, 103, '石门镇'),
	(37, 13, 29, 104, '曹庄镇'),
	(37, 13, 29, 108, '青云镇'),
	(37, 13, 29, 109, '玉山镇'),
	(37, 13, 29, 110, '店头镇');

/* 山东省 德州市 德城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 14, 02, 001, '新湖街道办事处'),
	(37, 14, 02, 002, '新华街道办事处'),
	(37, 14, 02, 003, '天衢街道办事处'),
	(37, 14, 02, 006, '广川街道办事处'),
	(37, 14, 02, 100, '二屯镇'),
	(37, 14, 02, 101, '黄河涯镇');

/* 山东省 德州市 陵城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 14, 03, 001, '安德街道办事处'),
	(37, 14, 03, 002, '临齐街道办事处'),
	(37, 14, 03, 101, '郑家寨镇'),
	(37, 14, 03, 102, '糜镇'),
	(37, 14, 03, 103, '宋家镇'),
	(37, 14, 03, 104, '徽王庄镇'),
	(37, 14, 03, 105, '神头镇'),
	(37, 14, 03, 106, '滋镇'),
	(37, 14, 03, 107, '前孙镇'),
	(37, 14, 03, 108, '边临镇'),
	(37, 14, 03, 109, '义渡口镇'),
	(37, 14, 03, 110, '丁庄镇'),
	(37, 14, 03, 202, '于集乡');

/* 山东省 德州市 宁津县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 14, 22, 001, '宁城街道办事处'),
	(37, 14, 22, 002, '津城街道办事处'),
	(37, 14, 22, 101, '柴胡店镇'),
	(37, 14, 22, 102, '长官镇'),
	(37, 14, 22, 103, '杜集镇'),
	(37, 14, 22, 104, '保店镇'),
	(37, 14, 22, 105, '大柳镇'),
	(37, 14, 22, 106, '大曹镇'),
	(37, 14, 22, 107, '相衙镇'),
	(37, 14, 22, 108, '时集镇'),
	(37, 14, 22, 109, '张大庄镇'),
	(37, 14, 22, 201, '刘营伍乡');

/* 山东省 德州市 庆云县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 14, 23, 001, '渤海路街道办事处'),
	(37, 14, 23, 100, '庆云镇'),
	(37, 14, 23, 101, '常家镇'),
	(37, 14, 23, 102, '尚堂镇'),
	(37, 14, 23, 103, '崔口镇'),
	(37, 14, 23, 104, '东辛店镇'),
	(37, 14, 23, 200, '严务乡'),
	(37, 14, 23, 202, '中丁乡'),
	(37, 14, 23, 203, '徐园子乡');

/* 山东省 德州市 临邑县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 14, 24, 001, '邢侗街道办事处'),
	(37, 14, 24, 002, '恒源街道办事处'),
	(37, 14, 24, 003, '临盘街道办事处'),
	(37, 14, 24, 100, '临邑镇'),
	(37, 14, 24, 102, '临南镇'),
	(37, 14, 24, 103, '德平镇'),
	(37, 14, 24, 104, '林子镇'),
	(37, 14, 24, 105, '兴隆镇'),
	(37, 14, 24, 106, '孟寺镇'),
	(37, 14, 24, 107, '翟家镇'),
	(37, 14, 24, 108, '理合务镇'),
	(37, 14, 24, 202, '宿安乡');

/* 山东省 德州市 齐河县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 14, 25, 001, '晏城街道办事处'),
	(37, 14, 25, 002, '晏北街道办事处'),
	(37, 14, 25, 101, '表白寺镇'),
	(37, 14, 25, 102, '焦庙镇'),
	(37, 14, 25, 103, '赵官镇'),
	(37, 14, 25, 104, '祝阿镇'),
	(37, 14, 25, 105, '仁里集镇'),
	(37, 14, 25, 106, '潘店镇'),
	(37, 14, 25, 107, '胡官屯镇'),
	(37, 14, 25, 108, '宣章屯镇'),
	(37, 14, 25, 109, '马集镇'),
	(37, 14, 25, 110, '华店镇'),
	(37, 14, 25, 111, '刘桥镇'),
	(37, 14, 25, 201, '安头乡'),
	(37, 14, 25, 204, '大黄乡');

/* 山东省 德州市 平原县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 14, 26, 001, '龙门街道办事处'),
	(37, 14, 26, 002, '桃园街道办事处'),
	(37, 14, 26, 101, '王凤楼镇'),
	(37, 14, 26, 102, '前曹镇'),
	(37, 14, 26, 103, '恩城镇'),
	(37, 14, 26, 104, '王庙镇'),
	(37, 14, 26, 105, '王杲铺镇'),
	(37, 14, 26, 106, '张华镇'),
	(37, 14, 26, 107, '腰站镇'),
	(37, 14, 26, 108, '王打卦镇'),
	(37, 14, 26, 200, '坊子乡'),
	(37, 14, 26, 202, '三唐乡');

/* 山东省 德州市 夏津县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 14, 27, 001, '银城街道办事处'),
	(37, 14, 27, 002, '北城街道办事处'),
	(37, 14, 27, 100, '南城镇'),
	(37, 14, 27, 101, '苏留庄镇'),
	(37, 14, 27, 102, '新盛店镇'),
	(37, 14, 27, 103, '雷集镇'),
	(37, 14, 27, 104, '郑保屯镇'),
	(37, 14, 27, 105, '白马湖镇'),
	(37, 14, 27, 106, '东李官屯镇'),
	(37, 14, 27, 107, '宋楼镇'),
	(37, 14, 27, 108, '香赵庄镇'),
	(37, 14, 27, 109, '双庙镇'),
	(37, 14, 27, 200, '渡口驿乡'),
	(37, 14, 27, 204, '田庄乡');

/* 山东省 德州市 武城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 14, 28, 001, '广运街道办事处'),
	(37, 14, 28, 100, '武城镇'),
	(37, 14, 28, 101, '老城镇'),
	(37, 14, 28, 103, '鲁权屯镇'),
	(37, 14, 28, 104, '郝王庄镇'),
	(37, 14, 28, 106, '甲马营镇'),
	(37, 14, 28, 107, '四女寺镇'),
	(37, 14, 28, 108, '李家户镇');

/* 山东省 德州市 乐陵市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 14, 81, 001, '市中街道'),
	(37, 14, 81, 002, '胡家街道'),
	(37, 14, 81, 003, '云红街道'),
	(37, 14, 81, 004, '郭家街道'),
	(37, 14, 81, 100, '杨安镇'),
	(37, 14, 81, 101, '朱集镇'),
	(37, 14, 81, 102, '黄夹镇'),
	(37, 14, 81, 103, '丁坞镇'),
	(37, 14, 81, 104, '花园镇'),
	(37, 14, 81, 105, '郑店镇'),
	(37, 14, 81, 106, '化楼镇'),
	(37, 14, 81, 107, '孔镇'),
	(37, 14, 81, 108, '铁营镇'),
	(37, 14, 81, 200, '西段乡'),
	(37, 14, 81, 201, '大孙乡'),
	(37, 14, 81, 203, '寨头堡乡');

/* 山东省 德州市 禹城市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 14, 82, 001, '市中街道'),
	(37, 14, 82, 100, '伦镇'),
	(37, 14, 82, 101, '房寺镇'),
	(37, 14, 82, 102, '张庄镇'),
	(37, 14, 82, 103, '辛店镇'),
	(37, 14, 82, 104, '安仁镇'),
	(37, 14, 82, 105, '辛寨镇'),
	(37, 14, 82, 106, '梁家镇'),
	(37, 14, 82, 107, '十里望镇'),
	(37, 14, 82, 108, '莒镇'),
	(37, 14, 82, 200, '李屯乡');

/* 山东省 聊城市 东昌府区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 15, 02, 001, '古楼街道办事处'),
	(37, 15, 02, 002, '柳园街道办事处'),
	(37, 15, 02, 003, '新区街道办事处'),
	(37, 15, 02, 004, '湖西街道办事处'),
	(37, 15, 02, 005, '道口铺街道办事处'),
	(37, 15, 02, 006, '阎寺街道办事处'),
	(37, 15, 02, 007, '凤凰街道办事处'),
	(37, 15, 02, 008, '北城街道办事处'),
	(37, 15, 02, 009, '东城街道办事处'),
	(37, 15, 02, 010, '蒋官屯街道办事处'),
	(37, 15, 02, 100, '侯营镇'),
	(37, 15, 02, 101, '沙镇镇'),
	(37, 15, 02, 102, '堂邑镇'),
	(37, 15, 02, 103, '梁水镇'),
	(37, 15, 02, 104, '斗虎屯镇'),
	(37, 15, 02, 105, '郑家镇'),
	(37, 15, 02, 106, '张炉集镇'),
	(37, 15, 02, 107, '于集镇'),
	(37, 15, 02, 108, '许营镇'),
	(37, 15, 02, 109, '朱老庄镇'),
	(37, 15, 02, 110, '顾官屯镇'),
	(37, 15, 02, 202, '广平乡'),
	(37, 15, 02, 203, '韩集乡');

/* 山东省 聊城市 阳谷县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 15, 21, 001, '博济桥街道办事处'),
	(37, 15, 21, 002, '侨润街道办事处'),
	(37, 15, 21, 003, '狮子楼街道办事处'),
	(37, 15, 21, 101, '阎楼镇'),
	(37, 15, 21, 103, '阿城镇'),
	(37, 15, 21, 104, '七级镇'),
	(37, 15, 21, 105, '安乐镇'),
	(37, 15, 21, 106, '定水镇'),
	(37, 15, 21, 107, '石佛镇'),
	(37, 15, 21, 108, '李台镇'),
	(37, 15, 21, 109, '寿张镇'),
	(37, 15, 21, 111, '十五里园镇'),
	(37, 15, 21, 112, '张秋镇'),
	(37, 15, 21, 113, '郭店屯镇'),
	(37, 15, 21, 114, '西湖镇'),
	(37, 15, 21, 115, '高庙王镇'),
	(37, 15, 21, 203, '大布乡'),
	(37, 15, 21, 207, '金斗营乡');

/* 山东省 聊城市 莘县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 15, 22, 001, '燕塔街道办事处'),
	(37, 15, 22, 002, '莘亭街道办事处'),
	(37, 15, 22, 003, '莘州街道办事处'),
	(37, 15, 22, 004, '东鲁街道办事处'),
	(37, 15, 22, 101, '张鲁镇'),
	(37, 15, 22, 102, '朝城镇'),
	(37, 15, 22, 103, '观城镇'),
	(37, 15, 22, 104, '古城镇'),
	(37, 15, 22, 105, '大张家镇'),
	(37, 15, 22, 106, '古云镇'),
	(37, 15, 22, 107, '十八里铺镇'),
	(37, 15, 22, 109, '燕店镇'),
	(37, 15, 22, 110, '董杜庄镇'),
	(37, 15, 22, 111, '王奉镇'),
	(37, 15, 22, 112, '樱桃园镇'),
	(37, 15, 22, 113, '河店镇'),
	(37, 15, 22, 114, '妹冢镇'),
	(37, 15, 22, 115, '魏庄镇'),
	(37, 15, 22, 116, '张寨镇'),
	(37, 15, 22, 117, '大王寨镇'),
	(37, 15, 22, 118, '徐庄镇'),
	(37, 15, 22, 119, '王庄集镇'),
	(37, 15, 22, 120, '柿子园镇'),
	(37, 15, 22, 121, '俎店镇');

/* 山东省 聊城市 茌平县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 15, 23, 001, '振兴街道办事处'),
	(37, 15, 23, 002, '信发街道办事处'),
	(37, 15, 23, 003, '温陈街道办事处'),
	(37, 15, 23, 101, '乐平铺镇'),
	(37, 15, 23, 102, '冯官屯镇'),
	(37, 15, 23, 103, '菜屯镇'),
	(37, 15, 23, 104, '博平镇'),
	(37, 15, 23, 105, '杜郎口镇'),
	(37, 15, 23, 106, '韩屯镇'),
	(37, 15, 23, 107, '胡屯镇'),
	(37, 15, 23, 108, '肖庄镇'),
	(37, 15, 23, 109, '贾寨镇'),
	(37, 15, 23, 110, '洪官屯镇'),
	(37, 15, 23, 208, '杨官屯乡');

/* 山东省 聊城市 东阿县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 15, 24, 001, '铜城街道办事处'),
	(37, 15, 24, 002, '新城街道办事处'),
	(37, 15, 24, 101, '刘集镇'),
	(37, 15, 24, 102, '牛角店镇'),
	(37, 15, 24, 103, '大桥镇'),
	(37, 15, 24, 104, '高集镇'),
	(37, 15, 24, 105, '姜楼镇'),
	(37, 15, 24, 107, '姚寨镇'),
	(37, 15, 24, 108, '鱼山镇'),
	(37, 15, 24, 205, '陈集乡');

/* 山东省 聊城市 冠县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 15, 25, 001, '清泉街道办事处'),
	(37, 15, 25, 002, '崇文街道办事处'),
	(37, 15, 25, 003, '烟庄街道办事处'),
	(37, 15, 25, 101, '贾镇'),
	(37, 15, 25, 102, '桑阿镇'),
	(37, 15, 25, 103, '柳林镇'),
	(37, 15, 25, 104, '清水镇'),
	(37, 15, 25, 105, '东古城镇'),
	(37, 15, 25, 106, '北馆陶镇'),
	(37, 15, 25, 107, '店子镇'),
	(37, 15, 25, 108, '定远寨镇'),
	(37, 15, 25, 109, '辛集镇'),
	(37, 15, 25, 110, '梁堂镇'),
	(37, 15, 25, 200, '斜店乡'),
	(37, 15, 25, 204, '范寨乡'),
	(37, 15, 25, 205, '甘官屯乡'),
	(37, 15, 25, 206, '兰沃乡'),
	(37, 15, 25, 209, '万善乡');

/* 山东省 聊城市 高唐县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 15, 26, 001, '鱼丘湖街道办事处'),
	(37, 15, 26, 002, '汇鑫街道办事处'),
	(37, 15, 26, 003, '人和街道办事处'),
	(37, 15, 26, 101, '梁村镇'),
	(37, 15, 26, 102, '尹集镇'),
	(37, 15, 26, 103, '清平镇'),
	(37, 15, 26, 104, '固河镇'),
	(37, 15, 26, 105, '三十里铺镇'),
	(37, 15, 26, 106, '琉璃寺镇'),
	(37, 15, 26, 107, '赵寨子镇'),
	(37, 15, 26, 108, '姜店镇'),
	(37, 15, 26, 109, '杨屯镇');

/* 山东省 聊城市 临清市 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 15, 81, 001, '青年路街道办事处'),
	(37, 15, 81, 002, '新华路街道办事处'),
	(37, 15, 81, 003, '先锋路街道办事处'),
	(37, 15, 81, 004, '大辛庄街道办事处'),
	(37, 15, 81, 101, '松林镇'),
	(37, 15, 81, 102, '老赵庄镇'),
	(37, 15, 81, 103, '康庄镇'),
	(37, 15, 81, 104, '魏湾镇'),
	(37, 15, 81, 105, '刘垓子镇'),
	(37, 15, 81, 107, '八岔路镇'),
	(37, 15, 81, 108, '潘庄镇'),
	(37, 15, 81, 109, '烟店镇'),
	(37, 15, 81, 110, '唐园镇'),
	(37, 15, 81, 111, '金郝庄镇'),
	(37, 15, 81, 112, '戴湾镇'),
	(37, 15, 81, 113, '尚店镇');

/* 山东省 滨州市 滨城区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 16, 02, 001, '市中街道办事处'),
	(37, 16, 02, 002, '市西街道办事处'),
	(37, 16, 02, 003, '北镇街道办事处'),
	(37, 16, 02, 004, '市东街道办事处'),
	(37, 16, 02, 005, '彭李街道办事处'),
	(37, 16, 02, 007, '小营街道办事处'),
	(37, 16, 02, 008, '滨北街道办事处'),
	(37, 16, 02, 009, '梁才街道办事处'),
	(37, 16, 02, 010, '杜店街道办事处'),
	(37, 16, 02, 011, '沙河街道办事处'),
	(37, 16, 02, 012, '里则街道办事处'),
	(37, 16, 02, 013, '青田街道办事处'),
	(37, 16, 02, 105, '三河湖镇'),
	(37, 16, 02, 106, '杨柳雪镇'),
	(37, 16, 02, 203, '秦皇台乡');

/* 山东省 滨州市 沾化区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 16, 03, 001, '富国街道办事处'),
	(37, 16, 03, 002, '富源街道办事处'),
	(37, 16, 03, 101, '下洼镇'),
	(37, 16, 03, 102, '古城镇'),
	(37, 16, 03, 103, '冯家镇'),
	(37, 16, 03, 104, '泊头镇'),
	(37, 16, 03, 105, '大高镇'),
	(37, 16, 03, 106, '黄升镇'),
	(37, 16, 03, 107, '滨海镇'),
	(37, 16, 03, 203, '下河乡'),
	(37, 16, 03, 204, '利国乡'),
	(37, 16, 03, 205, '海防办事处乡');

/* 山东省 滨州市 惠民县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 16, 21, 001, '孙武街道办事处'),
	(37, 16, 21, 002, '武定府街道办事处'),
	(37, 16, 21, 003, '何坊街道办事处'),
	(37, 16, 21, 101, '石庙镇'),
	(37, 16, 21, 102, '桑落墅镇'),
	(37, 16, 21, 103, '淄角镇'),
	(37, 16, 21, 104, '胡集镇'),
	(37, 16, 21, 105, '李庄镇'),
	(37, 16, 21, 107, '麻店镇'),
	(37, 16, 21, 108, '魏集镇'),
	(37, 16, 21, 109, '清河镇'),
	(37, 16, 21, 111, '姜楼镇'),
	(37, 16, 21, 113, '辛店镇'),
	(37, 16, 21, 114, '大年陈镇'),
	(37, 16, 21, 115, '皂户李镇');

/* 山东省 滨州市 阳信县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 16, 22, 001, '信城街道办事处'),
	(37, 16, 22, 002, '金阳街道办事处'),
	(37, 16, 22, 101, '商店镇'),
	(37, 16, 22, 102, '温店镇'),
	(37, 16, 22, 103, '河流镇'),
	(37, 16, 22, 104, '翟王镇'),
	(37, 16, 22, 105, '流坡坞镇'),
	(37, 16, 22, 106, '水落坡镇'),
	(37, 16, 22, 107, '劳店镇'),
	(37, 16, 22, 204, '洋湖乡');

/* 山东省 滨州市 无棣县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 16, 23, 001, '棣丰街道办事处'),
	(37, 16, 23, 002, '海丰街道办事处'),
	(37, 16, 23, 101, '水湾镇'),
	(37, 16, 23, 102, '碣石山镇'),
	(37, 16, 23, 103, '小泊头镇'),
	(37, 16, 23, 104, '埕口镇'),
	(37, 16, 23, 105, '马山子镇'),
	(37, 16, 23, 106, '车王镇'),
	(37, 16, 23, 107, '柳堡镇'),
	(37, 16, 23, 108, '佘家镇'),
	(37, 16, 23, 109, '信阳镇'),
	(37, 16, 23, 110, '西小王镇');

/* 山东省 滨州市 博兴县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 16, 25, 001, '城东街道办事处'),
	(37, 16, 25, 002, '锦秋街道办事处'),
	(37, 16, 25, 003, '博昌街道办事处'),
	(37, 16, 25, 101, '曹王镇'),
	(37, 16, 25, 102, '兴福镇'),
	(37, 16, 25, 103, '陈户镇'),
	(37, 16, 25, 104, '湖滨镇'),
	(37, 16, 25, 106, '店子镇'),
	(37, 16, 25, 107, '吕艺镇'),
	(37, 16, 25, 108, '纯化镇'),
	(37, 16, 25, 109, '庞家镇'),
	(37, 16, 25, 110, '乔庄镇');

/* 山东省 滨州市 邹平县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 16, 26, 001, '黛溪街道办事处'),
	(37, 16, 26, 002, '黄山街道办事处'),
	(37, 16, 26, 003, '高新街道办事处'),
	(37, 16, 26, 004, '好生街道办事处'),
	(37, 16, 26, 005, '西董街道办事处'),
	(37, 16, 26, 101, '长山镇'),
	(37, 16, 26, 102, '魏桥镇'),
	(37, 16, 26, 105, '临池镇'),
	(37, 16, 26, 108, '焦桥镇'),
	(37, 16, 26, 109, '韩店镇'),
	(37, 16, 26, 110, '孙镇镇'),
	(37, 16, 26, 111, '九户镇'),
	(37, 16, 26, 112, '青阳镇'),
	(37, 16, 26, 113, '明集镇'),
	(37, 16, 26, 114, '台子镇'),
	(37, 16, 26, 115, '码头镇');

/* 山东省 菏泽市 牡丹区 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 17, 02, 001, '东城街道'),
	(37, 17, 02, 002, '西城街道'),
	(37, 17, 02, 003, '南城街道'),
	(37, 17, 02, 004, '北城街道'),
	(37, 17, 02, 005, '牡丹街道'),
	(37, 17, 02, 009, '何楼街道'),
	(37, 17, 02, 100, '沙土镇'),
	(37, 17, 02, 101, '吴店镇'),
	(37, 17, 02, 102, '王浩屯镇'),
	(37, 17, 02, 103, '黄堽镇'),
	(37, 17, 02, 104, '都司镇'),
	(37, 17, 02, 105, '高庄镇'),
	(37, 17, 02, 106, '小留镇'),
	(37, 17, 02, 107, '李村镇'),
	(37, 17, 02, 108, '马岭岗镇'),
	(37, 17, 02, 109, '安兴镇'),
	(37, 17, 02, 110, '大黄集镇'),
	(37, 17, 02, 112, '胡集镇'),
	(37, 17, 02, 202, '皇镇乡');

/* 山东省 菏泽市 曹县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 17, 21, 001, '曹城街道办事处'),
	(37, 17, 21, 002, '磐石街道办事处'),
	(37, 17, 21, 003, '青菏街道办事处'),
	(37, 17, 21, 004, '郑庄街道办事处'),
	(37, 17, 21, 005, '倪集街道办事处'),
	(37, 17, 21, 101, '庄寨镇'),
	(37, 17, 21, 102, '普连集镇'),
	(37, 17, 21, 103, '青固集镇'),
	(37, 17, 21, 104, '桃源集镇'),
	(37, 17, 21, 105, '韩集镇'),
	(37, 17, 21, 106, '砖庙镇'),
	(37, 17, 21, 107, '古营集镇'),
	(37, 17, 21, 108, '魏湾镇'),
	(37, 17, 21, 109, '侯集回族镇'),
	(37, 17, 21, 110, '苏集镇'),
	(37, 17, 21, 111, '孙老家镇'),
	(37, 17, 21, 112, '阎店楼镇'),
	(37, 17, 21, 113, '梁堤头镇'),
	(37, 17, 21, 114, '安才楼镇'),
	(37, 17, 21, 115, '曹县邵庄镇'),
	(37, 17, 21, 116, '曹县王集镇'),
	(37, 17, 21, 117, '青岗集镇'),
	(37, 17, 21, 120, '常乐集镇'),
	(37, 17, 21, 121, '曹县大集镇'),
	(37, 17, 21, 122, '曹县仵楼镇'),
	(37, 17, 21, 203, '曹县楼庄乡'),
	(37, 17, 21, 207, '曹县朱洪庙乡');

/* 山东省 菏泽市 单县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 17, 22, 001, '北城街道办事处'),
	(37, 17, 22, 002, '南城街道办事处'),
	(37, 17, 22, 003, '园艺街道办事处'),
	(37, 17, 22, 004, '东城街道办事处'),
	(37, 17, 22, 101, '郭村镇'),
	(37, 17, 22, 102, '黄岗镇'),
	(37, 17, 22, 103, '终兴镇'),
	(37, 17, 22, 105, '高韦庄镇'),
	(37, 17, 22, 106, '徐寨镇'),
	(37, 17, 22, 107, '蔡堂镇'),
	(37, 17, 22, 108, '朱集镇'),
	(37, 17, 22, 109, '李新庄镇'),
	(37, 17, 22, 110, '浮岗镇'),
	(37, 17, 22, 111, '莱河镇'),
	(37, 17, 22, 112, '时楼镇'),
	(37, 17, 22, 113, '杨楼镇'),
	(37, 17, 22, 114, '张集镇'),
	(37, 17, 22, 115, '龙王庙镇'),
	(37, 17, 22, 116, '谢集镇'),
	(37, 17, 22, 117, '李田楼镇'),
	(37, 17, 22, 201, '高老家乡'),
	(37, 17, 22, 202, '曹庄乡');

/* 山东省 菏泽市 成武县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 17, 23, 001, '文亭街道办事处'),
	(37, 17, 23, 002, '永昌街道办事处'),
	(37, 17, 23, 101, '成武县大田集镇'),
	(37, 17, 23, 102, '成武县天宫庙镇'),
	(37, 17, 23, 103, '成武县汶上集镇'),
	(37, 17, 23, 104, '成武县南鲁集镇'),
	(37, 17, 23, 105, '成武县伯乐集镇'),
	(37, 17, 23, 106, '成武县苟村集镇'),
	(37, 17, 23, 107, '成武县白浮图镇'),
	(37, 17, 23, 108, '成武县孙寺镇'),
	(37, 17, 23, 109, '成武县九女集镇'),
	(37, 17, 23, 110, '成武县党集镇'),
	(37, 17, 23, 111, '成武县张楼镇');

/* 山东省 菏泽市 巨野县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 17, 24, 001, '凤凰街道办事处'),
	(37, 17, 24, 002, '永丰街道办事处'),
	(37, 17, 24, 101, '龙固镇'),
	(37, 17, 24, 102, '大义镇'),
	(37, 17, 24, 103, '柳林镇'),
	(37, 17, 24, 104, '章缝镇'),
	(37, 17, 24, 105, '大谢集镇'),
	(37, 17, 24, 106, '独山镇'),
	(37, 17, 24, 107, '麒麟镇'),
	(37, 17, 24, 108, '核桃园镇'),
	(37, 17, 24, 109, '田庄镇'),
	(37, 17, 24, 110, '太平镇'),
	(37, 17, 24, 111, '万丰镇'),
	(37, 17, 24, 112, '陶庙镇'),
	(37, 17, 24, 113, '董官屯镇'),
	(37, 17, 24, 114, '田桥镇'),
	(37, 17, 24, 115, '营里镇');

/* 山东省 菏泽市 郓城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 17, 25, 001, '郓州街道办事处'),
	(37, 17, 25, 002, '唐塔街道办事处'),
	(37, 17, 25, 101, '黄安镇'),
	(37, 17, 25, 102, '杨庄集镇'),
	(37, 17, 25, 103, '侯咽集镇'),
	(37, 17, 25, 104, '武安镇'),
	(37, 17, 25, 105, '郭屯镇'),
	(37, 17, 25, 106, '丁里长镇'),
	(37, 17, 25, 107, '玉皇庙镇'),
	(37, 17, 25, 108, '程屯镇'),
	(37, 17, 25, 109, '随官屯镇'),
	(37, 17, 25, 110, '张营镇'),
	(37, 17, 25, 111, '潘渡镇'),
	(37, 17, 25, 112, '双桥镇'),
	(37, 17, 25, 113, '南赵楼镇'),
	(37, 17, 25, 114, '黄堆集镇'),
	(37, 17, 25, 115, '唐庙镇'),
	(37, 17, 25, 205, '黄集乡'),
	(37, 17, 25, 206, '李集乡'),
	(37, 17, 25, 207, '张鲁集乡'),
	(37, 17, 25, 208, '水堡乡'),
	(37, 17, 25, 209, '陈坡乡');

/* 山东省 菏泽市 鄄城县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 17, 26, 001, '陈王街道办事处'),
	(37, 17, 26, 002, '古泉街道办事处'),
	(37, 17, 26, 101, '什集镇'),
	(37, 17, 26, 102, '红船镇'),
	(37, 17, 26, 103, '旧城镇'),
	(37, 17, 26, 104, '闫什镇'),
	(37, 17, 26, 105, '箕山镇'),
	(37, 17, 26, 106, '李进士堂镇'),
	(37, 17, 26, 107, '董口镇'),
	(37, 17, 26, 108, '临濮镇'),
	(37, 17, 26, 109, '彭楼镇'),
	(37, 17, 26, 110, '凤凰镇'),
	(37, 17, 26, 111, '郑营镇'),
	(37, 17, 26, 112, '大埝镇'),
	(37, 17, 26, 113, '引马镇'),
	(37, 17, 26, 200, '左营乡'),
	(37, 17, 26, 207, '富春乡');

/* 山东省 菏泽市 定陶县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 17, 27, 001, '天中街道办事处'),
	(37, 17, 27, 002, '滨河街道办事处'),
	(37, 17, 27, 101, '陈集镇'),
	(37, 17, 27, 102, '冉固镇'),
	(37, 17, 27, 103, '张湾镇'),
	(37, 17, 27, 104, '黄店镇'),
	(37, 17, 27, 105, '孟海镇'),
	(37, 17, 27, 106, '马集镇'),
	(37, 17, 27, 107, '仿山镇'),
	(37, 17, 27, 108, '半堤镇'),
	(37, 17, 27, 109, '杜堂镇'),
	(37, 17, 27, 110, '南王店镇');

/* 山东省 菏泽市 东明县 */
INSERT INTO `Street` (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(37, 17, 28, 001, '城关街道办事处'),
	(37, 17, 28, 002, '鱼沃街道办事处'),
	(37, 17, 28, 101, '东明集镇'),
	(37, 17, 28, 102, '刘楼镇'),
	(37, 17, 28, 103, '陆圈镇'),
	(37, 17, 28, 104, '马头镇'),
	(37, 17, 28, 105, '三春集镇'),
	(37, 17, 28, 106, '大屯镇'),
	(37, 17, 28, 107, '武胜桥镇'),
	(37, 17, 28, 108, '菜园集镇'),
	(37, 17, 28, 109, '沙窝镇'),
	(37, 17, 28, 110, '小井镇'),
	(37, 17, 28, 204, '长兴集乡'),
	(37, 17, 28, 205, '焦园乡');
