/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */


/*
 * 《2015年统计用区划代码和城乡划分代码（截止2018年10月31日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2018/index.html）
 * 数据范围：上海市(16)。
 */


/* 上海市 市辖区 黄浦区 */
310101002000    南京东路街道
310101013000    外滩街道
310101015000    半淞园路街道
310101017000    小东门街道
310101018000    豫园街道
310101019000    老西门街道
310101020000    五里桥街道
310101021000    打浦桥街道
310101022000    淮海中路街道
310101023000    瑞金二路街道

/* 上海市 市辖区 徐汇区 */
310104003000    天平路街道
310104004000    湖南路街道
310104007000    斜土路街道
310104008000    枫林路街道
310104010000    长桥街道
310104011000    田林街道
310104012000    虹梅路街道
310104013000    康健新村街道
310104014000    徐家汇街道
310104015000    凌云路街道
310104016000    龙华街道
310104017000    漕河泾街道
310104103000    华泾镇
310104501000    漕河泾新兴技术开发区

/* 上海市 市辖区 长宁区 */
310105001000    华阳路街道
310105002000    江苏路街道
310105004000    新华路街道
310105005000    周家桥街道
310105006000    天山路街道
310105008000    仙霞新村街道
310105009000    虹桥街道
310105010000    程家桥街道
310105011000    北新泾街道
310105102000    新泾镇

/* 上海市 市辖区 静安区 */
310106006000    江宁路街道
310106011000    石门二路街道
310106012000    南京西路街道
310106013000    静安寺街道
310106014000    曹家渡街道
310106015000    天目西路街道
310106016000    北站街道
310106017000    宝山路街道
310106018000    共和新路街道
310106019000    大宁路街道
310106020000    彭浦新村街道
310106021000    临汾路街道
310106022000    芷江西路街道
310106101000    彭浦镇

/* 上海市 市辖区 普陀区 */
310107005000    曹杨新村街道
310107014000    长风新村街道
310107015000    长寿路街道
310107016000    甘泉路街道
310107017000    石泉路街道
310107020000    宜川路街道
310107021000    万里街道
310107022000    真如镇街道
310107102000    长征镇
310107103000    桃浦镇

/* 上海市 市辖区 虹口区 */
310109009000    欧阳路街道
310109010000    曲阳路街道
310109011000    广中路街道
310109014000    嘉兴路街道
310109016000    凉城新村街道
310109017000    四川北路街道
310109018000    北外滩街道
310109019000    江湾镇街道

/* 上海市 市辖区 杨浦区 */
310110001000    定海路街道
310110006000    平凉路街道
310110008000    江浦路街道
310110009000    四平路街道
310110012000    控江路街道
310110013000    长白新村街道
310110015000    延吉新村街道
310110016000    殷行街道
310110018000    大桥街道
310110019000    五角场街道
310110020000    新江湾城街道
310110101000    五角场镇

/* 上海市 市辖区 闵行区 */
310112001000    江川路街道
310112006000    古美街道
310112008000    新虹街道
310112009000    浦锦街道
310112101000    莘庄镇
310112102000    七宝镇
310112103000    颛桥镇
310112106000    华漕镇
310112107000    虹桥镇
310112108000    梅陇镇
310112110000    吴泾镇
310112112000    马桥镇
310112114000    浦江镇
310112501000    莘庄工业区

/* 上海市 市辖区 宝山区 */
310113003000    友谊路街道
310113007000    吴淞街道
310113008000    张庙街道
310113101000    罗店镇
310113102000    大场镇
310113103000    杨行镇
310113104000    月浦镇
310113106000    罗泾镇
310113109000    顾村镇
310113111000    高境镇
310113112000    庙行镇
310113113000    淞南镇
310113501000    宝山城市工业园区

/* 上海市 市辖区 嘉定区 */
310114001000    新成路街道
310114002000    真新街道
310114003000    菊园新区管委会
310114004000    嘉定镇街道
310114102000    南翔镇
310114103000    安亭镇
310114106000    马陆镇
310114109000    徐行镇
310114111000    华亭镇
310114114000    外冈镇
310114118000    江桥镇
310114501000    嘉定工业区

/* 上海市 市辖区 浦东新区 */
310115004000    潍坊新村街道
310115005000    陆家嘴街道
310115007000    周家渡街道
310115008000    塘桥街道
310115009000    上钢新村街道
310115010000    南码头路街道
310115011000    沪东新村街道
310115012000    金杨新村街道
310115013000    洋泾街道
310115014000    浦兴路街道
310115015000    东明路街道
310115016000    花木街道
310115103000    川沙新镇
310115104000    高桥镇
310115105000    北蔡镇
310115110000    合庆镇
310115114000    唐镇
310115117000    曹路镇
310115120000    金桥镇
310115121000    高行镇
310115123000    高东镇
310115125000    张江镇
310115130000    三林镇
310115131000    惠南镇
310115132000    周浦镇
310115133000    新场镇
310115134000    大团镇
310115136000    康桥镇
310115137000    航头镇
310115139000    祝桥镇
310115140000    泥城镇
310115141000    宣桥镇
310115142000    书院镇
310115143000    万祥镇
310115144000    老港镇
310115145000    南汇新城镇
310115401000    芦潮港农场
310115402000    东海农场
310115403000    朝阳农场
310115501000    中国（上海）自由贸易试验区（保税片区）
310115502000    金桥经济技术开发区
310115503000    张江高科技园区

/* 上海市 市辖区 金山区 */
310116001000    石化街道
310116101000    朱泾镇
310116102000    枫泾镇
310116103000    张堰镇
310116104000    亭林镇
310116105000    吕巷镇
310116107000    廊下镇
310116109000    金山卫镇
310116112000    漕泾镇
310116113000    山阳镇
310116503000    金山工业区

/* 上海市 市辖区 松江区 */
310117001000    岳阳街道
310117002000    永丰街道
310117003000    方松街道
310117004000    中山街道
310117005000    广富林街道
310117006000    九里亭街道
310117102000    泗泾镇
310117103000    佘山镇
310117104000    车墩镇
310117105000    新桥镇
310117106000    洞泾镇
310117107000    九亭镇
310117109000    泖港镇
310117116000    石湖荡镇
310117117000    新浜镇
310117120000    叶榭镇
310117121000    小昆山镇
310117501000    松江工业区
310117504000    佘山度假区
310117507000    上海松江出口加工区

/* 上海市 市辖区 青浦区 */
310118001000    夏阳街道
310118002000    盈浦街道
310118003000    香花桥街道
310118102000    朱家角镇
310118103000    练塘镇
310118104000    金泽镇
310118105000    赵巷镇
310118106000    徐泾镇
310118107000    华新镇
310118109000    重固镇
310118110000    白鹤镇

/* 上海市 市辖区 奉贤区 */
310120001000    西渡街道
310120002000    奉浦街道
310120101000    南桥镇
310120102000    奉城镇
310120104000    庄行镇
310120106000    金汇镇
310120109000    四团镇
310120111000    青村镇
310120118000    柘林镇
310120123000    海湾镇
310120503000    上海市奉贤区海湾旅游区
310120504000    金海社区

/* 上海市 市辖区 崇明区 */
310151101000    城桥镇
310151102000    堡镇
310151103000    新河镇
310151104000    庙镇
310151105000    竖新镇
310151106000    向化镇
310151107000    三星镇
310151108000    港沿镇
310151109000    中兴镇
310151110000    陈家镇
310151111000    绿华镇
310151112000    港西镇
310151113000    建设镇
310151114000    新海镇
310151115000    东平镇
310151116000    长兴镇
310151201000    新村乡
310151202000    横沙乡
310151401000    前卫农场
310151402000    东平林场
310151501000    上实现代农业园区
