/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */


/*
 * 《2015年统计用区划代码和城乡划分代码（截止2015年09月30日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2015/index.html）
 * 数据范围：内蒙古自治区(15)。
 */

/* 内蒙古自治区 呼和浩特市 新城区 */
150102001000    海拉尔东路街道办事处
150102002000    锡林路街道办事处
150102003000    中山东路街道办事处
150102004000    东街街道办事处
150102005000    西街街道办事处
150102006000    东风路街道办事处
150102007000    迎新路街道办事处
150102008000    成吉思汗大街街道办事处
150102101000    保合少镇

/* 内蒙古自治区 呼和浩特市 回民区 */
150103001000    新华西路办事处
150103002000    中山西路办事处
150103003000    光明路办事处
150103004000    海拉尔西路办事处
150103005000    环河街办事处
150103006000    通道街办事处
150103007000    钢铁路办事处
150103100000    攸攸板镇

/* 内蒙古自治区 呼和浩特市 玉泉区 */
150104001000    小召前街办事处
150104002000    兴隆巷办事处
150104003000    长和廊办事处
150104004000    石东路办事处
150104005000    大南街办事处
150104006000    鄂尔多斯路办事处
150104007000    西菜园办事处
150104008000    昭君路办事处
150104100000    小黑河镇

/* 内蒙古自治区 呼和浩特市 赛罕区 */
150105001000    人民路街道办事处
150105002000    大学西路街道办事处
150105003000    乌兰察布东路街道办事处
150105004000    大学东路街道办事处
150105005000    中专路街道办事处
150105006000    昭乌达路街道办事处
150105007000    巴彦街道办事处
150105008000    敕勒川路街道办事处
150105101000    榆林镇
150105103000    黄合少镇
150105104000    金河镇

/* 内蒙古自治区 呼和浩特市 土默特左旗 */
150121100000    察素齐镇
150121101000    毕克齐镇
150121102000    善岱镇
150121103000    台阁牧镇
150121104000    白庙子镇
150121105000    沙尔沁镇
150121106000    敕勒川镇
150121207000    北什轴乡
150121208000    塔布赛乡

/* 内蒙古自治区 呼和浩特市 托克托县 */
150122100000    双河镇
150122101000    新营子镇
150122102000    五申镇
150122103000    伍什家镇
150122104000    古城镇

/* 内蒙古自治区 呼和浩特市 和林格尔县 */
150123100000    城关镇
150123101000    盛乐镇
150123102000    新店子镇
150123203000    舍必崖乡
150123205000    大红城乡
150123206000    羊群沟乡
150123207000    黑老夭乡
150123208000    巧什营乡

/* 内蒙古自治区 呼和浩特市 清水河县 */
150124100000    城关镇
150124101000    宏河镇
150124102000    喇嘛湾镇
150124103000    老牛湾镇
150124200000    窑沟乡
150124201000    北堡乡
150124202000    韮菜庄乡
150124203000    五良太乡

/* 内蒙古自治区 呼和浩特市 武川县 */
150125100000    可镇
150125101000    哈乐镇
150125102000    西乌兰不浪镇
150125200000    大青山乡
150125205000    上秃亥乡
150125207000    德胜沟乡
150125211000    二份子乡
150125213000    哈拉合少乡
150125214000    耗赖山乡

/* 内蒙古自治区 包头市 东河区 */
150202001000    和平街道办事处
150202002000    财神庙街道办事处
150202003000    西脑包街道办事处
150202004000    南门外街道办事处
150202005000    南圪洞街道办事处
150202006000    东站街道办事处
150202007000    回民街道办事处
150202008000    二里半街道办事处
150202009000    河东街道办事处
150202010000    铁西街道办事处
150202011000    东兴街道办事处
150202012000    杨圪楞街道办事处
150202100000    河东镇
150202101000    沙尔沁镇
150202198000    县级单位直辖村级单位（特殊镇）

/* 内蒙古自治区 包头市 昆都仑区 */
150203001000    少先路街道办事处
150203003000    沼潭街道办事处
150203004000    林荫路街道办事处
150203005000    友谊大街街道办事处
150203006000    阿尔丁大街街道办事处
150203007000    团结大街街道办事处
150203008000    鞍山道街道办事处
150203009000    前进道街道办事处
150203010000    市府东路街道办事处
150203011000    白云路街道办事处
150203012000    黄河西路街道办事处
150203013000    昆工路街道办事处
150203014000    昆北街道办事处
150203100000    昆河镇
150203102000    卜尔汉图镇

/* 内蒙古自治区 包头市 青山区 */
150204001000    先锋道街道办事处
150204002000    幸福路街道办事处
150204003000    万青路街道办事处
150204004000    富强路街道办事处
150204005000    科学路街道办事处
150204006000    青山路街道办事处
150204007000    自由路街道办事处
150204008000    乌素图街道办事处
150204100000    青福镇
150204101000    兴胜镇

/* 内蒙古自治区 包头市 石拐区 */
150205001000    石拐街道办事处
150205002000    大发街道办事处
150205003000    大磁街道办事处
150205004000    五当沟街道办事处
150205005000    白狐沟街道办事处
150205006000    大德恒办事处
150205101000    五当召镇
150205202000    吉忽伦图苏木

/* 内蒙古自治区 包头市 白云鄂博矿区 */
150206001000    矿山路街道办事处
150206002000    通阳道街道办事处

/* 内蒙古自治区 包头市 九原区 */
150207001000    沙河街道办事处
150207002000    赛汗街道办事处
150207003000    萨如拉街道办事处
150207004000    白音席勒街道办事处
150207103000    麻池镇
150207105000    哈林格尔镇
150207110000    哈业胡同镇
150207202000    阿嘎如泰苏木乡

/* 内蒙古自治区 包头市 土默特右旗 */
150221104000    萨拉齐镇
150221105000    双龙镇
150221106000    美岱召镇
150221107000    沟门镇
150221108000    将军尧镇
150221213000    海子乡
150221214000    明沙淖乡
150221215000    苏波盖乡

/* 内蒙古自治区 包头市 固阳县 */
150222102000    金山镇
150222103000    西斗铺镇
150222104000    下湿壕镇
150222105000    银号镇
150222106000    怀朔镇
150222107000    兴顺西镇

/* 内蒙古自治区 包头市 达尔罕茂明安联合旗 */
150223102000    满都拉镇
150223103000    希拉穆仁镇
150223104000    百灵庙镇
150223105000    石宝镇
150223106000    乌克忽洞镇
150223107000    明安镇
150223108000    巴音花镇
150223213000    达尔罕苏木乡
150223214000    查干哈达苏木
150223215000    巴音敖包苏木
150223216000    西河乡
150223217000    小文公乡

/* 内蒙古自治区 乌海市 海勃湾区 */
150302001000    凤凰岭街道办事处
150302002000    海北街道办事处
150302003000    新华街道办事处
150302004000    新华西街道办事处
150302005000    卡布其街道办事处
150302007000    滨河街道办事处
150302101000    千里山镇

/* 内蒙古自治区 乌海市 海南区 */
150303001000    拉僧仲街道办事处
150303002000    西卓子山街道办事处
150303102000    公乌素镇
150303103000    拉僧庙镇
150303104000    巴音陶亥镇

/* 内蒙古自治区 乌海市 乌达区 */
150304002000    三道坎街道办事处
150304003000    五虎山街道办事处
150304008000    新达街道办事处
150304009000    巴音赛街道办事处
150304010000    梁家沟街道办事处
150304011000    苏海图街道办事处
150304012000    滨海街道办事处
150304101000    乌兰淖尔镇

/* 内蒙古自治区 赤峰市 红山区 */
150402001000    西屯街道办事处
150402002000    三中街街道办事处
150402003000    永巨街道办事处
150402004000    东城街道办事处
150402005000    南新街街道办事处
150402006000    站前街道办事处
150402007000    铁南街道办事处
150402008000    长青街道办事处
150402009000    哈达街道办事处
150402010000    西城街道办事处
150402011000    桥北街道办事处
150402100000    红庙子镇
150402102000    文钟镇

/* 内蒙古自治区 赤峰市 元宝山区 */
150403001000    西露天街道办事处
150403002000    平庄城区街道办事处
150403003000    平庄东城街道办事处
150403004000    平庄西城街道办事处
150403005000    马林街道办事处
150403006000    云杉路街道办事处
150403100000    风水沟镇
150403101000    元宝山镇
150403102000    美丽河镇
150403103000    平庄镇
150403104000    五家镇
150403200000    小五家乡

/* 内蒙古自治区 赤峰市 松山区 */
150404001000    振兴街道办事处
150404002000    向阳街道办事处
150404003000    松州街道办事处
150404004000    铁东街道办事处
150404100000    穆家营子镇
150404101000    初头朗镇
150404102000    大庙镇
150404103000    王府镇
150404104000    老府镇
150404105000    哈拉道口镇
150404106000    上官地镇
150404107000    安庆镇
150404108000    太平地镇
150404200000    当铺地满族乡
150404201000    夏家店乡
150404202000    城子乡
150404203000    大夫营子乡
150404204000    岗子乡

/* 内蒙古自治区 赤峰市 阿鲁科尔沁旗 */
150421100000    天山镇
150421101000    天山口镇
150421102000    双胜镇
150421103000    坤都镇
150421104000    巴彦花镇
150421105000    绍根镇
150421106000    扎嘎斯台镇
150421200000    新民乡
150421201000    先锋乡
150421202000    罕苏木苏木
150421203000    赛汉塔拉苏木
150421204000    巴拉奇如德苏木
150421205000    乌兰哈达乡
150421206000    巴彦温都尔苏木

/* 内蒙古自治区 赤峰市 巴林左旗 */
150422100000    林东镇
150422101000    隆昌镇
150422102000    十三敖包镇
150422103000    碧流台镇
150422104000    富河镇
150422105000    白音勿拉镇
150422106000    哈拉哈达镇
150422200000    查干哈达苏木
150422201000    乌兰达坝苏木
150422202000    三山乡
150422203000    花加拉嘎乡

/* 内蒙古自治区 赤峰市 巴林右旗 */
150423100000    大板镇
150423101000    索博日嘎镇
150423102000    宝日勿苏镇
150423103000    查干诺尔镇
150423105000    巴彦琥硕镇
150423200000    西拉沐沦苏木
150423201000    巴彦塔拉苏木
150423202000    幸福之路苏木
150423203000    查干沐沦苏木

/* 内蒙古自治区 赤峰市 林西县 */
150424100000    林西镇
150424101000    新城子镇
150424102000    新林镇
150424103000    五十家子镇
150424104000    官地镇
150424105000    大井镇
150424106000    统部镇
150424200000    大营子乡
150424201000    十二吐乡

/* 内蒙古自治区 赤峰市 克什克腾旗 */
150425100000    经棚镇
150425101000    宇宙地镇
150425102000    土城子镇
150425103000    同兴镇
150425104000    万合永镇
150425105000    芝瑞镇
150425106000    达来诺日镇
150425200000    新开地乡
150425201000    红山子乡
150425202000    达日罕乌拉苏木
150425203000    巴彦查干苏木
150425204000    浩来呼热苏木
150425205000    乌兰布统苏木

/* 内蒙古自治区 赤峰市 翁牛特旗 */
150426100000    乌丹镇
150426101000    乌敦套海镇
150426102000    五分地镇
150426103000    桥头镇
150426104000    广德公镇
150426105000    梧桐花镇
150426106000    海拉苏镇
150426107000    亿合公镇
150426200000    解放营子乡
150426201000    阿什罕苏木
150426202000    新苏莫苏木
150426203000    白音套海苏木
150426204000    毛山东乡
150426205000    格日僧苏木

/* 内蒙古自治区 赤峰市 喀喇沁旗 */
150428100000    锦山镇
150428101000    美林镇
150428102000    王爷府镇
150428103000    小牛群镇
150428104000    牛家营子镇
150428105000    乃林镇
150428106000    西桥镇
150428200000    十家满族乡
150428201000    南台子乡

/* 内蒙古自治区 赤峰市 宁城县 */
150429100000    天义镇
150429101000    小城子镇
150429102000    大城子镇
150429103000    八里罕镇
150429104000    黑里河镇
150429105000    甸子镇
150429106000    大双庙镇
150429107000    汐子镇
150429108000    大明镇
150429109000    忙农镇
150429110000    五化镇
150429111000    三座店镇
150429112000    必斯营子镇
150429202000    一肯中乡
150429203000    存金沟乡

/* 内蒙古自治区 赤峰市 敖汉旗 */
150430100000    新惠镇
150430101000    四家子镇
150430102000    长胜镇
150430103000    贝子府镇
150430104000    四道湾子镇
150430105000    下洼镇
150430106000    金厂沟梁镇
150430107000    兴隆洼镇
150430201000    牛古吐乡
150430202000    木头营子乡
150430203000    古鲁板蒿乡
150430204000    丰收乡
150430205000    玛尼罕乡
150430206000    萨力巴乡
150430207000    敖润苏莫苏木
150430208000    林家地乡

/* 内蒙古自治区 通辽市 科尔沁区 */
150502001000    科尔沁街道办事处
150502002000    西门街道办事处
150502003000    永清街道办事处
150502004000    明仁街道办事处
150502005000    施介街道办事处
150502006000    清真街道办事处
150502007000    东郊街道办事处
150502008000    铁路街道办事处
150502009000    红星街道办事处
150502010000    霍林街道办事处
150502011000    建国街道办事处
150502100000    大林镇
150502101000    钱家店镇
150502102000    余粮堡镇
150502103000    木里图镇
150502104000    丰田镇
150502105000    清河镇
150502106000    育新镇
150502107000    庆和镇
150502108000    敖力布皋镇
150502200000    莫力庙苏木

/* 内蒙古自治区 通辽市 科尔沁左翼中旗 */
150521100000    保康镇
150521101000    宝龙山镇
150521102000    舍伯吐镇
150521103000    巴彦塔拉镇
150521104000    门达镇
150521105000    架玛吐镇
150521106000    腰林毛都镇
150521107000    希伯花镇
150521108000    花吐古拉镇
150521109000    代力吉镇
150521110000    努日木镇
150521200000    花胡硕苏木乡
150521201000    协代苏木乡
150521202000    白兴吐苏木乡
150521203000    图布信苏木乡
150521204000    敖包苏木
150521205000    胜利乡

/* 内蒙古自治区 通辽市 科尔沁左翼后旗 */
150522100000    甘旗卡镇
150522101000    吉尔嘎朗镇
150522102000    金宝屯镇
150522103000    常胜镇
150522104000    查日苏镇
150522105000    双胜镇
150522106000    阿古拉镇
150522107000    朝鲁吐镇
150522108000    努古斯台镇
150522109000    海鲁吐镇
150522200000    阿都沁苏木
150522201000    茂道吐苏木
150522202000    巴嘎塔拉苏木
150522203000    散都苏木
150522204000    巴彦毛都苏木

/* 内蒙古自治区 通辽市 开鲁县 */
150523100000    开鲁镇
150523101000    大榆树镇
150523102000    黑龙坝镇
150523103000    麦新镇
150523104000    义和塔拉镇
150523105000    建华镇
150523106000    小街基镇
150523107000    东风镇
150523108000    吉日嘎郎吐镇
150523109000    东来镇

/* 内蒙古自治区 通辽市 库伦旗 */
150524100000    库伦镇
150524101000    扣河子镇
150524102000    白音花镇
150524103000    六家子镇
150524104000    额勒顺镇
150524200000    茫汗苏木
150524201000    先进苏木
150524202000    水泉乡

/* 内蒙古自治区 通辽市 奈曼旗 */
150525100000    大沁他拉镇
150525101000    八仙筒镇
150525102000    青龙山镇
150525103000    新镇
150525104000    治安镇
150525105000    东明镇
150525106000    沙日浩来镇
150525107000    义隆永镇
150525200000    固日班花苏木
150525201000    白音他拉苏木
150525202000    明仁苏木
150525203000    黄花塔拉苏木
150525204000    土城子乡
150525205000    苇莲苏乡

/* 内蒙古自治区 通辽市 扎鲁特旗 */
150526100000    鲁北镇
150526101000    黄花山镇
150526102000    嘎亥图镇
150526103000    巨日合镇
150526104000    巴雅尔图胡硕镇
150526105000    香山镇
150526106000    阿日昆都楞镇
150526200000    巴彦塔拉苏木乡
150526201000    乌力吉木仁苏木乡
150526202000    道老杜苏木乡
150526203000    格日朝鲁苏木乡
150526204000    前德门苏木
150526205000    乌兰哈达苏木
150526206000    查布嘎图苏木
150526207000    乌额格其苏木

/* 内蒙古自治区 通辽市 霍林郭勒市 */
150581001000    珠斯花街道办事处
150581002000    莫斯台街道办事处
150581003000    宝日呼吉尔街道办事处
150581004000    沙尔呼热街道办事处
150581200000    达来胡硕苏木

/* 内蒙古自治区 鄂尔多斯市 东胜区 */
150602001000    交通街道办事处
150602002000    公园街道办事处
150602003000    林荫街道办事处
150602004000    建设街道办事处
150602005000    富兴街道办事处
150602006000    天骄街道办事处
150602007000    诃额伦街道办事处
150602008000    巴音门克街道办事处
150602010000    幸福街道办事处
150602011000    纺织街道办事处
150602012000    兴盛街道办事处
150602013000    民族街道办事处
150602100000    泊尔江海子镇
150602101000    罕台镇
150602102000    铜川镇

/* 内蒙古自治区 鄂尔多斯市 达拉特旗 */
150621001000    工业街道办事处
150621002000    昭君街道办事处
150621003000    锡尼街道办事处
150621004000    白塔街道办事处
150621005000    西园街道办事处
150621006000    平原街道办事处
150621100000    树林召镇
150621101000    吉格斯太镇
150621102000    白泥井镇
150621103000    王爱召镇
150621104000    昭君镇
150621105000    恩格贝镇
150621106000    中和西镇
150621200000    展旦召苏木乡

/* 内蒙古自治区 鄂尔多斯市 准格尔旗 */
150622001000    兴隆街道
150622002000    迎泽街道
150622003000    蓝天街道
150622004000    友谊街道
150622100000    薛家湾镇
150622101000    沙圪堵镇
150622102000    大路镇
150622103000    纳日松镇
150622104000    龙口镇
150622105000    准格尔召镇
150622200000    暖水乡
150622201000    十二连城乡
150622202000    布尔陶亥苏木乡

/* 内蒙古自治区 鄂尔多斯市 鄂托克前旗 */
150623100000    敖勒召其镇
150623101000    上海庙镇
150623102000    城川镇
150623103000    昂素镇

/* 内蒙古自治区 鄂尔多斯市 鄂托克旗 */
150624100000    乌兰镇
150624101000    棋盘井镇
150624102000    蒙西镇
150624103000    木凯淖尔镇
150624200000    苏米图苏木乡
150624201000    阿尔巴斯苏木乡

/* 内蒙古自治区 鄂尔多斯市 杭锦旗 */
150625100000    锡尼镇
150625101000    巴拉贡镇
150625102000    吉日嘎朗图镇
150625103000    独贵特拉镇
150625104000    呼和木独镇
150625200000    伊和乌素苏木乡

/* 内蒙古自治区 鄂尔多斯市 乌审旗 */
150626100000    嘎鲁图镇
150626101000    乌审召镇
150626102000    图克镇
150626103000    乌兰陶勒盖镇
150626104000    无定河镇
150626200000    苏力德苏木乡

/* 内蒙古自治区 鄂尔多斯市 伊金霍洛旗 */
150627100000    阿勒腾席热镇
150627101000    札萨克镇
150627102000    乌兰木伦镇
150627103000    纳林陶亥镇
150627104000    苏布尔嘎镇
150627105000    红庆河镇
150627106000    伊金霍洛镇

/* 内蒙古自治区 呼伦贝尔市 海拉尔区 */
150702001000    正阳办事处
150702002000    健康街道办事处
150702003000    靠山街道办事处
150702004000    胜利街道办事处
150702005000    呼伦街道办事处
150702007000    建设街道办事处
150702100000    哈克镇
150702101000    奋斗镇

/* 内蒙古自治区 呼伦贝尔市 扎赉诺尔区 */
150703001000    第三街道办事处
150703002000    第一街道办事处
150703003000    第二街道办事处
150703004000    第四街道办事处
150703005000    第五街道办事处
150703100000    灵泉镇

/* 内蒙古自治区 呼伦贝尔市 阿荣旗 */
150721100000    那吉镇
150721101000    六合镇
150721102000    亚东镇
150721103000    霍尔奇镇
150721104000    向阳峪镇
150721105000    三岔河镇
150721106000    复兴镇
150721200000    得力其鄂温克民族乡
150721201000    查巴奇鄂温克民族乡
150721202000    音河达斡尔鄂温克民族乡
150721203000    新发朝鲜民族乡

/* 内蒙古自治区 呼伦贝尔市 莫力达瓦达斡尔族自治旗 */
150722100000    尼尔基镇
150722101000    红彦镇
150722102000    宝山镇
150722103000    哈达阳镇
150722104000    阿尔拉镇
150722105000    汉古尔河镇
150722106000    西瓦尔图镇
150722108000    腾克镇
150722109000    奎勒河镇
150722110000    塔温敖宝镇
150722200000    巴彦鄂温克民族乡
150722201000    库如奇乡
150722203000    杜拉尔鄂温克民族乡

/* 内蒙古自治区 呼伦贝尔市 鄂伦春自治旗 */
150723100000    阿里河镇
150723101000    大杨树镇
150723102000    甘河镇
150723103000    吉文镇
150723104000    诺敏镇
150723105000    乌鲁布铁镇
150723106000    宜里镇
150723107000    克一河镇
150723200000    古里乡
150723201000    托扎敏乡

/* 内蒙古自治区 呼伦贝尔市 鄂温克族自治旗 */
150724100000    巴彦托海镇
150724110000    大雁镇
150724111000    伊敏河镇
150724112000    红花尔基镇
150724210000    巴彦查岗苏木
150724211000    锡尼河西苏木
150724212000    锡尼河东苏木
150724213000    巴彦塔拉达斡尔民族乡
150724214000    伊敏苏木
150724215000    辉苏木

/* 内蒙古自治区 呼伦贝尔市 陈巴尔虎旗 */
150725100000    陈旗巴彦库仁镇
150725101000    陈旗宝日希勒镇
150725102000    陈旗呼和诺尔镇
150725200000    陈旗西乌珠尔苏木
150725201000    陈旗鄂温克民族苏木
150725202000    陈旗东乌珠尔苏木
150725203000    陈旗巴彦哈达苏木

/* 内蒙古自治区 呼伦贝尔市 新巴尔虎左旗 */
150726101000    嵯岗镇
150726102000    阿木古郎镇
150726202000    新宝力格苏木乡
150726203000    乌布尔宝力格苏木乡
150726204000    罕达盖苏木
150726205000    吉布胡郎图苏木
150726206000    甘珠尔苏木

/* 内蒙古自治区 呼伦贝尔市 新巴尔虎右旗 */
150727100000    阿拉坦额莫勒镇
150727101000    阿日哈沙特镇
150727102000    呼伦镇
150727200000    贝尔苏木
150727201000    克尔伦苏木
150727202000    达赉苏木
150727203000    宝格德乌拉苏木

/* 内蒙古自治区 呼伦贝尔市 满洲里市 */
150781001000    东山街道办事处
150781002000    道南街道办事处
150781003000    道北街道办事处
150781004000    兴华街道办事处
150781100000    新开河镇

/* 内蒙古自治区 呼伦贝尔市 牙克石市 */
150782001000    胜利街道办事处
150782002000    红旗街道办事处
150782003000    新工街道办事处
150782004000    永兴街道办事处
150782005000    建设街道办事处
150782006000    暖泉街道办事处
150782007000    东兴街道办事处
150782100000    免渡河镇
150782101000    博克图镇
150782102000    绰河源镇
150782103000    乌尔其汉镇
150782104000    库都尔镇
150782105000    图里河镇
150782106000    乌奴耳镇
150782107000    塔尔气镇
150782108000    伊图里河镇

/* 内蒙古自治区 呼伦贝尔市 扎兰屯市 */
150783001000    兴华街道办事处
150783002000    正阳街道办事处
150783003000    繁荣街道办事处
150783004000    向阳街道办事处
150783005000    高台子街道办事处
150783006000    铁东街道办事处
150783007000    河西街道办事处
150783100000    磨菇气镇
150783102000    卧牛河镇
150783103000    成吉思汗镇
150783104000    大河湾镇
150783105000    浩饶山镇
150783106000    柴河镇
150783107000    中和镇
150783108000    哈多河镇
150783200000    达斡尔民族乡
150783201000    鄂伦春民族乡
150783202000    萨马街鄂温克民族乡
150783203000    洼堤乡

/* 内蒙古自治区 呼伦贝尔市 额尔古纳市 */
150784001000    拉布达林街道办事处
150784002000    上库力街道办事处
150784101000    黑山头镇
150784103000    莫尔道嘎镇
150784104000    恩和哈达镇
150784200000    三河回族乡
150784210000    恩和俄罗斯族民族乡
150784211000    蒙兀室韦苏木
150784212000    奇乾乡

/* 内蒙古自治区 呼伦贝尔市 根河市 */
150785001000    河东街道办事处
150785002000    河西街道办事处
150785003000    森工街道办事处
150785101000    金河镇
150785102000    阿龙山镇
150785103000    满归镇
150785104000    得耳布尔镇
150785200000    敖鲁古雅乡

/* 内蒙古自治区 巴彦淖尔市 临河区 */
150802001000    团结办事处
150802002000    车站办事处
150802003000    先锋办事处
150802004000    解放办事处
150802005000    新华办事处
150802006000    东环路办事处
150802007000    铁南办事处
150802008000    西环路办事处
150802009000    北环路办事处
150802100000    狼山镇
150802101000    新华镇
150802102000    干召庙镇
150802103000    乌兰图克镇
150802104000    双河镇
150802105000    城关镇
150802106000    白脑包镇
150802200000    曙光乡
150802201000    八一乡

/* 内蒙古自治区 巴彦淖尔市 五原县 */
150821100000    隆兴昌镇
150821101000    塔尔湖镇
150821102000    套海镇
150821103000    新公中镇
150821104000    天吉太镇
150821105000    胜丰镇
150821106000    银定图镇
150821107000    复兴镇
150821200000    和胜乡

/* 内蒙古自治区 巴彦淖尔市 磴口县 */
150822100000    巴彦高勒镇
150822101000    隆盛合镇
150822102000    渡口镇
150822103000    补隆淖镇
150822200000    沙金套海苏木

/* 内蒙古自治区 巴彦淖尔市 乌拉特前旗 */
150823100000    乌拉山镇
150823101000    白彦花镇
150823102000    先锋镇
150823103000    新安镇
150823104000    西小召镇
150823105000    大佘太镇
150823106000    明安镇
150823107000    小佘太镇
150823108000    苏独仑镇
150823200000    额尔登布拉格苏木
150823201000    沙德格苏木

/* 内蒙古自治区 巴彦淖尔市 乌拉特中旗 */
150824100000    海流图镇
150824101000    乌加河镇
150824102000    德岭山镇
150824103000    石哈河镇
150824104000    甘其毛都镇
150824105000    温更镇
150824200000    呼鲁斯太苏木
150824201000    川井苏木
150824202000    巴音乌兰苏木
150824203000    新忽热苏木

/* 内蒙古自治区 巴彦淖尔市 乌拉特后旗 */
150825100000    巴音宝力格镇
150825101000    呼和温都尔镇
150825102000    潮格温都尔镇
150825200000    获各琦苏木
150825201000    巴音前达门苏木
150825202000    乌盖苏木

/* 内蒙古自治区 巴彦淖尔市 杭锦后旗 */
150826100000    陕坝镇
150826101000    头道桥镇
150826102000    二道桥镇
150826103000    三道桥镇
150826104000    蛮会镇
150826105000    团结镇
150826106000    双庙镇
150826107000    沙海镇
150826108000    蒙海镇

/* 内蒙古自治区 乌兰察布市 集宁区 */
150902001000    新体路街道办事处
150902002000    桥东街道办事处
150902003000    前进路街道办事处
150902004000    常青街道办事处
150902005000    虎山街道办事处
150902006000    桥西街道办事处
150902007000    新华街街道办事处
150902008000    泉山街道办事处
150902105000    白海子镇
150902205000    马莲渠乡

/* 内蒙古自治区 乌兰察布市 卓资县 */
150921106000    卓资山镇
150921107000    旗下营镇
150921108000    卓资县十八台镇
150921109000    卓资县巴音锡勒镇
150921110000    卓资县梨花镇
150921210000    卓资县大榆树乡
150921211000    卓资县红召乡
150921212000    卓资县复兴乡

/* 内蒙古自治区 乌兰察布市 化德县 */
150922103000    化德县长顺镇
150922104000    化德县朝阳镇
150922105000    化德县七号镇
150922200000    化德县德包图乡
150922201000    化德县公腊胡洞乡
150922218000    化德县白音特拉乡

/* 内蒙古自治区 乌兰察布市 商都县 */
150923101000    七台镇
150923102000    十八顷镇
150923103000    大黑沙土镇
150923104000    西井子镇
150923105000    屯垦队镇
150923106000    小海子镇
150923200000    大库伦乡
150923201000    卯都乡
150923202000    玻璃忽镜乡
150923203000    三大顷乡

/* 内蒙古自治区 乌兰察布市 兴和县 */
150924106000    城关镇
150924107000    张皋镇
150924108000    赛乌素镇
150924109000    鄂尔栋镇
150924110000    店子镇
150924209000    大库联乡
150924210000    民族团结乡
150924211000    大同夭乡
150924212000    五股泉乡

/* 内蒙古自治区 乌兰察布市 凉城县 */
150925103000    岱海镇
150925104000    六苏木镇
150925105000    麦胡图镇
150925106000    永兴镇
150925107000    蛮汉镇
150925218000    天成乡
150925219000    曹碾满族乡
150925220000    厂汉营乡

/* 内蒙古自治区 乌兰察布市 察哈尔右翼前旗 */
150926105000    土贵乌拉镇
150926106000    平地泉镇
150926107000    玫瑰营镇
150926108000    巴音塔拉镇
150926109000    黄旗海镇
150926209000    乌拉哈乌拉乡
150926210000    黄茂营乡
150926211000    三岔口乡
150926212000    老圈沟乡

/* 内蒙古自治区 乌兰察布市 察哈尔右翼中旗 */
150927103000    科布尔镇
150927104000    铁沙盖镇
150927105000    黄羊城镇
150927106000    广益隆镇
150927107000    乌素图镇
150927216000    大滩乡
150927217000    宏盘乡
150927218000    巴音乡
150927219000    库联苏木
150927220000    乌兰哈页苏木
150927221000    察右中旗土城子乡

/* 内蒙古自治区 乌兰察布市 察哈尔右翼后旗 */
150928105000    白音察干镇
150928106000    察哈尔右翼后旗土牧尔台镇
150928107000    察哈尔右翼后旗红格尔图镇
150928108000    察哈尔右翼后旗贲红镇
150928109000    察哈尔右翼后旗大六号镇
150928209000    察哈尔右翼后旗当郎忽洞苏木
150928210000    察哈尔右翼后旗乌兰哈达苏木
150928211000    察哈尔右翼后旗锡勒乡

/* 内蒙古自治区 乌兰察布市 四子王旗 */
150929100000    四子王旗乌兰花镇
150929101000    四子王旗吉生太镇
150929102000    四子王旗库伦图镇
150929103000    四子王旗供济堂镇
150929104000    四子王旗白音朝克图镇
150929200000    四子王旗红格尔苏木
150929201000    四子王旗江岸苏木
150929202000    四子王旗查干补力格苏木
150929203000    四子王旗脑木更苏木
150929204000    四子王旗东八号乡
150929205000    四子王旗忽鸡图乡
150929206000    四子王旗大黑河乡
150929207000    四子王旗巴音敖包苏木

/* 内蒙古自治区 乌兰察布市 丰镇市 */
150981005000    新城区街道办事处
150981006000    旧城区街道办事处
150981007000    北城区街道办事处
150981008000    工业区街道办事处
150981009000    南城区街道办事处
150981107000    隆盛庄镇
150981108000    黑土台镇
150981109000    红砂坝镇
150981110000    巨宝庄镇
150981111000    三义泉镇
150981207000    浑源窑乡
150981208000    元山子乡
150981209000    官屯堡乡

/* 内蒙古自治区 兴安盟 乌兰浩特市 */
152201001000    爱国办事处
152201002000    和平办事处
152201003000    兴安办事处
152201004000    胜利办事处
152201005000    铁西办事处
152201006000    都林办事处
152201007000    五一办事处
152201008000    城郊办事处
152201100000    乌兰哈达镇
152201101000    葛根庙镇
152201102000    太本站镇
152201103000    义勒力特镇

/* 内蒙古自治区 兴安盟 阿尔山市 */
152202001000    阿尔山市林海街道
152202002000    阿尔山市新城街道
152202003000    阿尔山市温泉街道
152202004000    伊尔施街道办事处
152202100000    阿尔山市天池镇
152202101000    阿尔山市白狼镇
152202102000    阿尔山市五岔沟镇
152202103000    明水河镇

/* 内蒙古自治区 兴安盟 科尔沁右翼前旗 */
152221100000    科尔沁镇
152221101000    索伦镇
152221102000    德佰斯镇
152221103000    大石寨镇
152221104000    归流河镇
152221105000    居力很镇
152221106000    察尔森镇
152221107000    额尔格图镇
152221108000    俄体镇
152221200000    满族屯满族乡
152221201000    乌兰毛都苏木乡
152221202000    阿力得尔苏木乡
152221203000    巴拉格歹乡
152221204000    桃合木苏木

/* 内蒙古自治区 兴安盟 科尔沁右翼中旗 */
152222100000    巴彦呼舒镇
152222101000    巴仁哲里木镇
152222102000    吐列毛都镇
152222103000    杜尔基镇
152222104000    高力板镇
152222105000    好腰苏木镇
152222200000    代钦塔拉苏木
152222201000    新佳木苏木
152222202000    哈日诺尔苏木
152222203000    额木庭高勒苏木
152222204000    巴彦茫哈苏木
152222205000    巴彦淖尔苏木

/* 内蒙古自治区 兴安盟 扎赉特旗 */
152223100000    音德尔镇
152223101000    新林镇
152223102000    巴彦高勒镇
152223103000    胡尔勒镇
152223104000    阿尔本格勒镇
152223105000    巴达尔胡镇
152223106000    图牧吉镇
152223200000    好力保乡
152223201000    巴彦乌兰苏木
152223202000    宝力根花苏木
152223203000    阿拉达尔吐苏木
152223204000    巴彦扎拉嘎乡
152223205000    努文木仁乡

/* 内蒙古自治区 兴安盟 突泉县 */
152224100000    突泉镇
152224101000    六户镇
152224102000    东杜尔基镇
152224103000    永安镇
152224104000    水泉镇
152224105000    宝石镇
152224200000    学田乡
152224201000    九龙乡
152224202000    太平乡

/* 内蒙古自治区 锡林郭勒盟 二连浩特市 */
152501200000    格日勒敖都苏木

/* 内蒙古自治区 锡林郭勒盟 锡林浩特市 */
152502001000    希日塔拉街道办事处
152502002000    宝力根街道办事处
152502003000    杭盖街道办事处
152502004000    楚古兰街道办事处
152502005000    额尔敦街道办事处
152502006000    南郊街道办事处
152502007000    巴彦查干街道办事处
152502100000    阿尔善宝拉格镇
152502200000    宝力根苏木
152502201000    朝克乌拉苏木
152502202000    巴彦锡勒办事处乡
152502203000    巴彦宝拉格苏木

/* 内蒙古自治区 锡林郭勒盟 阿巴嘎旗 */
152522100000    别力古台镇
152522101000    洪格尔高勒镇
152522102000    查干淖尔镇
152522200000    那仁宝拉格苏木乡
152522201000    伊和高勒苏木乡乡
152522202000    吉尔嘎郎图苏木乡
152522203000    巴彦图嘎苏木

/* 内蒙古自治区 锡林郭勒盟 苏尼特左旗 */
152523100000    满都拉图镇
152523101000    查干敖包镇
152523102000    巴彦淖尔镇
152523200000    巴彦乌拉苏木
152523201000    赛罕高毕苏木
152523202000    洪格尔苏木
152523203000    达来苏木

/* 内蒙古自治区 锡林郭勒盟 苏尼特右旗 */
152524100000    赛汉塔拉镇
152524101000    朱日和镇
152524102000    乌日根塔拉镇
152524200000    桑宝拉格苏木乡
152524201000    额仁淖尔苏木
152524202000    赛罕乌力吉苏木
152524203000    阿其图乌拉苏木

/* 内蒙古自治区 锡林郭勒盟 东乌珠穆沁旗 */
152525100000    乌里雅斯太镇
152525101000    道特淖尔镇
152525102000    嘎达布其镇
152525103000    满都胡宝拉格镇
152525104000    额吉淖尔镇
152525200000    呼热图淖尔苏木
152525201000    萨麦苏木
152525202000    嘎海乐苏木
152525203000    阿拉坦合力苏木

/* 内蒙古自治区 锡林郭勒盟 西乌珠穆沁旗 */
152526100000    巴拉嘎尔高勒镇
152526101000    巴彦花镇
152526102000    吉仁高勒镇
152526103000    浩勒图高勒镇
152526104000    高日罕镇
152526200000    巴彦胡舒苏木乡
152526201000    乌兰哈拉嘎苏木

/* 内蒙古自治区 锡林郭勒盟 太仆寺旗 */
152527100000    宝昌镇
152527101000    千斤沟镇
152527102000    红旗镇
152527103000    骆驼山镇
152527104000    永丰镇
152527200000    幸福乡
152527201000    贡宝拉格苏木乡

/* 内蒙古自治区 锡林郭勒盟 镶黄旗 */
152528100000    新宝拉格镇
152528101000    巴彦塔拉镇
152528200000    翁贡乌拉苏木乡
152528201000    宝格达音髙勒苏木

/* 内蒙古自治区 锡林郭勒盟 正镶白旗 */
152529100000    明安图镇
152529101000    星耀镇
152529200000    伊和淖尔苏木乡
152529201000    乌兰查布苏木乡
152529202000    宝拉根陶海苏木

/* 内蒙古自治区 锡林郭勒盟 正蓝旗 */
152530100000    上都镇
152530101000    桑根达来镇
152530102000    哈毕日嘎镇
152530200000    宝绍代苏木乡
152530201000    那日图苏木乡
152530202000    赛音呼都嘎苏木乡
152530203000    扎格斯台苏木

/* 内蒙古自治区 锡林郭勒盟 多伦县 */
152531100000    大北沟镇
152531101000    多伦诺尔镇
152531200000    大河口乡
152531201000    蔡木山乡
152531202000    西干沟乡

/* 内蒙古自治区 阿拉善盟 阿拉善左旗 */
152921102000    温都尔勒图镇
152921105000    巴润别立镇
152921110000    巴彦浩特镇
152921111000    嘉尔嘎勒赛汉镇
152921112000    吉兰泰镇
152921113000    宗别立镇
152921114000    敖伦布拉格镇
152921115000    腾格里额里斯镇
152921203000    巴彦木仁苏木乡
152921213000    乌力吉苏木乡
152921214000    巴彦诺日公苏木乡
152921215000    额尔克哈什哈苏木乡
152921216000    银根苏木
152921217000    超格图呼热苏木

/* 内蒙古自治区 阿拉善盟 阿拉善右旗 */
152922103000    巴丹吉林镇
152922104000    雅布赖镇
152922105000    阿拉腾敖包镇
152922211000    曼德拉苏木
152922212000    阿拉腾朝格苏木
152922213000    巴音高勒苏木
152922214000    塔木素布拉格苏木

/* 内蒙古自治区 阿拉善盟 额济纳旗 */
152923100000    达来呼布镇
152923101000    额济纳旗东风镇
152923102000    哈日布日格德音乌拉镇
152923200000    额济纳旗赛汉陶来苏木
152923201000    额济纳旗马鬃山苏木
152923202000    额济纳旗苏泊淖尔苏木
152923203000    巴彦陶来苏木
152923204000    温图高勒苏木