/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */


/*
 * 《2015年统计用区划代码和城乡划分代码（截止2018年10月31日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2018/index.html）
 * 数据范围：北京市(16)。
 */


/* 北京市 市辖区 东城区 */
110101001000    东华门街道办事处
110101002000    景山街道办事处
110101003000    交道口街道办事处
110101004000    安定门街道办事处
110101005000    北新桥街道办事处
110101006000    东四街道办事处
110101007000    朝阳门街道办事处
110101008000    建国门街道办事处
110101009000    东直门街道办事处
110101010000    和平里街道办事处
110101011000    前门街道办事处
110101012000    崇文门外街道办事处
110101013000    东花市街道办事处
110101014000    龙潭街道办事处
110101015000    体育馆路街道办事处
110101016000    天坛街道办事处
110101017000    永定门外街道办事处

/* 北京市 市辖区 西城区 */
110102001000    西长安街街道办事处
110102003000    新街口街道办事处
110102007000    月坛街道办事处
110102009000    展览路街道办事处
110102010000    德胜街道办事处
110102011000    金融街街道办事处
110102012000    什刹海街道办事处
110102013000    大栅栏街道办事处
110102014000    天桥街道办事处
110102015000    椿树街道办事处
110102016000    陶然亭街道办事处
110102017000    广安门内街道办事处
110102018000    牛街街道办事处
110102019000    白纸坊街道办事处
110102020000    广安门外街道办事处

/* 北京市 市辖区 朝阳区 */
110105001000    建外街道办事处
110105002000    朝外街道办事处
110105003000    呼家楼街道办事处
110105004000    三里屯街道办事处
110105005000    左家庄街道办事处
110105006000    香河园街道办事处
110105007000    和平街街道办事处
110105008000    安贞街道办事处
110105009000    亚运村街道办事处
110105010000    小关街道办事处
110105011000    酒仙桥街道办事处
110105012000    麦子店街道办事处
110105013000    团结湖街道办事处
110105014000    六里屯街道办事处
110105015000    八里庄街道办事处
110105016000    双井街道办事处
110105017000    劲松街道办事处
110105018000    潘家园街道办事处
110105019000    垡头街道办事处
110105021000    南磨房地区办事处
110105022000    高碑店地区办事处
110105023000    将台地区办事处
110105024000    太阳宫地区办事处
110105025000    大屯街道办事处
110105026000    望京街道办事处
110105027000    小红门地区办事处
110105028000    十八里店地区办事处
110105029000    平房地区办事处
110105030000    东风地区办事处
110105031000    奥运村街道办事处
110105032000    来广营地区办事处
110105033000    常营地区办事处
110105034000    三间房地区办事处
110105035000    管庄地区办事处
110105036000    金盏地区办事处
110105037000    孙河地区办事处
110105038000    崔各庄地区办事处
110105039000    东坝地区办事处
110105040000    黑庄户地区办事处
110105041000    豆各庄地区办事处
110105042000    王四营地区办事处
110105043000    东湖街道办事处
110105400000    首都机场街道办事处

/* 北京市 市辖区 丰台区 */
110106001000    右安门街道办事处
110106002000    太平桥街道办事处
110106003000    西罗园街道办事处
110106004000    大红门街道办事处
110106005000    南苑街道办事处
110106006000    东高地街道办事处
110106007000    东铁匠营街道办事处
110106008000    卢沟桥街道办事处
110106009000    丰台街道办事处
110106010000    新村街道办事处
110106011000    长辛店街道办事处
110106012000    云岗街道办事处
110106013000    方庄地区办事处
110106014000    宛平城地区办事处
110106015000    马家堡街道办事处
110106016000    和义街道办事处
110106017000    卢沟桥地区办事处
110106018000    花乡地区办事处
110106019000    南苑地区办事处
110106100000    长辛店镇
110106101000    王佐镇

/* 北京市 市辖区 石景山区 */
110107001000    八宝山街道办事处
110107002000    老山街道办事处
110107003000    八角街道办事处
110107004000    古城街道办事处
110107005000    苹果园街道办事处
110107006000    金顶街街道办事处
110107009000    广宁街道办事处
110107010000    五里坨街道办事处
110107011000    鲁谷街道办事处

/* 北京市 市辖区 海淀区 */
110108001000    万寿路街道办事处
110108002000    永定路街道办事处
110108003000    羊坊店街道办事处
110108004000    甘家口街道办事处
110108005000    八里庄街道办事处
110108006000    紫竹院街道办事处
110108007000    北下关街道办事处
110108008000    北太平庄街道办事处
110108010000    学院路街道办事处
110108011000    中关村街道办事处
110108012000    海淀街道办事处
110108013000    青龙桥街道办事处
110108014000    清华园街道办事处
110108015000    燕园街道办事处
110108016000    香山街道办事处
110108017000    清河街道办事处
110108018000    花园路街道办事处
110108019000    西三旗街道办事处
110108020000    马连洼街道办事处
110108021000    田村路街道办事处
110108022000    上地街道办事处
110108023000    万柳地区办事处
110108024000    东升地区办事处
110108025000    曙光街道办事处
110108026000    温泉地区办事处
110108027000    四季青地区办事处
110108028000    西北旺地区办事处
110108029000    苏家坨地区办事处
110108030000    上庄地区办事处

/* 北京市 市辖区 门头沟区 */
110109001000    大峪街道办事处
110109002000    城子街道办事处
110109003000    东辛房街道办事处
110109004000    大台街道办事处
110109005000    王平地区办事处
110109006000    永定地区办事处
110109007000    龙泉地区办事处
110109101000    潭柘寺镇
110109104000    军庄镇
110109105000    雁翅镇
110109106000    斋堂镇
110109107000    清水镇
110109108000    妙峰山镇

/* 北京市 市辖区 房山区 */
110111001000    城关街道办事处
110111002000    新镇街道办事处
110111004000    向阳街道办事处
110111005000    东风街道办事处
110111006000    迎风街道办事处
110111007000    星城街道办事处
110111008000    良乡地区办事处
110111009000    周口店地区办事处
110111010000    琉璃河地区办事处
110111011000    拱辰街道办事处
110111012000    西潞街道办事处
110111101000    阎村镇
110111103000    窦店镇
110111104000    石楼镇
110111105000    长阳镇
110111107000    河北镇
110111108000    长沟镇
110111109000    大石窝镇
110111110000    张坊镇
110111111000    十渡镇
110111112000    青龙湖镇
110111115000    韩村河镇
110111208000    霞云岭乡
110111209000    南窖乡
110111210000    佛子庄乡
110111211000    大安山乡
110111212000    史家营乡
110111213000    蒲洼乡

/* 北京市 市辖区 通州区 */
110112001000    中仓街道办事处
110112002000    新华街道办事处
110112003000    北苑街道办事处
110112004000    玉桥街道办事处
110112005000    永顺地区办事处
110112006000    梨园地区办事处
110112104000    宋庄镇
110112105000    张家湾镇
110112106000    漷县镇
110112109000    马驹桥镇
110112110000    西集镇
110112114000    台湖镇
110112117000    永乐店镇
110112119000    潞城镇
110112209000    于家务回族乡

/* 北京市 市辖区 顺义区 */
110113001000    胜利街道办事处
110113002000    光明街道办事处
110113003000    仁和地区办事处
110113004000    后沙峪地区办事处
110113005000    天竺地区办事处
110113006000    杨镇地区办事处
110113007000    牛栏山地区办事处
110113008000    南法信地区办事处
110113009000    马坡地区办事处
110113010000    石园街道办事处
110113011000    空港街道办事处
110113012000    双丰街道办事处
110113013000    旺泉街道办事处
110113101000    高丽营镇
110113104000    李桥镇
110113105000    李遂镇
110113106000    南彩镇
110113108000    北务镇
110113109000    大孙各庄镇
110113110000    张镇
110113111000    龙湾屯镇
110113112000    木林镇
110113113000    北小营镇
110113115000    北石槽镇
110113116000    赵全营镇

/* 北京市 市辖区 昌平区 */
110114001000    城北街道办事处
110114002000    南口地区办事处
110114003000    马池口地区办事处
110114004000    沙河地区办事处
110114005000    城南街道办事处
110114007000    东小口地区办事处
110114008000    天通苑北街道办事处
110114009000    天通苑南街道办事处
110114010000    霍营街道办事处
110114011000    回龙观街道办事处
110114012000    龙泽园街道办事处
110114013000    史各庄街道办事处
110114104000    阳坊镇
110114110000    小汤山镇
110114111000    南邵镇
110114112000    崔村镇
110114113000    百善镇
110114115000    北七家镇
110114116000    兴寿镇
110114118000    流村镇
110114119000    十三陵镇
110114120000    延寿镇

/* 北京市 市辖区 大兴区 */
110115001000    兴丰街道办事处
110115002000    林校路街道办事处
110115003000    清源街道办事处
110115004000    亦庄地区办事处
110115005000    黄村地区办事处
110115006000    旧宫地区办事处
110115007000    西红门地区办事处
110115008000    瀛海地区办事处
110115009000    观音寺街道办事处
110115010000    天宫院街道办事处
110115011000    高米店街道办事处
110115012000    荣华街道办事处
110115013000    博兴街道办事处
110115103000    青云店镇
110115104000    采育镇
110115105000    安定镇
110115106000    礼贤镇
110115107000    榆垡镇
110115108000    庞各庄镇
110115109000    北臧村镇
110115110000    魏善庄镇
110115111000    长子营镇
110115403000    北京经济技术开发区
110115404000    中关村国家自主创新示范区大兴生物医药产业基地
110115405000    国家新媒体产业基地

/* 北京市 市辖区 怀柔区 */
110116001000    泉河街道办事处
110116002000    龙山街道办事处
110116003000    怀柔地区办事处
110116004000    雁栖地区办事处
110116005000    庙城地区办事处
110116102000    北房镇
110116103000    杨宋镇
110116105000    桥梓镇
110116106000    怀北镇
110116107000    汤河口镇
110116108000    渤海镇
110116109000    九渡河镇
110116110000    琉璃庙镇
110116111000    宝山镇
110116211000    长哨营满族乡
110116213000    喇叭沟门满族乡
110116400000    北京雁栖经济开发区

/* 北京市 市辖区 平谷区 */
110117001000    滨河街道办事处
110117002000    兴谷街道办事处
110117003000    渔阳地区办事处
110117004000    峪口地区办事处
110117005000    马坊地区办事处
110117006000    金海湖地区办事处
110117101000    东高村镇
110117102000    山东庄镇
110117104000    南独乐河镇
110117105000    大华山镇
110117106000    夏各庄镇
110117108000    马昌营镇
110117110000    王辛庄镇
110117111000    大兴庄镇
110117112000    刘家店镇
110117114000    镇罗营镇
110117213000    黄松峪乡
110117214000    熊儿寨乡

/* 北京市 市辖区 密云区 */
110118001000    鼓楼街道办事处
110118002000    果园街道办事处
110118003000    檀营地区办事处
110118100000    密云镇
110118101000    溪翁庄镇
110118102000    西田各庄镇
110118103000    十里堡镇
110118104000    河南寨镇
110118105000    巨各庄镇
110118106000    穆家峪镇
110118107000    太师屯镇
110118108000    高岭镇
110118109000    不老屯镇
110118110000    冯家峪镇
110118111000    古北口镇
110118112000    大城子镇
110118113000    东邵渠镇
110118114000    北庄镇
110118115000    新城子镇
110118116000    石城镇
110118400000    北京密云经济开发区

/* 北京市 市辖区 延庆区 */
110119001000    百泉街道办事处
110119002000    香水园街道办事处
110119003000    儒林街道办事处
110119100000    延庆镇
110119101000    康庄镇
110119102000    八达岭镇
110119103000    永宁镇
110119104000    旧县镇
110119105000    张山营镇
110119106000    四海镇
110119107000    千家店镇
110119108000    沈家营镇
110119109000    大榆树镇
110119110000    井庄镇
110119200000    大庄科乡
110119201000    刘斌堡乡
110119202000    香营乡
110119203000    珍珠泉乡
