/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */


/*
 * 《2015年统计用区划代码和城乡划分代码（截止2018年10月31日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2018/index.html）
 * 数据范围：天津市(16)。
 */


/* 天津市 市辖区 和平区 */
120101001000    劝业场街道
120101002000    小白楼街道
120101003000    五大道街道
120101004000    新兴街道
120101005000    南营门街道
120101006000    南市街道

/* 天津市 市辖区 河东区 */
120102001000    大王庄街道
120102002000    大直沽街道
120102003000    中山门街道
120102004000    富民路街道
120102005000    二号桥街道
120102006000    春华街道
120102007000    唐家口街道
120102008000    向阳楼街道
120102009000    常州道街道
120102010000    上杭路街道
120102011000    东新街道
120102012000    鲁山道街道
120102013000    天津铁厂街道

/* 天津市 市辖区 河西区 */
120103001000    大营门街道
120103002000    下瓦房街道
120103003000    桃园街道
120103004000    挂甲寺街道
120103005000    马场街道
120103006000    越秀路街道
120103007000    友谊路街道
120103008000    天塔街道
120103009000    尖山街道
120103010000    陈塘庄街道
120103011000    柳林街道
120103012000    东海街道
120103013000    梅江街道
120103014000    太湖路街道

/* 天津市 市辖区 南开区 */
120104001000    长虹街道
120104002000    鼓楼街道
120104003000    兴南街道
120104004000    广开街道
120104005000    万兴街道
120104006000    学府街道
120104007000    向阳路街道
120104008000    嘉陵道街道
120104009000    王顶堤街道
120104010000    水上公园街道
120104011000    体育中心街道
120104012000    华苑街道

/* 天津市 市辖区 河北区 */
120105001000    光复道街道
120105002000    望海楼街道
120105003000    鸿顺里街道
120105004000    新开河街道
120105005000    铁东路街道
120105006000    建昌道街道
120105007000    宁园街道
120105008000    王串场街道
120105009000    江都路街道
120105010000    月牙河街道

/* 天津市 市辖区 红桥区 */
120106001000    西于庄街道
120106002000    双环村街道
120106003000    咸阳北路街道
120106004000    丁字沽街道
120106005000    西沽街道
120106006000    三条石街道
120106008000    邵公庄街道
120106009000    芥园街道
120106010000    铃铛阁街道
120106011000    大胡同街道
120106012000    和苑街道办事处

/* 天津市 市辖区 东丽区 */
120110001000    张贵庄街道
120110002000    丰年村街道
120110003000    万新街道
120110004000    无瑕街道
120110005000    新立街道
120110006000    华明街道
120110007000    金钟街道
120110008000    军粮城街道
120110009000    金桥街道
120110010000    华新街道
120110011000    东丽湖街道
120110400000    天津开发区西区
120110401000    天津航空物流区
120110402000    天津空港经济区
120110403000    东丽区经济技术开发区
120110405000    综合保税区
120110406000    航空新城
120110407000    服务滨海新区建设管理委员会

/* 天津市 市辖区 西青区 */
120111001000    西营门街道
120111002000    李七庄街道
120111003000    赤龙南街道
120111100000    中北镇
120111101000    杨柳青镇
120111102000    辛口镇
120111103000    张家窝镇
120111104000    精武镇
120111105000    大寺镇
120111106000    王稳庄镇
120111400000    天津开发区微电子小区
120111401000    新技术产业园区
120111402000    西青高校区
120111450000    西青区开发区

/* 天津市 市辖区 津南区 */
120112001000    双新街道办事处
120112002000    双林街道办事处
120112100000    咸水沽镇
120112101000    葛沽镇
120112102000    小站镇
120112103000    双港镇
120112104000    辛庄镇
120112106000    双桥河镇
120112107000    八里台镇
120112108000    北闸口镇
120112401000    铁路十八局
120112403000    长青办事处
120112404000    津南开发区东区
120112405000    津南开发区西区
120112407000    海河教育园区
120112500000    双林农场
120112501000    津南国家农业园区

/* 天津市 市辖区 北辰区 */
120113001000    果园新村街道
120113002000    集贤里街道
120113003000    普东街道
120113004000    瑞景街道
120113005000    佳荣里街道
120113006000    青源街道
120113007000    广源街道
120113100000    天穆镇
120113101000    北仓镇
120113102000    双街镇
120113103000    双口镇
120113104000    青光镇
120113106000    宜兴埠镇
120113107000    小淀镇
120113108000    大张庄镇
120113111000    西堤头镇
120113400000    科技园区北区
120113401000    科技园区南区
120113402000    天津医药医疗器械工业园
120113403000    天津陆路港物流装备产业园
120113404000    天津风电产业园
120113500000    红旗农场
120113501000    曙光农场

/* 天津市 市辖区 武清区 */
120114001000    杨村街道
120114002000    下朱庄街道
120114003000    东蒲洼街道
120114004000    黄庄街道
120114005000    徐官屯街道
120114006000    运河西街道
120114101000    梅厂镇
120114102000    大碱厂镇
120114103000    崔黄口镇
120114104000    大良镇
120114105000    下伍旗镇
120114106000    南蔡村镇
120114107000    大孟庄镇
120114108000    泗村店镇
120114109000    河西务镇
120114110000    城关镇
120114111000    东马圈镇
120114112000    黄花店镇
120114113000    石各庄镇
120114114000    王庆坨镇
120114115000    汊沽港镇
120114116000    河北屯镇
120114117000    上马台镇
120114118000    大王古庄镇
120114119000    陈咀镇
120114120000    豆张庄镇
120114121000    曹子里镇
120114122000    大黄堡镇
120114123000    高村镇
120114124000    白古屯镇
120114400000    天津开发区逸仙科学工业园
120114401000    武清经济技术开发区
120114402000    天津武清商务区
120114403000    天津京滨工业园
120114404000    天津京津电子商务产业园
120114405000    天津武清汽车产业园
120114406000    天津京津科技谷
120114407000    京津高村科技创新园
120114500000    武清农场

/* 天津市 市辖区 宝坻区 */
120115001000    海滨街道
120115002000    宝平街道
120115003000    钰华街道
120115004000    大白街道
120115005000    口东街道
120115006000    周良街道
120115007000    潮阳街道
120115008000    朝霞街道
120115101000    大口屯镇
120115103000    王卜庄镇
120115104000    方家庄镇
120115105000    林亭口镇
120115106000    八门城镇
120115107000    大钟庄镇
120115108000    新安镇
120115111000    霍各庄镇
120115113000    新开口镇
120115115000    大唐庄镇
120115119000    牛道口镇
120115120000    史各庄镇
120115121000    郝各庄镇
120115123000    牛家牌镇
120115124000    尔王庄镇
120115125000    黄庄镇
120115453000    天宝工业园区
120115454000    九园工业园区
120115455000    京津新城
120115500000    里自沽农场
120115501000    黄庄农场
120115502000    大钟农场

/* 天津市 市辖区 滨海新区 */
120116001000    塘沽街道
120116005000    杭州道街道
120116006000    新河街道
120116007000    大沽街道
120116008000    新北街道
120116009000    北塘街道
120116011000    胡家园街道
120116012000    新港街道
120116013000    新村街道
120116014000    泰达街道（天津经济技术开发区东区）
120116031000    汉沽街道
120116032000    寨上街道
120116033000    茶淀街道
120116051000    大港街道
120116053000    古林街道
120116054000    海滨街道
120116100000    新城镇
120116135000    杨家泊镇
120116156000    太平镇
120116157000    小王庄镇
120116158000    中塘镇
120116400000    天津经济技术开发区（其他片区）
120116401000    天津港保税区
120116402000    天津滨海新区高新技术产业开发区
120116403000    东疆保税港区
120116406000    中新天津生态城
120116415000    天津滨海中关村科技园

/* 天津市 市辖区 宁河区 */
120117100000    芦台镇
120117102000    宁河镇
120117103000    苗庄镇
120117104000    丰台镇
120117105000    岳龙镇
120117106000    板桥镇
120117107000    潘庄镇
120117109000    造甲城镇
120117110000    七里海镇
120117111000    大北涧沽镇
120117112000    东棘坨镇
120117113000    北淮淀镇
120117114000    俵口镇
120117115000    廉庄镇
120117400000    宁河区贸易开发区
120117401000    宁河区经济开发区
120117402000    天津未来科技城开发区片区
120117403000    天津未来科技城滨海高新区片区
120117451000    天津未来科技城宁河片区现代产业区组团
120117452000    天津未来科技城宁河片区潘庄工业区组团
120117453000    天津未来科技城宁河片区北淮淀组团
120117500000    潘庄农场

/* 天津市 市辖区 静海区 */
120118001000    华康街道办事处
120118100000    静海镇
120118101000    唐官屯镇
120118102000    独流镇
120118103000    王口镇
120118104000    台头镇
120118105000    子牙镇
120118106000    陈官屯镇
120118107000    中旺镇
120118108000    大邱庄镇
120118109000    蔡公庄镇
120118110000    梁头镇
120118111000    团泊镇
120118112000    双塘镇
120118113000    大丰堆镇
120118114000    沿庄镇
120118115000    西翟庄镇
120118200000    良王庄乡
120118201000    杨成庄乡
120118400000    天津静海经济开发区
120118402000    天津子牙循环经济产业区
120118403000    团泊新城

/* 天津市 市辖区 蓟州区 */
120119001000    文昌街道办事处
120119100000    渔阳镇
120119101000    洇溜镇
120119102000    官庄镇
120119103000    马伸桥镇
120119104000    下营镇
120119105000    邦均镇
120119106000    别山镇
120119108000    尤古庄镇
120119109000    上仓镇
120119111000    下仓镇
120119112000    罗庄子镇
120119113000    白涧镇
120119114000    五百户镇
120119115000    侯家营镇
120119116000    桑梓镇
120119117000    东施古镇
120119118000    下窝头镇
120119119000    杨津庄镇
120119120000    出头岭镇
120119121000    西龙虎峪镇
120119122000    穿芳峪镇
120119123000    东二营镇
120119124000    许家台镇
120119125000    礼明庄镇
120119126000    东赵各庄镇
120119203000    孙各庄乡
120119400000    蓟县新城建设管理委员会
