/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */


/*
 * 《2015年统计用区划代码和城乡划分代码（截止2018年10月31日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2018/index.html）
 * 数据范围：宁夏回族自治区(5)。
 */


/* 宁夏回族自治区 银川市 兴庆区 */
640104001000    凤凰北街街道办事处
640104002000    解放西街街道办事处
640104003000    文化街街道办事处
640104004000    富宁街街道办事处
640104005000    新华街街道办事处
640104006000    玉皇阁北街街道办事处
640104007000    前进街街道办事处
640104008000    中山南街街道办事处
640104009000    银古路街道办事处
640104010000    胜利街街道办事处
640104011000    丽景街街道办事处
640104100000    掌政镇
640104101000    大新镇
640104200000    通贵乡
640104201000    月牙湖乡
640104400000    燕鸽湖管委会

/* 宁夏回族自治区 银川市 西夏区 */
640105001000    西花园街道办事处
640105002000    北京西路街道办事处
640105003000    文昌路街道办事处
640105004000    朔方路街道办事处
640105005000    宁华路街道办事处
640105006000    贺兰山西路街道办事处
640105007000    怀远路街道办事处
640105100000    兴泾镇
640105101000    镇北堡镇

/* 宁夏回族自治区 银川市 金凤区 */
640106001000    满城北街街道办事处
640106002000    黄河东路街道办事处
640106003000    长城中路街道办事处
640106004000    北京中路街道办事处
640106005000    上海西路街道办事处
640106100000    良田镇
640106101000    丰登镇

/* 宁夏回族自治区 银川市 永宁县 */
640121001000    团结西路街道办事处
640121100000    杨和镇
640121101000    李俊镇
640121102000    望远镇
640121103000    望洪镇
640121104000    闽宁镇
640121200000    胜利乡
640121400000    黄羊滩农场
640121401000    玉泉营农场

/* 宁夏回族自治区 银川市 贺兰县 */
640122100000    习岗镇
640122101000    金贵镇
640122102000    立岗镇
640122103000    洪广镇
640122200000    常信乡
640122400000    南梁台子管委会
640122401000    暖泉农场
640122402000    宁夏原种场
640122403000    京星农牧场

/* 宁夏回族自治区 银川市 灵武市 */
640181001000    城区街道办事处
640181100000    东塔镇
640181101000    郝家桥镇
640181102000    崇兴镇
640181103000    宁东镇
640181104000    马家滩镇
640181105000    临河镇
640181200000    梧桐树乡
640181201000    白土岗乡
640181400000    灵武农场
640181401000    狼皮子梁管委会

/* 宁夏回族自治区 石嘴山市 大武口区 */
640202001000    长胜街道办事处
640202002000    朝阳街道办事处
640202003000    人民路街道办事处
640202004000    长城街道办事处
640202005000    青山街道办事处
640202006000    石炭井街道办事处
640202007000    白芨沟街道办事处
640202008000    沟口街道办事处
640202010000    长兴街道办事处
640202011000    锦林街道办事处
640202100000    星海镇

/* 宁夏回族自治区 石嘴山市 惠农区 */
640205001000    育才路街道办事处
640205002000    南街街道办事处
640205003000    中街街道办事处
640205004000    北街街道办事处
640205005000    河滨街道办事处
640205006000    火车站街道办事处
640205100000    红果子镇
640205101000    尾闸镇
640205102000    园艺镇
640205200000    庙台乡
640205201000    礼和乡
640205202000    燕子墩乡
640205401000    简泉农场
640205402000    国营农林牧场
640205403000    良种繁殖场

/* 宁夏回族自治区 石嘴山市 平罗县 */
640221100000    城关镇
640221101000    黄渠桥镇
640221102000    宝丰镇
640221103000    头闸镇
640221104000    姚伏镇
640221105000    崇岗镇
640221106000    陶乐镇
640221200000    高庄乡
640221201000    灵沙乡
640221202000    渠口乡
640221203000    通伏乡
640221204000    高仁乡
640221205000    红崖子乡
640221400000    前进农场

/* 宁夏回族自治区 吴忠市 利通区 */
640302100000    金积镇
640302101000    金银滩镇
640302102000    高闸镇
640302103000    扁担沟镇
640302104000    上桥镇
640302105000    古城镇
640302106000    金星镇
640302107000    胜利镇
640302200000    东塔寺乡
640302201000    板桥乡
640302202000    马莲渠乡
640302203000    郭家桥乡
640302400000    巴浪湖农场
640302401000    孙家滩管委会

/* 宁夏回族自治区 吴忠市 红寺堡区 */
640303001000    红寺堡区新民街道办事处
640303100000    红寺堡区红寺堡镇
640303101000    红寺堡区太阳山镇
640303200000    红寺堡区大河乡
640303201000    红寺堡区新庄集乡
640303202000    红寺堡区柳泉乡
640303400000    红寺堡工业园区管委会

/* 宁夏回族自治区 吴忠市 盐池县 */
640323100000    花马池镇
640323101000    大水坑镇
640323102000    惠安堡镇
640323103000    高沙窝镇
640323200000    王乐井乡
640323201000    冯记沟乡
640323202000    青山乡
640323203000    麻黄山乡

/* 宁夏回族自治区 吴忠市 同心县 */
640324100000    豫海镇
640324101000    河西镇
640324102000    韦州镇
640324103000    下马关镇
640324104000    预旺镇
640324105000    王团镇
640324106000    丁塘镇
640324201000    田老庄乡
640324202000    马高庄乡
640324203000    张家塬乡
640324204000    兴隆乡

/* 宁夏回族自治区 吴忠市 青铜峡市 */
640381001000    裕民街道办事处
640381100000    小坝镇
640381101000    大坝镇
640381102000    青铜峡镇
640381103000    叶盛镇
640381104000    瞿靖镇
640381105000    峡口镇
640381106000    邵岗镇
640381107000    陈袁滩镇
640381400000    连湖农场
640381401000    树新林场

/* 宁夏回族自治区 固原市 原州区 */
640402001000    南关街道办事处
640402002000    古雁街道办事处
640402003000    北塬街道办事处
640402100000    三营镇
640402103000    官厅镇
640402104000    开城镇
640402105000    张易镇
640402106000    彭堡镇
640402107000    头营镇
640402108000    黄铎堡镇
640402200000    中河乡
640402201000    河川乡
640402204000    炭山乡
640402205000    寨科乡

/* 宁夏回族自治区 固原市 西吉县 */
640422100000    吉强镇
640422101000    兴隆镇
640422102000    平峰镇
640422103000    将台堡镇
640422200000    新营乡
640422201000    红耀乡
640422202000    田坪乡
640422203000    马建乡
640422204000    震湖乡
640422205000    兴平乡
640422206000    西滩乡
640422207000    王民乡
640422208000    什字乡
640422209000    马莲乡
640422211000    硝河乡
640422212000    偏城乡
640422213000    沙沟乡
640422214000    白崖乡
640422215000    火石寨乡

/* 宁夏回族自治区 固原市 隆德县 */
640423100000    城关镇
640423101000    沙塘镇
640423102000    联财镇
640423200000    陈靳乡
640423201000    好水乡
640423202000    观庄乡
640423203000    杨河乡
640423204000    神林乡
640423205000    张程乡
640423206000    凤岭乡
640423207000    山河乡
640423208000    温堡乡
640423209000    奠安乡

/* 宁夏回族自治区 固原市 泾源县 */
640424100000    香水镇
640424101000    泾河源镇
640424102000    六盘山镇
640424200000    新民乡
640424201000    兴盛乡
640424202000    黄花乡
640424203000    大湾乡

/* 宁夏回族自治区 固原市 彭阳县 */
640425100000    白阳镇
640425101000    王洼镇
640425102000    古城镇
640425103000    红河镇
640425200000    新集乡
640425201000    城阳乡
640425203000    冯庄乡
640425204000    小岔乡
640425205000    孟塬乡
640425206000    罗洼乡
640425207000    交岔乡
640425208000    草庙乡

/* 宁夏回族自治区 中卫市 沙坡头区 */
640502100000    滨河镇
640502101000    文昌镇
640502102000    东园镇
640502103000    柔远镇
640502104000    镇罗镇
640502105000    宣和镇
640502106000    永康镇
640502107000    常乐镇
640502108000    迎水桥镇
640502109000    兴仁镇
640502200000    香山乡
640502400000    中卫山羊选育场
640502401000    中卫工业园区

/* 宁夏回族自治区 中卫市 中宁县 */
640521100000    宁安镇
640521101000    鸣沙镇
640521102000    石空镇
640521103000    新堡镇
640521104000    恩和镇
640521105000    大战场镇
640521200000    舟塔乡
640521201000    白马乡
640521202000    余丁乡
640521204000    喊叫水乡
640521205000    徐套乡
640521206000    太阳梁乡

/* 宁夏回族自治区 中卫市 海原县 */
640522100000    海城镇
640522101000    李旺镇
640522103000    西安镇
640522104000    三河镇
640522105000    七营镇
640522200000    史店乡
640522201000    树台乡
640522202000    关桥乡
640522206000    高崖乡
640522207000    郑旗乡
640522208000    贾塘乡
640522209000    曹洼乡
640522210000    九彩乡
640522211000    李俊乡
640522212000    红羊乡
640522213000    关庄乡
640522214000    甘城乡
640522400000    种羊场
640522401000    涵养林总场
640522402000    老城管理办公室
640522406000    海兴开发区
