SET NOCOUNT ON;
SET XACT_ABORT ON;

/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

/*
 * 《2015年统计用区划代码和城乡划分代码（截止2015年09月30日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2015/index.html）
 * 数据范围：辽宁省(21)、吉林省(22)、黑龙江省(23)。
 */

/* 辽宁省 沈阳市 和平区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 02, 001, N'浑河湾街道'),
	(21, 01, 02, 002, N'新华街道'),
	(21, 01, 02, 007, N'西塔街道'),
	(21, 01, 02, 013, N'八经街道'),
	(21, 01, 02, 016, N'马路湾街道'),
	(21, 01, 02, 017, N'集贤街道'),
	(21, 01, 02, 019, N'南湖街道'),
	(21, 01, 02, 021, N'长白街道'),
	(21, 01, 02, 022, N'太原街街道'),
	(21, 01, 02, 023, N'北市场街道'),
	(21, 01, 02, 025, N'南市场街道'),
	(21, 01, 02, 027, N'沈水湾街道'),
	(21, 01, 02, 028, N'浑河站西街道');

/* 辽宁省 沈阳市 沈河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 03, 004, N'大西街道'),
	(21, 01, 03, 005, N'滨河街道'),
	(21, 01, 03, 006, N'万莲街道'),
	(21, 01, 03, 010, N'大南街道'),
	(21, 01, 03, 011, N'山东庙街道'),
	(21, 01, 03, 013, N'朱剪炉街道'),
	(21, 01, 03, 014, N'新北站街道'),
	(21, 01, 03, 015, N'风雨坛街道'),
	(21, 01, 03, 017, N'皇城街道'),
	(21, 01, 03, 018, N'五里河街道'),
	(21, 01, 03, 019, N'南塔街道'),
	(21, 01, 03, 020, N'泉园街道'),
	(21, 01, 03, 021, N'丰乐街道'),
	(21, 01, 03, 022, N'马官桥街道'),
	(21, 01, 03, 023, N'东陵街道');

/* 辽宁省 沈阳市 大东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 04, 002, N'大北街道'),
	(21, 01, 04, 003, N'万泉街道'),
	(21, 01, 04, 004, N'洮昌街道'),
	(21, 01, 04, 006, N'文官街道'),
	(21, 01, 04, 007, N'二台子街道'),
	(21, 01, 04, 008, N'津桥街道'),
	(21, 01, 04, 009, N'东站街道'),
	(21, 01, 04, 010, N'北海街道'),
	(21, 01, 04, 012, N'长安街道'),
	(21, 01, 04, 014, N'新东街道'),
	(21, 01, 04, 015, N'东塔街道'),
	(21, 01, 04, 016, N'小东街道'),
	(21, 01, 04, 017, N'上园街道'),
	(21, 01, 04, 018, N'前进街道');

/* 辽宁省 沈阳市 皇姑区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 05, 001, N'三台子街道'),
	(21, 01, 05, 003, N'辽河街道'),
	(21, 01, 05, 008, N'黄河街道'),
	(21, 01, 05, 012, N'三洞桥街道'),
	(21, 01, 05, 013, N'华山街道'),
	(21, 01, 05, 014, N'寿泉街道'),
	(21, 01, 05, 015, N'塔湾街道'),
	(21, 01, 05, 017, N'明廉街道'),
	(21, 01, 05, 019, N'新乐街道'),
	(21, 01, 05, 020, N'舍利塔街道'),
	(21, 01, 05, 021, N'北塔街道'),
	(21, 01, 05, 022, N'陵东街道');

/* 辽宁省 沈阳市 铁西区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 06, 001, N'昆明湖街道'),
	(21, 01, 06, 003, N'工人村街道'),
	(21, 01, 06, 005, N'七路街道'),
	(21, 01, 06, 007, N'启工街道'),
	(21, 01, 06, 013, N'笃工街道'),
	(21, 01, 06, 015, N'兴华街道'),
	(21, 01, 06, 018, N'兴工街道'),
	(21, 01, 06, 019, N'霁虹街道'),
	(21, 01, 06, 020, N'凌空街道'),
	(21, 01, 06, 021, N'重工街道'),
	(21, 01, 06, 022, N'艳粉街道'),
	(21, 01, 06, 023, N'保工街道'),
	(21, 01, 06, 024, N'兴顺街道'),
	(21, 01, 06, 025, N'贵和街道'),
	(21, 01, 06, 026, N'大青中朝友谊街道'),
	(21, 01, 06, 027, N'翟家街道'),
	(21, 01, 06, 028, N'西三环街道'),
	(21, 01, 06, 029, N'大潘街道'),
	(21, 01, 06, 030, N'彰驿站街道'),
	(21, 01, 06, 031, N'高花街道');

/* 辽宁省 沈阳市 苏家屯区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 11, 001, N'解放街道'),
	(21, 01, 11, 003, N'民主街道'),
	(21, 01, 11, 004, N'临湖街道'),
	(21, 01, 11, 005, N'中兴街道'),
	(21, 01, 11, 006, N'湖西街道'),
	(21, 01, 11, 007, N'八一街道'),
	(21, 01, 11, 008, N'红菱街道'),
	(21, 01, 11, 009, N'林盛街道'),
	(21, 01, 11, 010, N'沙河街道'),
	(21, 01, 11, 011, N'十里河街道'),
	(21, 01, 11, 012, N'陈相街道'),
	(21, 01, 11, 013, N'姚千街道'),
	(21, 01, 11, 014, N'王纲街道'),
	(21, 01, 11, 015, N'永乐街道'),
	(21, 01, 11, 016, N'大沟街道'),
	(21, 01, 11, 017, N'白清街道'),
	(21, 01, 11, 018, N'佟沟街道办事处');

/* 辽宁省 沈阳市 浑南区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 12, 007, N'英达街道'),
	(21, 01, 12, 009, N'东湖街道'),
	(21, 01, 12, 010, N'五三街道'),
	(21, 01, 12, 012, N'浑河站东街道'),
	(21, 01, 12, 014, N'高坎街道'),
	(21, 01, 12, 015, N'满堂街道'),
	(21, 01, 12, 016, N'深井子街道'),
	(21, 01, 12, 017, N'祝家街道'),
	(21, 01, 12, 018, N'白塔街道'),
	(21, 01, 12, 019, N'桃仙街道'),
	(21, 01, 12, 020, N'李相街道'),
	(21, 01, 12, 021, N'营城子街道'),
	(21, 01, 12, 022, N'汪家街道'),
	(21, 01, 12, 023, N'王滨街道'),
	(21, 01, 12, 024, N'望滨街道');

/* 辽宁省 沈阳市 沈北新区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 13, 001, N'新城子街道'),
	(21, 01, 13, 002, N'清水台街道'),
	(21, 01, 13, 003, N'辉山街道'),
	(21, 01, 13, 004, N'道义街道'),
	(21, 01, 13, 006, N'虎石台街道'),
	(21, 01, 13, 007, N'财落街道'),
	(21, 01, 13, 009, N'沈北街道'),
	(21, 01, 13, 010, N'马刚街道'),
	(21, 01, 13, 011, N'石佛寺街道'),
	(21, 01, 13, 012, N'黄家街道'),
	(21, 01, 13, 013, N'尹家街道'),
	(21, 01, 13, 014, N'兴隆台街道'),
	(21, 01, 13, 015, N'清泉街道');

/* 辽宁省 沈阳市 于洪区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 14, 001, N'迎宾路街道'),
	(21, 01, 14, 003, N'陵西街道'),
	(21, 01, 14, 005, N'于洪街道'),
	(21, 01, 14, 007, N'北陵街道'),
	(21, 01, 14, 009, N'沙岭街道'),
	(21, 01, 14, 010, N'南阳湖街道'),
	(21, 01, 14, 011, N'城东湖街道'),
	(21, 01, 14, 012, N'平罗街道'),
	(21, 01, 14, 013, N'马三家街道'),
	(21, 01, 14, 014, N'造化街道'),
	(21, 01, 14, 015, N'大兴街道'),
	(21, 01, 14, 016, N'光辉街道');

/* 辽宁省 沈阳市 辽中县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 22, 001, N'蒲西街道办事处'),
	(21, 01, 22, 002, N'蒲东街道办事处'),
	(21, 01, 22, 101, N'于家房镇'),
	(21, 01, 22, 102, N'朱家房镇'),
	(21, 01, 22, 103, N'冷子堡镇'),
	(21, 01, 22, 104, N'刘二堡镇'),
	(21, 01, 22, 105, N'茨榆坨镇'),
	(21, 01, 22, 106, N'新民屯镇'),
	(21, 01, 22, 107, N'满都户镇'),
	(21, 01, 22, 108, N'杨士岗镇'),
	(21, 01, 22, 109, N'肖寨门镇'),
	(21, 01, 22, 110, N'长滩镇'),
	(21, 01, 22, 111, N'四方台镇'),
	(21, 01, 22, 112, N'城郊镇'),
	(21, 01, 22, 113, N'六间房镇'),
	(21, 01, 22, 114, N'养士堡镇'),
	(21, 01, 22, 115, N'潘家堡镇'),
	(21, 01, 22, 117, N'老大房镇'),
	(21, 01, 22, 118, N'大黑岗子镇'),
	(21, 01, 22, 119, N'牛心坨镇');

/* 辽宁省 沈阳市 康平县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 23, 001, N'北三家子街道'),
	(21, 01, 23, 002, N'胜利街道'),
	(21, 01, 23, 003, N'东关街道'),
	(21, 01, 23, 101, N'小城子镇'),
	(21, 01, 23, 102, N'张强镇'),
	(21, 01, 23, 103, N'方家屯镇'),
	(21, 01, 23, 105, N'郝官屯镇'),
	(21, 01, 23, 106, N'二牛所口镇'),
	(21, 01, 23, 203, N'北四家子乡'),
	(21, 01, 23, 204, N'两家子乡'),
	(21, 01, 23, 206, N'海洲窝堡乡'),
	(21, 01, 23, 208, N'沙金台蒙古族满族乡'),
	(21, 01, 23, 209, N'柳树屯蒙古族满族乡'),
	(21, 01, 23, 210, N'西关屯蒙古族满族乡'),
	(21, 01, 23, 211, N'东升满族蒙古族乡');

/* 辽宁省 沈阳市 法库县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 24, 100, N'法库镇'),
	(21, 01, 24, 101, N'大孤家子镇'),
	(21, 01, 24, 102, N'三面船镇'),
	(21, 01, 24, 103, N'秀水河子镇'),
	(21, 01, 24, 104, N'叶茂台镇'),
	(21, 01, 24, 105, N'登仕堡子镇'),
	(21, 01, 24, 106, N'柏家沟镇'),
	(21, 01, 24, 107, N'丁家房镇'),
	(21, 01, 24, 108, N'孟家镇'),
	(21, 01, 24, 109, N'十间房镇'),
	(21, 01, 24, 110, N'冯贝堡镇'),
	(21, 01, 24, 111, N'依牛堡子镇'),
	(21, 01, 24, 112, N'五台子镇'),
	(21, 01, 24, 113, N'包家屯镇'),
	(21, 01, 24, 201, N'慈恩寺乡'),
	(21, 01, 24, 203, N'和平乡'),
	(21, 01, 24, 208, N'四家子蒙古族乡'),
	(21, 01, 24, 209, N'双台子乡'),
	(21, 01, 24, 210, N'卧牛石乡');

/* 辽宁省 沈阳市 新民市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 01, 81, 001, N'东城街道'),
	(21, 01, 81, 002, N'辽滨街道'),
	(21, 01, 81, 003, N'西城街道'),
	(21, 01, 81, 004, N'新柳街道'),
	(21, 01, 81, 005, N'新城街道'),
	(21, 01, 81, 101, N'大红旗镇'),
	(21, 01, 81, 102, N'梁山镇'),
	(21, 01, 81, 103, N'公主屯镇'),
	(21, 01, 81, 104, N'兴隆镇'),
	(21, 01, 81, 105, N'前当堡镇'),
	(21, 01, 81, 106, N'大民屯镇'),
	(21, 01, 81, 107, N'大柳屯镇'),
	(21, 01, 81, 108, N'兴隆堡镇'),
	(21, 01, 81, 109, N'胡台镇'),
	(21, 01, 81, 110, N'法哈牛镇'),
	(21, 01, 81, 111, N'柳河沟镇'),
	(21, 01, 81, 112, N'高台子镇'),
	(21, 01, 81, 113, N'张家屯镇'),
	(21, 01, 81, 114, N'罗家房镇'),
	(21, 01, 81, 115, N'三道岗子镇'),
	(21, 01, 81, 116, N'东蛇山子镇'),
	(21, 01, 81, 117, N'陶家屯镇'),
	(21, 01, 81, 118, N'周坨子镇'),
	(21, 01, 81, 204, N'金五台子乡'),
	(21, 01, 81, 205, N'红旗乡'),
	(21, 01, 81, 206, N'卢家屯乡'),
	(21, 01, 81, 207, N'姚堡乡'),
	(21, 01, 81, 209, N'于家窝堡乡'),
	(21, 01, 81, 210, N'新农乡');

/* 辽宁省 大连市 中山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 02, 02, 001, N'海军广场街道'),
	(21, 02, 02, 003, N'桂林街道'),
	(21, 02, 02, 005, N'人民路街道'),
	(21, 02, 02, 008, N'青泥洼桥街道'),
	(21, 02, 02, 009, N'昆明街道'),
	(21, 02, 02, 010, N'葵英街道'),
	(21, 02, 02, 011, N'桃源街道'),
	(21, 02, 02, 012, N'老虎滩街道'),
	(21, 02, 02, 013, N'东港街道');

/* 辽宁省 大连市 西岗区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 02, 03, 001, N'香炉礁街道'),
	(21, 02, 03, 002, N'站北街道'),
	(21, 02, 03, 004, N'日新街道'),
	(21, 02, 03, 005, N'北京街道'),
	(21, 02, 03, 010, N'八一路街道'),
	(21, 02, 03, 011, N'人民广场街道'),
	(21, 02, 03, 013, N'白云街道');

/* 辽宁省 大连市 沙河口区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 02, 04, 002, N'中山公园街道'),
	(21, 02, 04, 004, N'白山路街道'),
	(21, 02, 04, 005, N'兴工街道'),
	(21, 02, 04, 006, N'春柳街道'),
	(21, 02, 04, 008, N'马栏街道'),
	(21, 02, 04, 009, N'南沙河口街道'),
	(21, 02, 04, 010, N'黑石礁街道'),
	(21, 02, 04, 011, N'李家街道'),
	(21, 02, 04, 017, N'星海湾街道');

/* 辽宁省 大连市 甘井子区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 02, 11, 001, N'周水子街道'),
	(21, 02, 11, 002, N'椒金山街道'),
	(21, 02, 11, 004, N'甘井子街道'),
	(21, 02, 11, 006, N'南关岭街道'),
	(21, 02, 11, 007, N'泡崖街道'),
	(21, 02, 11, 008, N'中华路街道'),
	(21, 02, 11, 009, N'兴华街道'),
	(21, 02, 11, 010, N'机场街道'),
	(21, 02, 11, 014, N'辛寨子街道'),
	(21, 02, 11, 015, N'红旗街道'),
	(21, 02, 11, 016, N'凌水街道'),
	(21, 02, 11, 017, N'大连湾街道'),
	(21, 02, 11, 018, N'泉水街道'),
	(21, 02, 11, 019, N'革镇堡街道'),
	(21, 02, 11, 020, N'营城子街道');

/* 辽宁省 大连市 旅顺口区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 02, 12, 001, N'登峰街道'),
	(21, 02, 12, 002, N'市场街道'),
	(21, 02, 12, 003, N'得胜街道'),
	(21, 02, 12, 004, N'光荣街道'),
	(21, 02, 12, 005, N'水师营街道'),
	(21, 02, 12, 006, N'龙王塘街道'),
	(21, 02, 12, 007, N'铁山街道'),
	(21, 02, 12, 009, N'双岛湾街道'),
	(21, 02, 12, 010, N'三涧堡街道'),
	(21, 02, 12, 011, N'长城街道'),
	(21, 02, 12, 012, N'龙头街道'),
	(21, 02, 12, 013, N'北海街道');

/* 辽宁省 大连市 金州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 02, 13, 001, N'拥政街道'),
	(21, 02, 13, 002, N'友谊街道'),
	(21, 02, 13, 003, N'光明街道'),
	(21, 02, 13, 004, N'马桥子街道'),
	(21, 02, 13, 005, N'海青岛街道'),
	(21, 02, 13, 006, N'大孤山街道'),
	(21, 02, 13, 007, N'中长街道'),
	(21, 02, 13, 008, N'站前街道'),
	(21, 02, 13, 009, N'先进街道'),
	(21, 02, 13, 011, N'董家沟街道'),
	(21, 02, 13, 012, N'金石滩街道'),
	(21, 02, 13, 013, N'湾里街道'),
	(21, 02, 13, 014, N'二十里堡街道'),
	(21, 02, 13, 016, N'亮甲店街道'),
	(21, 02, 13, 017, N'登沙河街道'),
	(21, 02, 13, 019, N'大魏家街道'),
	(21, 02, 13, 020, N'杏树街道'),
	(21, 02, 13, 021, N'七顶山街道'),
	(21, 02, 13, 022, N'华家街道'),
	(21, 02, 13, 023, N'向应街道'),
	(21, 02, 13, 024, N'大李家街道'),
	(21, 02, 13, 025, N'得胜街道'),
	(21, 02, 13, 026, N'大窑湾街道');

/* 辽宁省 大连市 长海县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 02, 24, 100, N'大长山岛镇'),
	(21, 02, 24, 101, N'獐子岛镇'),
	(21, 02, 24, 201, N'小长山乡'),
	(21, 02, 24, 202, N'广鹿乡'),
	(21, 02, 24, 203, N'海洋乡');

/* 辽宁省 大连市 瓦房店市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 02, 81, 001, N'新华办事处'),
	(21, 02, 81, 002, N'文兰办事处'),
	(21, 02, 81, 003, N'岭东办事处'),
	(21, 02, 81, 004, N'共济办事处'),
	(21, 02, 81, 005, N'铁东办事处'),
	(21, 02, 81, 006, N'祝华办事处'),
	(21, 02, 81, 007, N'岗店办事处'),
	(21, 02, 81, 008, N'太阳街道办事处'),
	(21, 02, 81, 009, N'长兴岛办事处'),
	(21, 02, 81, 010, N'九龙办事处'),
	(21, 02, 81, 011, N'交流岛街道'),
	(21, 02, 81, 101, N'复州城镇'),
	(21, 02, 81, 103, N'松树镇'),
	(21, 02, 81, 105, N'得利寺镇'),
	(21, 02, 81, 106, N'万家岭镇'),
	(21, 02, 81, 107, N'许屯镇'),
	(21, 02, 81, 108, N'永宁镇'),
	(21, 02, 81, 109, N'谢屯镇'),
	(21, 02, 81, 112, N'老虎屯镇'),
	(21, 02, 81, 113, N'红沿河镇'),
	(21, 02, 81, 115, N'李官镇'),
	(21, 02, 81, 116, N'仙浴湾镇'),
	(21, 02, 81, 117, N'元台镇'),
	(21, 02, 81, 118, N'瓦窝镇'),
	(21, 02, 81, 201, N'赵屯乡'),
	(21, 02, 81, 203, N'土城乡'),
	(21, 02, 81, 204, N'阎店乡'),
	(21, 02, 81, 205, N'西杨乡'),
	(21, 02, 81, 206, N'驼山乡'),
	(21, 02, 81, 208, N'三台满族乡'),
	(21, 02, 81, 210, N'泡崖乡'),
	(21, 02, 81, 212, N'杨家满族乡');

/* 辽宁省 大连市 普兰店市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 02, 82, 001, N'丰荣街道'),
	(21, 02, 82, 002, N'铁西街道'),
	(21, 02, 82, 003, N'太平街道'),
	(21, 02, 82, 004, N'南山街道'),
	(21, 02, 82, 005, N'皮口街道'),
	(21, 02, 82, 006, N'城子坦街道'),
	(21, 02, 82, 007, N'大刘家街道'),
	(21, 02, 82, 008, N'杨树房街道'),
	(21, 02, 82, 009, N'大谭街道'),
	(21, 02, 82, 010, N'唐家房街道'),
	(21, 02, 82, 011, N'莲山街道'),
	(21, 02, 82, 012, N'炮台街道'),
	(21, 02, 82, 013, N'复州湾街道'),
	(21, 02, 82, 014, N'石河街道'),
	(21, 02, 82, 015, N'三十里堡街道'),
	(21, 02, 82, 106, N'双塔镇'),
	(21, 02, 82, 107, N'安波镇'),
	(21, 02, 82, 108, N'四平镇'),
	(21, 02, 82, 109, N'沙包镇'),
	(21, 02, 82, 117, N'星台镇'),
	(21, 02, 82, 206, N'墨盘乡'),
	(21, 02, 82, 208, N'同益乡'),
	(21, 02, 82, 209, N'乐甲满族乡');

/* 辽宁省 大连市 庄河市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 02, 83, 001, N'城关街道'),
	(21, 02, 83, 002, N'新华街道'),
	(21, 02, 83, 003, N'兴达街道'),
	(21, 02, 83, 004, N'昌盛街道'),
	(21, 02, 83, 005, N'明阳街道'),
	(21, 02, 83, 101, N'青堆镇'),
	(21, 02, 83, 102, N'徐岭镇'),
	(21, 02, 83, 104, N'黑岛镇'),
	(21, 02, 83, 105, N'栗子房镇'),
	(21, 02, 83, 107, N'大营镇'),
	(21, 02, 83, 108, N'塔岭镇'),
	(21, 02, 83, 109, N'仙人洞镇'),
	(21, 02, 83, 110, N'蓉花山镇'),
	(21, 02, 83, 111, N'长岭镇'),
	(21, 02, 83, 112, N'荷花山镇'),
	(21, 02, 83, 113, N'城山镇'),
	(21, 02, 83, 114, N'光明山镇'),
	(21, 02, 83, 115, N'大郑镇'),
	(21, 02, 83, 118, N'吴炉镇'),
	(21, 02, 83, 120, N'王家镇'),
	(21, 02, 83, 204, N'鞍子山乡'),
	(21, 02, 83, 208, N'太平岭满族乡'),
	(21, 02, 83, 209, N'步云山乡'),
	(21, 02, 83, 211, N'桂云花满族乡'),
	(21, 02, 83, 214, N'兰店乡'),
	(21, 02, 83, 216, N'石城乡');

/* 辽宁省 鞍山市 铁东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 03, 02, 001, N'长甸街道办事处'),
	(21, 03, 02, 002, N'解放街道办事处'),
	(21, 03, 02, 003, N'山南街道办事处'),
	(21, 03, 02, 004, N'园林街道办事处'),
	(21, 03, 02, 005, N'胜利街道办事处'),
	(21, 03, 02, 006, N'站前街道办事处'),
	(21, 03, 02, 007, N'钢城街道办事处'),
	(21, 03, 02, 008, N'和平街道办事处'),
	(21, 03, 02, 009, N'对炉街道办事处'),
	(21, 03, 02, 010, N'东长甸街道办事处'),
	(21, 03, 02, 011, N'湖南街道办事处'),
	(21, 03, 02, 012, N'常青街道办事处'),
	(21, 03, 02, 013, N'新兴街道办事处'),
	(21, 03, 02, 014, N'旧堡街道办事处'),
	(21, 03, 02, 015, N'大孤山街道'),
	(21, 03, 02, 016, N'温泉街道办事处');

/* 辽宁省 鞍山市 铁西区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 03, 03, 001, N'启明街道办事处'),
	(21, 03, 03, 002, N'繁荣街道办事处'),
	(21, 03, 03, 003, N'八家子街道办事处'),
	(21, 03, 03, 004, N'兴盛街道办事处'),
	(21, 03, 03, 005, N'共和街道办事处'),
	(21, 03, 03, 006, N'永乐街道办事处'),
	(21, 03, 03, 007, N'北陶官街道办事处'),
	(21, 03, 03, 008, N'南华街道办事处'),
	(21, 03, 03, 009, N'大陆街道办事处'),
	(21, 03, 03, 010, N'新陶官街道办事处'),
	(21, 03, 03, 011, N'新城街道办事处'),
	(21, 03, 03, 012, N'永发街道办事处'),
	(21, 03, 03, 013, N'宁远街道办事处'),
	(21, 03, 03, 014, N'达道湾街道办事处');

/* 辽宁省 鞍山市 立山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 03, 04, 001, N'友好街道办事处'),
	(21, 03, 04, 004, N'双山街道办事处'),
	(21, 03, 04, 006, N'立山街道办事处'),
	(21, 03, 04, 008, N'曙光街道办事处'),
	(21, 03, 04, 009, N'灵山街道办事处'),
	(21, 03, 04, 013, N'深南街道办事处'),
	(21, 03, 04, 014, N'深北街道办事处'),
	(21, 03, 04, 015, N'沙河街道办事处'),
	(21, 03, 04, 016, N'滨河街道办事处'),
	(21, 03, 04, 017, N'千山街道办事处'),
	(21, 03, 04, 019, N'齐大山街道办事处'),
	(21, 03, 04, 020, N'汪峪街道办事处'),
	(21, 03, 04, 021, N'红岭街道办事处');

/* 辽宁省 鞍山市 千山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 03, 11, 005, N'对桩石街道办事处'),
	(21, 03, 11, 006, N'汤岗子街道办事处'),
	(21, 03, 11, 007, N'东鞍山街道办事处'),
	(21, 03, 11, 102, N'唐家房镇'),
	(21, 03, 11, 103, N'大屯镇'),
	(21, 03, 11, 104, N'甘泉镇');

/* 辽宁省 鞍山市 台安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 03, 21, 001, N'八角台街道办事处'),
	(21, 03, 21, 002, N'台东街道办事处'),
	(21, 03, 21, 003, N'台南街道办事处'),
	(21, 03, 21, 004, N'台北街道办事处'),
	(21, 03, 21, 101, N'西佛镇'),
	(21, 03, 21, 102, N'新开河镇'),
	(21, 03, 21, 103, N'黄沙坨镇'),
	(21, 03, 21, 104, N'高力房镇'),
	(21, 03, 21, 105, N'桑林镇'),
	(21, 03, 21, 106, N'富家镇'),
	(21, 03, 21, 107, N'达牛镇'),
	(21, 03, 21, 109, N'台安县韭菜台镇'),
	(21, 03, 21, 110, N'新台镇'),
	(21, 03, 21, 111, N'桓洞镇');

/* 辽宁省 鞍山市 岫岩满族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 03, 23, 001, N'阜昌街道办事处'),
	(21, 03, 23, 002, N'大宁街道办事处'),
	(21, 03, 23, 003, N'兴隆街道办事处'),
	(21, 03, 23, 004, N'雅河街道办事处'),
	(21, 03, 23, 005, N'仙人咀街道办事处'),
	(21, 03, 23, 101, N'三家子镇'),
	(21, 03, 23, 102, N'石庙子镇'),
	(21, 03, 23, 103, N'黄花甸镇'),
	(21, 03, 23, 104, N'大营子镇'),
	(21, 03, 23, 105, N'苏子沟镇'),
	(21, 03, 23, 106, N'偏岭镇'),
	(21, 03, 23, 107, N'哈达碑镇'),
	(21, 03, 23, 108, N'新甸镇'),
	(21, 03, 23, 109, N'洋河镇'),
	(21, 03, 23, 111, N'杨家堡镇'),
	(21, 03, 23, 112, N'清凉山镇'),
	(21, 03, 23, 113, N'石灰窑镇'),
	(21, 03, 23, 114, N'前营子镇'),
	(21, 03, 23, 115, N'龙潭镇'),
	(21, 03, 23, 116, N'牧牛镇'),
	(21, 03, 23, 117, N'药山镇'),
	(21, 03, 23, 118, N'大房身镇'),
	(21, 03, 23, 119, N'朝阳镇'),
	(21, 03, 23, 206, N'红旗营子乡'),
	(21, 03, 23, 211, N'岭沟乡'),
	(21, 03, 23, 212, N'哨子河乡');

/* 辽宁省 鞍山市 海城市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 03, 81, 001, N'海州街道办事处'),
	(21, 03, 81, 002, N'兴海街道办事处'),
	(21, 03, 81, 003, N'响堂街道办事处'),
	(21, 03, 81, 004, N'东四街道办事处'),
	(21, 03, 81, 005, N'验军街道办事处'),
	(21, 03, 81, 006, N'温泉街道办事处'),
	(21, 03, 81, 101, N'孤山镇'),
	(21, 03, 81, 102, N'岔沟镇'),
	(21, 03, 81, 103, N'接文镇'),
	(21, 03, 81, 104, N'析木镇'),
	(21, 03, 81, 105, N'马风镇'),
	(21, 03, 81, 107, N'牌楼镇'),
	(21, 03, 81, 108, N'八里镇'),
	(21, 03, 81, 109, N'毛祁镇'),
	(21, 03, 81, 110, N'英落镇'),
	(21, 03, 81, 111, N'感王镇'),
	(21, 03, 81, 112, N'西柳镇'),
	(21, 03, 81, 113, N'中小镇'),
	(21, 03, 81, 114, N'王石镇'),
	(21, 03, 81, 115, N'南台镇'),
	(21, 03, 81, 118, N'腾鳌镇'),
	(21, 03, 81, 121, N'耿庄镇'),
	(21, 03, 81, 123, N'牛庄镇'),
	(21, 03, 81, 124, N'西四镇'),
	(21, 03, 81, 125, N'望台镇'),
	(21, 03, 81, 126, N'温香镇'),
	(21, 03, 81, 127, N'高坨镇');

/* 辽宁省 抚顺市 新抚区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 04, 02, 001, N'站前街道'),
	(21, 04, 02, 003, N'东公园街道'),
	(21, 04, 02, 005, N'福民街道'),
	(21, 04, 02, 007, N'新抚街道'),
	(21, 04, 02, 009, N'榆林街道'),
	(21, 04, 02, 011, N'永安台街道'),
	(21, 04, 02, 013, N'千金街道'),
	(21, 04, 02, 015, N'南阳街道'),
	(21, 04, 02, 017, N'南花园街道'),
	(21, 04, 02, 019, N'刘山街道'),
	(21, 04, 02, 201, N'千金乡');

/* 辽宁省 抚顺市 东洲区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 04, 03, 002, N'东洲街道'),
	(21, 04, 03, 003, N'张甸街道'),
	(21, 04, 03, 004, N'搭连街道'),
	(21, 04, 03, 005, N'龙凤街道'),
	(21, 04, 03, 006, N'新屯街道'),
	(21, 04, 03, 007, N'万新街道'),
	(21, 04, 03, 008, N'老虎台街道'),
	(21, 04, 03, 009, N'平山街道'),
	(21, 04, 03, 012, N'章党街道'),
	(21, 04, 03, 013, N'抚东街道'),
	(21, 04, 03, 103, N'章党镇'),
	(21, 04, 03, 104, N'哈达镇'),
	(21, 04, 03, 202, N'碾盘乡'),
	(21, 04, 03, 215, N'兰山乡');

/* 辽宁省 抚顺市 望花区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 04, 04, 001, N'田屯街道'),
	(21, 04, 04, 002, N'工农街道'),
	(21, 04, 04, 003, N'建设街道'),
	(21, 04, 04, 004, N'和平街道'),
	(21, 04, 04, 005, N'光明街道'),
	(21, 04, 04, 006, N'朴屯街道'),
	(21, 04, 04, 007, N'演武街道'),
	(21, 04, 04, 008, N'五老屯街道'),
	(21, 04, 04, 009, N'古城子街道'),
	(21, 04, 04, 010, N'新民街道'),
	(21, 04, 04, 011, N'李石街道'),
	(21, 04, 04, 101, N'塔峪镇'),
	(21, 04, 04, 201, N'拉古满族乡');

/* 辽宁省 抚顺市 顺城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 04, 11, 001, N'河东街道'),
	(21, 04, 11, 002, N'长春街道'),
	(21, 04, 11, 003, N'葛布街道'),
	(21, 04, 11, 004, N'将军堡街道'),
	(21, 04, 11, 005, N'新华街道'),
	(21, 04, 11, 007, N'抚顺城街道'),
	(21, 04, 11, 102, N'前甸镇'),
	(21, 04, 11, 201, N'河北乡'),
	(21, 04, 11, 205, N'会元乡');

/* 辽宁省 抚顺市 抚顺县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 04, 21, 101, N'石文镇'),
	(21, 04, 21, 102, N'后安镇'),
	(21, 04, 21, 105, N'上马镇'),
	(21, 04, 21, 106, N'救兵镇'),
	(21, 04, 21, 204, N'马圈子乡'),
	(21, 04, 21, 209, N'峡河乡'),
	(21, 04, 21, 211, N'海浪乡'),
	(21, 04, 21, 216, N'汤图满族乡');

/* 辽宁省 抚顺市 新宾满族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 04, 22, 100, N'新宾镇'),
	(21, 04, 22, 101, N'旺清门镇'),
	(21, 04, 22, 102, N'永陵镇'),
	(21, 04, 22, 103, N'平顶山镇'),
	(21, 04, 22, 104, N'大四平镇'),
	(21, 04, 22, 105, N'苇子峪镇'),
	(21, 04, 22, 106, N'木奇镇'),
	(21, 04, 22, 108, N'上夹河镇'),
	(21, 04, 22, 109, N'南杂木镇'),
	(21, 04, 22, 202, N'红升乡'),
	(21, 04, 22, 203, N'响水河子乡'),
	(21, 04, 22, 204, N'红庙子乡'),
	(21, 04, 22, 205, N'北四平乡'),
	(21, 04, 22, 207, N'榆树乡'),
	(21, 04, 22, 208, N'下夹河乡');

/* 辽宁省 抚顺市 清原满族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 04, 23, 100, N'清原镇'),
	(21, 04, 23, 101, N'红透山镇'),
	(21, 04, 23, 103, N'草市镇'),
	(21, 04, 23, 104, N'英额门镇'),
	(21, 04, 23, 105, N'南口前镇'),
	(21, 04, 23, 106, N'南山城镇'),
	(21, 04, 23, 107, N'湾甸子镇'),
	(21, 04, 23, 108, N'大孤家镇'),
	(21, 04, 23, 109, N'夏家堡镇'),
	(21, 04, 23, 203, N'土口子乡'),
	(21, 04, 23, 204, N'北三家乡'),
	(21, 04, 23, 206, N'敖家堡乡'),
	(21, 04, 23, 207, N'大苏河乡'),
	(21, 04, 23, 208, N'枸乃甸乡');

/* 辽宁省 本溪市 平山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 05, 02, 001, N'南地街道'),
	(21, 05, 02, 002, N'工人街道'),
	(21, 05, 02, 003, N'平山街道'),
	(21, 05, 02, 004, N'东明街道'),
	(21, 05, 02, 005, N'崔东街道'),
	(21, 05, 02, 007, N'站前街道'),
	(21, 05, 02, 008, N'千金街道'),
	(21, 05, 02, 010, N'北台街道办事处'),
	(21, 05, 02, 011, N'桥头街道办事处');

/* 辽宁省 本溪市 溪湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 05, 03, 001, N'河东街道'),
	(21, 05, 03, 003, N'河西街道'),
	(21, 05, 03, 005, N'彩屯街道'),
	(21, 05, 03, 006, N'竖井街道'),
	(21, 05, 03, 007, N'彩北街道'),
	(21, 05, 03, 009, N'东风街道办事处'),
	(21, 05, 03, 010, N'石桥子街道办事处'),
	(21, 05, 03, 011, N'日月岛街道办事处'),
	(21, 05, 03, 012, N'张其寨街道办事处'),
	(21, 05, 03, 013, N'火连寨街道办事处');

/* 辽宁省 本溪市 明山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 05, 04, 001, N'金山街道'),
	(21, 05, 04, 002, N'北地街道'),
	(21, 05, 04, 004, N'高峪街道'),
	(21, 05, 04, 005, N'明山街道'),
	(21, 05, 04, 007, N'东兴街道'),
	(21, 05, 04, 008, N'新明街道'),
	(21, 05, 04, 009, N'牛心台街道'),
	(21, 05, 04, 010, N'卧龙街道'),
	(21, 05, 04, 011, N'高台子街道办事处');

/* 辽宁省 本溪市 南芬区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 05, 05, 001, N'南芬街道'),
	(21, 05, 05, 002, N'铁山街道'),
	(21, 05, 05, 003, N'郭家街道'),
	(21, 05, 05, 004, N'思山岭街道办事处'),
	(21, 05, 05, 005, N'下马塘街道办事处');

/* 辽宁省 本溪市 本溪满族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 05, 21, 001, N'观音阁街道'),
	(21, 05, 21, 100, N'小市镇'),
	(21, 05, 21, 101, N'草河掌镇'),
	(21, 05, 21, 102, N'草河城镇'),
	(21, 05, 21, 103, N'草河口镇'),
	(21, 05, 21, 104, N'连山关镇'),
	(21, 05, 21, 106, N'清河城镇'),
	(21, 05, 21, 109, N'田师傅镇'),
	(21, 05, 21, 110, N'南甸镇'),
	(21, 05, 21, 111, N'碱厂镇'),
	(21, 05, 21, 112, N'高官镇'),
	(21, 05, 21, 202, N'东营房乡');

/* 辽宁省 本溪市 桓仁满族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 05, 22, 001, N'八卦城街道办事处'),
	(21, 05, 22, 100, N'桓仁镇'),
	(21, 05, 22, 101, N'普乐堡镇'),
	(21, 05, 22, 102, N'二棚甸子镇'),
	(21, 05, 22, 103, N'沙尖子镇'),
	(21, 05, 22, 104, N'五里甸子镇'),
	(21, 05, 22, 108, N'八里甸子镇'),
	(21, 05, 22, 110, N'华来镇'),
	(21, 05, 22, 111, N'古城镇'),
	(21, 05, 22, 201, N'雅河朝鲜族乡'),
	(21, 05, 22, 202, N'向阳乡'),
	(21, 05, 22, 206, N'黑沟乡'),
	(21, 05, 22, 208, N'北甸子乡');

/* 辽宁省 丹东市 元宝区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 06, 02, 001, N'六道口街道'),
	(21, 06, 02, 002, N'七道街道'),
	(21, 06, 02, 003, N'八道街道'),
	(21, 06, 02, 004, N'九道街道'),
	(21, 06, 02, 005, N'广济街道'),
	(21, 06, 02, 006, N'兴东街道'),
	(21, 06, 02, 101, N'金山镇');

/* 辽宁省 丹东市 振兴区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 06, 03, 001, N'头道桥街道'),
	(21, 06, 03, 002, N'站前街道'),
	(21, 06, 03, 003, N'临江街道'),
	(21, 06, 03, 004, N'六道沟街道'),
	(21, 06, 03, 005, N'帽盔山街道'),
	(21, 06, 03, 006, N'纤维街道'),
	(21, 06, 03, 007, N'永昌街道'),
	(21, 06, 03, 008, N'花园街道'),
	(21, 06, 03, 009, N'江海街道'),
	(21, 06, 03, 010, N'西城街道办事处'),
	(21, 06, 03, 101, N'浪头镇'),
	(21, 06, 03, 102, N'安民镇'),
	(21, 06, 03, 103, N'汤池镇');

/* 辽宁省 丹东市 振安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 06, 04, 001, N'鸭绿江街道'),
	(21, 06, 04, 003, N'金矿街道'),
	(21, 06, 04, 004, N'珍珠街道'),
	(21, 06, 04, 005, N'太平湾街道'),
	(21, 06, 04, 102, N'同兴镇'),
	(21, 06, 04, 104, N'五龙背镇'),
	(21, 06, 04, 105, N'楼房镇'),
	(21, 06, 04, 106, N'九连城镇'),
	(21, 06, 04, 107, N'汤山城镇');

/* 辽宁省 丹东市 宽甸满族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 06, 24, 100, N'宽甸镇'),
	(21, 06, 24, 101, N'灌水镇'),
	(21, 06, 24, 102, N'硼海镇'),
	(21, 06, 24, 103, N'红石镇'),
	(21, 06, 24, 104, N'毛甸子镇'),
	(21, 06, 24, 105, N'长甸镇'),
	(21, 06, 24, 106, N'永甸镇'),
	(21, 06, 24, 108, N'太平哨镇'),
	(21, 06, 24, 109, N'青山沟镇'),
	(21, 06, 24, 110, N'牛毛坞镇'),
	(21, 06, 24, 111, N'大川头镇'),
	(21, 06, 24, 112, N'青椅山镇'),
	(21, 06, 24, 113, N'杨木川镇'),
	(21, 06, 24, 114, N'虎山镇'),
	(21, 06, 24, 115, N'振江镇'),
	(21, 06, 24, 116, N'步达远镇'),
	(21, 06, 24, 117, N'大西岔镇'),
	(21, 06, 24, 118, N'八河川镇'),
	(21, 06, 24, 119, N'双山子镇'),
	(21, 06, 24, 201, N'石湖沟乡'),
	(21, 06, 24, 206, N'古楼子乡'),
	(21, 06, 24, 212, N'下露河朝鲜族乡');

/* 辽宁省 丹东市 东港市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 06, 81, 001, N'大东街道'),
	(21, 06, 81, 002, N'新兴街道'),
	(21, 06, 81, 003, N'新城街道'),
	(21, 06, 81, 101, N'孤山镇'),
	(21, 06, 81, 104, N'前阳镇'),
	(21, 06, 81, 105, N'长安镇'),
	(21, 06, 81, 106, N'十字街镇'),
	(21, 06, 81, 107, N'长山镇'),
	(21, 06, 81, 108, N'北井子镇'),
	(21, 06, 81, 109, N'椅圈镇'),
	(21, 06, 81, 110, N'黄土坎镇'),
	(21, 06, 81, 113, N'马家店镇'),
	(21, 06, 81, 114, N'龙王庙镇'),
	(21, 06, 81, 115, N'小甸子镇'),
	(21, 06, 81, 117, N'菩萨庙镇'),
	(21, 06, 81, 118, N'黑沟镇'),
	(21, 06, 81, 119, N'新农镇'),
	(21, 06, 81, 206, N'合隆满族乡');

/* 辽宁省 丹东市 凤城市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 06, 82, 001, N'凤凰城街道'),
	(21, 06, 82, 002, N'凤山街道'),
	(21, 06, 82, 003, N'草河街道'),
	(21, 06, 82, 101, N'宝山镇'),
	(21, 06, 82, 102, N'白旗镇'),
	(21, 06, 82, 103, N'沙里寨镇'),
	(21, 06, 82, 104, N'红旗镇'),
	(21, 06, 82, 105, N'蓝旗镇'),
	(21, 06, 82, 107, N'边门镇'),
	(21, 06, 82, 110, N'东汤镇'),
	(21, 06, 82, 111, N'石城镇'),
	(21, 06, 82, 112, N'大兴镇'),
	(21, 06, 82, 113, N'爱阳镇'),
	(21, 06, 82, 114, N'赛马镇'),
	(21, 06, 82, 115, N'弟兄山镇'),
	(21, 06, 82, 116, N'鸡冠山镇'),
	(21, 06, 82, 117, N'刘家河镇'),
	(21, 06, 82, 118, N'通远堡镇'),
	(21, 06, 82, 119, N'四门子镇'),
	(21, 06, 82, 120, N'青城子镇'),
	(21, 06, 82, 200, N'大堡蒙古族乡');

/* 辽宁省 锦州市 古塔区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 07, 02, 001, N'天安街道'),
	(21, 07, 02, 002, N'石油街道'),
	(21, 07, 02, 003, N'北街街道'),
	(21, 07, 02, 004, N'敬业街道'),
	(21, 07, 02, 005, N'保安街道'),
	(21, 07, 02, 006, N'南街街道'),
	(21, 07, 02, 007, N'饶阳街道'),
	(21, 07, 02, 008, N'站前街道'),
	(21, 07, 02, 009, N'士英街道'),
	(21, 07, 02, 010, N'钟屯街道办事处');

/* 辽宁省 锦州市 凌河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 07, 03, 001, N'正大街道'),
	(21, 07, 03, 002, N'石桥子街道'),
	(21, 07, 03, 003, N'龙江街道'),
	(21, 07, 03, 004, N'榴花街道'),
	(21, 07, 03, 005, N'铁新街道'),
	(21, 07, 03, 006, N'凌安街道'),
	(21, 07, 03, 007, N'菊园街道'),
	(21, 07, 03, 008, N'康宁街道'),
	(21, 07, 03, 009, N'锦铁街道'),
	(21, 07, 03, 010, N'马家街道'),
	(21, 07, 03, 011, N'紫荆街道');

/* 辽宁省 锦州市 太和区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 07, 11, 001, N'太和街道'),
	(21, 07, 11, 002, N'兴隆街道'),
	(21, 07, 11, 003, N'汤河子街道'),
	(21, 07, 11, 004, N'凌西街道'),
	(21, 07, 11, 007, N'大薛街道'),
	(21, 07, 11, 070, N'王家街道'),
	(21, 07, 11, 071, N'天桥街道'),
	(21, 07, 11, 072, N'杏山街道'),
	(21, 07, 11, 073, N'娘娘宫街道办事处'),
	(21, 07, 11, 080, N'凌南街道'),
	(21, 07, 11, 081, N'松山街道办事处'),
	(21, 07, 11, 202, N'女儿河乡'),
	(21, 07, 11, 204, N'营盘乡'),
	(21, 07, 11, 205, N'新民乡');

/* 辽宁省 锦州市 黑山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 07, 26, 001, N'黑山街道办事处'),
	(21, 07, 26, 002, N'大虎山街道办事处'),
	(21, 07, 26, 101, N'芳山镇'),
	(21, 07, 26, 102, N'白厂门镇'),
	(21, 07, 26, 103, N'常兴镇'),
	(21, 07, 26, 104, N'姜屯镇'),
	(21, 07, 26, 105, N'励家镇'),
	(21, 07, 26, 106, N'绕阳河镇'),
	(21, 07, 26, 107, N'半拉门镇'),
	(21, 07, 26, 108, N'无梁殿镇'),
	(21, 07, 26, 109, N'胡家镇'),
	(21, 07, 26, 110, N'新立屯镇'),
	(21, 07, 26, 111, N'八道壕镇'),
	(21, 07, 26, 113, N'四家子镇'),
	(21, 07, 26, 114, N'新兴镇'),
	(21, 07, 26, 116, N'太和镇'),
	(21, 07, 26, 117, N'镇安镇'),
	(21, 07, 26, 201, N'英城子乡'),
	(21, 07, 26, 209, N'段家乡'),
	(21, 07, 26, 210, N'大兴乡'),
	(21, 07, 26, 212, N'薛屯乡');

/* 辽宁省 锦州市 义县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 07, 27, 001, N'义州街道办事处'),
	(21, 07, 27, 002, N'城关街道办事处'),
	(21, 07, 27, 101, N'刘龙台镇'),
	(21, 07, 27, 102, N'七里河镇'),
	(21, 07, 27, 103, N'大榆树堡镇'),
	(21, 07, 27, 104, N'稍户营子镇'),
	(21, 07, 27, 105, N'九道岭镇'),
	(21, 07, 27, 106, N'高台子镇'),
	(21, 07, 27, 108, N'瓦子峪镇'),
	(21, 07, 27, 109, N'头台镇'),
	(21, 07, 27, 110, N'前杨镇'),
	(21, 07, 27, 111, N'张家堡镇'),
	(21, 07, 27, 112, N'头道河镇'),
	(21, 07, 27, 113, N'留龙沟镇'),
	(21, 07, 27, 114, N'聚粮屯镇'),
	(21, 07, 27, 203, N'地藏寺满族乡'),
	(21, 07, 27, 205, N'大定堡满族乡'),
	(21, 07, 27, 207, N'白庙子乡');

/* 辽宁省 锦州市 凌海市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 07, 81, 001, N'大凌河街道'),
	(21, 07, 81, 002, N'金城街道'),
	(21, 07, 81, 003, N'八千街道办事处'),
	(21, 07, 81, 004, N'大有街道办事处'),
	(21, 07, 81, 101, N'石山镇'),
	(21, 07, 81, 102, N'余积镇'),
	(21, 07, 81, 103, N'双羊镇'),
	(21, 07, 81, 104, N'班吉塔镇'),
	(21, 07, 81, 105, N'沈家台镇'),
	(21, 07, 81, 106, N'三台子镇'),
	(21, 07, 81, 107, N'右卫满族镇'),
	(21, 07, 81, 108, N'阎家镇'),
	(21, 07, 81, 109, N'新庄子镇'),
	(21, 07, 81, 112, N'翠岩镇'),
	(21, 07, 81, 113, N'安屯镇'),
	(21, 07, 81, 114, N'大业镇'),
	(21, 07, 81, 116, N'建业镇'),
	(21, 07, 81, 117, N'温滴楼满族镇'),
	(21, 07, 81, 118, N'白台子镇'),
	(21, 07, 81, 212, N'板石沟乡'),
	(21, 07, 81, 217, N'谢屯乡');

/* 辽宁省 锦州市 北镇市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 07, 82, 004, N'北镇街道办事处'),
	(21, 07, 82, 005, N'观音阁街道办事处'),
	(21, 07, 82, 006, N'富屯街道办事处'),
	(21, 07, 82, 007, N'广宁街道办事处'),
	(21, 07, 82, 008, N'沟帮子街道办事处'),
	(21, 07, 82, 009, N'沙子河街道办事处'),
	(21, 07, 82, 101, N'大市镇'),
	(21, 07, 82, 102, N'罗罗堡镇'),
	(21, 07, 82, 103, N'常兴店镇'),
	(21, 07, 82, 104, N'正安镇'),
	(21, 07, 82, 105, N'闾阳镇'),
	(21, 07, 82, 106, N'中安镇'),
	(21, 07, 82, 107, N'廖屯镇'),
	(21, 07, 82, 109, N'赵屯镇'),
	(21, 07, 82, 110, N'青堆子镇'),
	(21, 07, 82, 111, N'高山子镇'),
	(21, 07, 82, 113, N'吴家镇'),
	(21, 07, 82, 203, N'鲍家乡'),
	(21, 07, 82, 206, N'大屯乡'),
	(21, 07, 82, 209, N'柳家乡');

/* 辽宁省 营口市 站前区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 08, 02, 001, N'八田地街道'),
	(21, 08, 02, 002, N'建丰街道'),
	(21, 08, 02, 003, N'建设街道'),
	(21, 08, 02, 004, N'跃进街道'),
	(21, 08, 02, 005, N'东风街道'),
	(21, 08, 02, 006, N'新兴街道'),
	(21, 08, 02, 007, N'新建街道');

/* 辽宁省 营口市 西市区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 08, 03, 001, N'胜利街道'),
	(21, 08, 03, 002, N'清华街道'),
	(21, 08, 03, 003, N'滨海街道'),
	(21, 08, 03, 004, N'得胜街道'),
	(21, 08, 03, 005, N'五台子街道'),
	(21, 08, 03, 006, N'渔市街道'),
	(21, 08, 03, 007, N'河北街道'),
	(21, 08, 03, 008, N'沿海街道');

/* 辽宁省 营口市 鲅鱼圈区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 08, 04, 001, N'红海街道'),
	(21, 08, 04, 002, N'海星街道'),
	(21, 08, 04, 003, N'望海街道'),
	(21, 08, 04, 004, N'海东街道'),
	(21, 08, 04, 100, N'熊岳镇'),
	(21, 08, 04, 101, N'芦屯镇'),
	(21, 08, 04, 102, N'红旗满族镇');

/* 辽宁省 营口市 老边区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 08, 11, 001, N'老边街道'),
	(21, 08, 11, 002, N'城东街道'),
	(21, 08, 11, 101, N'路南镇'),
	(21, 08, 11, 102, N'柳树镇'),
	(21, 08, 11, 103, N'边城镇');

/* 辽宁省 营口市 盖州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 08, 81, 001, N'鼓楼街道'),
	(21, 08, 81, 002, N'西城街道'),
	(21, 08, 81, 003, N'东城街道'),
	(21, 08, 81, 004, N'太阳升街道'),
	(21, 08, 81, 005, N'团山街道'),
	(21, 08, 81, 006, N'西海街道'),
	(21, 08, 81, 007, N'九垄地街道'),
	(21, 08, 81, 008, N'归州街道'),
	(21, 08, 81, 102, N'高屯镇'),
	(21, 08, 81, 105, N'沙岗镇'),
	(21, 08, 81, 109, N'九寨镇'),
	(21, 08, 81, 110, N'万福镇'),
	(21, 08, 81, 111, N'卧龙泉镇'),
	(21, 08, 81, 112, N'青石岭镇'),
	(21, 08, 81, 113, N'暖泉镇'),
	(21, 08, 81, 116, N'榜式堡镇'),
	(21, 08, 81, 117, N'团甸镇'),
	(21, 08, 81, 118, N'双台镇'),
	(21, 08, 81, 119, N'杨运镇'),
	(21, 08, 81, 120, N'徐屯镇'),
	(21, 08, 81, 121, N'什字街镇'),
	(21, 08, 81, 122, N'矿洞沟镇'),
	(21, 08, 81, 123, N'陈屯镇'),
	(21, 08, 81, 124, N'梁屯镇'),
	(21, 08, 81, 216, N'小石棚乡'),
	(21, 08, 81, 217, N'果园乡'),
	(21, 08, 81, 218, N'二台乡');

/* 辽宁省 营口市 大石桥市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 08, 82, 001, N'石桥街道'),
	(21, 08, 82, 002, N'青花街道'),
	(21, 08, 82, 003, N'金桥街道'),
	(21, 08, 82, 004, N'钢都街道'),
	(21, 08, 82, 005, N'南楼街道'),
	(21, 08, 82, 101, N'水源镇'),
	(21, 08, 82, 102, N'沟沿镇'),
	(21, 08, 82, 103, N'石佛镇'),
	(21, 08, 82, 104, N'高坎镇'),
	(21, 08, 82, 105, N'旗口镇'),
	(21, 08, 82, 106, N'虎庄镇'),
	(21, 08, 82, 107, N'官屯镇'),
	(21, 08, 82, 112, N'博洛铺镇'),
	(21, 08, 82, 113, N'永安镇'),
	(21, 08, 82, 114, N'汤池镇'),
	(21, 08, 82, 115, N'建一镇'),
	(21, 08, 82, 116, N'黄土岭镇'),
	(21, 08, 82, 117, N'周家镇');

/* 辽宁省 阜新市 海州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 09, 02, 002, N'新兴街道'),
	(21, 09, 02, 003, N'和平街道'),
	(21, 09, 02, 004, N'西山街道'),
	(21, 09, 02, 005, N'河北街道'),
	(21, 09, 02, 006, N'站前街道'),
	(21, 09, 02, 007, N'西阜新街道'),
	(21, 09, 02, 008, N'五龙街道'),
	(21, 09, 02, 009, N'平安西部街道'),
	(21, 09, 02, 010, N'工人村街道'),
	(21, 09, 02, 011, N'东梁街道'),
	(21, 09, 02, 101, N'韩家店镇');

/* 辽宁省 阜新市 新邱区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 09, 03, 001, N'兴隆街道'),
	(21, 09, 03, 002, N'中兴街道'),
	(21, 09, 03, 003, N'益民街道'),
	(21, 09, 03, 004, N'新发街道'),
	(21, 09, 03, 101, N'长营子蒙古族镇');

/* 辽宁省 阜新市 太平区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 09, 04, 001, N'红树街道'),
	(21, 09, 04, 002, N'煤海街道'),
	(21, 09, 04, 003, N'高德街道'),
	(21, 09, 04, 004, N'孙家湾街道'),
	(21, 09, 04, 005, N'城南街道'),
	(21, 09, 04, 101, N'水泉镇');

/* 辽宁省 阜新市 清河门区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 09, 05, 001, N'清河街道'),
	(21, 09, 05, 002, N'六台街道'),
	(21, 09, 05, 003, N'艾友街道'),
	(21, 09, 05, 004, N'新北街道'),
	(21, 09, 05, 101, N'河西镇'),
	(21, 09, 05, 102, N'乌龙坝镇');

/* 辽宁省 阜新市 细河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 09, 11, 001, N'西苑街道'),
	(21, 09, 11, 002, N'北苑街道'),
	(21, 09, 11, 003, N'东苑街道'),
	(21, 09, 11, 004, N'学苑街道'),
	(21, 09, 11, 005, N'中苑街道'),
	(21, 09, 11, 006, N'华东街道'),
	(21, 09, 11, 102, N'四合镇');

/* 辽宁省 阜新市 阜新蒙古族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 09, 21, 001, N'城区街道办事处'),
	(21, 09, 21, 100, N'阜新镇'),
	(21, 09, 21, 102, N'东梁镇'),
	(21, 09, 21, 103, N'佛寺镇'),
	(21, 09, 21, 104, N'伊吗图镇'),
	(21, 09, 21, 105, N'旧庙镇'),
	(21, 09, 21, 106, N'务欢池镇'),
	(21, 09, 21, 107, N'建设镇'),
	(21, 09, 21, 108, N'大巴镇'),
	(21, 09, 21, 109, N'泡子镇'),
	(21, 09, 21, 110, N'十家子镇'),
	(21, 09, 21, 111, N'王府镇'),
	(21, 09, 21, 112, N'于寺镇'),
	(21, 09, 21, 113, N'富荣镇'),
	(21, 09, 21, 114, N'新民镇'),
	(21, 09, 21, 115, N'福兴地镇'),
	(21, 09, 21, 116, N'平安地镇'),
	(21, 09, 21, 117, N'沙拉镇'),
	(21, 09, 21, 118, N'大固本镇'),
	(21, 09, 21, 119, N'大五家子镇'),
	(21, 09, 21, 120, N'大板镇'),
	(21, 09, 21, 121, N'招束沟镇'),
	(21, 09, 21, 122, N'八家子镇'),
	(21, 09, 21, 123, N'蜘蛛山镇'),
	(21, 09, 21, 124, N'塔营子镇'),
	(21, 09, 21, 125, N'扎兰营子镇'),
	(21, 09, 21, 126, N'七家子镇'),
	(21, 09, 21, 127, N'红帽子镇'),
	(21, 09, 21, 128, N'紫都台镇'),
	(21, 09, 21, 129, N'化石戈镇'),
	(21, 09, 21, 130, N'哈达户稍镇'),
	(21, 09, 21, 131, N'老河土镇'),
	(21, 09, 21, 132, N'太平镇'),
	(21, 09, 21, 203, N'卧凤沟乡'),
	(21, 09, 21, 211, N'苍土乡'),
	(21, 09, 21, 222, N'国华乡');

/* 辽宁省 阜新市 彰武县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 09, 22, 100, N'彰武镇'),
	(21, 09, 22, 101, N'哈尔套镇'),
	(21, 09, 22, 102, N'章古台镇'),
	(21, 09, 22, 103, N'五峰镇'),
	(21, 09, 22, 104, N'冯家镇'),
	(21, 09, 22, 105, N'后新秋镇'),
	(21, 09, 22, 106, N'东六家子镇'),
	(21, 09, 22, 107, N'阿尔乡镇'),
	(21, 09, 22, 108, N'前福兴地镇'),
	(21, 09, 22, 109, N'双庙镇'),
	(21, 09, 22, 110, N'大四家子镇'),
	(21, 09, 22, 111, N'苇子沟镇'),
	(21, 09, 22, 112, N'兴隆山镇'),
	(21, 09, 22, 113, N'满堂红镇'),
	(21, 09, 22, 114, N'四合城镇'),
	(21, 09, 22, 115, N'大冷蒙古族镇'),
	(21, 09, 22, 116, N'两家子镇'),
	(21, 09, 22, 117, N'平安镇'),
	(21, 09, 22, 202, N'二道河子蒙古族乡'),
	(21, 09, 22, 203, N'西六家子蒙古族满族乡'),
	(21, 09, 22, 208, N'四堡子乡'),
	(21, 09, 22, 209, N'丰田乡'),
	(21, 09, 22, 210, N'大德乡'),
	(21, 09, 22, 213, N'兴隆堡乡');

/* 辽宁省 辽阳市 白塔区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 10, 02, 001, N'星火街道办事处'),
	(21, 10, 02, 002, N'胜利街道办事处'),
	(21, 10, 02, 003, N'跃进街道办事处'),
	(21, 10, 02, 005, N'卫国路街道办事处'),
	(21, 10, 02, 006, N'站前街道办事处'),
	(21, 10, 02, 010, N'武圣街道办事处'),
	(21, 10, 02, 011, N'襄平街道办事处'),
	(21, 10, 02, 012, N'文圣街道办事处'),
	(21, 10, 02, 013, N'南门街道办事处'),
	(21, 10, 02, 014, N'东兴街道办事处'),
	(21, 10, 02, 015, N'新华街道办事处');

/* 辽宁省 辽阳市 文圣区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 10, 03, 004, N'庆阳街道办事处'),
	(21, 10, 03, 008, N'东京陵街道办事处'),
	(21, 10, 03, 009, N'新城街道办事处'),
	(21, 10, 03, 101, N'小屯镇'),
	(21, 10, 03, 102, N'罗大台镇');

/* 辽宁省 辽阳市 宏伟区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 10, 04, 001, N'工农街道办事处'),
	(21, 10, 04, 002, N'光华街道办事处'),
	(21, 10, 04, 003, N'新村街道办事处'),
	(21, 10, 04, 004, N'长征街道办事处'),
	(21, 10, 04, 101, N'曙光镇'),
	(21, 10, 04, 102, N'兰家镇');

/* 辽宁省 辽阳市 弓长岭区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 10, 05, 001, N'苏家街道办事处'),
	(21, 10, 05, 002, N'团山街道办事处'),
	(21, 10, 05, 003, N'安平街道办事处'),
	(21, 10, 05, 101, N'汤河镇'),
	(21, 10, 05, 201, N'安平乡');

/* 辽宁省 辽阳市 太子河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 10, 11, 002, N'望水台街道办事处'),
	(21, 10, 11, 003, N'铁西街道办事处'),
	(21, 10, 11, 101, N'祁家镇'),
	(21, 10, 11, 102, N'沙岭镇'),
	(21, 10, 11, 103, N'王家镇'),
	(21, 10, 11, 204, N'东宁卫乡');

/* 辽宁省 辽阳市 辽阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 10, 21, 100, N'首山镇'),
	(21, 10, 21, 101, N'刘二堡镇'),
	(21, 10, 21, 103, N'小北河镇'),
	(21, 10, 21, 104, N'黄泥洼镇'),
	(21, 10, 21, 106, N'唐马寨镇'),
	(21, 10, 21, 107, N'穆家镇'),
	(21, 10, 21, 108, N'柳壕镇'),
	(21, 10, 21, 110, N'河栏镇'),
	(21, 10, 21, 111, N'隆昌镇'),
	(21, 10, 21, 112, N'八会镇'),
	(21, 10, 21, 113, N'寒岭镇'),
	(21, 10, 21, 114, N'兴隆镇'),
	(21, 10, 21, 201, N'下达河乡'),
	(21, 10, 21, 202, N'吉洞峪满族乡'),
	(21, 10, 21, 206, N'甜水满族乡');

/* 辽宁省 辽阳市 灯塔市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 10, 81, 001, N'烟台街道办事处'),
	(21, 10, 81, 002, N'万宝桥街道办事处'),
	(21, 10, 81, 003, N'古城子街道办事处'),
	(21, 10, 81, 101, N'佟二堡镇'),
	(21, 10, 81, 102, N'铧子镇'),
	(21, 10, 81, 103, N'张台子镇'),
	(21, 10, 81, 104, N'西大窑镇'),
	(21, 10, 81, 105, N'沈旦堡镇'),
	(21, 10, 81, 106, N'西马峰镇'),
	(21, 10, 81, 107, N'柳条寨镇'),
	(21, 10, 81, 108, N'柳河子镇'),
	(21, 10, 81, 111, N'大河南镇'),
	(21, 10, 81, 114, N'五星镇'),
	(21, 10, 81, 205, N'鸡冠山乡');

/* 辽宁省 盘锦市 双台子区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 11, 02, 001, N'东风街道'),
	(21, 11, 02, 002, N'胜利街道'),
	(21, 11, 02, 003, N'建设街道'),
	(21, 11, 02, 004, N'红旗街道'),
	(21, 11, 02, 005, N'辽河街道'),
	(21, 11, 02, 007, N'化工街道'),
	(21, 11, 02, 008, N'铁东街道'),
	(21, 11, 02, 009, N'双盛街道'),
	(21, 11, 02, 100, N'统一镇'),
	(21, 11, 02, 101, N'陆家镇');

/* 辽宁省 盘锦市 兴隆台区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 11, 03, 001, N'振兴街道'),
	(21, 11, 03, 002, N'兴隆街道'),
	(21, 11, 03, 003, N'渤海街道'),
	(21, 11, 03, 004, N'新工街道'),
	(21, 11, 03, 005, N'于楼街道'),
	(21, 11, 03, 006, N'友谊街道'),
	(21, 11, 03, 007, N'曙光街道'),
	(21, 11, 03, 008, N'欢喜街道'),
	(21, 11, 03, 009, N'平安街道'),
	(21, 11, 03, 010, N'新生街道'),
	(21, 11, 03, 011, N'红村街道'),
	(21, 11, 03, 012, N'高升街道'),
	(21, 11, 03, 013, N'沈采街道'),
	(21, 11, 03, 014, N'锦采街道'),
	(21, 11, 03, 015, N'茨采街道'),
	(21, 11, 03, 016, N'创新街道'),
	(21, 11, 03, 017, N'兴盛街道'),
	(21, 11, 03, 018, N'兴海街道');

/* 辽宁省 盘锦市 大洼县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 11, 21, 001, N'荣滨街道'),
	(21, 11, 21, 002, N'二界沟街道'),
	(21, 11, 21, 100, N'大洼镇'),
	(21, 11, 21, 101, N'田庄台镇'),
	(21, 11, 21, 103, N'东风镇'),
	(21, 11, 21, 104, N'新开镇'),
	(21, 11, 21, 105, N'田家镇'),
	(21, 11, 21, 106, N'清水镇'),
	(21, 11, 21, 107, N'新兴镇'),
	(21, 11, 21, 108, N'西安镇'),
	(21, 11, 21, 109, N'新立镇'),
	(21, 11, 21, 110, N'荣兴镇'),
	(21, 11, 21, 111, N'王家镇'),
	(21, 11, 21, 112, N'唐家镇'),
	(21, 11, 21, 113, N'平安镇'),
	(21, 11, 21, 114, N'赵圈河镇'),
	(21, 11, 21, 115, N'榆树镇');

/* 辽宁省 盘锦市 盘山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 11, 22, 101, N'沙岭镇'),
	(21, 11, 22, 102, N'高升镇'),
	(21, 11, 22, 103, N'胡家镇'),
	(21, 11, 22, 104, N'石新镇'),
	(21, 11, 22, 105, N'东郭镇'),
	(21, 11, 22, 106, N'羊圈子镇'),
	(21, 11, 22, 107, N'古城子镇'),
	(21, 11, 22, 108, N'坝墙子镇'),
	(21, 11, 22, 109, N'太平镇'),
	(21, 11, 22, 110, N'陈家镇'),
	(21, 11, 22, 111, N'甜水镇'),
	(21, 11, 22, 112, N'吴家镇'),
	(21, 11, 22, 113, N'得胜镇');

/* 辽宁省 铁岭市 银州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 12, 02, 001, N'红旗街道'),
	(21, 12, 02, 002, N'工人街道'),
	(21, 12, 02, 003, N'铁西街道'),
	(21, 12, 02, 004, N'铜钟街道'),
	(21, 12, 02, 005, N'柴河街道'),
	(21, 12, 02, 006, N'岭东街道'),
	(21, 12, 02, 007, N'辽海街道'),
	(21, 12, 02, 201, N'龙山乡');

/* 辽宁省 铁岭市 清河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 12, 04, 001, N'红旗街道'),
	(21, 12, 04, 002, N'向阳街道'),
	(21, 12, 04, 101, N'张相镇'),
	(21, 12, 04, 102, N'杨木林子镇'),
	(21, 12, 04, 203, N'聂家满族乡');

/* 辽宁省 铁岭市 铁岭县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 12, 21, 101, N'新台子镇'),
	(21, 12, 21, 102, N'阿吉镇'),
	(21, 12, 21, 103, N'平顶堡镇'),
	(21, 12, 21, 104, N'大甸子镇'),
	(21, 12, 21, 105, N'凡河镇'),
	(21, 12, 21, 106, N'腰堡镇'),
	(21, 12, 21, 107, N'镇西堡镇'),
	(21, 12, 21, 108, N'蔡牛镇'),
	(21, 12, 21, 109, N'李千户镇'),
	(21, 12, 21, 110, N'熊官屯镇'),
	(21, 12, 21, 111, N'横道河子镇'),
	(21, 12, 21, 112, N'双井子镇'),
	(21, 12, 21, 208, N'鸡冠山乡'),
	(21, 12, 21, 209, N'白旗寨满族乡');

/* 辽宁省 铁岭市 西丰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 12, 23, 100, N'西丰镇'),
	(21, 12, 23, 101, N'平岗镇'),
	(21, 12, 23, 102, N'郜家店镇'),
	(21, 12, 23, 103, N'凉泉镇'),
	(21, 12, 23, 104, N'振兴镇'),
	(21, 12, 23, 105, N'安民镇'),
	(21, 12, 23, 106, N'天德镇'),
	(21, 12, 23, 107, N'房木镇'),
	(21, 12, 23, 108, N'柏榆镇'),
	(21, 12, 23, 109, N'陶然镇'),
	(21, 12, 23, 110, N'钓鱼镇'),
	(21, 12, 23, 111, N'更刻镇'),
	(21, 12, 23, 204, N'德兴满族乡'),
	(21, 12, 23, 206, N'明德满族乡'),
	(21, 12, 23, 209, N'成平满族乡'),
	(21, 12, 23, 211, N'和隆满族乡'),
	(21, 12, 23, 212, N'营厂满族乡'),
	(21, 12, 23, 213, N'金星满族乡');

/* 辽宁省 铁岭市 昌图县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 12, 24, 100, N'昌图镇'),
	(21, 12, 24, 101, N'老城镇'),
	(21, 12, 24, 102, N'八面城镇'),
	(21, 12, 24, 103, N'三江口镇'),
	(21, 12, 24, 104, N'金家镇'),
	(21, 12, 24, 105, N'宝力镇'),
	(21, 12, 24, 106, N'泉头镇'),
	(21, 12, 24, 107, N'双庙子镇'),
	(21, 12, 24, 108, N'亮中桥镇'),
	(21, 12, 24, 109, N'马仲河镇'),
	(21, 12, 24, 110, N'毛家店镇'),
	(21, 12, 24, 111, N'老四平镇'),
	(21, 12, 24, 112, N'大洼镇'),
	(21, 12, 24, 113, N'头道镇'),
	(21, 12, 24, 114, N'鴜鷺树镇'),
	(21, 12, 24, 115, N'傅家镇'),
	(21, 12, 24, 117, N'四合镇'),
	(21, 12, 24, 118, N'朝阳镇'),
	(21, 12, 24, 119, N'古榆树镇'),
	(21, 12, 24, 120, N'七家子镇'),
	(21, 12, 24, 121, N'东嘎镇'),
	(21, 12, 24, 122, N'四面城镇'),
	(21, 12, 24, 123, N'前双井镇'),
	(21, 12, 24, 124, N'通江口镇'),
	(21, 12, 24, 125, N'大四家子镇'),
	(21, 12, 24, 126, N'曲家店镇'),
	(21, 12, 24, 127, N'十八家子镇'),
	(21, 12, 24, 128, N'太平镇'),
	(21, 12, 24, 129, N'下二台镇'),
	(21, 12, 24, 130, N'平安堡镇'),
	(21, 12, 24, 131, N'大兴镇'),
	(21, 12, 24, 132, N'后窑镇'),
	(21, 12, 24, 133, N'长发镇');

/* 辽宁省 铁岭市 调兵山市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 12, 81, 001, N'兀术街街道'),
	(21, 12, 81, 002, N'调兵山街道'),
	(21, 12, 81, 102, N'晓明镇'),
	(21, 12, 81, 103, N'大明镇'),
	(21, 12, 81, 105, N'晓南镇');

/* 辽宁省 铁岭市 开原市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 12, 82, 001, N'新城街道'),
	(21, 12, 82, 002, N'老城街道'),
	(21, 12, 82, 003, N'兴开街道'),
	(21, 12, 82, 102, N'威远堡镇'),
	(21, 12, 82, 103, N'庆云堡镇'),
	(21, 12, 82, 104, N'中固镇'),
	(21, 12, 82, 105, N'八棵树镇'),
	(21, 12, 82, 106, N'金沟子镇'),
	(21, 12, 82, 107, N'八宝镇'),
	(21, 12, 82, 108, N'业民镇'),
	(21, 12, 82, 109, N'莲花镇'),
	(21, 12, 82, 110, N'靠山镇'),
	(21, 12, 82, 111, N'马家寨镇'),
	(21, 12, 82, 112, N'下肥镇'),
	(21, 12, 82, 113, N'松山镇'),
	(21, 12, 82, 114, N'城东镇'),
	(21, 12, 82, 115, N'李家台镇'),
	(21, 12, 82, 116, N'上肥地满族镇'),
	(21, 12, 82, 117, N'黄旗寨满族镇'),
	(21, 12, 82, 217, N'林丰满族乡');

/* 辽宁省 朝阳市 双塔区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 13, 02, 001, N'南塔街道'),
	(21, 13, 02, 002, N'北塔街道'),
	(21, 13, 02, 003, N'前进街道'),
	(21, 13, 02, 004, N'凌河街道'),
	(21, 13, 02, 005, N'光明街道'),
	(21, 13, 02, 006, N'凌凤街道'),
	(21, 13, 02, 007, N'龙山街道'),
	(21, 13, 02, 008, N'站南街道'),
	(21, 13, 02, 009, N'红旗街道'),
	(21, 13, 02, 010, N'燕北街道'),
	(21, 13, 02, 011, N'燕都街道'),
	(21, 13, 02, 100, N'桃花吐镇'),
	(21, 13, 02, 101, N'他拉皋镇'),
	(21, 13, 02, 102, N'孙家湾镇'),
	(21, 13, 02, 205, N'长宝营子乡');

/* 辽宁省 朝阳市 龙城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 13, 03, 001, N'向阳街道'),
	(21, 13, 03, 002, N'燕山街道'),
	(21, 13, 03, 003, N'马山街道'),
	(21, 13, 03, 004, N'新华街道'),
	(21, 13, 03, 005, N'海龙街道'),
	(21, 13, 03, 070, N'开发区龙泉街道'),
	(21, 13, 03, 101, N'七道泉子镇'),
	(21, 13, 03, 102, N'西大营子镇'),
	(21, 13, 03, 103, N'召都巴镇'),
	(21, 13, 03, 105, N'大平房镇'),
	(21, 13, 03, 106, N'联合镇'),
	(21, 13, 03, 107, N'边杖子镇');

/* 辽宁省 朝阳市 朝阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 13, 21, 001, N'柳城街道'),
	(21, 13, 21, 102, N'波罗赤镇'),
	(21, 13, 21, 103, N'木头城子镇'),
	(21, 13, 21, 104, N'二十家子镇'),
	(21, 13, 21, 105, N'羊山镇'),
	(21, 13, 21, 106, N'六家子镇'),
	(21, 13, 21, 107, N'瓦房子镇'),
	(21, 13, 21, 108, N'大庙镇'),
	(21, 13, 21, 110, N'古山子镇'),
	(21, 13, 21, 111, N'南双庙镇'),
	(21, 13, 21, 112, N'台子镇'),
	(21, 13, 21, 113, N'清风岭镇'),
	(21, 13, 21, 114, N'胜利镇'),
	(21, 13, 21, 115, N'七道岭镇'),
	(21, 13, 21, 211, N'西五家子乡'),
	(21, 13, 21, 212, N'北沟门子乡'),
	(21, 13, 21, 213, N'杨树湾乡'),
	(21, 13, 21, 214, N'东大道乡'),
	(21, 13, 21, 215, N'乌兰河硕蒙古族乡'),
	(21, 13, 21, 220, N'东大屯乡'),
	(21, 13, 21, 221, N'松岭门蒙古族乡'),
	(21, 13, 21, 222, N'根德营子乡'),
	(21, 13, 21, 224, N'西营子乡'),
	(21, 13, 21, 228, N'北四家子乡'),
	(21, 13, 21, 230, N'王营子乡'),
	(21, 13, 21, 231, N'黑牛营子乡'),
	(21, 13, 21, 232, N'尚志乡');

/* 辽宁省 朝阳市 建平县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 13, 22, 001, N'叶柏寿街道'),
	(21, 13, 22, 002, N'红山街道'),
	(21, 13, 22, 003, N'铁南街道'),
	(21, 13, 22, 004, N'万寿街道'),
	(21, 13, 22, 005, N'富山街道'),
	(21, 13, 22, 006, N'新城街道'),
	(21, 13, 22, 007, N'东城街道'),
	(21, 13, 22, 101, N'朱碌科镇'),
	(21, 13, 22, 102, N'建平镇'),
	(21, 13, 22, 103, N'黑水镇'),
	(21, 13, 22, 104, N'喀喇沁镇'),
	(21, 13, 22, 105, N'北二十家子镇'),
	(21, 13, 22, 106, N'沙海镇'),
	(21, 13, 22, 108, N'哈拉道口镇'),
	(21, 13, 22, 109, N'榆树林子镇'),
	(21, 13, 22, 110, N'老官地镇'),
	(21, 13, 22, 111, N'深井镇'),
	(21, 13, 22, 112, N'奎德素镇'),
	(21, 13, 22, 113, N'小塘镇'),
	(21, 13, 22, 114, N'马场镇'),
	(21, 13, 22, 115, N'昌隆镇'),
	(21, 13, 22, 117, N'张家营子镇'),
	(21, 13, 22, 118, N'青峰山镇'),
	(21, 13, 22, 119, N'太平庄镇'),
	(21, 13, 22, 205, N'青松岭乡'),
	(21, 13, 22, 206, N'杨树岭乡'),
	(21, 13, 22, 209, N'罗福沟乡'),
	(21, 13, 22, 211, N'烧锅营子乡'),
	(21, 13, 22, 214, N'白山乡'),
	(21, 13, 22, 218, N'三家蒙古族乡'),
	(21, 13, 22, 220, N'义成功乡');

/* 辽宁省 朝阳市 喀喇沁左翼蒙古族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 13, 24, 001, N'大城子街道'),
	(21, 13, 24, 002, N'利州街道'),
	(21, 13, 24, 003, N'南哨街道'),
	(21, 13, 24, 101, N'南公营子镇'),
	(21, 13, 24, 102, N'山嘴子镇'),
	(21, 13, 24, 104, N'公营子镇'),
	(21, 13, 24, 105, N'白塔子镇'),
	(21, 13, 24, 106, N'中三家镇'),
	(21, 13, 24, 107, N'老爷庙镇'),
	(21, 13, 24, 108, N'六官营子镇'),
	(21, 13, 24, 109, N'平房子镇'),
	(21, 13, 24, 110, N'十二德堡镇'),
	(21, 13, 24, 111, N'羊角沟镇'),
	(21, 13, 24, 112, N'兴隆庄镇'),
	(21, 13, 24, 113, N'甘招镇'),
	(21, 13, 24, 114, N'东哨镇'),
	(21, 13, 24, 115, N'水泉镇'),
	(21, 13, 24, 204, N'尤杖子乡'),
	(21, 13, 24, 207, N'草场乡'),
	(21, 13, 24, 210, N'坤都营子乡'),
	(21, 13, 24, 211, N'大营子乡'),
	(21, 13, 24, 214, N'卧虎沟乡');

/* 辽宁省 朝阳市 北票市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 13, 81, 001, N'城关街道'),
	(21, 13, 81, 002, N'南山街道'),
	(21, 13, 81, 003, N'冠山街道'),
	(21, 13, 81, 004, N'桥北街道'),
	(21, 13, 81, 005, N'三宝街道'),
	(21, 13, 81, 006, N'台吉街道'),
	(21, 13, 81, 008, N'双河街道'),
	(21, 13, 81, 101, N'西官营镇'),
	(21, 13, 81, 102, N'大板镇'),
	(21, 13, 81, 103, N'上园镇'),
	(21, 13, 81, 104, N'宝国老镇'),
	(21, 13, 81, 105, N'黑城子镇'),
	(21, 13, 81, 107, N'五间房镇'),
	(21, 13, 81, 108, N'台吉镇'),
	(21, 13, 81, 109, N'东官营镇'),
	(21, 13, 81, 110, N'龙潭镇'),
	(21, 13, 81, 111, N'北塔镇'),
	(21, 13, 81, 112, N'蒙古营镇'),
	(21, 13, 81, 113, N'大三家镇'),
	(21, 13, 81, 201, N'长皋乡'),
	(21, 13, 81, 202, N'常河营乡'),
	(21, 13, 81, 203, N'小塔子乡'),
	(21, 13, 81, 204, N'马友营蒙古族乡'),
	(21, 13, 81, 206, N'泉巨永乡'),
	(21, 13, 81, 212, N'哈尔脑乡'),
	(21, 13, 81, 213, N'南八家子乡'),
	(21, 13, 81, 214, N'章吉营乡'),
	(21, 13, 81, 215, N'三宝营乡'),
	(21, 13, 81, 216, N'巴图营乡'),
	(21, 13, 81, 218, N'台吉营乡'),
	(21, 13, 81, 220, N'娄家店乡'),
	(21, 13, 81, 221, N'北四家乡'),
	(21, 13, 81, 223, N'凉水河蒙古族乡'),
	(21, 13, 81, 228, N'三宝乡');

/* 辽宁省 朝阳市 凌源市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 13, 82, 001, N'东城街道'),
	(21, 13, 82, 002, N'北街街道'),
	(21, 13, 82, 003, N'南街街道'),
	(21, 13, 82, 004, N'凌北街道'),
	(21, 13, 82, 006, N'热水汤街道'),
	(21, 13, 82, 007, N'兴源街道'),
	(21, 13, 82, 008, N'红山街道'),
	(21, 13, 82, 009, N'城关街道'),
	(21, 13, 82, 101, N'万元店镇'),
	(21, 13, 82, 102, N'宋杖子镇'),
	(21, 13, 82, 103, N'三十家子镇'),
	(21, 13, 82, 104, N'杨杖子镇'),
	(21, 13, 82, 105, N'刀尔登镇'),
	(21, 13, 82, 106, N'松岭子镇'),
	(21, 13, 82, 107, N'四官营子镇'),
	(21, 13, 82, 108, N'沟门子镇'),
	(21, 13, 82, 110, N'小城子镇'),
	(21, 13, 82, 111, N'四合当镇'),
	(21, 13, 82, 113, N'乌兰白镇'),
	(21, 13, 82, 114, N'瓦房店镇'),
	(21, 13, 82, 115, N'大河北镇'),
	(21, 13, 82, 116, N'牛营子镇'),
	(21, 13, 82, 204, N'大王杖子乡'),
	(21, 13, 82, 205, N'刘杖子乡'),
	(21, 13, 82, 206, N'前进乡'),
	(21, 13, 82, 208, N'三道河子乡'),
	(21, 13, 82, 210, N'北炉乡'),
	(21, 13, 82, 217, N'三家子乡'),
	(21, 13, 82, 219, N'佛爷洞乡'),
	(21, 13, 82, 220, N'河坎子乡');

/* 辽宁省 葫芦岛市 连山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 14, 02, 001, N'连山街道'),
	(21, 14, 02, 002, N'站前街道'),
	(21, 14, 02, 003, N'渤海街道'),
	(21, 14, 02, 004, N'兴工街道'),
	(21, 14, 02, 005, N'石油街道'),
	(21, 14, 02, 006, N'化工街道'),
	(21, 14, 02, 007, N'化机街道'),
	(21, 14, 02, 008, N'水泥街道'),
	(21, 14, 02, 011, N'锦郊街道'),
	(21, 14, 02, 104, N'钢屯镇'),
	(21, 14, 02, 105, N'寺儿堡镇'),
	(21, 14, 02, 106, N'新台门蒙古族镇'),
	(21, 14, 02, 201, N'沙河营乡'),
	(21, 14, 02, 202, N'孤竹营子乡'),
	(21, 14, 02, 203, N'白马石乡'),
	(21, 14, 02, 205, N'山神庙子乡'),
	(21, 14, 02, 206, N'塔山乡'),
	(21, 14, 02, 210, N'杨郊乡');

/* 辽宁省 葫芦岛市 龙港区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 14, 03, 001, N'葫芦岛街道'),
	(21, 14, 03, 002, N'东街道'),
	(21, 14, 03, 003, N'西街道'),
	(21, 14, 03, 004, N'望海寺街道'),
	(21, 14, 03, 005, N'龙湾街道'),
	(21, 14, 03, 006, N'滨海街道'),
	(21, 14, 03, 007, N'双龙街道'),
	(21, 14, 03, 008, N'玉皇街道'),
	(21, 14, 03, 009, N'连湾街道'),
	(21, 14, 03, 010, N'北港街道'),
	(21, 14, 03, 201, N'双树乡');

/* 辽宁省 葫芦岛市 南票区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 14, 04, 001, N'赵家屯街道'),
	(21, 14, 04, 002, N'沙锅屯街道'),
	(21, 14, 04, 003, N'邱皮沟街道'),
	(21, 14, 04, 005, N'苇子沟街道'),
	(21, 14, 04, 006, N'三家子街道'),
	(21, 14, 04, 007, N'小凌河街道'),
	(21, 14, 04, 008, N'九龙街道'),
	(21, 14, 04, 009, N'龙飞街道'),
	(21, 14, 04, 010, N'龙腾街道'),
	(21, 14, 04, 011, N'龙翔街道'),
	(21, 14, 04, 101, N'缸窑岭镇'),
	(21, 14, 04, 102, N'暖池塘镇'),
	(21, 14, 04, 103, N'高桥镇'),
	(21, 14, 04, 104, N'虹螺岘镇'),
	(21, 14, 04, 105, N'金星镇'),
	(21, 14, 04, 106, N'台集屯镇'),
	(21, 14, 04, 201, N'沙锅屯乡'),
	(21, 14, 04, 203, N'黄土坎乡'),
	(21, 14, 04, 204, N'大兴乡'),
	(21, 14, 04, 205, N'张相公屯乡');

/* 辽宁省 葫芦岛市 绥中县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 14, 21, 100, N'绥中镇'),
	(21, 14, 21, 101, N'西甸子镇'),
	(21, 14, 21, 102, N'宽帮满族镇'),
	(21, 14, 21, 103, N'大王庙满族镇'),
	(21, 14, 21, 104, N'万家镇'),
	(21, 14, 21, 105, N'前所镇'),
	(21, 14, 21, 106, N'高岭镇'),
	(21, 14, 21, 107, N'前卫镇'),
	(21, 14, 21, 108, N'荒地满族镇'),
	(21, 14, 21, 109, N'塔山屯镇'),
	(21, 14, 21, 113, N'高台镇'),
	(21, 14, 21, 114, N'王宝镇'),
	(21, 14, 21, 115, N'沙河镇'),
	(21, 14, 21, 116, N'小庄子镇'),
	(21, 14, 21, 201, N'西平坡满族乡'),
	(21, 14, 21, 202, N'葛家满族乡'),
	(21, 14, 21, 204, N'高甸子满族乡'),
	(21, 14, 21, 206, N'范家满族乡'),
	(21, 14, 21, 207, N'明水满族乡'),
	(21, 14, 21, 208, N'秋子沟乡'),
	(21, 14, 21, 210, N'加碑岩乡'),
	(21, 14, 21, 211, N'永安堡乡'),
	(21, 14, 21, 212, N'李家堡乡'),
	(21, 14, 21, 214, N'网户满族乡'),
	(21, 14, 21, 217, N'城郊乡');

/* 辽宁省 葫芦岛市 建昌县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 14, 22, 100, N'建昌镇'),
	(21, 14, 22, 101, N'八家子镇'),
	(21, 14, 22, 102, N'喇嘛洞镇'),
	(21, 14, 22, 103, N'药王庙镇'),
	(21, 14, 22, 104, N'汤神庙镇'),
	(21, 14, 22, 105, N'玲珑塔镇'),
	(21, 14, 22, 106, N'大屯镇'),
	(21, 14, 22, 201, N'牤牛营子乡'),
	(21, 14, 22, 203, N'素珠营子乡'),
	(21, 14, 22, 204, N'石佛乡'),
	(21, 14, 22, 206, N'王宝营子乡'),
	(21, 14, 22, 207, N'老大杖子乡'),
	(21, 14, 22, 208, N'要路沟乡'),
	(21, 14, 22, 209, N'魏家岭乡'),
	(21, 14, 22, 210, N'西碱厂乡'),
	(21, 14, 22, 211, N'头道营子乡'),
	(21, 14, 22, 212, N'新开岭乡'),
	(21, 14, 22, 213, N'贺杖子乡'),
	(21, 14, 22, 214, N'养马甸子乡'),
	(21, 14, 22, 215, N'和尚房子乡'),
	(21, 14, 22, 218, N'杨树湾子乡'),
	(21, 14, 22, 219, N'黑山科乡'),
	(21, 14, 22, 220, N'雷家店乡'),
	(21, 14, 22, 222, N'小德营子乡'),
	(21, 14, 22, 223, N'二道湾子蒙古族乡'),
	(21, 14, 22, 224, N'巴什罕乡'),
	(21, 14, 22, 225, N'娘娘庙乡'),
	(21, 14, 22, 226, N'谷杖子乡');

/* 辽宁省 葫芦岛市 兴城市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(21, 14, 81, 001, N'古城街道'),
	(21, 14, 81, 002, N'宁远街道'),
	(21, 14, 81, 003, N'城东街道'),
	(21, 14, 81, 004, N'温泉街道'),
	(21, 14, 81, 005, N'钓鱼台街道'),
	(21, 14, 81, 006, N'华山街道'),
	(21, 14, 81, 007, N'四家屯街道'),
	(21, 14, 81, 008, N'菊花街道'),
	(21, 14, 81, 009, N'临海街道'),
	(21, 14, 81, 101, N'曹庄镇'),
	(21, 14, 81, 103, N'沙后所满族镇'),
	(21, 14, 81, 104, N'东辛庄满族镇'),
	(21, 14, 81, 105, N'郭家满族镇'),
	(21, 14, 81, 106, N'红崖子镇'),
	(21, 14, 81, 107, N'徐大堡镇'),
	(21, 14, 81, 108, N'高家岭满族镇'),
	(21, 14, 81, 201, N'羊安满族乡'),
	(21, 14, 81, 203, N'元台子满族乡'),
	(21, 14, 81, 204, N'白塔满族乡'),
	(21, 14, 81, 206, N'望海满族乡'),
	(21, 14, 81, 207, N'刘台子满族乡'),
	(21, 14, 81, 208, N'大寨满族乡'),
	(21, 14, 81, 209, N'南大山满族乡'),
	(21, 14, 81, 210, N'围屏满族乡'),
	(21, 14, 81, 212, N'碱厂满族乡'),
	(21, 14, 81, 213, N'三道沟满族乡'),
	(21, 14, 81, 215, N'旧门满族乡'),
	(21, 14, 81, 216, N'药王满族乡');


/* 吉林省 长春市 南关区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 01, 02, 001, N'南岭街道办事处'),
	(22, 01, 02, 002, N'自强街道办事处'),
	(22, 01, 02, 003, N'民康街道办事处'),
	(22, 01, 02, 004, N'新春街道办事处'),
	(22, 01, 02, 005, N'长通街道办事处'),
	(22, 01, 02, 006, N'全安街道办事处'),
	(22, 01, 02, 007, N'曙光街道办事处'),
	(22, 01, 02, 008, N'永吉街道办事处'),
	(22, 01, 02, 009, N'桃源街道办事处'),
	(22, 01, 02, 010, N'鸿城街道办事处'),
	(22, 01, 02, 011, N'明珠街道办事处'),
	(22, 01, 02, 012, N'富裕街道办事处'),
	(22, 01, 02, 200, N'幸福乡');

/* 吉林省 长春市 宽城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 01, 03, 001, N'新发街道办事处'),
	(22, 01, 03, 002, N'站前街道办事处'),
	(22, 01, 03, 003, N'南广街道办事处'),
	(22, 01, 03, 004, N'东广街道办事处'),
	(22, 01, 03, 005, N'群英街道办事处'),
	(22, 01, 03, 006, N'兴业街道办事处'),
	(22, 01, 03, 007, N'凯旋街道办事处'),
	(22, 01, 03, 008, N'团山街道办事处'),
	(22, 01, 03, 009, N'柳影街道办事处'),
	(22, 01, 03, 010, N'欣园街道办事处'),
	(22, 01, 03, 100, N'兰家镇'),
	(22, 01, 03, 101, N'米沙子镇'),
	(22, 01, 03, 102, N'万宝镇'),
	(22, 01, 03, 171, N'合隆镇');

/* 吉林省 长春市 朝阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 01, 04, 001, N'前进街道办事处'),
	(22, 01, 04, 002, N'桂林街道办事处'),
	(22, 01, 04, 003, N'南湖街道办事处'),
	(22, 01, 04, 004, N'永昌街道办事处'),
	(22, 01, 04, 005, N'重庆街道办事处'),
	(22, 01, 04, 006, N'清和街道办事处'),
	(22, 01, 04, 007, N'红旗街道办事处'),
	(22, 01, 04, 008, N'湖西街道办事处'),
	(22, 01, 04, 009, N'富锋街道办事处'),
	(22, 01, 04, 100, N'乐山镇'),
	(22, 01, 04, 101, N'永春镇');

/* 吉林省 长春市 二道区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 01, 05, 001, N'东盛街道办事处'),
	(22, 01, 05, 002, N'吉林街道办事处'),
	(22, 01, 05, 003, N'荣光街道办事处'),
	(22, 01, 05, 004, N'东站街道办事处'),
	(22, 01, 05, 005, N'远达街道办事处'),
	(22, 01, 05, 006, N'八里堡街道办事处'),
	(22, 01, 05, 007, N'长青街道办事处'),
	(22, 01, 05, 100, N'英俊镇'),
	(22, 01, 05, 170, N'龙嘉镇'),
	(22, 01, 05, 173, N'劝农山镇（长春莲花山生态旅游度假区省级）'),
	(22, 01, 05, 174, N'泉眼镇'),
	(22, 01, 05, 250, N'四家乡（长春莲花山生态旅游度假区省级）');

/* 吉林省 长春市 绿园区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 01, 06, 001, N'正阳街道办事处'),
	(22, 01, 06, 003, N'春城街道办事处'),
	(22, 01, 06, 005, N'青年街道办事处'),
	(22, 01, 06, 010, N'林园街道办事处'),
	(22, 01, 06, 011, N'同心街道办事处'),
	(22, 01, 06, 100, N'合心镇'),
	(22, 01, 06, 101, N'西新镇'),
	(22, 01, 06, 102, N'城西镇');

/* 吉林省 长春市 双阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 01, 12, 001, N'云山街道办事处'),
	(22, 01, 12, 002, N'平湖街道办事处'),
	(22, 01, 12, 003, N'奢岭街道办事处'),
	(22, 01, 12, 004, N'山河街道办事处'),
	(22, 01, 12, 100, N'齐家镇'),
	(22, 01, 12, 101, N'太平镇'),
	(22, 01, 12, 102, N'鹿乡镇'),
	(22, 01, 12, 250, N'双营子回族乡（梅花鹿产业经济开发区）（省级）');

/* 吉林省 长春市 九台区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 01, 13, 001, N'九台街道办事处'),
	(22, 01, 13, 002, N'营城街道办事处'),
	(22, 01, 13, 003, N'九郊街道办事处'),
	(22, 01, 13, 004, N'西营城街道办事处'),
	(22, 01, 13, 005, N'土们岭街道办事处'),
	(22, 01, 13, 006, N'苇子沟街道办事处'),
	(22, 01, 13, 007, N'兴隆街道办事处'),
	(22, 01, 13, 008, N'纪家街道办事处'),
	(22, 01, 13, 009, N'波泥河街道办事处'),
	(22, 01, 13, 010, N'卡伦湖街道办事处'),
	(22, 01, 13, 011, N'东湖街道办事处'),
	(22, 01, 13, 100, N'沐石河镇'),
	(22, 01, 13, 101, N'城子街镇'),
	(22, 01, 13, 102, N'其塔木镇'),
	(22, 01, 13, 103, N'上河湾镇'),
	(22, 01, 13, 200, N'胡家回族乡'),
	(22, 01, 13, 201, N'莽卡满族乡');

/* 吉林省 长春市 农安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 01, 22, 100, N'农安镇'),
	(22, 01, 22, 101, N'伏龙泉镇'),
	(22, 01, 22, 102, N'哈拉海镇'),
	(22, 01, 22, 103, N'靠山镇'),
	(22, 01, 22, 104, N'开安镇'),
	(22, 01, 22, 105, N'烧锅镇'),
	(22, 01, 22, 106, N'高家店镇'),
	(22, 01, 22, 107, N'华家镇'),
	(22, 01, 22, 108, N'三盛玉镇'),
	(22, 01, 22, 109, N'巴吉垒镇'),
	(22, 01, 22, 110, N'三岗镇'),
	(22, 01, 22, 200, N'前岗乡'),
	(22, 01, 22, 201, N'龙王乡'),
	(22, 01, 22, 203, N'万顺乡'),
	(22, 01, 22, 204, N'杨树林乡'),
	(22, 01, 22, 205, N'永安乡'),
	(22, 01, 22, 206, N'青山口乡'),
	(22, 01, 22, 207, N'黄鱼圈乡'),
	(22, 01, 22, 208, N'新农乡'),
	(22, 01, 22, 209, N'万金塔乡'),
	(22, 01, 22, 210, N'小城子乡');

/* 吉林省 长春市 榆树市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 01, 82, 001, N'华昌街道办事处'),
	(22, 01, 82, 002, N'正阳街道办事处'),
	(22, 01, 82, 003, N'培英街道办事处'),
	(22, 01, 82, 004, N'城郊街道办事处'),
	(22, 01, 82, 100, N'五棵树镇'),
	(22, 01, 82, 101, N'弓棚镇'),
	(22, 01, 82, 102, N'闵家镇'),
	(22, 01, 82, 103, N'大坡镇'),
	(22, 01, 82, 104, N'黑林镇'),
	(22, 01, 82, 105, N'土桥镇'),
	(22, 01, 82, 106, N'新立镇'),
	(22, 01, 82, 107, N'大岭镇'),
	(22, 01, 82, 108, N'于家镇'),
	(22, 01, 82, 109, N'泗河镇'),
	(22, 01, 82, 110, N'八号镇'),
	(22, 01, 82, 111, N'刘家镇'),
	(22, 01, 82, 112, N'秀水镇'),
	(22, 01, 82, 113, N'保寿镇'),
	(22, 01, 82, 114, N'新庄镇'),
	(22, 01, 82, 200, N'育民乡'),
	(22, 01, 82, 201, N'红星乡'),
	(22, 01, 82, 202, N'太安乡'),
	(22, 01, 82, 203, N'先峰乡'),
	(22, 01, 82, 204, N'青山乡'),
	(22, 01, 82, 205, N'延和朝鲜族乡'),
	(22, 01, 82, 206, N'恩育乡'),
	(22, 01, 82, 207, N'城发乡'),
	(22, 01, 82, 208, N'环城乡');

/* 吉林省 长春市 德惠市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 01, 83, 001, N'胜利街道办事处'),
	(22, 01, 83, 002, N'建设街道办事处'),
	(22, 01, 83, 003, N'惠发街道办事处'),
	(22, 01, 83, 004, N'夏家店街道办事处'),
	(22, 01, 83, 100, N'大青嘴镇'),
	(22, 01, 83, 101, N'郭家镇'),
	(22, 01, 83, 102, N'松花江镇'),
	(22, 01, 83, 103, N'达家沟镇'),
	(22, 01, 83, 104, N'大房身镇'),
	(22, 01, 83, 105, N'岔路口镇'),
	(22, 01, 83, 106, N'朱城子镇'),
	(22, 01, 83, 107, N'布海镇'),
	(22, 01, 83, 108, N'天台镇'),
	(22, 01, 83, 109, N'菜园子镇'),
	(22, 01, 83, 200, N'同太乡'),
	(22, 01, 83, 201, N'边岗乡'),
	(22, 01, 83, 202, N'五台乡'),
	(22, 01, 83, 203, N'朝阳乡');

/* 吉林省 吉林市 昌邑区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 02, 02, 001, N'兴华街道办事处'),
	(22, 02, 02, 002, N'文庙街道办事处'),
	(22, 02, 02, 003, N'东局子街道办事处'),
	(22, 02, 02, 004, N'新地号街道办事处'),
	(22, 02, 02, 005, N'延安街道办事处'),
	(22, 02, 02, 006, N'站前街道办事处'),
	(22, 02, 02, 007, N'民主街道办事处'),
	(22, 02, 02, 008, N'莲花街道办事处'),
	(22, 02, 02, 009, N'通江街道办事处'),
	(22, 02, 02, 010, N'哈达湾街道办事处'),
	(22, 02, 02, 011, N'新建街道办事处'),
	(22, 02, 02, 012, N'延江街道办事处'),
	(22, 02, 02, 013, N'双吉街道办事处'),
	(22, 02, 02, 071, N'吉林东市商贸示范区'),
	(22, 02, 02, 100, N'孤店子镇'),
	(22, 02, 02, 101, N'桦皮厂镇'),
	(22, 02, 02, 102, N'左家镇'),
	(22, 02, 02, 200, N'两家子满族乡'),
	(22, 02, 02, 201, N'土城子满族朝鲜族乡');

/* 吉林省 吉林市 龙潭区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 02, 03, 001, N'龙华街道办事处'),
	(22, 02, 03, 002, N'湘潭街道办事处'),
	(22, 02, 03, 003, N'铁东街道办事处'),
	(22, 02, 03, 004, N'泡子沿街道办事处'),
	(22, 02, 03, 005, N'龙潭街道办事处'),
	(22, 02, 03, 006, N'新吉林街道办事处'),
	(22, 02, 03, 007, N'山前街道办事处'),
	(22, 02, 03, 008, N'新安街道办事处'),
	(22, 02, 03, 009, N'遵义街道办事处'),
	(22, 02, 03, 010, N'榆树街道办事处'),
	(22, 02, 03, 012, N'东城街道办事处'),
	(22, 02, 03, 013, N'承德街道办事处'),
	(22, 02, 03, 072, N'靠山街道办事处'),
	(22, 02, 03, 100, N'乌拉街镇'),
	(22, 02, 03, 101, N'缸窑镇'),
	(22, 02, 03, 102, N'江密峰镇'),
	(22, 02, 03, 103, N'大口钦镇'),
	(22, 02, 03, 104, N'金珠镇'),
	(22, 02, 03, 200, N'江北乡');

/* 吉林省 吉林市 船营区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 02, 04, 001, N'德胜街道办事处'),
	(22, 02, 04, 002, N'南京街道办事处'),
	(22, 02, 04, 003, N'大东街道办事处'),
	(22, 02, 04, 004, N'青岛街道办事处'),
	(22, 02, 04, 005, N'向阳街道办事处'),
	(22, 02, 04, 006, N'北极街道办事处'),
	(22, 02, 04, 007, N'致和街道办事处'),
	(22, 02, 04, 008, N'长春路街道办事处'),
	(22, 02, 04, 009, N'临江街道办事处'),
	(22, 02, 04, 010, N'北山街道办事处'),
	(22, 02, 04, 011, N'黄旗屯街道办事处'),
	(22, 02, 04, 100, N'大绥河镇'),
	(22, 02, 04, 101, N'搜登站镇'),
	(22, 02, 04, 102, N'越北镇'),
	(22, 02, 04, 200, N'欢喜乡');

/* 吉林省 吉林市 丰满区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 02, 11, 001, N'泰山街道办事处'),
	(22, 02, 11, 002, N'江南街道办事处'),
	(22, 02, 11, 003, N'石井街道办事处'),
	(22, 02, 11, 004, N'沿丰街道办事处'),
	(22, 02, 11, 005, N'丰满街道办事处'),
	(22, 02, 11, 071, N'红旗街道办事处'),
	(22, 02, 11, 100, N'旺起镇'),
	(22, 02, 11, 200, N'江南乡'),
	(22, 02, 11, 201, N'前二道乡'),
	(22, 02, 11, 250, N'小白山乡');

/* 吉林省 吉林市 永吉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 02, 21, 100, N'口前镇'),
	(22, 02, 21, 101, N'双河镇'),
	(22, 02, 21, 102, N'西阳镇'),
	(22, 02, 21, 103, N'北大湖镇'),
	(22, 02, 21, 104, N'一拉溪镇'),
	(22, 02, 21, 171, N'万昌镇'),
	(22, 02, 21, 172, N'永吉经济开发区'),
	(22, 02, 21, 200, N'金家乡'),
	(22, 02, 21, 201, N'黄榆乡');

/* 吉林省 吉林市 蛟河市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 02, 81, 001, N'民主街道办事处'),
	(22, 02, 81, 002, N'长安街道办事处'),
	(22, 02, 81, 003, N'河南街道办事处'),
	(22, 02, 81, 004, N'奶子山街道办事处'),
	(22, 02, 81, 005, N'拉法街道办事处'),
	(22, 02, 81, 006, N'河北街道办事处'),
	(22, 02, 81, 007, N'新农街道办事处'),
	(22, 02, 81, 100, N'新站镇'),
	(22, 02, 81, 101, N'天岗镇'),
	(22, 02, 81, 102, N'白石山镇'),
	(22, 02, 81, 103, N'漂河镇'),
	(22, 02, 81, 104, N'黄松甸镇'),
	(22, 02, 81, 105, N'天北镇'),
	(22, 02, 81, 106, N'松江镇'),
	(22, 02, 81, 107, N'庆岭镇'),
	(22, 02, 81, 200, N'乌林朝鲜族乡'),
	(22, 02, 81, 201, N'前进乡');

/* 吉林省 吉林市 桦甸市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 02, 82, 001, N'明桦街道办事处'),
	(22, 02, 82, 002, N'永吉街道办事处'),
	(22, 02, 82, 003, N'胜利街道办事处'),
	(22, 02, 82, 004, N'新华街道办事处'),
	(22, 02, 82, 005, N'启新街道办事处'),
	(22, 02, 82, 100, N'夹皮沟镇'),
	(22, 02, 82, 101, N'二道甸子镇'),
	(22, 02, 82, 102, N'红石砬子镇'),
	(22, 02, 82, 103, N'八道河子镇'),
	(22, 02, 82, 104, N'常山镇'),
	(22, 02, 82, 105, N'金沙镇'),
	(22, 02, 82, 200, N'桦郊乡'),
	(22, 02, 82, 201, N'横道河子乡'),
	(22, 02, 82, 204, N'公吉乡');

/* 吉林省 吉林市 舒兰市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 02, 83, 001, N'北城街道办事处'),
	(22, 02, 83, 002, N'南城街道办事处'),
	(22, 02, 83, 003, N'环城街道办事处'),
	(22, 02, 83, 004, N'吉舒街道办事处'),
	(22, 02, 83, 005, N'铁东街道办事处'),
	(22, 02, 83, 100, N'法特镇'),
	(22, 02, 83, 101, N'白旗镇'),
	(22, 02, 83, 102, N'溪河镇'),
	(22, 02, 83, 103, N'朝阳镇'),
	(22, 02, 83, 104, N'小城镇'),
	(22, 02, 83, 105, N'上营镇'),
	(22, 02, 83, 106, N'水曲柳镇'),
	(22, 02, 83, 107, N'平安镇'),
	(22, 02, 83, 108, N'金马镇'),
	(22, 02, 83, 109, N'开原镇'),
	(22, 02, 83, 200, N'莲花乡'),
	(22, 02, 83, 201, N'亮甲山乡'),
	(22, 02, 83, 202, N'新安乡'),
	(22, 02, 83, 203, N'七里乡'),
	(22, 02, 83, 204, N'天德乡');

/* 吉林省 吉林市 磐石市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 02, 84, 001, N'福安街道办事处'),
	(22, 02, 84, 002, N'东宁街道办事处'),
	(22, 02, 84, 003, N'河南街道办事处'),
	(22, 02, 84, 070, N'磐石经济开发区（省级）'),
	(22, 02, 84, 100, N'烟筒山镇'),
	(22, 02, 84, 101, N'红旗岭镇'),
	(22, 02, 84, 102, N'明城镇'),
	(22, 02, 84, 103, N'石嘴镇'),
	(22, 02, 84, 104, N'驿马镇'),
	(22, 02, 84, 105, N'牛心镇'),
	(22, 02, 84, 106, N'呼兰镇'),
	(22, 02, 84, 107, N'吉昌镇'),
	(22, 02, 84, 108, N'松山镇'),
	(22, 02, 84, 109, N'黑石镇'),
	(22, 02, 84, 110, N'朝阳山镇'),
	(22, 02, 84, 111, N'富太镇'),
	(22, 02, 84, 112, N'取柴河镇'),
	(22, 02, 84, 200, N'宝山乡');

/* 吉林省 四平市 铁西区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 03, 02, 001, N'仁兴街道办事处'),
	(22, 03, 02, 002, N'英雄街道办事处'),
	(22, 03, 02, 003, N'站前街道办事处'),
	(22, 03, 02, 004, N'北沟街道办事处'),
	(22, 03, 02, 005, N'地直街道办事处'),
	(22, 03, 02, 200, N'平西乡');

/* 吉林省 四平市 铁东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 03, 03, 001, N'平东街道办事处'),
	(22, 03, 03, 002, N'北市场街道办事处'),
	(22, 03, 03, 003, N'七马路街道办事处'),
	(22, 03, 03, 004, N'四马路街道办事处'),
	(22, 03, 03, 005, N'解放街道办事处'),
	(22, 03, 03, 006, N'北门街道办事处'),
	(22, 03, 03, 007, N'黄土坑街道办事处'),
	(22, 03, 03, 008, N'平南街道办事处'),
	(22, 03, 03, 100, N'山门镇'),
	(22, 03, 03, 101, N'石岭镇'),
	(22, 03, 03, 102, N'叶赫满族镇'),
	(22, 03, 03, 170, N'四平经济开发区（省级）'),
	(22, 03, 03, 200, N'城东乡');

/* 吉林省 四平市 梨树县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 03, 22, 100, N'梨树镇'),
	(22, 03, 22, 101, N'郭家店镇'),
	(22, 03, 22, 102, N'榆树台镇'),
	(22, 03, 22, 103, N'孤家子镇（四平辽河农垦管理区）'),
	(22, 03, 22, 104, N'小城子镇'),
	(22, 03, 22, 105, N'喇嘛甸镇'),
	(22, 03, 22, 106, N'蔡家镇'),
	(22, 03, 22, 107, N'刘家馆子镇'),
	(22, 03, 22, 108, N'十家堡镇'),
	(22, 03, 22, 109, N'孟家岭镇'),
	(22, 03, 22, 110, N'万发镇'),
	(22, 03, 22, 111, N'东河镇'),
	(22, 03, 22, 112, N'沈洋镇'),
	(22, 03, 22, 113, N'林海镇'),
	(22, 03, 22, 114, N'小宽镇'),
	(22, 03, 22, 200, N'白山乡'),
	(22, 03, 22, 201, N'泉眼岭乡'),
	(22, 03, 22, 202, N'胜利乡'),
	(22, 03, 22, 203, N'四棵树乡'),
	(22, 03, 22, 204, N'双河乡'),
	(22, 03, 22, 205, N'金山乡');

/* 吉林省 四平市 伊通满族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 03, 23, 100, N'伊通镇'),
	(22, 03, 23, 101, N'二道镇'),
	(22, 03, 23, 102, N'伊丹镇'),
	(22, 03, 23, 103, N'马鞍镇'),
	(22, 03, 23, 104, N'景台镇'),
	(22, 03, 23, 105, N'靠山镇'),
	(22, 03, 23, 106, N'大孤山镇'),
	(22, 03, 23, 107, N'小孤山镇'),
	(22, 03, 23, 108, N'营城子镇'),
	(22, 03, 23, 109, N'西苇镇'),
	(22, 03, 23, 110, N'河源镇'),
	(22, 03, 23, 111, N'黄岭子镇'),
	(22, 03, 23, 200, N'新兴乡'),
	(22, 03, 23, 201, N'莫里青乡'),
	(22, 03, 23, 202, N'三道乡');

/* 吉林省 四平市 公主岭市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 03, 81, 001, N'河南街道办事处'),
	(22, 03, 81, 002, N'河北街道办事处'),
	(22, 03, 81, 003, N'东三街道办事处'),
	(22, 03, 81, 004, N'岭东街道办事处'),
	(22, 03, 81, 005, N'铁北街道办事处'),
	(22, 03, 81, 006, N'岭西街道办事处'),
	(22, 03, 81, 007, N'刘房子街道办事处'),
	(22, 03, 81, 008, N'南崴子街道办事处'),
	(22, 03, 81, 009, N'环岭街道办事处'),
	(22, 03, 81, 010, N'苇子沟街道办事处'),
	(22, 03, 81, 100, N'二十家子镇'),
	(22, 03, 81, 101, N'黑林子镇'),
	(22, 03, 81, 102, N'陶家屯镇'),
	(22, 03, 81, 103, N'范家屯镇'),
	(22, 03, 81, 104, N'响水镇'),
	(22, 03, 81, 105, N'大岭镇'),
	(22, 03, 81, 106, N'怀德镇'),
	(22, 03, 81, 107, N'双城堡镇'),
	(22, 03, 81, 108, N'双龙镇'),
	(22, 03, 81, 109, N'杨大城子镇'),
	(22, 03, 81, 110, N'毛城子镇'),
	(22, 03, 81, 111, N'玻璃城子镇'),
	(22, 03, 81, 112, N'朝阳坡镇'),
	(22, 03, 81, 113, N'大榆树镇'),
	(22, 03, 81, 114, N'秦家屯镇'),
	(22, 03, 81, 115, N'八屋镇'),
	(22, 03, 81, 116, N'十屋镇'),
	(22, 03, 81, 117, N'桑树台镇'),
	(22, 03, 81, 200, N'龙山乡'),
	(22, 03, 81, 201, N'永发乡');

/* 吉林省 四平市 双辽市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 03, 82, 001, N'郑家屯街道办事处'),
	(22, 03, 82, 002, N'辽西街道办事处'),
	(22, 03, 82, 003, N'辽南街道办事处'),
	(22, 03, 82, 004, N'辽北街道办事处'),
	(22, 03, 82, 005, N'辽东街道办事处'),
	(22, 03, 82, 006, N'红旗街道办事处'),
	(22, 03, 82, 100, N'茂林镇'),
	(22, 03, 82, 101, N'双山镇'),
	(22, 03, 82, 102, N'卧虎镇'),
	(22, 03, 82, 103, N'服先镇'),
	(22, 03, 82, 104, N'王奔镇'),
	(22, 03, 82, 105, N'玻璃山镇'),
	(22, 03, 82, 106, N'兴隆镇'),
	(22, 03, 82, 107, N'东明镇'),
	(22, 03, 82, 200, N'那木乡'),
	(22, 03, 82, 201, N'柳条乡'),
	(22, 03, 82, 202, N'新立乡'),
	(22, 03, 82, 203, N'永加乡');

/* 吉林省 辽源市 龙山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 04, 02, 070, N'辽源民营经济开发区'),
	(22, 04, 02, 100, N'寿山镇'),
	(22, 04, 02, 198, N'县级直管村级单位'),
	(22, 04, 02, 200, N'工农乡');

/* 吉林省 辽源市 西安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 04, 03, 100, N'灯塔镇'),
	(22, 04, 03, 198, N'县级直管村级单位');

/* 吉林省 辽源市 东丰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 04, 21, 100, N'东丰镇'),
	(22, 04, 21, 101, N'大阳镇'),
	(22, 04, 21, 102, N'横道河镇'),
	(22, 04, 21, 103, N'那丹伯镇'),
	(22, 04, 21, 104, N'猴石镇'),
	(22, 04, 21, 105, N'杨木林镇'),
	(22, 04, 21, 106, N'小四平镇'),
	(22, 04, 21, 107, N'黄河镇'),
	(22, 04, 21, 108, N'拉拉河镇'),
	(22, 04, 21, 109, N'沙河镇'),
	(22, 04, 21, 110, N'南屯基镇'),
	(22, 04, 21, 111, N'大兴镇'),
	(22, 04, 21, 200, N'三合满族朝鲜族乡'),
	(22, 04, 21, 201, N'二龙山乡');

/* 吉林省 辽源市 东辽县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 04, 22, 100, N'白泉镇'),
	(22, 04, 22, 101, N'渭津镇'),
	(22, 04, 22, 102, N'安石镇'),
	(22, 04, 22, 103, N'辽河源镇'),
	(22, 04, 22, 104, N'泉太镇'),
	(22, 04, 22, 105, N'建安镇'),
	(22, 04, 22, 106, N'安恕镇'),
	(22, 04, 22, 107, N'平岗镇'),
	(22, 04, 22, 108, N'云顶镇'),
	(22, 04, 22, 200, N'凌云乡'),
	(22, 04, 22, 201, N'甲山乡'),
	(22, 04, 22, 202, N'足民乡'),
	(22, 04, 22, 203, N'金洲乡');

/* 吉林省 通化市 东昌区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 05, 02, 001, N'东昌街道办事处'),
	(22, 05, 02, 002, N'民主街道办事处'),
	(22, 05, 02, 003, N'老站街道办事处'),
	(22, 05, 02, 004, N'团结街道办事处'),
	(22, 05, 02, 005, N'新站街道办事处'),
	(22, 05, 02, 006, N'光明街道办事处'),
	(22, 05, 02, 007, N'龙泉街道办事处'),
	(22, 05, 02, 100, N'金厂镇'),
	(22, 05, 02, 120, N'通化经济开发区'),
	(22, 05, 02, 200, N'环通乡'),
	(22, 05, 02, 201, N'江东乡');

/* 吉林省 通化市 二道江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 05, 03, 001, N'桃园街道办事处'),
	(22, 05, 03, 002, N'东通化街道办事处'),
	(22, 05, 03, 100, N'鸭园镇'),
	(22, 05, 03, 101, N'铁厂镇'),
	(22, 05, 03, 102, N'五道江镇'),
	(22, 05, 03, 200, N'二道江乡');

/* 吉林省 通化市 通化县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 05, 21, 100, N'快大茂镇'),
	(22, 05, 21, 101, N'二密镇'),
	(22, 05, 21, 102, N'果松镇'),
	(22, 05, 21, 103, N'石湖镇'),
	(22, 05, 21, 104, N'大安镇'),
	(22, 05, 21, 105, N'光华镇'),
	(22, 05, 21, 106, N'兴林镇'),
	(22, 05, 21, 107, N'英额布镇'),
	(22, 05, 21, 108, N'三棵榆树镇'),
	(22, 05, 21, 109, N'西江镇'),
	(22, 05, 21, 120, N'通化聚鑫经济开发区管理委员会'),
	(22, 05, 21, 200, N'富江乡'),
	(22, 05, 21, 201, N'四棚乡'),
	(22, 05, 21, 202, N'东来乡'),
	(22, 05, 21, 203, N'大泉源满族朝鲜族乡'),
	(22, 05, 21, 204, N'金斗朝鲜族满族乡');

/* 吉林省 通化市 辉南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 05, 23, 100, N'朝阳镇'),
	(22, 05, 23, 101, N'辉南镇'),
	(22, 05, 23, 102, N'样子哨镇'),
	(22, 05, 23, 103, N'杉松岗镇'),
	(22, 05, 23, 104, N'石道河镇'),
	(22, 05, 23, 105, N'辉发城镇'),
	(22, 05, 23, 106, N'抚民镇'),
	(22, 05, 23, 107, N'金川镇'),
	(22, 05, 23, 108, N'团林镇'),
	(22, 05, 23, 109, N'庆阳镇'),
	(22, 05, 23, 200, N'楼街朝鲜族乡');

/* 吉林省 通化市 柳河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 05, 24, 100, N'柳河镇'),
	(22, 05, 24, 101, N'三源浦朝鲜族镇'),
	(22, 05, 24, 102, N'五道沟镇'),
	(22, 05, 24, 103, N'驼腰岭镇'),
	(22, 05, 24, 104, N'孤山子镇'),
	(22, 05, 24, 105, N'圣水河子镇'),
	(22, 05, 24, 106, N'罗通山镇'),
	(22, 05, 24, 107, N'安口镇'),
	(22, 05, 24, 108, N'向阳镇'),
	(22, 05, 24, 109, N'红石镇'),
	(22, 05, 24, 110, N'凉水河子镇'),
	(22, 05, 24, 111, N'亨通镇'),
	(22, 05, 24, 200, N'柳南乡'),
	(22, 05, 24, 201, N'时家店乡'),
	(22, 05, 24, 202, N'姜家店朝鲜族乡');

/* 吉林省 通化市 梅河口市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 05, 81, 001, N'新华街道办事处'),
	(22, 05, 81, 002, N'光明街道办事处'),
	(22, 05, 81, 070, N'和平街道办事处（梅河口市经济贸易开发区）（省级）'),
	(22, 05, 81, 071, N'解放街道办事处（梅河口市经济贸易开发区）（省级）'),
	(22, 05, 81, 072, N'福民街道办事处（梅河口市经济贸易开发区）（省级）'),
	(22, 05, 81, 100, N'山城镇'),
	(22, 05, 81, 101, N'红梅镇'),
	(22, 05, 81, 102, N'海龙镇'),
	(22, 05, 81, 103, N'新合镇'),
	(22, 05, 81, 104, N'曙光镇'),
	(22, 05, 81, 105, N'中和镇'),
	(22, 05, 81, 106, N'黑山头镇'),
	(22, 05, 81, 107, N'水道镇'),
	(22, 05, 81, 108, N'进化镇'),
	(22, 05, 81, 109, N'一座营镇'),
	(22, 05, 81, 110, N'康大营镇'),
	(22, 05, 81, 111, N'牛心顶镇'),
	(22, 05, 81, 112, N'杏岭镇'),
	(22, 05, 81, 113, N'湾龙镇'),
	(22, 05, 81, 114, N'兴华镇'),
	(22, 05, 81, 115, N'双兴镇'),
	(22, 05, 81, 201, N'李炉乡'),
	(22, 05, 81, 205, N'小杨满族朝鲜族乡'),
	(22, 05, 81, 206, N'吉乐乡');

/* 吉林省 通化市 集安市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 05, 82, 001, N'团结街道办事处'),
	(22, 05, 82, 002, N'黎明街道办事处'),
	(22, 05, 82, 003, N'通胜街道办事处'),
	(22, 05, 82, 100, N'青石镇'),
	(22, 05, 82, 101, N'榆林镇'),
	(22, 05, 82, 102, N'花甸镇'),
	(22, 05, 82, 103, N'头道镇'),
	(22, 05, 82, 104, N'清河镇'),
	(22, 05, 82, 105, N'台上镇'),
	(22, 05, 82, 106, N'财源镇'),
	(22, 05, 82, 107, N'大路镇'),
	(22, 05, 82, 108, N'太王镇'),
	(22, 05, 82, 200, N'麻线乡'),
	(22, 05, 82, 201, N'凉水朝鲜族乡');

/* 吉林省 白山市 浑江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 06, 02, 001, N'新建街道办事处'),
	(22, 06, 02, 002, N'通沟街道办事处'),
	(22, 06, 02, 003, N'东兴街道办事处'),
	(22, 06, 02, 004, N'红旗街道办事处'),
	(22, 06, 02, 005, N'城南街道办事处'),
	(22, 06, 02, 006, N'江北街道办事处'),
	(22, 06, 02, 007, N'河口街道办事处'),
	(22, 06, 02, 008, N'板石街道办事处'),
	(22, 06, 02, 100, N'七道江镇'),
	(22, 06, 02, 101, N'六道江镇'),
	(22, 06, 02, 102, N'红土崖镇'),
	(22, 06, 02, 103, N'三道沟镇');

/* 吉林省 白山市 江源区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 06, 05, 001, N'孙家堡子街道办事处'),
	(22, 06, 05, 002, N'江源街道办事处'),
	(22, 06, 05, 003, N'正岔街道办事处'),
	(22, 06, 05, 004, N'城墙街道办事处'),
	(22, 06, 05, 102, N'湾沟镇'),
	(22, 06, 05, 103, N'松树镇'),
	(22, 06, 05, 104, N'砟子镇'),
	(22, 06, 05, 105, N'石人镇'),
	(22, 06, 05, 106, N'大阳岔镇'),
	(22, 06, 05, 107, N'大石人镇');

/* 吉林省 白山市 抚松县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 06, 21, 100, N'抚松镇'),
	(22, 06, 21, 101, N'松江河镇'),
	(22, 06, 21, 102, N'泉阳镇'),
	(22, 06, 21, 103, N'露水河镇'),
	(22, 06, 21, 104, N'仙人桥镇'),
	(22, 06, 21, 105, N'万良镇'),
	(22, 06, 21, 106, N'新屯子镇'),
	(22, 06, 21, 107, N'东岗镇'),
	(22, 06, 21, 108, N'漫江镇'),
	(22, 06, 21, 109, N'北岗镇'),
	(22, 06, 21, 110, N'兴参镇'),
	(22, 06, 21, 120, N'长白山保护开发区管委会池西区'),
	(22, 06, 21, 121, N'长白山保护开发区管委会池南区'),
	(22, 06, 21, 200, N'兴隆乡'),
	(22, 06, 21, 201, N'抽水乡'),
	(22, 06, 21, 202, N'沿江乡');

/* 吉林省 白山市 靖宇县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 06, 22, 100, N'靖宇镇'),
	(22, 06, 22, 101, N'三道湖镇'),
	(22, 06, 22, 102, N'龙泉镇'),
	(22, 06, 22, 103, N'那尔轰镇'),
	(22, 06, 22, 104, N'花园口镇'),
	(22, 06, 22, 105, N'景山镇'),
	(22, 06, 22, 106, N'赤松镇'),
	(22, 06, 22, 201, N'蒙江乡');

/* 吉林省 白山市 长白朝鲜族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 06, 23, 100, N'长白镇'),
	(22, 06, 23, 101, N'八道沟镇'),
	(22, 06, 23, 102, N'十四道沟镇'),
	(22, 06, 23, 103, N'马鹿沟镇'),
	(22, 06, 23, 104, N'宝泉山镇'),
	(22, 06, 23, 105, N'新房子镇'),
	(22, 06, 23, 106, N'十二道沟镇'),
	(22, 06, 23, 200, N'金华乡');

/* 吉林省 白山市 临江市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 06, 81, 001, N'建国街道办事处'),
	(22, 06, 81, 002, N'新市街道办事处'),
	(22, 06, 81, 003, N'兴隆街道办事处'),
	(22, 06, 81, 004, N'大湖街道办事处'),
	(22, 06, 81, 005, N'森工街道办事处'),
	(22, 06, 81, 006, N'大栗子街道办事处'),
	(22, 06, 81, 100, N'桦树镇'),
	(22, 06, 81, 101, N'六道沟镇'),
	(22, 06, 81, 102, N'苇沙河镇'),
	(22, 06, 81, 103, N'花山镇'),
	(22, 06, 81, 104, N'闹枝镇'),
	(22, 06, 81, 105, N'四道沟镇'),
	(22, 06, 81, 200, N'蚂蚁河乡');

/* 吉林省 松原市 宁江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 07, 02, 001, N'团结街道办事处'),
	(22, 07, 02, 002, N'文化街道办事处'),
	(22, 07, 02, 003, N'民主街道办事处'),
	(22, 07, 02, 004, N'临江街道办事处'),
	(22, 07, 02, 005, N'新区街道办事处'),
	(22, 07, 02, 006, N'前进街道办事处'),
	(22, 07, 02, 007, N'和平街道办事处'),
	(22, 07, 02, 008, N'工农街道办事处'),
	(22, 07, 02, 009, N'沿江街道办事处'),
	(22, 07, 02, 010, N'铁西街道办事处'),
	(22, 07, 02, 011, N'繁荣街道办事处'),
	(22, 07, 02, 012, N'建设街道办事处'),
	(22, 07, 02, 013, N'石化街道办事处'),
	(22, 07, 02, 014, N'伯都讷街道办事处'),
	(22, 07, 02, 015, N'长宁街道办事处'),
	(22, 07, 02, 016, N'滨江街道办事处'),
	(22, 07, 02, 017, N'镜湖街道办事处'),
	(22, 07, 02, 100, N'大洼镇'),
	(22, 07, 02, 101, N'善友镇'),
	(22, 07, 02, 102, N'毛都站镇'),
	(22, 07, 02, 103, N'哈达山镇'),
	(22, 07, 02, 200, N'新城乡'),
	(22, 07, 02, 202, N'伯都乡');

/* 吉林省 松原市 前郭尔罗斯蒙古族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 07, 21, 100, N'前郭尔罗斯镇'),
	(22, 07, 21, 101, N'长山镇'),
	(22, 07, 21, 102, N'海渤日戈镇'),
	(22, 07, 21, 103, N'乌兰图嘎镇'),
	(22, 07, 21, 104, N'查干花镇'),
	(22, 07, 21, 105, N'王府站镇'),
	(22, 07, 21, 106, N'八郎镇'),
	(22, 07, 21, 107, N'哈拉毛都镇'),
	(22, 07, 21, 108, N'查干湖镇'),
	(22, 07, 21, 200, N'宝甸乡'),
	(22, 07, 21, 201, N'平凤乡'),
	(22, 07, 21, 203, N'达里巴乡'),
	(22, 07, 21, 204, N'吉拉吐乡'),
	(22, 07, 21, 205, N'白依拉嘎乡'),
	(22, 07, 21, 206, N'洪泉乡'),
	(22, 07, 21, 207, N'额如乡'),
	(22, 07, 21, 208, N'套浩太乡'),
	(22, 07, 21, 209, N'长龙乡'),
	(22, 07, 21, 210, N'乌兰塔拉乡'),
	(22, 07, 21, 211, N'东三家子乡'),
	(22, 07, 21, 212, N'浩特芒哈乡'),
	(22, 07, 21, 213, N'乌兰敖都乡');

/* 吉林省 松原市 长岭县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 07, 22, 100, N'长岭镇'),
	(22, 07, 22, 101, N'太平川镇'),
	(22, 07, 22, 102, N'巨宝镇'),
	(22, 07, 22, 103, N'太平山镇'),
	(22, 07, 22, 104, N'前七号镇'),
	(22, 07, 22, 105, N'新安镇'),
	(22, 07, 22, 106, N'三青山镇'),
	(22, 07, 22, 107, N'大兴镇'),
	(22, 07, 22, 108, N'北正镇'),
	(22, 07, 22, 109, N'流水镇'),
	(22, 07, 22, 110, N'永久镇'),
	(22, 07, 22, 111, N'利发盛镇'),
	(22, 07, 22, 120, N'太平川（镇）农业园区'),
	(22, 07, 22, 122, N'双龙工业园区'),
	(22, 07, 22, 123, N'长岭经济开发区'),
	(22, 07, 22, 200, N'集体乡'),
	(22, 07, 22, 201, N'光明乡'),
	(22, 07, 22, 202, N'三县堡乡'),
	(22, 07, 22, 203, N'海青乡'),
	(22, 07, 22, 204, N'前进乡'),
	(22, 07, 22, 205, N'东岭乡'),
	(22, 07, 22, 206, N'腰坨子乡'),
	(22, 07, 22, 207, N'八十八乡'),
	(22, 07, 22, 208, N'三团乡'),
	(22, 07, 22, 209, N'三十号乡');

/* 吉林省 松原市 乾安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 07, 23, 100, N'乾安镇'),
	(22, 07, 23, 101, N'大布苏镇'),
	(22, 07, 23, 102, N'水字镇'),
	(22, 07, 23, 103, N'让字镇'),
	(22, 07, 23, 104, N'所字镇'),
	(22, 07, 23, 105, N'安字镇'),
	(22, 07, 23, 200, N'余字乡'),
	(22, 07, 23, 201, N'道字乡'),
	(22, 07, 23, 202, N'严字乡'),
	(22, 07, 23, 203, N'赞字乡');

/* 吉林省 松原市 扶余市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 07, 81, 001, N'和兴街道办事处'),
	(22, 07, 81, 002, N'育才街道办事处'),
	(22, 07, 81, 003, N'联盟街道办事处'),
	(22, 07, 81, 004, N'士英街道办事处'),
	(22, 07, 81, 005, N'铁西街道办事处'),
	(22, 07, 81, 100, N'三岔河镇'),
	(22, 07, 81, 101, N'长春岭镇'),
	(22, 07, 81, 102, N'五家站镇'),
	(22, 07, 81, 103, N'陶赖昭镇'),
	(22, 07, 81, 104, N'蔡家沟镇'),
	(22, 07, 81, 105, N'弓棚子镇'),
	(22, 07, 81, 106, N'三井子镇'),
	(22, 07, 81, 107, N'增盛镇'),
	(22, 07, 81, 108, N'新万发镇'),
	(22, 07, 81, 109, N'大林子镇'),
	(22, 07, 81, 110, N'新源镇'),
	(22, 07, 81, 111, N'得胜镇'),
	(22, 07, 81, 200, N'三骏满族蒙古族锡伯族乡'),
	(22, 07, 81, 201, N'永平乡'),
	(22, 07, 81, 203, N'新站乡'),
	(22, 07, 81, 204, N'更新乡'),
	(22, 07, 81, 206, N'肖家乡');

/* 吉林省 白城市 洮北区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 08, 02, 001, N'海明街道办事处'),
	(22, 08, 02, 002, N'长庆街道办事处'),
	(22, 08, 02, 003, N'瑞光街道办事处'),
	(22, 08, 02, 004, N'明仁街道办事处'),
	(22, 08, 02, 005, N'铁东街道办事处'),
	(22, 08, 02, 006, N'城南街道办事处（工业园区）'),
	(22, 08, 02, 007, N'新立街道办事处'),
	(22, 08, 02, 009, N'新华街道办事处'),
	(22, 08, 02, 100, N'平安镇'),
	(22, 08, 02, 101, N'青山镇'),
	(22, 08, 02, 102, N'林海镇'),
	(22, 08, 02, 103, N'洮河镇'),
	(22, 08, 02, 104, N'平台镇'),
	(22, 08, 02, 105, N'到保镇'),
	(22, 08, 02, 170, N'岭下镇（查干浩特旅游经济开发区）（省级）'),
	(22, 08, 02, 200, N'东风乡'),
	(22, 08, 02, 201, N'三合乡'),
	(22, 08, 02, 202, N'东胜乡'),
	(22, 08, 02, 203, N'金祥乡'),
	(22, 08, 02, 204, N'德顺蒙古族乡');

/* 吉林省 白城市 镇赉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 08, 21, 100, N'镇赉镇'),
	(22, 08, 21, 101, N'坦途镇'),
	(22, 08, 21, 102, N'东屏镇'),
	(22, 08, 21, 103, N'大屯镇'),
	(22, 08, 21, 104, N'沿江镇'),
	(22, 08, 21, 105, N'五棵树镇'),
	(22, 08, 21, 106, N'黑鱼泡镇'),
	(22, 08, 21, 200, N'哈吐气蒙古族乡'),
	(22, 08, 21, 201, N'莫莫格蒙古族乡'),
	(22, 08, 21, 202, N'建平乡'),
	(22, 08, 21, 203, N'嘎什根乡');

/* 吉林省 白城市 通榆县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 08, 22, 100, N'开通镇'),
	(22, 08, 22, 101, N'瞻榆镇'),
	(22, 08, 22, 102, N'双岗镇'),
	(22, 08, 22, 103, N'兴隆山镇'),
	(22, 08, 22, 104, N'边昭镇'),
	(22, 08, 22, 105, N'鸿兴镇'),
	(22, 08, 22, 106, N'新华镇'),
	(22, 08, 22, 107, N'乌兰花镇'),
	(22, 08, 22, 200, N'新发乡'),
	(22, 08, 22, 201, N'新兴乡'),
	(22, 08, 22, 202, N'向海蒙古族乡'),
	(22, 08, 22, 203, N'包拉温都蒙古族乡'),
	(22, 08, 22, 204, N'团结乡'),
	(22, 08, 22, 205, N'十花道乡'),
	(22, 08, 22, 206, N'八面乡'),
	(22, 08, 22, 207, N'苏公坨乡');

/* 吉林省 白城市 洮南市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 08, 81, 001, N'团结街道办事处'),
	(22, 08, 81, 002, N'富文街道办事处'),
	(22, 08, 81, 003, N'光明街道办事处'),
	(22, 08, 81, 004, N'兴隆街道办事处'),
	(22, 08, 81, 005, N'永康街道办事处'),
	(22, 08, 81, 006, N'通达街道办事处'),
	(22, 08, 81, 007, N'洮府街道办事处'),
	(22, 08, 81, 008, N'向阳街道办事处'),
	(22, 08, 81, 100, N'瓦房镇'),
	(22, 08, 81, 101, N'万宝镇'),
	(22, 08, 81, 102, N'黑水镇'),
	(22, 08, 81, 103, N'那金镇'),
	(22, 08, 81, 104, N'安定镇'),
	(22, 08, 81, 105, N'福顺镇'),
	(22, 08, 81, 200, N'胡力吐蒙古族乡'),
	(22, 08, 81, 201, N'万宝乡'),
	(22, 08, 81, 202, N'聚宝乡'),
	(22, 08, 81, 203, N'东升乡'),
	(22, 08, 81, 204, N'野马乡'),
	(22, 08, 81, 205, N'永茂乡'),
	(22, 08, 81, 206, N'蛟流河乡'),
	(22, 08, 81, 207, N'大通乡'),
	(22, 08, 81, 209, N'二龙乡'),
	(22, 08, 81, 210, N'呼和车力蒙古族乡');

/* 吉林省 白城市 大安市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 08, 82, 001, N'慧阳街道办事处'),
	(22, 08, 82, 002, N'临江街道办事处'),
	(22, 08, 82, 003, N'长虹街道办事处'),
	(22, 08, 82, 004, N'锦华街道办事处'),
	(22, 08, 82, 005, N'安北街道办事处'),
	(22, 08, 82, 100, N'月亮泡镇'),
	(22, 08, 82, 101, N'安广镇'),
	(22, 08, 82, 102, N'丰收镇'),
	(22, 08, 82, 103, N'新平安镇'),
	(22, 08, 82, 104, N'两家子镇'),
	(22, 08, 82, 105, N'舍力镇'),
	(22, 08, 82, 106, N'大岗子镇'),
	(22, 08, 82, 107, N'叉干镇'),
	(22, 08, 82, 108, N'龙沼镇'),
	(22, 08, 82, 109, N'太山镇'),
	(22, 08, 82, 110, N'烧锅镇'),
	(22, 08, 82, 111, N'乐胜镇'),
	(22, 08, 82, 200, N'四棵树乡'),
	(22, 08, 82, 201, N'联合乡'),
	(22, 08, 82, 202, N'大赉乡'),
	(22, 08, 82, 203, N'红岗子乡'),
	(22, 08, 82, 204, N'海坨乡'),
	(22, 08, 82, 205, N'新艾里蒙古族乡');

/* 吉林省 延边朝鲜族自治州 延吉市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 24, 01, 001, N'进学街道办事处'),
	(22, 24, 01, 002, N'北山街道办事处'),
	(22, 24, 01, 003, N'新兴街道办事处'),
	(22, 24, 01, 004, N'公园街道办事处'),
	(22, 24, 01, 005, N'河南街道办事处'),
	(22, 24, 01, 006, N'建工街道办事处'),
	(22, 24, 01, 100, N'小营镇'),
	(22, 24, 01, 101, N'依兰镇'),
	(22, 24, 01, 102, N'三道湾镇'),
	(22, 24, 01, 105, N'朝阳川镇');

/* 吉林省 延边朝鲜族自治州 图们市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 24, 02, 001, N'向上街道办事处'),
	(22, 24, 02, 002, N'新华街道办事处'),
	(22, 24, 02, 003, N'月宫街道办事处'),
	(22, 24, 02, 100, N'月晴镇'),
	(22, 24, 02, 101, N'石岘镇'),
	(22, 24, 02, 102, N'长安镇'),
	(22, 24, 02, 103, N'凉水镇');

/* 吉林省 延边朝鲜族自治州 敦化市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 24, 03, 001, N'渤海街道办事处'),
	(22, 24, 03, 002, N'胜利街道办事处'),
	(22, 24, 03, 003, N'民主街道办事处'),
	(22, 24, 03, 004, N'丹江街道办事处'),
	(22, 24, 03, 100, N'大石头镇'),
	(22, 24, 03, 101, N'黄泥河镇'),
	(22, 24, 03, 102, N'官地镇'),
	(22, 24, 03, 103, N'沙河沿镇'),
	(22, 24, 03, 104, N'秋梨沟镇'),
	(22, 24, 03, 105, N'额穆镇'),
	(22, 24, 03, 106, N'贤儒镇'),
	(22, 24, 03, 107, N'大蒲柴河镇'),
	(22, 24, 03, 108, N'雁鸣湖镇'),
	(22, 24, 03, 109, N'江源镇'),
	(22, 24, 03, 110, N'江南镇'),
	(22, 24, 03, 200, N'大桥乡'),
	(22, 24, 03, 201, N'黑石乡'),
	(22, 24, 03, 202, N'青沟子乡'),
	(22, 24, 03, 203, N'翰章乡'),
	(22, 24, 03, 204, N'红石乡');

/* 吉林省 延边朝鲜族自治州 珲春市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 24, 04, 001, N'靖和街道办事处'),
	(22, 24, 04, 002, N'新安街道办事处'),
	(22, 24, 04, 003, N'河南街道办事处'),
	(22, 24, 04, 060, N'近海街道办事处'),
	(22, 24, 04, 100, N'春化镇'),
	(22, 24, 04, 101, N'敬信镇'),
	(22, 24, 04, 102, N'板石镇'),
	(22, 24, 04, 103, N'英安镇'),
	(22, 24, 04, 200, N'马川子乡'),
	(22, 24, 04, 201, N'杨泡满族乡'),
	(22, 24, 04, 202, N'三家子满族乡'),
	(22, 24, 04, 203, N'密江乡'),
	(22, 24, 04, 204, N'哈达门乡');

/* 吉林省 延边朝鲜族自治州 龙井市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 24, 05, 001, N'安民街道办事处'),
	(22, 24, 05, 002, N'龙门街道办事处'),
	(22, 24, 05, 100, N'开山屯镇'),
	(22, 24, 05, 102, N'老头沟镇'),
	(22, 24, 05, 103, N'三合镇'),
	(22, 24, 05, 104, N'东盛涌镇'),
	(22, 24, 05, 105, N'智新镇'),
	(22, 24, 05, 200, N'德新乡'),
	(22, 24, 05, 201, N'白金乡');

/* 吉林省 延边朝鲜族自治州 和龙市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 24, 06, 001, N'民慧街道办事处'),
	(22, 24, 06, 002, N'光明街道办事处'),
	(22, 24, 06, 003, N'文化街道办事处'),
	(22, 24, 06, 100, N'八家子镇'),
	(22, 24, 06, 101, N'福洞镇'),
	(22, 24, 06, 102, N'头道镇'),
	(22, 24, 06, 103, N'西城镇'),
	(22, 24, 06, 104, N'南坪镇'),
	(22, 24, 06, 105, N'东城镇'),
	(22, 24, 06, 106, N'崇善镇'),
	(22, 24, 06, 107, N'龙城镇');

/* 吉林省 延边朝鲜族自治州 汪清县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 24, 24, 003, N'南山社区工作委员会'),
	(22, 24, 24, 004, N'大明社区工作委员会'),
	(22, 24, 24, 005, N'大川社区工作委员会'),
	(22, 24, 24, 006, N'幸福社区工作委员会'),
	(22, 24, 24, 007, N'新民社区工作委员会'),
	(22, 24, 24, 008, N'新华社区工作委员会'),
	(22, 24, 24, 009, N'东振社区工作委员会'),
	(22, 24, 24, 010, N'江北社区工作委员会'),
	(22, 24, 24, 100, N'汪清镇'),
	(22, 24, 24, 101, N'大兴沟镇'),
	(22, 24, 24, 102, N'天桥岭镇'),
	(22, 24, 24, 103, N'罗子沟镇'),
	(22, 24, 24, 104, N'百草沟镇'),
	(22, 24, 24, 105, N'春阳镇'),
	(22, 24, 24, 106, N'复兴镇'),
	(22, 24, 24, 107, N'东光镇'),
	(22, 24, 24, 200, N'鸡冠乡');

/* 吉林省 延边朝鲜族自治州 安图县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(22, 24, 26, 100, N'明月镇'),
	(22, 24, 26, 101, N'松江镇'),
	(22, 24, 26, 102, N'二道白河镇'),
	(22, 24, 26, 103, N'两江镇'),
	(22, 24, 26, 104, N'石门镇'),
	(22, 24, 26, 105, N'万宝镇'),
	(22, 24, 26, 106, N'亮兵镇'),
	(22, 24, 26, 120, N'长白山保护开发区管委会池北区'),
	(22, 24, 26, 198, N'县级直管村级单位'),
	(22, 24, 26, 200, N'新合乡'),
	(22, 24, 26, 201, N'永庆乡');


/* 黑龙江省 哈尔滨市 道里区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 02, 001, N'兆麟街道办事处'),
	(23, 01, 02, 002, N'新阳路街道办事处'),
	(23, 01, 02, 003, N'抚顺街道办事处'),
	(23, 01, 02, 004, N'共乐街道办事处'),
	(23, 01, 02, 005, N'新华街道办事处'),
	(23, 01, 02, 006, N'城乡路街道办事处'),
	(23, 01, 02, 007, N'工农街道办事处'),
	(23, 01, 02, 008, N'尚志街道办事处'),
	(23, 01, 02, 009, N'斯大林街道办事处'),
	(23, 01, 02, 010, N'通江街道办事处'),
	(23, 01, 02, 011, N'经纬街道办事处'),
	(23, 01, 02, 012, N'工程街道办事处'),
	(23, 01, 02, 013, N'安静街道办事处'),
	(23, 01, 02, 014, N'安和街道办事处'),
	(23, 01, 02, 015, N'正阳河街道办事处'),
	(23, 01, 02, 016, N'建国街道办事处'),
	(23, 01, 02, 017, N'康安街道办事处'),
	(23, 01, 02, 018, N'爱建街道办事处'),
	(23, 01, 02, 019, N'群力街道办事处'),
	(23, 01, 02, 101, N'太平镇'),
	(23, 01, 02, 102, N'新发镇'),
	(23, 01, 02, 103, N'新农镇'),
	(23, 01, 02, 104, N'榆树镇');

/* 黑龙江省 哈尔滨市 南岗区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 03, 001, N'花园街道办事处'),
	(23, 01, 03, 002, N'奋斗路街道办事处'),
	(23, 01, 03, 003, N'革新街道办事处'),
	(23, 01, 03, 004, N'文化街道办事处'),
	(23, 01, 03, 005, N'大成街道办事处'),
	(23, 01, 03, 006, N'芦家街道办事处'),
	(23, 01, 03, 007, N'荣市街道办事处'),
	(23, 01, 03, 009, N'燎原街道办事处'),
	(23, 01, 03, 010, N'松花江街道办事处'),
	(23, 01, 03, 011, N'曲线街道办事处'),
	(23, 01, 03, 012, N'通达街道办事处'),
	(23, 01, 03, 013, N'七政街道办事处'),
	(23, 01, 03, 015, N'和兴路街道办事处'),
	(23, 01, 03, 016, N'哈西街道办事处'),
	(23, 01, 03, 017, N'保健路街道办事处'),
	(23, 01, 03, 018, N'先锋路街道办事处'),
	(23, 01, 03, 019, N'新春街道办事处'),
	(23, 01, 03, 020, N'跃进街道办事处'),
	(23, 01, 03, 101, N'王岗镇'),
	(23, 01, 03, 201, N'红旗满族乡');

/* 黑龙江省 哈尔滨市 道外区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 04, 001, N'靖宇街道办事处'),
	(23, 01, 04, 002, N'太古街道办事处'),
	(23, 01, 04, 003, N'东莱街道办事处'),
	(23, 01, 04, 004, N'滨江街道办事处'),
	(23, 01, 04, 005, N'仁里街道办事处'),
	(23, 01, 04, 006, N'南市街道办事处'),
	(23, 01, 04, 007, N'崇俭街道办事处'),
	(23, 01, 04, 008, N'振江街道办事处'),
	(23, 01, 04, 009, N'东原街道办事处'),
	(23, 01, 04, 010, N'大兴街道办事处'),
	(23, 01, 04, 011, N'胜利街道办事处'),
	(23, 01, 04, 012, N'南马街道办事处'),
	(23, 01, 04, 021, N'民强街道办事处'),
	(23, 01, 04, 022, N'大有坊街道办事处'),
	(23, 01, 04, 023, N'南直路街道办事处'),
	(23, 01, 04, 024, N'化工街道办事处'),
	(23, 01, 04, 025, N'火车头街道办事处'),
	(23, 01, 04, 026, N'新一街道办事处'),
	(23, 01, 04, 027, N'三棵树大街街道办事处'),
	(23, 01, 04, 028, N'水泥路街道办事处'),
	(23, 01, 04, 029, N'太平大街街道办事处'),
	(23, 01, 04, 030, N'黎华街道办事处'),
	(23, 01, 04, 031, N'新乐街道办事处'),
	(23, 01, 04, 102, N'永源镇'),
	(23, 01, 04, 109, N'巨源镇'),
	(23, 01, 04, 111, N'团结镇'),
	(23, 01, 04, 112, N'民主镇');

/* 黑龙江省 哈尔滨市 平房区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 08, 001, N'兴建街道办事处'),
	(23, 01, 08, 002, N'保国街道办事处'),
	(23, 01, 08, 003, N'联盟街道办事处'),
	(23, 01, 08, 004, N'友协街道办事处'),
	(23, 01, 08, 005, N'新疆街道办事处'),
	(23, 01, 08, 006, N'新伟街道办事处'),
	(23, 01, 08, 007, N'平新街道办事处'),
	(23, 01, 08, 101, N'平房镇');

/* 黑龙江省 哈尔滨市 松北区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 09, 001, N'三电街道办事处'),
	(23, 01, 09, 002, N'太阳岛街道办事处'),
	(23, 01, 09, 003, N'松浦街道办事处'),
	(23, 01, 09, 004, N'万宝街道办事处'),
	(23, 01, 09, 005, N'松北街道办事处'),
	(23, 01, 09, 101, N'对青山镇'),
	(23, 01, 09, 102, N'乐业镇');

/* 黑龙江省 哈尔滨市 香坊区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 10, 001, N'香坊大街街道办事处'),
	(23, 01, 10, 002, N'安埠街道办事处'),
	(23, 01, 10, 003, N'通天街道办事处'),
	(23, 01, 10, 004, N'新香坊街道办事处'),
	(23, 01, 10, 005, N'铁东街道办事处'),
	(23, 01, 10, 006, N'新成街道办事处'),
	(23, 01, 10, 007, N'红旗街道办事处'),
	(23, 01, 10, 008, N'六顺街道办事处'),
	(23, 01, 10, 009, N'建筑街道办事处'),
	(23, 01, 10, 010, N'哈平路街道办事处'),
	(23, 01, 10, 011, N'安乐街道办事处'),
	(23, 01, 10, 012, N'健康路街道办事处'),
	(23, 01, 10, 013, N'大庆路街道办事处'),
	(23, 01, 10, 014, N'进乡街道办事处'),
	(23, 01, 10, 015, N'通乡街道办事处'),
	(23, 01, 10, 016, N'和平路街道办事处'),
	(23, 01, 10, 017, N'民生路街道办事处'),
	(23, 01, 10, 018, N'文政街道办事处'),
	(23, 01, 10, 019, N'王兆街道办事处'),
	(23, 01, 10, 020, N'黎明街道办事处'),
	(23, 01, 10, 101, N'成高子镇'),
	(23, 01, 10, 102, N'幸福镇'),
	(23, 01, 10, 103, N'朝阳镇'),
	(23, 01, 10, 104, N'向阳镇');

/* 黑龙江省 哈尔滨市 呼兰区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 11, 001, N'兰河街道办事处'),
	(23, 01, 11, 002, N'呼兰街道办事处'),
	(23, 01, 11, 003, N'建设路街道办事处'),
	(23, 01, 11, 004, N'利民街道办事处'),
	(23, 01, 11, 005, N'学院路街道办事处'),
	(23, 01, 11, 006, N'腰卜街道办事处'),
	(23, 01, 11, 007, N'康金街道办事处'),
	(23, 01, 11, 008, N'双井街道办事处'),
	(23, 01, 11, 009, N'长岭街道办事处'),
	(23, 01, 11, 010, N'沈家街道办事处'),
	(23, 01, 11, 105, N'二八镇'),
	(23, 01, 11, 106, N'石人镇'),
	(23, 01, 11, 107, N'白奎镇'),
	(23, 01, 11, 109, N'方台镇'),
	(23, 01, 11, 110, N'莲花镇'),
	(23, 01, 11, 111, N'大用镇'),
	(23, 01, 11, 114, N'利业镇'),
	(23, 01, 11, 201, N'杨林乡'),
	(23, 01, 11, 203, N'许卜乡'),
	(23, 01, 11, 205, N'孟家乡');

/* 黑龙江省 哈尔滨市 阿城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 12, 001, N'金城街道办事处'),
	(23, 01, 12, 002, N'金都街道办事处'),
	(23, 01, 12, 003, N'通城街道办事处'),
	(23, 01, 12, 004, N'河东街道办事处'),
	(23, 01, 12, 005, N'阿什河街道办事处'),
	(23, 01, 12, 006, N'玉泉街道办事处'),
	(23, 01, 12, 007, N'新利街道办事处'),
	(23, 01, 12, 008, N'双丰街道办事处'),
	(23, 01, 12, 009, N'舍利街道办事处'),
	(23, 01, 12, 010, N'小岭街道办事处'),
	(23, 01, 12, 011, N'亚沟街道办事处'),
	(23, 01, 12, 012, N'交界街道办事处'),
	(23, 01, 12, 103, N'蜚克图镇'),
	(23, 01, 12, 107, N'平山镇'),
	(23, 01, 12, 108, N'松峰山镇'),
	(23, 01, 12, 109, N'红星镇'),
	(23, 01, 12, 112, N'金龙山镇'),
	(23, 01, 12, 113, N'杨树镇'),
	(23, 01, 12, 114, N'料甸镇');

/* 黑龙江省 哈尔滨市 双城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 13, 001, N'双城市街道管委会'),
	(23, 01, 13, 002, N'五家街道办事处'),
	(23, 01, 13, 003, N'新兴街道办事处'),
	(23, 01, 13, 004, N'兰棱街道办事处'),
	(23, 01, 13, 005, N'周家街道办事处'),
	(23, 01, 13, 006, N'公正街道办事处'),
	(23, 01, 13, 007, N'承旭街道办事处'),
	(23, 01, 13, 008, N'承恩街道办事处'),
	(23, 01, 13, 009, N'永治街道办事处'),
	(23, 01, 13, 010, N'永和街道办事处'),
	(23, 01, 13, 011, N'幸福街道办事处'),
	(23, 01, 13, 104, N'韩甸镇'),
	(23, 01, 13, 105, N'单城镇'),
	(23, 01, 13, 106, N'东官镇'),
	(23, 01, 13, 107, N'农丰满族锡伯族镇'),
	(23, 01, 13, 108, N'杏山镇'),
	(23, 01, 13, 109, N'西官镇'),
	(23, 01, 13, 200, N'朝阳乡'),
	(23, 01, 13, 201, N'金城乡'),
	(23, 01, 13, 203, N'青岭满族乡'),
	(23, 01, 13, 204, N'联兴满族乡'),
	(23, 01, 13, 208, N'永胜乡'),
	(23, 01, 13, 209, N'临江乡'),
	(23, 01, 13, 210, N'水泉乡'),
	(23, 01, 13, 211, N'乐群满族乡'),
	(23, 01, 13, 214, N'万隆乡'),
	(23, 01, 13, 216, N'希勤满族乡'),
	(23, 01, 13, 217, N'同心满族乡');

/* 黑龙江省 哈尔滨市 依兰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 23, 100, N'依兰镇'),
	(23, 01, 23, 101, N'达连河镇'),
	(23, 01, 23, 102, N'江湾镇'),
	(23, 01, 23, 103, N'三道岗镇'),
	(23, 01, 23, 104, N'道台桥镇'),
	(23, 01, 23, 105, N'宏克利镇'),
	(23, 01, 23, 200, N'团山子乡'),
	(23, 01, 23, 201, N'愚公乡'),
	(23, 01, 23, 202, N'迎兰朝鲜族乡');

/* 黑龙江省 哈尔滨市 方正县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 24, 100, N'方正镇'),
	(23, 01, 24, 101, N'会发镇'),
	(23, 01, 24, 102, N'大罗密镇'),
	(23, 01, 24, 103, N'得莫利镇'),
	(23, 01, 24, 200, N'天门乡'),
	(23, 01, 24, 201, N'松南乡'),
	(23, 01, 24, 202, N'德善乡'),
	(23, 01, 24, 204, N'宝兴乡');

/* 黑龙江省 哈尔滨市 宾县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 25, 100, N'宾州镇'),
	(23, 01, 25, 101, N'居仁镇'),
	(23, 01, 25, 102, N'宾西镇'),
	(23, 01, 25, 103, N'糖坊镇'),
	(23, 01, 25, 104, N'宾安镇'),
	(23, 01, 25, 105, N'新甸镇'),
	(23, 01, 25, 106, N'胜利镇'),
	(23, 01, 25, 107, N'宁远镇'),
	(23, 01, 25, 109, N'摆渡镇'),
	(23, 01, 25, 110, N'平坊镇'),
	(23, 01, 25, 111, N'满井镇'),
	(23, 01, 25, 112, N'常安镇'),
	(23, 01, 25, 201, N'永和乡'),
	(23, 01, 25, 203, N'鸟河乡'),
	(23, 01, 25, 204, N'民和乡'),
	(23, 01, 25, 205, N'经建乡'),
	(23, 01, 25, 210, N'三宝乡');

/* 黑龙江省 哈尔滨市 巴彦县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 26, 100, N'巴彦镇'),
	(23, 01, 26, 101, N'兴隆镇'),
	(23, 01, 26, 102, N'西集镇'),
	(23, 01, 26, 103, N'洼兴镇'),
	(23, 01, 26, 104, N'龙泉镇'),
	(23, 01, 26, 105, N'巴彦港镇'),
	(23, 01, 26, 106, N'龙庙镇'),
	(23, 01, 26, 107, N'万发镇'),
	(23, 01, 26, 108, N'天增镇'),
	(23, 01, 26, 110, N'黑山镇'),
	(23, 01, 26, 200, N'松花江乡'),
	(23, 01, 26, 202, N'富江乡'),
	(23, 01, 26, 204, N'华山乡'),
	(23, 01, 26, 205, N'丰乐乡'),
	(23, 01, 26, 209, N'德祥乡'),
	(23, 01, 26, 210, N'红光乡'),
	(23, 01, 26, 212, N'山后乡'),
	(23, 01, 26, 214, N'镇东乡');

/* 黑龙江省 哈尔滨市 木兰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 27, 100, N'木兰镇'),
	(23, 01, 27, 101, N'东兴镇'),
	(23, 01, 27, 102, N'大贵镇'),
	(23, 01, 27, 103, N'利东镇'),
	(23, 01, 27, 104, N'柳河镇'),
	(23, 01, 27, 105, N'新民镇'),
	(23, 01, 27, 200, N'建国乡'),
	(23, 01, 27, 203, N'吉兴乡');

/* 黑龙江省 哈尔滨市 通河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 28, 100, N'通河镇'),
	(23, 01, 28, 101, N'乌鸦泡镇'),
	(23, 01, 28, 102, N'清河镇'),
	(23, 01, 28, 103, N'浓河镇'),
	(23, 01, 28, 104, N'凤山镇'),
	(23, 01, 28, 105, N'祥顺镇'),
	(23, 01, 28, 201, N'三站乡'),
	(23, 01, 28, 202, N'富林乡');

/* 黑龙江省 哈尔滨市 延寿县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 29, 100, N'延寿镇'),
	(23, 01, 29, 101, N'六团镇'),
	(23, 01, 29, 102, N'中和镇'),
	(23, 01, 29, 103, N'加信镇'),
	(23, 01, 29, 104, N'延河镇'),
	(23, 01, 29, 204, N'安山乡'),
	(23, 01, 29, 205, N'寿山乡'),
	(23, 01, 29, 206, N'玉河乡'),
	(23, 01, 29, 209, N'青川乡');

/* 黑龙江省 哈尔滨市 尚志市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 83, 100, N'尚志镇'),
	(23, 01, 83, 101, N'一面坡镇'),
	(23, 01, 83, 102, N'苇河镇'),
	(23, 01, 83, 103, N'亚布力镇'),
	(23, 01, 83, 104, N'帽儿山镇'),
	(23, 01, 83, 105, N'亮河镇'),
	(23, 01, 83, 106, N'庆阳镇'),
	(23, 01, 83, 107, N'石头河子镇'),
	(23, 01, 83, 108, N'元宝镇'),
	(23, 01, 83, 109, N'黑龙宫镇'),
	(23, 01, 83, 202, N'长寿乡'),
	(23, 01, 83, 204, N'乌吉密乡'),
	(23, 01, 83, 206, N'鱼池乡'),
	(23, 01, 83, 207, N'珍珠山乡'),
	(23, 01, 83, 208, N'老街基乡'),
	(23, 01, 83, 209, N'马延乡'),
	(23, 01, 83, 211, N'河东乡');

/* 黑龙江省 哈尔滨市 五常市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 01, 84, 100, N'五常镇'),
	(23, 01, 84, 101, N'拉林满族镇'),
	(23, 01, 84, 102, N'山河镇'),
	(23, 01, 84, 103, N'小山子镇'),
	(23, 01, 84, 104, N'安家镇'),
	(23, 01, 84, 105, N'牛家满族镇'),
	(23, 01, 84, 106, N'杜家镇'),
	(23, 01, 84, 107, N'背荫河镇'),
	(23, 01, 84, 108, N'冲河镇'),
	(23, 01, 84, 109, N'沙河子镇'),
	(23, 01, 84, 110, N'向阳镇'),
	(23, 01, 84, 111, N'龙凤山镇'),
	(23, 01, 84, 200, N'兴盛乡'),
	(23, 01, 84, 201, N'志广乡'),
	(23, 01, 84, 202, N'卫国乡'),
	(23, 01, 84, 203, N'常堡乡'),
	(23, 01, 84, 206, N'民意乡'),
	(23, 01, 84, 209, N'红旗满族乡'),
	(23, 01, 84, 210, N'八家子乡'),
	(23, 01, 84, 211, N'民乐朝鲜族乡'),
	(23, 01, 84, 212, N'营城子满族乡'),
	(23, 01, 84, 214, N'长山乡'),
	(23, 01, 84, 215, N'兴隆乡'),
	(23, 01, 84, 216, N'二河乡');

/* 黑龙江省 齐齐哈尔市 龙沙区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 02, 001, N'五龙街道办事处'),
	(23, 02, 02, 002, N'湖滨街道办事处'),
	(23, 02, 02, 003, N'江安街道办事处'),
	(23, 02, 02, 004, N'正阳街道办事处'),
	(23, 02, 02, 005, N'彩虹街道办事处'),
	(23, 02, 02, 006, N'南航街道办事处'),
	(23, 02, 02, 007, N'大民街道办事处');

/* 黑龙江省 齐齐哈尔市 建华区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 03, 002, N'中华街道办事处'),
	(23, 02, 03, 004, N'西大桥街道办事处'),
	(23, 02, 03, 005, N'卜奎街道办事处'),
	(23, 02, 03, 006, N'建设街道办事处'),
	(23, 02, 03, 007, N'文化街道办事处'),
	(23, 02, 03, 198, N'建华区（镇）直辖地域');

/* 黑龙江省 齐齐哈尔市 铁锋区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 04, 001, N'站前街道办事处'),
	(23, 02, 04, 002, N'南浦街道办事处'),
	(23, 02, 04, 003, N'通东街道办事处'),
	(23, 02, 04, 004, N'光荣街道办事处'),
	(23, 02, 04, 005, N'龙华街道办事处'),
	(23, 02, 04, 006, N'北局宅街道办事处'),
	(23, 02, 04, 008, N'东湖街道办事处'),
	(23, 02, 04, 100, N'扎龙镇');

/* 黑龙江省 齐齐哈尔市 昂昂溪区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 05, 001, N'新兴街道办事处'),
	(23, 02, 05, 002, N'新建街道办事处'),
	(23, 02, 05, 005, N'林机街道办事处'),
	(23, 02, 05, 006, N'道北街道办事处'),
	(23, 02, 05, 100, N'水师营满族镇'),
	(23, 02, 05, 101, N'榆树屯镇');

/* 黑龙江省 齐齐哈尔市 富拉尔基区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 06, 001, N'红岸街道办事处'),
	(23, 02, 06, 003, N'沿江街道办事处'),
	(23, 02, 06, 004, N'电力街道办事处'),
	(23, 02, 06, 005, N'幸福街道办事处'),
	(23, 02, 06, 006, N'红宝石街道办事处'),
	(23, 02, 06, 007, N'北兴街道办事处'),
	(23, 02, 06, 008, N'铁北街道办事处'),
	(23, 02, 06, 009, N'和平街道办事处'),
	(23, 02, 06, 200, N'长青乡'),
	(23, 02, 06, 202, N'杜尔门沁达斡尔族乡');

/* 黑龙江省 齐齐哈尔市 碾子山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 07, 001, N'东安街道办事处'),
	(23, 02, 07, 002, N'富强街道办事处'),
	(23, 02, 07, 003, N'跃进街道办事处'),
	(23, 02, 07, 004, N'繁荣街道办事处'),
	(23, 02, 07, 198, N'碾子山区（镇）直辖地域');

/* 黑龙江省 齐齐哈尔市 梅里斯达斡尔族区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 08, 001, N'梅里斯街道办事处'),
	(23, 02, 08, 101, N'雅尔塞镇'),
	(23, 02, 08, 102, N'卧牛吐达斡尔族镇'),
	(23, 02, 08, 103, N'达呼店镇'),
	(23, 02, 08, 104, N'共和镇'),
	(23, 02, 08, 105, N'梅里斯镇'),
	(23, 02, 08, 200, N'莽格吐达斡尔族乡');

/* 黑龙江省 齐齐哈尔市 龙江县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 21, 100, N'龙江镇'),
	(23, 02, 21, 101, N'景星镇'),
	(23, 02, 21, 102, N'龙兴镇'),
	(23, 02, 21, 103, N'山泉镇'),
	(23, 02, 21, 104, N'七棵树镇'),
	(23, 02, 21, 105, N'杏山镇'),
	(23, 02, 21, 106, N'白山镇'),
	(23, 02, 21, 107, N'头站镇'),
	(23, 02, 21, 201, N'黑岗乡'),
	(23, 02, 21, 202, N'广厚乡'),
	(23, 02, 21, 203, N'华民乡'),
	(23, 02, 21, 204, N'哈拉海乡'),
	(23, 02, 21, 215, N'鲁河乡'),
	(23, 02, 21, 217, N'济沁河乡');

/* 黑龙江省 齐齐哈尔市 依安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 23, 100, N'依安镇'),
	(23, 02, 23, 101, N'依龙镇'),
	(23, 02, 23, 102, N'双阳镇'),
	(23, 02, 23, 103, N'三兴镇'),
	(23, 02, 23, 104, N'中心镇'),
	(23, 02, 23, 105, N'新兴镇'),
	(23, 02, 23, 200, N'富饶乡'),
	(23, 02, 23, 201, N'解放乡'),
	(23, 02, 23, 202, N'阳春乡'),
	(23, 02, 23, 203, N'新发乡'),
	(23, 02, 23, 204, N'太东乡'),
	(23, 02, 23, 205, N'上游乡'),
	(23, 02, 23, 206, N'红星乡'),
	(23, 02, 23, 207, N'先锋乡'),
	(23, 02, 23, 208, N'新屯乡');

/* 黑龙江省 齐齐哈尔市 泰来县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 24, 100, N'泰来镇'),
	(23, 02, 24, 101, N'平洋镇'),
	(23, 02, 24, 102, N'汤池镇'),
	(23, 02, 24, 103, N'江桥蒙古族镇'),
	(23, 02, 24, 104, N'塔子城镇'),
	(23, 02, 24, 105, N'大兴镇'),
	(23, 02, 24, 106, N'和平镇'),
	(23, 02, 24, 107, N'克利镇'),
	(23, 02, 24, 200, N'胜利蒙古族乡'),
	(23, 02, 24, 209, N'宁姜蒙古族乡');

/* 黑龙江省 齐齐哈尔市 甘南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 25, 100, N'甘南镇'),
	(23, 02, 25, 101, N'兴十四镇'),
	(23, 02, 25, 102, N'平阳镇'),
	(23, 02, 25, 103, N'东阳镇'),
	(23, 02, 25, 104, N'巨宝镇'),
	(23, 02, 25, 201, N'长山乡'),
	(23, 02, 25, 202, N'中兴乡'),
	(23, 02, 25, 203, N'兴隆乡'),
	(23, 02, 25, 204, N'宝山乡'),
	(23, 02, 25, 206, N'查哈阳乡');

/* 黑龙江省 齐齐哈尔市 富裕县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 27, 100, N'富裕镇'),
	(23, 02, 27, 101, N'富路镇'),
	(23, 02, 27, 102, N'富海镇'),
	(23, 02, 27, 103, N'二道湾镇'),
	(23, 02, 27, 104, N'龙安桥镇'),
	(23, 02, 27, 105, N'塔哈镇'),
	(23, 02, 27, 200, N'繁荣乡'),
	(23, 02, 27, 201, N'绍文乡'),
	(23, 02, 27, 202, N'忠厚乡'),
	(23, 02, 27, 203, N'友谊乡');

/* 黑龙江省 齐齐哈尔市 克山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 29, 100, N'克山镇'),
	(23, 02, 29, 101, N'北兴镇'),
	(23, 02, 29, 102, N'西城镇'),
	(23, 02, 29, 103, N'古城镇'),
	(23, 02, 29, 104, N'北联镇'),
	(23, 02, 29, 105, N'西河镇'),
	(23, 02, 29, 106, N'双河镇'),
	(23, 02, 29, 200, N'河南乡'),
	(23, 02, 29, 203, N'河北乡'),
	(23, 02, 29, 204, N'古北乡'),
	(23, 02, 29, 205, N'西联乡'),
	(23, 02, 29, 206, N'发展乡'),
	(23, 02, 29, 207, N'西建乡'),
	(23, 02, 29, 208, N'向华乡'),
	(23, 02, 29, 210, N'曙光乡');

/* 黑龙江省 齐齐哈尔市 克东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 30, 100, N'克东镇'),
	(23, 02, 30, 101, N'宝泉镇'),
	(23, 02, 30, 102, N'乾丰镇'),
	(23, 02, 30, 103, N'玉岗镇'),
	(23, 02, 30, 104, N'蒲峪路镇'),
	(23, 02, 30, 202, N'润津乡'),
	(23, 02, 30, 204, N'昌盛乡');

/* 黑龙江省 齐齐哈尔市 拜泉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 31, 100, N'拜泉镇'),
	(23, 02, 31, 101, N'三道镇'),
	(23, 02, 31, 102, N'兴农镇'),
	(23, 02, 31, 103, N'长春镇'),
	(23, 02, 31, 104, N'龙泉镇'),
	(23, 02, 31, 105, N'国富镇'),
	(23, 02, 31, 106, N'富强镇'),
	(23, 02, 31, 200, N'新生乡'),
	(23, 02, 31, 201, N'兴国乡'),
	(23, 02, 31, 203, N'上升乡'),
	(23, 02, 31, 204, N'兴华乡'),
	(23, 02, 31, 206, N'大众乡'),
	(23, 02, 31, 209, N'丰产乡'),
	(23, 02, 31, 210, N'永勤乡'),
	(23, 02, 31, 212, N'爱农乡'),
	(23, 02, 31, 214, N'时中乡');

/* 黑龙江省 齐齐哈尔市 讷河市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 02, 81, 001, N'雨亭街道办事处'),
	(23, 02, 81, 002, N'通江街道办事处'),
	(23, 02, 81, 101, N'拉哈镇'),
	(23, 02, 81, 102, N'二克浅镇'),
	(23, 02, 81, 103, N'学田镇'),
	(23, 02, 81, 104, N'龙河镇'),
	(23, 02, 81, 105, N'讷南镇'),
	(23, 02, 81, 106, N'六合镇'),
	(23, 02, 81, 107, N'长发镇'),
	(23, 02, 81, 108, N'通南镇'),
	(23, 02, 81, 109, N'同义镇'),
	(23, 02, 81, 110, N'九井镇'),
	(23, 02, 81, 111, N'老莱镇'),
	(23, 02, 81, 201, N'孔国乡'),
	(23, 02, 81, 207, N'和盛乡'),
	(23, 02, 81, 208, N'同心乡'),
	(23, 02, 81, 210, N'兴旺鄂温克族乡');

/* 黑龙江省 鸡西市 鸡冠区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 03, 02, 001, N'向阳街道办事处'),
	(23, 03, 02, 002, N'南山街道办事处'),
	(23, 03, 02, 003, N'立新街道办事处'),
	(23, 03, 02, 004, N'东风街道办事处'),
	(23, 03, 02, 005, N'红军路街道办事处'),
	(23, 03, 02, 006, N'西鸡西街道办事处'),
	(23, 03, 02, 007, N'西山街道办事处'),
	(23, 03, 02, 200, N'红星乡'),
	(23, 03, 02, 201, N'西郊乡');

/* 黑龙江省 鸡西市 恒山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 03, 03, 001, N'桦木林街道办事处'),
	(23, 03, 03, 002, N'大恒山街道办事处'),
	(23, 03, 03, 003, N'小恒山街道办事处'),
	(23, 03, 03, 004, N'二道河子街道办事处'),
	(23, 03, 03, 005, N'张新街道办事处'),
	(23, 03, 03, 006, N'奋斗街道办事处'),
	(23, 03, 03, 007, N'柳毛街道办事处'),
	(23, 03, 03, 200, N'红旗乡'),
	(23, 03, 03, 201, N'柳毛乡');

/* 黑龙江省 鸡西市 滴道区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 03, 04, 001, N'东兴街道办事处'),
	(23, 03, 04, 002, N'矿里街道办事处'),
	(23, 03, 04, 003, N'洗煤街道办事处'),
	(23, 03, 04, 004, N'大通沟街道办事处'),
	(23, 03, 04, 200, N'滴道河乡'),
	(23, 03, 04, 201, N'兰岭乡');

/* 黑龙江省 鸡西市 梨树区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 03, 05, 001, N'街里街道办事处'),
	(23, 03, 05, 002, N'穆棱街道办事处'),
	(23, 03, 05, 003, N'平岗街道办事处'),
	(23, 03, 05, 004, N'碱场街道办事处'),
	(23, 03, 05, 005, N'石磷街道办事处'),
	(23, 03, 05, 198, N'梨树区（镇）直辖地域');

/* 黑龙江省 鸡西市 城子河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 03, 06, 001, N'城子河街道办事处'),
	(23, 03, 06, 002, N'正阳街道办事处'),
	(23, 03, 06, 003, N'东海街道办事处'),
	(23, 03, 06, 004, N'城西街道办事处'),
	(23, 03, 06, 005, N'杏花街道办事处'),
	(23, 03, 06, 200, N'长青乡'),
	(23, 03, 06, 201, N'永丰乡');

/* 黑龙江省 鸡西市 麻山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 03, 07, 001, N'麻山街道办事处'),
	(23, 03, 07, 198, N'麻山区（镇）直辖地域');

/* 黑龙江省 鸡西市 鸡东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 03, 21, 100, N'鸡东镇'),
	(23, 03, 21, 101, N'平阳镇'),
	(23, 03, 21, 102, N'向阳镇'),
	(23, 03, 21, 103, N'哈达镇'),
	(23, 03, 21, 104, N'永安镇'),
	(23, 03, 21, 105, N'永和镇'),
	(23, 03, 21, 106, N'东海镇'),
	(23, 03, 21, 107, N'兴农镇'),
	(23, 03, 21, 200, N'鸡林乡'),
	(23, 03, 21, 205, N'明德乡'),
	(23, 03, 21, 206, N'下亮子乡');

/* 黑龙江省 鸡西市 虎林市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 03, 81, 100, N'虎林镇'),
	(23, 03, 81, 101, N'东方红镇'),
	(23, 03, 81, 102, N'迎春镇'),
	(23, 03, 81, 103, N'虎头镇'),
	(23, 03, 81, 104, N'杨岗镇'),
	(23, 03, 81, 105, N'东诚镇'),
	(23, 03, 81, 106, N'宝东镇'),
	(23, 03, 81, 203, N'新乐乡'),
	(23, 03, 81, 204, N'伟光乡'),
	(23, 03, 81, 206, N'珍宝岛乡'),
	(23, 03, 81, 207, N'阿北乡');

/* 黑龙江省 鸡西市 密山市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 03, 82, 001, N'中心街道办事处'),
	(23, 03, 82, 100, N'密山镇'),
	(23, 03, 82, 101, N'连珠山镇'),
	(23, 03, 82, 102, N'当壁镇'),
	(23, 03, 82, 103, N'知一镇'),
	(23, 03, 82, 104, N'黑台镇'),
	(23, 03, 82, 105, N'兴凯镇'),
	(23, 03, 82, 106, N'裴德镇'),
	(23, 03, 82, 107, N'白鱼湾镇'),
	(23, 03, 82, 200, N'柳毛乡'),
	(23, 03, 82, 201, N'杨木乡'),
	(23, 03, 82, 202, N'兴凯湖乡'),
	(23, 03, 82, 203, N'承紫河乡'),
	(23, 03, 82, 206, N'二人班乡'),
	(23, 03, 82, 208, N'太平乡'),
	(23, 03, 82, 210, N'和平乡'),
	(23, 03, 82, 212, N'富源乡');

/* 黑龙江省 鹤岗市 向阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 04, 02, 001, N'北山街道办事处'),
	(23, 04, 02, 002, N'红军街道办事处'),
	(23, 04, 02, 003, N'光明街道办事处'),
	(23, 04, 02, 004, N'胜利街道办事处'),
	(23, 04, 02, 005, N'南翼街道办事处');

/* 黑龙江省 鹤岗市 工农区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 04, 03, 001, N'育才街道办事处'),
	(23, 04, 03, 002, N'红旗街道办事处'),
	(23, 04, 03, 003, N'新南街道办事处'),
	(23, 04, 03, 004, N'湖滨街道办事处'),
	(23, 04, 03, 005, N'解放街道办事处'),
	(23, 04, 03, 006, N'团结街道办事处');

/* 黑龙江省 鹤岗市 南山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 04, 04, 001, N'铁西街道办事处'),
	(23, 04, 04, 002, N'铁东街道办事处'),
	(23, 04, 04, 003, N'六号街道办事处'),
	(23, 04, 04, 004, N'大陆街道办事处'),
	(23, 04, 04, 005, N'富力街道办事处'),
	(23, 04, 04, 006, N'麓林山街道办事处');

/* 黑龙江省 鹤岗市 兴安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 04, 05, 001, N'兴安路街道办事处'),
	(23, 04, 05, 002, N'兴建路街道办事处'),
	(23, 04, 05, 003, N'兴长路街道办事处'),
	(23, 04, 05, 004, N'峻德路街道办事处'),
	(23, 04, 05, 005, N'河东路街道办事处'),
	(23, 04, 05, 006, N'光宇街道办事处'),
	(23, 04, 05, 100, N'红旗镇');

/* 黑龙江省 鹤岗市 东山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 04, 06, 001, N'工人村街道办事处'),
	(23, 04, 06, 002, N'新一街道办事处'),
	(23, 04, 06, 003, N'三街街道办事处'),
	(23, 04, 06, 004, N'东山街道办事处'),
	(23, 04, 06, 005, N'蔬园乡街道办事处'),
	(23, 04, 06, 100, N'新华镇'),
	(23, 04, 06, 201, N'蔬园乡'),
	(23, 04, 06, 202, N'东方红乡');

/* 黑龙江省 鹤岗市 兴山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 04, 07, 001, N'岭北街道办事处'),
	(23, 04, 07, 002, N'岭南街道办事处'),
	(23, 04, 07, 003, N'沟北街道办事处'),
	(23, 04, 07, 004, N'沟南街道办事处');

/* 黑龙江省 鹤岗市 萝北县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 04, 21, 100, N'凤翔镇'),
	(23, 04, 21, 101, N'鹤北镇'),
	(23, 04, 21, 102, N'名山镇'),
	(23, 04, 21, 103, N'团结镇'),
	(23, 04, 21, 104, N'肇兴镇'),
	(23, 04, 21, 105, N'云山镇'),
	(23, 04, 21, 200, N'东明朝鲜族乡'),
	(23, 04, 21, 203, N'太平沟乡');

/* 黑龙江省 鹤岗市 绥滨县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 04, 22, 100, N'绥滨镇'),
	(23, 04, 22, 101, N'绥东镇'),
	(23, 04, 22, 102, N'忠仁镇'),
	(23, 04, 22, 200, N'连生乡'),
	(23, 04, 22, 201, N'北岗乡'),
	(23, 04, 22, 202, N'富强乡'),
	(23, 04, 22, 203, N'北山乡'),
	(23, 04, 22, 204, N'福兴乡'),
	(23, 04, 22, 205, N'新富乡');

/* 黑龙江省 双鸭山市 尖山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 05, 02, 001, N'二马路街道办事处'),
	(23, 05, 02, 002, N'八马路街道办事处'),
	(23, 05, 02, 003, N'中心站街道办事处'),
	(23, 05, 02, 004, N'富安街道办事处'),
	(23, 05, 02, 005, N'窑地街道办事处'),
	(23, 05, 02, 006, N'长安街道办事处'),
	(23, 05, 02, 007, N'铁西街道办事处'),
	(23, 05, 02, 200, N'安邦乡');

/* 黑龙江省 双鸭山市 岭东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 05, 03, 001, N'中山街道办事处'),
	(23, 05, 03, 002, N'北山街道办事处'),
	(23, 05, 03, 003, N'南山街道办事处'),
	(23, 05, 03, 004, N'东山街道办事处'),
	(23, 05, 03, 005, N'中心街道办事处'),
	(23, 05, 03, 006, N'西山街道办事处'),
	(23, 05, 03, 200, N'长胜乡');

/* 黑龙江省 双鸭山市 四方台区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 05, 05, 001, N'振兴中路街道办事处'),
	(23, 05, 05, 002, N'振兴东路街道办事处'),
	(23, 05, 05, 004, N'集贤街道办事处'),
	(23, 05, 05, 005, N'东荣街道办事处'),
	(23, 05, 05, 101, N'太保镇');

/* 黑龙江省 双鸭山市 宝山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 05, 06, 001, N'红旗街道办事处'),
	(23, 05, 06, 002, N'跃进街道办事处'),
	(23, 05, 06, 003, N'东保卫街道办事处'),
	(23, 05, 06, 004, N'七星街道办事处'),
	(23, 05, 06, 005, N'双阳街道办事处'),
	(23, 05, 06, 006, N'新安街道办事处'),
	(23, 05, 06, 007, N'电厂街道办事处'),
	(23, 05, 06, 101, N'七星镇');

/* 黑龙江省 双鸭山市 集贤县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 05, 21, 100, N'福利镇'),
	(23, 05, 21, 101, N'集贤镇'),
	(23, 05, 21, 102, N'升昌镇'),
	(23, 05, 21, 103, N'丰乐镇'),
	(23, 05, 21, 104, N'太平镇'),
	(23, 05, 21, 201, N'腰屯乡'),
	(23, 05, 21, 202, N'兴安乡'),
	(23, 05, 21, 204, N'永安乡');

/* 黑龙江省 双鸭山市 友谊县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 05, 22, 100, N'友谊镇'),
	(23, 05, 22, 101, N'兴隆镇'),
	(23, 05, 22, 102, N'龙山镇'),
	(23, 05, 22, 103, N'凤岗镇'),
	(23, 05, 22, 200, N'兴盛乡'),
	(23, 05, 22, 201, N'东建乡'),
	(23, 05, 22, 202, N'庆丰乡'),
	(23, 05, 22, 203, N'建设乡'),
	(23, 05, 22, 204, N'友邻乡'),
	(23, 05, 22, 205, N'新镇乡'),
	(23, 05, 22, 206, N'成富朝鲜族满族乡');

/* 黑龙江省 双鸭山市 宝清县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 05, 23, 100, N'宝清镇'),
	(23, 05, 23, 101, N'七星泡镇'),
	(23, 05, 23, 102, N'青原镇'),
	(23, 05, 23, 103, N'夹信子镇'),
	(23, 05, 23, 104, N'龙头镇'),
	(23, 05, 23, 105, N'小城子镇'),
	(23, 05, 23, 202, N'朝阳乡'),
	(23, 05, 23, 203, N'万金山乡'),
	(23, 05, 23, 204, N'尖山子乡'),
	(23, 05, 23, 209, N'七星河乡');

/* 黑龙江省 双鸭山市 饶河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 05, 24, 100, N'饶河镇'),
	(23, 05, 24, 101, N'小佳河镇'),
	(23, 05, 24, 102, N'西丰镇'),
	(23, 05, 24, 103, N'五林洞镇'),
	(23, 05, 24, 200, N'西林子乡'),
	(23, 05, 24, 201, N'四排乡'),
	(23, 05, 24, 203, N'大佳河乡'),
	(23, 05, 24, 204, N'山里乡'),
	(23, 05, 24, 207, N'大通河乡');

/* 黑龙江省 大庆市 萨尔图区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 06, 02, 001, N'萨尔图街道办事处'),
	(23, 06, 02, 005, N'铁人街道办事处'),
	(23, 06, 02, 006, N'友谊街道办事处'),
	(23, 06, 02, 007, N'富强街道办事处'),
	(23, 06, 02, 008, N'拥军街道办事处'),
	(23, 06, 02, 009, N'会战街道办事处'),
	(23, 06, 02, 010, N'火炬街道办事处'),
	(23, 06, 02, 011, N'东风街道办事处'),
	(23, 06, 02, 012, N'东安街道办事处');

/* 黑龙江省 大庆市 龙凤区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 06, 03, 001, N'龙凤街道办事处'),
	(23, 06, 03, 002, N'兴化街道办事处'),
	(23, 06, 03, 007, N'卧里屯街道办事处'),
	(23, 06, 03, 008, N'东光街道办事处'),
	(23, 06, 03, 009, N'三永街道办事处'),
	(23, 06, 03, 100, N'龙凤镇');

/* 黑龙江省 大庆市 让胡路区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 06, 04, 001, N'龙岗街道办事处'),
	(23, 06, 04, 002, N'银浪街道办事处'),
	(23, 06, 04, 004, N'奋斗街道办事处'),
	(23, 06, 04, 005, N'庆新街道办事处'),
	(23, 06, 04, 007, N'西宾街道办事处'),
	(23, 06, 04, 009, N'乘风街道办事处'),
	(23, 06, 04, 101, N'喇嘛甸镇');

/* 黑龙江省 大庆市 红岗区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 06, 05, 001, N'红岗街道办事处'),
	(23, 06, 05, 004, N'八百垧街道办事处'),
	(23, 06, 05, 005, N'杏南街道办事处'),
	(23, 06, 05, 006, N'解放街道办事处'),
	(23, 06, 05, 007, N'创业街道办事处'),
	(23, 06, 05, 100, N'杏树岗镇');

/* 黑龙江省 大庆市 大同区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 06, 06, 001, N'庆葡街道办事处'),
	(23, 06, 06, 002, N'高台子镇街道办事处'),
	(23, 06, 06, 004, N'林源镇街道办事处'),
	(23, 06, 06, 005, N'立志街道办事处'),
	(23, 06, 06, 006, N'新华街道办事处'),
	(23, 06, 06, 007, N'大同镇街道办事处'),
	(23, 06, 06, 100, N'大同镇'),
	(23, 06, 06, 101, N'高台子镇'),
	(23, 06, 06, 102, N'太阳升镇'),
	(23, 06, 06, 103, N'林源镇'),
	(23, 06, 06, 200, N'祝三乡'),
	(23, 06, 06, 203, N'老山头乡'),
	(23, 06, 06, 205, N'八井子乡'),
	(23, 06, 06, 206, N'双榆树乡');

/* 黑龙江省 大庆市 肇州县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 06, 21, 100, N'肇州镇'),
	(23, 06, 21, 101, N'永乐镇'),
	(23, 06, 21, 102, N'丰乐镇'),
	(23, 06, 21, 103, N'朝阳沟镇'),
	(23, 06, 21, 104, N'兴城镇'),
	(23, 06, 21, 105, N'二井镇'),
	(23, 06, 21, 202, N'双发乡'),
	(23, 06, 21, 203, N'托古乡'),
	(23, 06, 21, 205, N'朝阳乡'),
	(23, 06, 21, 206, N'永胜乡'),
	(23, 06, 21, 208, N'榆树乡'),
	(23, 06, 21, 211, N'新福乡');

/* 黑龙江省 大庆市 肇源县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 06, 22, 100, N'肇源镇'),
	(23, 06, 22, 101, N'三站镇'),
	(23, 06, 22, 102, N'二站镇'),
	(23, 06, 22, 103, N'茂兴镇'),
	(23, 06, 22, 104, N'古龙镇'),
	(23, 06, 22, 105, N'新站镇'),
	(23, 06, 22, 106, N'头台镇'),
	(23, 06, 22, 107, N'古恰镇'),
	(23, 06, 22, 200, N'福兴乡'),
	(23, 06, 22, 201, N'薄荷台乡'),
	(23, 06, 22, 203, N'和平乡'),
	(23, 06, 22, 207, N'超等乡'),
	(23, 06, 22, 208, N'民意乡'),
	(23, 06, 22, 210, N'义顺乡'),
	(23, 06, 22, 211, N'浩德乡'),
	(23, 06, 22, 212, N'大兴乡');

/* 黑龙江省 大庆市 林甸县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 06, 23, 100, N'林甸镇'),
	(23, 06, 23, 101, N'红旗镇'),
	(23, 06, 23, 102, N'花园镇'),
	(23, 06, 23, 103, N'四季青镇'),
	(23, 06, 23, 104, N'鹤鸣湖镇'),
	(23, 06, 23, 200, N'东兴乡'),
	(23, 06, 23, 201, N'宏伟乡'),
	(23, 06, 23, 204, N'四合乡');

/* 黑龙江省 大庆市 杜尔伯特蒙古族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 06, 24, 100, N'泰康镇'),
	(23, 06, 24, 101, N'胡吉吐莫镇'),
	(23, 06, 24, 102, N'烟筒屯镇'),
	(23, 06, 24, 103, N'他拉哈镇'),
	(23, 06, 24, 104, N'连环湖镇'),
	(23, 06, 24, 200, N'一心乡'),
	(23, 06, 24, 201, N'克尔台乡'),
	(23, 06, 24, 203, N'敖林西伯乡'),
	(23, 06, 24, 204, N'巴彦查干乡'),
	(23, 06, 24, 205, N'腰新乡'),
	(23, 06, 24, 206, N'江湾乡');

/* 黑龙江省 伊春市 伊春区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 02, 001, N'旭日街道办事处'),
	(23, 07, 02, 004, N'红升街道办事处'),
	(23, 07, 02, 006, N'前进街道办事处'),
	(23, 07, 02, 007, N'朝阳街道办事处'),
	(23, 07, 02, 008, N'东升街道办事处');

/* 黑龙江省 伊春市 南岔区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 03, 002, N'西水街道办事处'),
	(23, 07, 03, 004, N'联合街道办事处'),
	(23, 07, 03, 005, N'东升街道办事处'),
	(23, 07, 03, 101, N'晨明镇'),
	(23, 07, 03, 102, N'浩良河镇'),
	(23, 07, 03, 200, N'迎春乡');

/* 黑龙江省 伊春市 友好区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 04, 001, N'友好街道办事处'),
	(23, 07, 04, 003, N'双子河街道办事处'),
	(23, 07, 04, 004, N'铁林街道办事处');

/* 黑龙江省 伊春市 西林区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 05, 001, N'西林街道办事处'),
	(23, 07, 05, 003, N'新兴街道办事处'),
	(23, 07, 05, 005, N'苔青街道办事处');

/* 黑龙江省 伊春市 翠峦区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 06, 001, N'向阳街道办事处'),
	(23, 07, 06, 002, N'曙光街道办事处');

/* 黑龙江省 伊春市 新青区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 07, 001, N'新青街道办事处'),
	(23, 07, 07, 003, N'兴安街道办事处');

/* 黑龙江省 伊春市 美溪区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 08, 001, N'美溪街道办事处');

/* 黑龙江省 伊春市 金山屯区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 09, 002, N'奋斗街道办事处'),
	(23, 07, 09, 003, N'金山街道办事处');

/* 黑龙江省 伊春市 五营区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 10, 001, N'五营街道办事处'),
	(23, 07, 10, 011, N'五星街道办事处');

/* 黑龙江省 伊春市 乌马河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 11, 001, N'乌马河街道办事处');

/* 黑龙江省 伊春市 汤旺河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 12, 001, N'河南街道办事处'),
	(23, 07, 12, 002, N'河北街道办事处');

/* 黑龙江省 伊春市 带岭区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 13, 001, N'带岭街道');

/* 黑龙江省 伊春市 乌伊岭区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 14, 001, N'乌伊岭街道办事处');

/* 黑龙江省 伊春市 红星区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 15, 001, N'红星街道办事处');

/* 黑龙江省 伊春市 上甘岭区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 16, 001, N'红山街道办事处');

/* 黑龙江省 伊春市 嘉荫县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 22, 100, N'朝阳镇'),
	(23, 07, 22, 101, N'乌云镇'),
	(23, 07, 22, 102, N'乌拉嘎镇'),
	(23, 07, 22, 200, N'常胜乡'),
	(23, 07, 22, 201, N'向阳乡'),
	(23, 07, 22, 202, N'沪嘉乡'),
	(23, 07, 22, 203, N'红光乡'),
	(23, 07, 22, 204, N'保兴乡'),
	(23, 07, 22, 205, N'青山乡');

/* 黑龙江省 伊春市 铁力市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 07, 81, 100, N'铁力镇'),
	(23, 07, 81, 101, N'双丰镇'),
	(23, 07, 81, 102, N'桃山镇'),
	(23, 07, 81, 104, N'朗乡镇'),
	(23, 07, 81, 200, N'年丰乡'),
	(23, 07, 81, 201, N'工农乡'),
	(23, 07, 81, 202, N'王杨乡');

/* 黑龙江省 佳木斯市 向阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 08, 03, 001, N'西林街道办事处'),
	(23, 08, 03, 002, N'保卫街道办事处'),
	(23, 08, 03, 003, N'桥南街道办事处'),
	(23, 08, 03, 004, N'西南岗街道办事处'),
	(23, 08, 03, 005, N'建设街道办事处'),
	(23, 08, 03, 006, N'长安街道办事处'),
	(23, 08, 03, 198, N'向阳区（镇）直辖地域');

/* 黑龙江省 佳木斯市 前进区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 08, 04, 198, N'前进区（镇）直辖');

/* 黑龙江省 佳木斯市 东风区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 08, 05, 001, N'晓云街道办事处'),
	(23, 08, 05, 002, N'佳东街道办事处'),
	(23, 08, 05, 003, N'造纸街道办事处'),
	(23, 08, 05, 004, N'佳南街道办事处'),
	(23, 08, 05, 005, N'建国街道办事处'),
	(23, 08, 05, 100, N'建国镇'),
	(23, 08, 05, 200, N'松江乡');

/* 黑龙江省 佳木斯市 郊区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 08, 11, 001, N'佳西街道办事处'),
	(23, 08, 11, 002, N'友谊街道办事处'),
	(23, 08, 11, 101, N'大来镇'),
	(23, 08, 11, 102, N'敖其镇'),
	(23, 08, 11, 103, N'望江镇'),
	(23, 08, 11, 104, N'长发镇'),
	(23, 08, 11, 105, N'莲江口镇'),
	(23, 08, 11, 200, N'长青乡'),
	(23, 08, 11, 201, N'沿江乡'),
	(23, 08, 11, 202, N'西格木乡'),
	(23, 08, 11, 208, N'平安乡'),
	(23, 08, 11, 210, N'四丰乡'),
	(23, 08, 11, 211, N'群胜乡');

/* 黑龙江省 佳木斯市 桦南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 08, 22, 103, N'驼腰子镇'),
	(23, 08, 22, 104, N'石头河子镇'),
	(23, 08, 22, 106, N'桦南镇'),
	(23, 08, 22, 107, N'土龙山镇'),
	(23, 08, 22, 108, N'孟家岗镇'),
	(23, 08, 22, 109, N'闫家镇'),
	(23, 08, 22, 205, N'金沙乡'),
	(23, 08, 22, 213, N'梨树乡'),
	(23, 08, 22, 214, N'明义乡'),
	(23, 08, 22, 215, N'大八浪乡');

/* 黑龙江省 佳木斯市 桦川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 08, 26, 101, N'横头山镇'),
	(23, 08, 26, 103, N'苏家店镇'),
	(23, 08, 26, 104, N'悦来镇'),
	(23, 08, 26, 105, N'新城镇'),
	(23, 08, 26, 106, N'四马架镇'),
	(23, 08, 26, 201, N'东河乡'),
	(23, 08, 26, 202, N'梨丰乡'),
	(23, 08, 26, 205, N'创业乡'),
	(23, 08, 26, 207, N'星火乡');

/* 黑龙江省 佳木斯市 汤原县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 08, 28, 101, N'香兰镇'),
	(23, 08, 28, 102, N'鹤立镇'),
	(23, 08, 28, 103, N'竹帘镇'),
	(23, 08, 28, 104, N'汤原镇'),
	(23, 08, 28, 201, N'汤旺乡'),
	(23, 08, 28, 203, N'胜利乡'),
	(23, 08, 28, 208, N'吉祥乡'),
	(23, 08, 28, 209, N'振兴乡'),
	(23, 08, 28, 210, N'太平川乡'),
	(23, 08, 28, 211, N'永发乡');

/* 黑龙江省 佳木斯市 抚远县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 08, 33, 100, N'抚远镇'),
	(23, 08, 33, 101, N'寒葱沟镇'),
	(23, 08, 33, 102, N'浓桥镇'),
	(23, 08, 33, 103, N'乌苏镇'),
	(23, 08, 33, 200, N'通江乡'),
	(23, 08, 33, 201, N'浓江乡'),
	(23, 08, 33, 202, N'海青乡'),
	(23, 08, 33, 203, N'别拉洪乡'),
	(23, 08, 33, 204, N'鸭南乡');

/* 黑龙江省 佳木斯市 同江市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 08, 81, 001, N'同江市城市管理委员会'),
	(23, 08, 81, 100, N'同江镇'),
	(23, 08, 81, 101, N'乐业镇'),
	(23, 08, 81, 102, N'三村镇'),
	(23, 08, 81, 103, N'临江镇'),
	(23, 08, 81, 104, N'向阳镇'),
	(23, 08, 81, 105, N'青河镇'),
	(23, 08, 81, 204, N'街津口乡'),
	(23, 08, 81, 205, N'八岔乡'),
	(23, 08, 81, 206, N'金川乡'),
	(23, 08, 81, 207, N'银川乡');

/* 黑龙江省 佳木斯市 富锦市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 08, 82, 001, N'城东街道办事处'),
	(23, 08, 82, 002, N'城关社区建设委员会'),
	(23, 08, 82, 003, N'城西街道办事处'),
	(23, 08, 82, 103, N'长安镇'),
	(23, 08, 82, 106, N'砚山镇'),
	(23, 08, 82, 107, N'头林镇'),
	(23, 08, 82, 108, N'兴隆岗镇'),
	(23, 08, 82, 109, N'宏胜镇'),
	(23, 08, 82, 110, N'向阳川镇'),
	(23, 08, 82, 111, N'二龙山镇'),
	(23, 08, 82, 112, N'上街基镇'),
	(23, 08, 82, 113, N'锦山镇'),
	(23, 08, 82, 114, N'大榆树镇');

/* 黑龙江省 七台河市 新兴区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 09, 02, 011, N'兴安社区公共服务站'),
	(23, 09, 02, 012, N'兴乐社区公共服务站'),
	(23, 09, 02, 013, N'兴富社区公共服务站'),
	(23, 09, 02, 014, N'兴秀社区公共服务站'),
	(23, 09, 02, 015, N'兴平社区公共服务站'),
	(23, 09, 02, 016, N'兴和社区公共服务站'),
	(23, 09, 02, 017, N'兴城社区公共服务站'),
	(23, 09, 02, 018, N'兴盛社区公共服务站'),
	(23, 09, 02, 019, N'北山社区公共服务站'),
	(23, 09, 02, 020, N'欣源社区公共服务站'),
	(23, 09, 02, 021, N'冬梅社区公共服务站'),
	(23, 09, 02, 022, N'枫叶社区公共服务站'),
	(23, 09, 02, 023, N'安居社区公共服务站'),
	(23, 09, 02, 024, N'河南社区公共服务站'),
	(23, 09, 02, 025, N'新立社区公共服务站'),
	(23, 09, 02, 026, N'新建社区公共服务站'),
	(23, 09, 02, 027, N'新城社区公共服务站'),
	(23, 09, 02, 028, N'缸窑沟社区公共服务站'),
	(23, 09, 02, 100, N'红旗镇'),
	(23, 09, 02, 200, N'长兴乡');

/* 黑龙江省 七台河市 桃山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 09, 03, 031, N'祥和社区公共服务站'),
	(23, 09, 03, 032, N'运管社区公共服务站'),
	(23, 09, 03, 033, N'安康社区公共服务站'),
	(23, 09, 03, 034, N'文苑社区公共服务站'),
	(23, 09, 03, 035, N'朝阳社区公共服务站'),
	(23, 09, 03, 036, N'东正社区公共服务站'),
	(23, 09, 03, 037, N'旭日社区公共服务站'),
	(23, 09, 03, 038, N'花园社区公共服务站'),
	(23, 09, 03, 039, N'银泉社区公共服务站'),
	(23, 09, 03, 040, N'运销社区公共服务站'),
	(23, 09, 03, 041, N'同仁社区公共服务站'),
	(23, 09, 03, 042, N'东方社区公共服务站'),
	(23, 09, 03, 043, N'学府社区公共服务站'),
	(23, 09, 03, 044, N'桃山社区公共服务站'),
	(23, 09, 03, 045, N'长青社区公共服务站'),
	(23, 09, 03, 100, N'万宝河镇');

/* 黑龙江省 七台河市 茄子河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 09, 04, 001, N'东风街道办事处'),
	(23, 09, 04, 002, N'向阳街道办事处'),
	(23, 09, 04, 003, N'富强街道办事处'),
	(23, 09, 04, 004, N'新富街道办事处'),
	(23, 09, 04, 005, N'龙湖街道办事处'),
	(23, 09, 04, 100, N'茄子河镇'),
	(23, 09, 04, 101, N'宏伟镇'),
	(23, 09, 04, 200, N'铁山乡'),
	(23, 09, 04, 201, N'中心河乡');

/* 黑龙江省 七台河市 勃利县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 09, 21, 001, N'新起街道办事处'),
	(23, 09, 21, 002, N'新华街道办事处'),
	(23, 09, 21, 003, N'元明街道办事处'),
	(23, 09, 21, 004, N'铁西街道办事处'),
	(23, 09, 21, 005, N'城西街道办事处'),
	(23, 09, 21, 100, N'勃利镇'),
	(23, 09, 21, 101, N'小五站镇'),
	(23, 09, 21, 102, N'大四站镇'),
	(23, 09, 21, 103, N'双河镇'),
	(23, 09, 21, 104, N'倭肯镇'),
	(23, 09, 21, 200, N'青山乡'),
	(23, 09, 21, 202, N'永恒乡'),
	(23, 09, 21, 203, N'抢垦乡'),
	(23, 09, 21, 204, N'杏树朝鲜族乡'),
	(23, 09, 21, 205, N'吉兴朝鲜族满族乡');

/* 黑龙江省 牡丹江市 东安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 10, 02, 001, N'新安街道办事处'),
	(23, 10, 02, 002, N'长安街道办事处'),
	(23, 10, 02, 003, N'七星街道办事处'),
	(23, 10, 02, 004, N'五星街道办事处'),
	(23, 10, 02, 101, N'兴隆镇');

/* 黑龙江省 牡丹江市 阳明区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 10, 03, 001, N'阳明街道办事处'),
	(23, 10, 03, 002, N'前进街道办事处'),
	(23, 10, 03, 003, N'新兴街道办事处'),
	(23, 10, 03, 004, N'桦林橡胶厂街道办事处'),
	(23, 10, 03, 100, N'铁岭镇'),
	(23, 10, 03, 101, N'桦林镇'),
	(23, 10, 03, 102, N'磨刀石镇'),
	(23, 10, 03, 103, N'五林镇');

/* 黑龙江省 牡丹江市 爱民区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 10, 04, 001, N'向阳街道办事处'),
	(23, 10, 04, 002, N'黄花街道办事处'),
	(23, 10, 04, 003, N'铁北街道办事处'),
	(23, 10, 04, 004, N'新华街道办事处'),
	(23, 10, 04, 005, N'大庆街道办事处'),
	(23, 10, 04, 006, N'兴平街道办事处'),
	(23, 10, 04, 007, N'北山街道办事处'),
	(23, 10, 04, 100, N'三道关镇');

/* 黑龙江省 牡丹江市 西安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 10, 05, 001, N'先锋街道办事处'),
	(23, 10, 05, 002, N'火炬街道办事处'),
	(23, 10, 05, 003, N'立新街道办事处'),
	(23, 10, 05, 004, N'牡丹街道办事处'),
	(23, 10, 05, 005, N'江滨街道办事处'),
	(23, 10, 05, 006, N'沿江街道办事处'),
	(23, 10, 05, 100, N'温春镇'),
	(23, 10, 05, 201, N'海南朝鲜族乡');

/* 黑龙江省 牡丹江市 东宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 10, 24, 100, N'东宁镇'),
	(23, 10, 24, 101, N'三岔口镇'),
	(23, 10, 24, 102, N'大肚川镇'),
	(23, 10, 24, 103, N'老黑山镇'),
	(23, 10, 24, 104, N'道河镇'),
	(23, 10, 24, 105, N'绥阳镇');

/* 黑龙江省 牡丹江市 林口县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 10, 25, 100, N'林口镇'),
	(23, 10, 25, 101, N'古城镇'),
	(23, 10, 25, 102, N'刁翎镇'),
	(23, 10, 25, 104, N'朱家镇'),
	(23, 10, 25, 105, N'柳树镇'),
	(23, 10, 25, 106, N'三道通镇'),
	(23, 10, 25, 107, N'龙爪镇'),
	(23, 10, 25, 108, N'莲花镇'),
	(23, 10, 25, 200, N'奎山乡'),
	(23, 10, 25, 201, N'青山乡'),
	(23, 10, 25, 202, N'建堂乡');

/* 黑龙江省 牡丹江市 绥芬河市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 10, 81, 100, N'绥芬河镇'),
	(23, 10, 81, 101, N'阜宁镇');

/* 黑龙江省 牡丹江市 海林市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 10, 83, 100, N'海林镇'),
	(23, 10, 83, 101, N'长汀镇'),
	(23, 10, 83, 102, N'横道镇'),
	(23, 10, 83, 103, N'山市镇'),
	(23, 10, 83, 104, N'柴河镇'),
	(23, 10, 83, 105, N'二道镇'),
	(23, 10, 83, 106, N'新安朝鲜族镇'),
	(23, 10, 83, 107, N'三道镇');

/* 黑龙江省 牡丹江市 宁安市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 10, 84, 001, N'城区街道办事处'),
	(23, 10, 84, 100, N'宁安镇'),
	(23, 10, 84, 101, N'东京城镇'),
	(23, 10, 84, 102, N'渤海镇'),
	(23, 10, 84, 103, N'石岩镇'),
	(23, 10, 84, 104, N'沙兰镇'),
	(23, 10, 84, 105, N'海浪镇'),
	(23, 10, 84, 106, N'兰岗镇'),
	(23, 10, 84, 202, N'江南朝鲜族满族乡'),
	(23, 10, 84, 206, N'卧龙朝鲜族乡'),
	(23, 10, 84, 208, N'马河乡'),
	(23, 10, 84, 210, N'镜泊乡'),
	(23, 10, 84, 211, N'三陵乡');

/* 黑龙江省 牡丹江市 穆棱市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 10, 85, 100, N'八面通镇'),
	(23, 10, 85, 101, N'穆棱镇'),
	(23, 10, 85, 102, N'下城子镇'),
	(23, 10, 85, 103, N'马桥河镇'),
	(23, 10, 85, 104, N'兴源镇'),
	(23, 10, 85, 200, N'福录乡'),
	(23, 10, 85, 201, N'河西乡'),
	(23, 10, 85, 202, N'共和乡');

/* 黑龙江省 黑河市 爱辉区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 11, 02, 001, N'花园街道办事处'),
	(23, 11, 02, 002, N'兴安街道办事处'),
	(23, 11, 02, 003, N'海兰街道办事处'),
	(23, 11, 02, 004, N'西兴街道办事处'),
	(23, 11, 02, 101, N'西岗子镇'),
	(23, 11, 02, 102, N'爱辉镇'),
	(23, 11, 02, 103, N'罕达汽镇'),
	(23, 11, 02, 200, N'幸福乡'),
	(23, 11, 02, 201, N'四嘉子乡'),
	(23, 11, 02, 202, N'坤河乡'),
	(23, 11, 02, 203, N'上马厂乡'),
	(23, 11, 02, 204, N'张地营子乡'),
	(23, 11, 02, 205, N'西峰山乡'),
	(23, 11, 02, 206, N'新生乡'),
	(23, 11, 02, 207, N'二站乡');

/* 黑龙江省 黑河市 嫩江县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 11, 21, 100, N'嫩江镇'),
	(23, 11, 21, 101, N'伊拉哈镇'),
	(23, 11, 21, 102, N'双山镇'),
	(23, 11, 21, 103, N'多宝山镇'),
	(23, 11, 21, 104, N'海江镇'),
	(23, 11, 21, 105, N'前进镇'),
	(23, 11, 21, 106, N'长福镇'),
	(23, 11, 21, 107, N'科洛镇'),
	(23, 11, 21, 202, N'临江乡'),
	(23, 11, 21, 206, N'联兴乡'),
	(23, 11, 21, 207, N'白云乡'),
	(23, 11, 21, 208, N'塔溪乡'),
	(23, 11, 21, 210, N'霍龙门乡'),
	(23, 11, 21, 211, N'长江乡');

/* 黑龙江省 黑河市 逊克县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 11, 23, 001, N'奇克街道办事处'),
	(23, 11, 23, 100, N'奇克镇'),
	(23, 11, 23, 101, N'逊河镇'),
	(23, 11, 23, 102, N'逊克县克林镇'),
	(23, 11, 23, 201, N'干岔子乡'),
	(23, 11, 23, 202, N'松树沟乡'),
	(23, 11, 23, 203, N'车陆乡'),
	(23, 11, 23, 204, N'新鄂乡'),
	(23, 11, 23, 205, N'新兴乡'),
	(23, 11, 23, 207, N'宝山乡');

/* 黑龙江省 黑河市 孙吴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 11, 24, 001, N'孙吴城区街道办事处'),
	(23, 11, 24, 100, N'孙吴镇'),
	(23, 11, 24, 101, N'辰清镇'),
	(23, 11, 24, 201, N'西兴乡'),
	(23, 11, 24, 202, N'沿江满族乡'),
	(23, 11, 24, 203, N'腰屯乡'),
	(23, 11, 24, 204, N'卧牛河乡'),
	(23, 11, 24, 205, N'群山乡'),
	(23, 11, 24, 206, N'奋斗乡'),
	(23, 11, 24, 207, N'红旗乡'),
	(23, 11, 24, 208, N'正阳山乡'),
	(23, 11, 24, 210, N'清溪乡');

/* 黑龙江省 黑河市 北安市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 11, 81, 001, N'兆麟街道办事处'),
	(23, 11, 81, 002, N'和平街道办事处'),
	(23, 11, 81, 003, N'北岗街道办事处'),
	(23, 11, 81, 004, N'庆华街道办事处'),
	(23, 11, 81, 005, N'铁西街道办事处'),
	(23, 11, 81, 006, N'铁南街道办事处'),
	(23, 11, 81, 101, N'通北镇'),
	(23, 11, 81, 102, N'赵光镇'),
	(23, 11, 81, 103, N'海星镇'),
	(23, 11, 81, 104, N'石泉镇'),
	(23, 11, 81, 105, N'二井镇'),
	(23, 11, 81, 200, N'城郊乡'),
	(23, 11, 81, 201, N'东胜乡'),
	(23, 11, 81, 203, N'杨家乡'),
	(23, 11, 81, 207, N'主星乡');

/* 黑龙江省 黑河市 五大连池市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 11, 82, 001, N'青山街道办事处'),
	(23, 11, 82, 101, N'龙镇'),
	(23, 11, 82, 102, N'和平镇'),
	(23, 11, 82, 103, N'五大连池镇'),
	(23, 11, 82, 104, N'双泉镇'),
	(23, 11, 82, 105, N'新发镇'),
	(23, 11, 82, 106, N'团结镇'),
	(23, 11, 82, 202, N'兴隆乡'),
	(23, 11, 82, 203, N'建设乡'),
	(23, 11, 82, 205, N'太平乡'),
	(23, 11, 82, 208, N'兴安乡'),
	(23, 11, 82, 210, N'朝阳乡');

/* 黑龙江省 绥化市 北林区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 12, 02, 001, N'紫来办事处'),
	(23, 12, 02, 002, N'爱路办事处'),
	(23, 12, 02, 003, N'大有办事处'),
	(23, 12, 02, 004, N'吉泰办事处'),
	(23, 12, 02, 005, N'东兴办事处'),
	(23, 12, 02, 006, N'北林办事处'),
	(23, 12, 02, 101, N'宝山镇'),
	(23, 12, 02, 102, N'绥胜镇'),
	(23, 12, 02, 103, N'西长发镇'),
	(23, 12, 02, 104, N'永安镇'),
	(23, 12, 02, 105, N'太平川镇'),
	(23, 12, 02, 106, N'秦家镇'),
	(23, 12, 02, 107, N'双河镇'),
	(23, 12, 02, 108, N'三河镇'),
	(23, 12, 02, 109, N'四方台镇'),
	(23, 12, 02, 110, N'津河镇'),
	(23, 12, 02, 111, N'张维镇'),
	(23, 12, 02, 113, N'东津镇'),
	(23, 12, 02, 114, N'东富镇'),
	(23, 12, 02, 201, N'红旗乡'),
	(23, 12, 02, 202, N'连岗乡'),
	(23, 12, 02, 203, N'新华乡'),
	(23, 12, 02, 204, N'兴福乡'),
	(23, 12, 02, 209, N'三井乡'),
	(23, 12, 02, 212, N'五营乡'),
	(23, 12, 02, 213, N'兴和乡');

/* 黑龙江省 绥化市 望奎县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 12, 21, 100, N'望奎镇'),
	(23, 12, 21, 101, N'通江镇'),
	(23, 12, 21, 102, N'卫星镇'),
	(23, 12, 21, 103, N'海丰镇'),
	(23, 12, 21, 104, N'莲花镇'),
	(23, 12, 21, 105, N'惠七满族镇'),
	(23, 12, 21, 106, N'先锋镇'),
	(23, 12, 21, 107, N'火箭镇'),
	(23, 12, 21, 108, N'东郊镇'),
	(23, 12, 21, 202, N'灵山满族乡'),
	(23, 12, 21, 203, N'后三乡'),
	(23, 12, 21, 207, N'灯塔乡'),
	(23, 12, 21, 209, N'东升乡'),
	(23, 12, 21, 210, N'恭六乡'),
	(23, 12, 21, 211, N'厢白满族乡');

/* 黑龙江省 绥化市 兰西县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 12, 22, 101, N'兰西镇'),
	(23, 12, 22, 102, N'榆林镇'),
	(23, 12, 22, 103, N'临江镇'),
	(23, 12, 22, 104, N'平山镇'),
	(23, 12, 22, 105, N'红光镇'),
	(23, 12, 22, 106, N'远大镇'),
	(23, 12, 22, 200, N'康荣乡'),
	(23, 12, 22, 201, N'燎原乡'),
	(23, 12, 22, 202, N'北安乡'),
	(23, 12, 22, 203, N'长江乡'),
	(23, 12, 22, 204, N'兰河乡'),
	(23, 12, 22, 205, N'红星乡'),
	(23, 12, 22, 207, N'长岗乡'),
	(23, 12, 22, 210, N'星火乡'),
	(23, 12, 22, 211, N'奋斗乡');

/* 黑龙江省 绥化市 青冈县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 12, 23, 100, N'青冈镇'),
	(23, 12, 23, 101, N'中和镇'),
	(23, 12, 23, 102, N'祯祥镇'),
	(23, 12, 23, 103, N'兴华镇'),
	(23, 12, 23, 104, N'永丰镇'),
	(23, 12, 23, 105, N'芦河镇'),
	(23, 12, 23, 106, N'民政镇'),
	(23, 12, 23, 107, N'柞岗镇'),
	(23, 12, 23, 108, N'劳动镇'),
	(23, 12, 23, 109, N'迎春镇'),
	(23, 12, 23, 202, N'建设乡'),
	(23, 12, 23, 203, N'新村乡'),
	(23, 12, 23, 206, N'昌盛乡'),
	(23, 12, 23, 209, N'德胜乡'),
	(23, 12, 23, 212, N'连丰乡');

/* 黑龙江省 绥化市 庆安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 12, 24, 101, N'庆安镇'),
	(23, 12, 24, 102, N'民乐镇'),
	(23, 12, 24, 103, N'大罗镇'),
	(23, 12, 24, 104, N'平安镇'),
	(23, 12, 24, 105, N'勤劳镇'),
	(23, 12, 24, 106, N'久胜镇'),
	(23, 12, 24, 107, N'同乐镇'),
	(23, 12, 24, 201, N'建民乡'),
	(23, 12, 24, 202, N'巨宝山乡'),
	(23, 12, 24, 204, N'新胜乡'),
	(23, 12, 24, 206, N'丰收乡'),
	(23, 12, 24, 208, N'发展乡'),
	(23, 12, 24, 210, N'致富乡'),
	(23, 12, 24, 211, N'欢胜乡');

/* 黑龙江省 绥化市 明水县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 12, 25, 100, N'明水镇'),
	(23, 12, 25, 101, N'兴仁镇'),
	(23, 12, 25, 102, N'永兴镇'),
	(23, 12, 25, 103, N'崇德镇'),
	(23, 12, 25, 104, N'通达镇'),
	(23, 12, 25, 201, N'双兴乡'),
	(23, 12, 25, 203, N'永久乡'),
	(23, 12, 25, 204, N'树人乡'),
	(23, 12, 25, 205, N'光荣乡'),
	(23, 12, 25, 206, N'繁荣乡'),
	(23, 12, 25, 207, N'通泉乡'),
	(23, 12, 25, 208, N'育林乡');

/* 黑龙江省 绥化市 绥棱县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 12, 26, 100, N'绥棱镇'),
	(23, 12, 26, 101, N'上集镇'),
	(23, 12, 26, 102, N'四海店镇'),
	(23, 12, 26, 103, N'双岔河镇'),
	(23, 12, 26, 104, N'阁山镇'),
	(23, 12, 26, 200, N'靠山乡'),
	(23, 12, 26, 201, N'后头乡'),
	(23, 12, 26, 203, N'长山乡'),
	(23, 12, 26, 205, N'克音河乡'),
	(23, 12, 26, 206, N'绥中乡'),
	(23, 12, 26, 207, N'泥尔河乡');

/* 黑龙江省 绥化市 安达市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 12, 81, 001, N'铁西街道办事处'),
	(23, 12, 81, 002, N'新兴街道办事处'),
	(23, 12, 81, 003, N'安虹街道办事处'),
	(23, 12, 81, 100, N'安达镇'),
	(23, 12, 81, 101, N'任民镇'),
	(23, 12, 81, 103, N'万宝山镇'),
	(23, 12, 81, 104, N'昌德镇'),
	(23, 12, 81, 105, N'升平镇'),
	(23, 12, 81, 106, N'羊草镇'),
	(23, 12, 81, 107, N'老虎岗镇'),
	(23, 12, 81, 108, N'中本镇'),
	(23, 12, 81, 109, N'太平庄镇'),
	(23, 12, 81, 110, N'吉兴岗镇'),
	(23, 12, 81, 202, N'火石山乡'),
	(23, 12, 81, 204, N'卧里屯乡'),
	(23, 12, 81, 205, N'青肯泡乡'),
	(23, 12, 81, 209, N'先源乡');

/* 黑龙江省 绥化市 肇东市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 12, 82, 001, N'朝阳区办事处'),
	(23, 12, 82, 002, N'东升区办事处'),
	(23, 12, 82, 003, N'西园区办事处'),
	(23, 12, 82, 004, N'正阳区办事处'),
	(23, 12, 82, 100, N'肇东镇'),
	(23, 12, 82, 101, N'昌五镇'),
	(23, 12, 82, 102, N'宋站镇'),
	(23, 12, 82, 103, N'五站镇'),
	(23, 12, 82, 104, N'尚家镇'),
	(23, 12, 82, 105, N'姜家镇'),
	(23, 12, 82, 106, N'里木店镇'),
	(23, 12, 82, 107, N'四站镇'),
	(23, 12, 82, 108, N'涝洲镇'),
	(23, 12, 82, 109, N'五里明镇'),
	(23, 12, 82, 110, N'黎明镇'),
	(23, 12, 82, 111, N'西八里镇'),
	(23, 12, 82, 201, N'太平乡'),
	(23, 12, 82, 203, N'海城乡'),
	(23, 12, 82, 204, N'向阳乡'),
	(23, 12, 82, 205, N'洪河乡'),
	(23, 12, 82, 206, N'跃进乡'),
	(23, 12, 82, 212, N'德昌乡'),
	(23, 12, 82, 213, N'宣化乡'),
	(23, 12, 82, 214, N'安民乡'),
	(23, 12, 82, 215, N'明久乡');

/* 黑龙江省 绥化市 海伦市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 12, 83, 100, N'海伦镇'),
	(23, 12, 83, 101, N'海北镇'),
	(23, 12, 83, 102, N'伦河镇'),
	(23, 12, 83, 103, N'共合镇'),
	(23, 12, 83, 104, N'海兴镇'),
	(23, 12, 83, 105, N'祥富镇'),
	(23, 12, 83, 106, N'东风镇'),
	(23, 12, 83, 107, N'百祥镇'),
	(23, 12, 83, 202, N'前进乡'),
	(23, 12, 83, 203, N'向荣乡'),
	(23, 12, 83, 204, N'长发乡'),
	(23, 12, 83, 205, N'东林乡'),
	(23, 12, 83, 208, N'海南乡'),
	(23, 12, 83, 209, N'共荣乡'),
	(23, 12, 83, 210, N'乐业乡'),
	(23, 12, 83, 211, N'福民乡'),
	(23, 12, 83, 212, N'丰山乡'),
	(23, 12, 83, 213, N'永富乡'),
	(23, 12, 83, 216, N'联发乡'),
	(23, 12, 83, 217, N'永和乡'),
	(23, 12, 83, 218, N'爱民乡'),
	(23, 12, 83, 220, N'扎音河乡'),
	(23, 12, 83, 221, N'双录乡');

/* 黑龙江省 大兴安岭地区 呼玛县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 27, 21, 100, N'呼玛镇'),
	(23, 27, 21, 101, N'韩家园镇'),
	(23, 27, 21, 200, N'三卡乡'),
	(23, 27, 21, 201, N'金山乡'),
	(23, 27, 21, 202, N'兴华乡'),
	(23, 27, 21, 203, N'鸥浦乡'),
	(23, 27, 21, 204, N'白银纳鄂伦春族民族乡'),
	(23, 27, 21, 205, N'北疆乡');

/* 黑龙江省 大兴安岭地区 塔河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 27, 22, 100, N'塔河镇'),
	(23, 27, 22, 101, N'瓦拉干镇'),
	(23, 27, 22, 102, N'盘古镇'),
	(23, 27, 22, 103, N'古驿镇'),
	(23, 27, 22, 200, N'十八站鄂伦春族民族乡'),
	(23, 27, 22, 201, N'依西肯乡'),
	(23, 27, 22, 202, N'开库康乡');

/* 黑龙江省 大兴安岭地区 漠河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(23, 27, 23, 100, N'西林吉镇'),
	(23, 27, 23, 101, N'图强镇'),
	(23, 27, 23, 102, N'阿木尔镇'),
	(23, 27, 23, 103, N'兴安镇'),
	(23, 27, 23, 104, N'北极镇'),
	(23, 27, 23, 105, N'古莲镇');
