SET NOCOUNT ON;
SET XACT_ABORT ON;

/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

/*
 * 《2015年统计用区划代码和城乡划分代码（截止2015年09月30日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2015/index.html）
 * 数据范围：陕西省(61)、甘肃省(62)、青海省(63)。
 */

/* 陕西省 西安市 新城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 02, 001, N'西一路街道办事处'),
	(61, 01, 02, 002, N'长乐中路街道办事处'),
	(61, 01, 02, 003, N'中山门街道办事处'),
	(61, 01, 02, 004, N'韩森寨街道办事处'),
	(61, 01, 02, 005, N'解放门街道办事处'),
	(61, 01, 02, 006, N'自强路街道办事处'),
	(61, 01, 02, 007, N'太华路街道办事处'),
	(61, 01, 02, 008, N'长乐西路街道办事处'),
	(61, 01, 02, 009, N'胡家庙街道办事处');

/* 陕西省 西安市 碑林区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 03, 001, N'南院门街道办事处'),
	(61, 01, 03, 002, N'柏树林街道办事处'),
	(61, 01, 03, 003, N'长乐坊街道办事处'),
	(61, 01, 03, 004, N'东关南街街道办事处'),
	(61, 01, 03, 005, N'太乙路街道办事处'),
	(61, 01, 03, 006, N'文艺路街道办事处'),
	(61, 01, 03, 007, N'长安路街道办事处'),
	(61, 01, 03, 008, N'张家村街道办事处');

/* 陕西省 西安市 莲湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 04, 001, N'青年路街道办事处'),
	(61, 01, 04, 002, N'北院门街道办事处'),
	(61, 01, 04, 003, N'北关街道办事处'),
	(61, 01, 04, 004, N'红庙坡街道办事处'),
	(61, 01, 04, 005, N'环城西路街道办事处'),
	(61, 01, 04, 006, N'西关街道办事处'),
	(61, 01, 04, 007, N'土门街道办事处'),
	(61, 01, 04, 008, N'桃园路街道办事处'),
	(61, 01, 04, 009, N'枣园街道办事处');

/* 陕西省 西安市 灞桥区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 11, 001, N'纺织城街道办事处'),
	(61, 01, 11, 002, N'十里铺街道办事处'),
	(61, 01, 11, 003, N'红旗街道办事处'),
	(61, 01, 11, 004, N'席王街道办事处'),
	(61, 01, 11, 005, N'洪庆街道办事处'),
	(61, 01, 11, 006, N'狄寨街道办事处'),
	(61, 01, 11, 007, N'灞桥街道办事处'),
	(61, 01, 11, 008, N'新筑街道办事处'),
	(61, 01, 11, 009, N'新合街道办事处');

/* 陕西省 西安市 未央区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 12, 001, N'张家堡街道办事处'),
	(61, 01, 12, 002, N'三桥街道办事处'),
	(61, 01, 12, 003, N'辛家庙街道办事处'),
	(61, 01, 12, 004, N'徐家湾街道办事处'),
	(61, 01, 12, 005, N'大明宫街道办事处'),
	(61, 01, 12, 006, N'谭家街道办事处'),
	(61, 01, 12, 007, N'草滩街道办事处'),
	(61, 01, 12, 008, N'六村堡街道办事处'),
	(61, 01, 12, 009, N'未央宫街道办事处'),
	(61, 01, 12, 010, N'汉城街道办事处'),
	(61, 01, 12, 011, N'未央湖街道办事处'),
	(61, 01, 12, 012, N'建章路街道办事处');

/* 陕西省 西安市 雁塔区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 13, 001, N'小寨路街道办事处'),
	(61, 01, 13, 002, N'大雁塔街道办事处'),
	(61, 01, 13, 003, N'长延堡街道办事处'),
	(61, 01, 13, 004, N'电子城街道办事处'),
	(61, 01, 13, 005, N'等驾坡街道办事处'),
	(61, 01, 13, 006, N'鱼化寨街道办事处'),
	(61, 01, 13, 007, N'丈八沟街道办事处'),
	(61, 01, 13, 008, N'曲江街道办事处');

/* 陕西省 西安市 阎良区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 14, 001, N'凤凰路街道办事处'),
	(61, 01, 14, 002, N'新华路街道办事处'),
	(61, 01, 14, 003, N'振兴街道办事处'),
	(61, 01, 14, 004, N'新兴街道办事处'),
	(61, 01, 14, 005, N'北屯街道办事处'),
	(61, 01, 14, 100, N'武屯镇'),
	(61, 01, 14, 101, N'关山镇');

/* 陕西省 西安市 临潼区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 15, 001, N'骊山街道办事处'),
	(61, 01, 15, 002, N'秦陵街道办事处'),
	(61, 01, 15, 003, N'新丰街道办事处'),
	(61, 01, 15, 004, N'代王街道办事处'),
	(61, 01, 15, 005, N'斜口街道办事处'),
	(61, 01, 15, 006, N'行者街道办事处'),
	(61, 01, 15, 007, N'零口街道办事处'),
	(61, 01, 15, 008, N'相桥街道办事处'),
	(61, 01, 15, 009, N'雨金街道办事处'),
	(61, 01, 15, 010, N'新市街道办事处'),
	(61, 01, 15, 011, N'徐杨街道办事处'),
	(61, 01, 15, 012, N'西泉街道办事处'),
	(61, 01, 15, 013, N'栎阳街道办事处'),
	(61, 01, 15, 014, N'马额街道办事处'),
	(61, 01, 15, 015, N'何寨街道办事处'),
	(61, 01, 15, 016, N'交口街道办事处'),
	(61, 01, 15, 017, N'油槐街道办事处'),
	(61, 01, 15, 018, N'北田街道办事处'),
	(61, 01, 15, 019, N'铁炉街道办事处'),
	(61, 01, 15, 020, N'任留街道办事处'),
	(61, 01, 15, 021, N'穆寨街道办事处'),
	(61, 01, 15, 022, N'小金街道办事处'),
	(61, 01, 15, 023, N'仁宗街道办事处');

/* 陕西省 西安市 长安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 16, 001, N'韦曲街道办事处'),
	(61, 01, 16, 002, N'郭杜街道办事处'),
	(61, 01, 16, 003, N'滦镇街道办事处'),
	(61, 01, 16, 004, N'引镇街道办事处'),
	(61, 01, 16, 005, N'王寺街道办事处'),
	(61, 01, 16, 006, N'马王街道办事处'),
	(61, 01, 16, 007, N'太乙宫街道办事处'),
	(61, 01, 16, 008, N'东大街道办事处'),
	(61, 01, 16, 009, N'子午街道办事处'),
	(61, 01, 16, 010, N'斗门街道办事处'),
	(61, 01, 16, 011, N'细柳街道办事处'),
	(61, 01, 16, 012, N'杜曲街道办事处'),
	(61, 01, 16, 013, N'大兆街道办事处'),
	(61, 01, 16, 014, N'黄良街道办事处'),
	(61, 01, 16, 015, N'兴隆街道办事处'),
	(61, 01, 16, 016, N'王曲街道办事处'),
	(61, 01, 16, 017, N'鸣犊街道办事处'),
	(61, 01, 16, 018, N'王莽街道办事处'),
	(61, 01, 16, 019, N'五台街道办事处'),
	(61, 01, 16, 020, N'高桥街道办事处'),
	(61, 01, 16, 021, N'五星街道办事处'),
	(61, 01, 16, 022, N'灵沼街道办事处'),
	(61, 01, 16, 023, N'杨庄街道办事处'),
	(61, 01, 16, 024, N'砲里街道办事处'),
	(61, 01, 16, 025, N'魏寨街道办事处');

/* 陕西省 西安市 高陵区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 17, 001, N'鹿苑街道办事处'),
	(61, 01, 17, 002, N'泾渭街道办事处'),
	(61, 01, 17, 003, N'崇皇街道办事处'),
	(61, 01, 17, 101, N'通远镇'),
	(61, 01, 17, 102, N'耿镇'),
	(61, 01, 17, 106, N'张卜镇');

/* 陕西省 西安市 蓝田县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 22, 001, N'蓝关街道办事处'),
	(61, 01, 22, 101, N'洩湖镇'),
	(61, 01, 22, 102, N'华胥镇'),
	(61, 01, 22, 103, N'前卫镇'),
	(61, 01, 22, 104, N'汤峪镇'),
	(61, 01, 22, 105, N'焦岱镇'),
	(61, 01, 22, 106, N'玉山镇'),
	(61, 01, 22, 107, N'三里镇'),
	(61, 01, 22, 108, N'普化镇'),
	(61, 01, 22, 109, N'葛牌镇'),
	(61, 01, 22, 110, N'灞源镇'),
	(61, 01, 22, 111, N'九间房镇'),
	(61, 01, 22, 112, N'蓝桥镇'),
	(61, 01, 22, 113, N'辋川镇'),
	(61, 01, 22, 115, N'厚镇'),
	(61, 01, 22, 116, N'三官庙镇'),
	(61, 01, 22, 118, N'安村镇'),
	(61, 01, 22, 119, N'孟村镇'),
	(61, 01, 22, 120, N'小寨镇');

/* 陕西省 西安市 周至县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 24, 001, N'二曲街道办事处'),
	(61, 01, 24, 101, N'哑柏镇'),
	(61, 01, 24, 102, N'终南镇'),
	(61, 01, 24, 103, N'马召镇'),
	(61, 01, 24, 104, N'集贤镇'),
	(61, 01, 24, 105, N'楼观镇'),
	(61, 01, 24, 106, N'尚村镇'),
	(61, 01, 24, 107, N'广济镇'),
	(61, 01, 24, 108, N'厚畛子镇'),
	(61, 01, 24, 109, N'青化镇'),
	(61, 01, 24, 110, N'竹峪镇'),
	(61, 01, 24, 111, N'翠峰镇'),
	(61, 01, 24, 112, N'四屯镇'),
	(61, 01, 24, 115, N'司竹镇'),
	(61, 01, 24, 116, N'九峰镇'),
	(61, 01, 24, 117, N'富仁镇'),
	(61, 01, 24, 118, N'骆峪镇'),
	(61, 01, 24, 119, N'陈河镇'),
	(61, 01, 24, 120, N'板房子镇'),
	(61, 01, 24, 121, N'王家河镇');

/* 陕西省 西安市 户县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 01, 25, 001, N'甘亭街道办'),
	(61, 01, 25, 101, N'余下镇'),
	(61, 01, 25, 102, N'祖庵镇'),
	(61, 01, 25, 103, N'秦渡镇'),
	(61, 01, 25, 104, N'大王镇'),
	(61, 01, 25, 105, N'草堂镇'),
	(61, 01, 25, 106, N'蒋村镇'),
	(61, 01, 25, 107, N'庞光镇'),
	(61, 01, 25, 108, N'涝店镇'),
	(61, 01, 25, 109, N'甘河镇'),
	(61, 01, 25, 110, N'石井镇'),
	(61, 01, 25, 111, N'玉蝉镇'),
	(61, 01, 25, 112, N'五竹镇'),
	(61, 01, 25, 114, N'渭丰镇');

/* 陕西省 铜川市 王益区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 02, 02, 001, N'七一路街道办事处'),
	(61, 02, 02, 002, N'红旗街道办事处'),
	(61, 02, 02, 003, N'桃园街道办事处'),
	(61, 02, 02, 004, N'青年路街道办事处'),
	(61, 02, 02, 005, N'王家河街道办事处'),
	(61, 02, 02, 006, N'王益街道办事处'),
	(61, 02, 02, 100, N'黄堡镇');

/* 陕西省 铜川市 印台区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 02, 03, 001, N'城关街道办事处'),
	(61, 02, 03, 002, N'三里洞街道办事处'),
	(61, 02, 03, 003, N'王石凹街道办事处'),
	(61, 02, 03, 004, N'印台街道办事处'),
	(61, 02, 03, 100, N'陈炉镇'),
	(61, 02, 03, 101, N'红土镇'),
	(61, 02, 03, 102, N'广阳镇'),
	(61, 02, 03, 104, N'金锁关镇'),
	(61, 02, 03, 106, N'阿庄镇');

/* 陕西省 铜川市 耀州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 02, 04, 001, N'永安路街道办事处'),
	(61, 02, 04, 002, N'天宝路街道办事处'),
	(61, 02, 04, 003, N'咸丰路街道办事处'),
	(61, 02, 04, 004, N'正阳路街道办事处'),
	(61, 02, 04, 005, N'锦阳路街道办事处'),
	(61, 02, 04, 006, N'坡头街道办事处'),
	(61, 02, 04, 101, N'董家河镇'),
	(61, 02, 04, 102, N'庙湾镇'),
	(61, 02, 04, 103, N'瑶曲镇'),
	(61, 02, 04, 104, N'照金镇'),
	(61, 02, 04, 107, N'小丘镇'),
	(61, 02, 04, 108, N'孙塬镇'),
	(61, 02, 04, 109, N'关庄镇'),
	(61, 02, 04, 111, N'石柱镇');

/* 陕西省 铜川市 宜君县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 02, 22, 001, N'宜阳街道办事处'),
	(61, 02, 22, 101, N'彭镇'),
	(61, 02, 22, 102, N'五里镇'),
	(61, 02, 22, 103, N'太安镇'),
	(61, 02, 22, 104, N'棋盘镇'),
	(61, 02, 22, 105, N'尧生镇'),
	(61, 02, 22, 106, N'哭泉镇'),
	(61, 02, 22, 201, N'云梦乡');

/* 陕西省 宝鸡市 渭滨区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 02, 001, N'金陵街道办事处'),
	(61, 03, 02, 002, N'经二路街道办事处'),
	(61, 03, 02, 003, N'清姜街道办事处'),
	(61, 03, 02, 004, N'姜谭街道办事处'),
	(61, 03, 02, 005, N'桥南街道办事处'),
	(61, 03, 02, 100, N'马营镇'),
	(61, 03, 02, 101, N'石鼓镇'),
	(61, 03, 02, 102, N'神农镇'),
	(61, 03, 02, 103, N'高家镇'),
	(61, 03, 02, 104, N'八鱼镇');

/* 陕西省 宝鸡市 金台区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 03, 001, N'中山东路街道办事处'),
	(61, 03, 03, 002, N'西关街道办事处'),
	(61, 03, 03, 003, N'中山西路街道办事处'),
	(61, 03, 03, 004, N'群众路街道办事处'),
	(61, 03, 03, 006, N'东风路街道办事处'),
	(61, 03, 03, 007, N'十里铺街道办事处'),
	(61, 03, 03, 008, N'卧龙寺街道办事处'),
	(61, 03, 03, 100, N'陈仓镇'),
	(61, 03, 03, 101, N'蟠龙镇'),
	(61, 03, 03, 102, N'金河镇'),
	(61, 03, 03, 103, N'硖石镇');

/* 陕西省 宝鸡市 陈仓区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 04, 001, N'虢镇街道办事处'),
	(61, 03, 04, 002, N'东关街道办事处'),
	(61, 03, 04, 003, N'千渭街道办事处'),
	(61, 03, 04, 101, N'阳平镇'),
	(61, 03, 04, 102, N'千河镇'),
	(61, 03, 04, 103, N'磻溪镇'),
	(61, 03, 04, 104, N'天王镇'),
	(61, 03, 04, 105, N'慕仪镇'),
	(61, 03, 04, 106, N'周原镇'),
	(61, 03, 04, 107, N'贾村镇'),
	(61, 03, 04, 109, N'县功镇'),
	(61, 03, 04, 110, N'新街镇'),
	(61, 03, 04, 111, N'坪头镇'),
	(61, 03, 04, 112, N'香泉镇'),
	(61, 03, 04, 113, N'赤沙镇'),
	(61, 03, 04, 114, N'拓石镇'),
	(61, 03, 04, 115, N'凤阁岭镇'),
	(61, 03, 04, 116, N'钓渭镇');

/* 陕西省 宝鸡市 凤翔县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 22, 100, N'城关镇'),
	(61, 03, 22, 101, N'虢王镇'),
	(61, 03, 22, 102, N'彪角镇'),
	(61, 03, 22, 103, N'横水镇'),
	(61, 03, 22, 104, N'田家庄镇'),
	(61, 03, 22, 105, N'糜杆桥镇'),
	(61, 03, 22, 107, N'南指挥镇'),
	(61, 03, 22, 108, N'陈村镇'),
	(61, 03, 22, 109, N'长青镇'),
	(61, 03, 22, 110, N'柳林镇'),
	(61, 03, 22, 111, N'姚家沟镇'),
	(61, 03, 22, 112, N'范家寨镇');

/* 陕西省 宝鸡市 岐山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 23, 100, N'凤鸣镇'),
	(61, 03, 23, 101, N'蔡家坡镇'),
	(61, 03, 23, 103, N'益店镇'),
	(61, 03, 23, 104, N'蒲村镇'),
	(61, 03, 23, 106, N'青化镇'),
	(61, 03, 23, 107, N'枣林镇'),
	(61, 03, 23, 108, N'雍川镇'),
	(61, 03, 23, 111, N'故郡镇'),
	(61, 03, 23, 112, N'京当镇');

/* 陕西省 宝鸡市 扶风县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 24, 100, N'城关镇'),
	(61, 03, 24, 101, N'天度镇'),
	(61, 03, 24, 102, N'午井镇'),
	(61, 03, 24, 103, N'绛帐镇'),
	(61, 03, 24, 104, N'段家镇'),
	(61, 03, 24, 105, N'杏林镇'),
	(61, 03, 24, 106, N'召公镇'),
	(61, 03, 24, 107, N'法门镇');

/* 陕西省 宝鸡市 眉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 26, 100, N'首善镇'),
	(61, 03, 26, 101, N'横渠镇'),
	(61, 03, 26, 102, N'槐芽镇'),
	(61, 03, 26, 103, N'汤峪镇'),
	(61, 03, 26, 104, N'常兴镇'),
	(61, 03, 26, 105, N'金渠镇'),
	(61, 03, 26, 106, N'营头镇'),
	(61, 03, 26, 107, N'齐镇');

/* 陕西省 宝鸡市 陇县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 27, 100, N'城关镇'),
	(61, 03, 27, 101, N'东风镇'),
	(61, 03, 27, 102, N'八渡镇'),
	(61, 03, 27, 104, N'东南镇'),
	(61, 03, 27, 106, N'温水镇'),
	(61, 03, 27, 107, N'天成镇'),
	(61, 03, 27, 108, N'曹家湾镇'),
	(61, 03, 27, 109, N'固关镇'),
	(61, 03, 27, 112, N'河北镇'),
	(61, 03, 27, 113, N'新集川镇');

/* 陕西省 宝鸡市 千阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 28, 100, N'城关镇'),
	(61, 03, 28, 101, N'崔家头镇'),
	(61, 03, 28, 102, N'南寨镇'),
	(61, 03, 28, 103, N'张家塬镇'),
	(61, 03, 28, 104, N'水沟镇'),
	(61, 03, 28, 105, N'草碧镇'),
	(61, 03, 28, 107, N'高崖镇');

/* 陕西省 宝鸡市 麟游县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 29, 100, N'九成宫镇'),
	(61, 03, 29, 101, N'崔木镇'),
	(61, 03, 29, 102, N'招贤镇'),
	(61, 03, 29, 103, N'两亭镇'),
	(61, 03, 29, 105, N'常丰镇'),
	(61, 03, 29, 106, N'丈八镇'),
	(61, 03, 29, 107, N'酒房镇');

/* 陕西省 宝鸡市 凤县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 30, 100, N'双石铺镇'),
	(61, 03, 30, 101, N'凤州镇'),
	(61, 03, 30, 102, N'黄牛铺镇'),
	(61, 03, 30, 103, N'红花铺镇'),
	(61, 03, 30, 104, N'河口镇'),
	(61, 03, 30, 105, N'唐藏镇'),
	(61, 03, 30, 106, N'平木镇'),
	(61, 03, 30, 107, N'坪坎镇'),
	(61, 03, 30, 110, N'留凤关镇');

/* 陕西省 宝鸡市 太白县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 03, 31, 100, N'咀头镇'),
	(61, 03, 31, 101, N'桃川镇'),
	(61, 03, 31, 102, N'鹦鸽镇'),
	(61, 03, 31, 103, N'靖口镇'),
	(61, 03, 31, 104, N'太白河镇'),
	(61, 03, 31, 105, N'黄柏塬镇'),
	(61, 03, 31, 106, N'王家堎镇');

/* 陕西省 咸阳市 秦都区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 02, 001, N'人民路街道办事处'),
	(61, 04, 02, 002, N'西兰路街道办事处'),
	(61, 04, 02, 003, N'吴家堡街道办事处'),
	(61, 04, 02, 004, N'渭阳西路街道办事处'),
	(61, 04, 02, 005, N'陈杨寨街道办事处'),
	(61, 04, 02, 006, N'古渡街道办事处'),
	(61, 04, 02, 007, N'沣东街道办事处'),
	(61, 04, 02, 008, N'钓台街道办事处'),
	(61, 04, 02, 009, N'马泉街道办事处'),
	(61, 04, 02, 010, N'渭滨街道办事处'),
	(61, 04, 02, 011, N'双照街道办事处'),
	(61, 04, 02, 012, N'马庄街道办事处');

/* 陕西省 咸阳市 杨陵区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 03, 001, N'杨陵街道办事处'),
	(61, 04, 03, 002, N'李台街道办事处'),
	(61, 04, 03, 003, N'大寨街道办事处'),
	(61, 04, 03, 100, N'五泉镇'),
	(61, 04, 03, 102, N'揉谷镇');

/* 陕西省 咸阳市 渭城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 04, 001, N'中山街道办事处'),
	(61, 04, 04, 002, N'文汇路街道办事处'),
	(61, 04, 04, 003, N'新兴街道办事处'),
	(61, 04, 04, 004, N'渭阳街道办事处'),
	(61, 04, 04, 005, N'渭城街道办事处'),
	(61, 04, 04, 006, N'窑店街道办事处'),
	(61, 04, 04, 007, N'正阳街道办事处'),
	(61, 04, 04, 008, N'周陵街道办事处'),
	(61, 04, 04, 009, N'底张街道办事处'),
	(61, 04, 04, 010, N'北杜街道办事处');

/* 陕西省 咸阳市 三原县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 22, 001, N'城关街道办事处'),
	(61, 04, 22, 102, N'陂西镇'),
	(61, 04, 22, 103, N'独李镇'),
	(61, 04, 22, 104, N'大程镇'),
	(61, 04, 22, 105, N'西阳镇'),
	(61, 04, 22, 106, N'鲁桥镇'),
	(61, 04, 22, 107, N'陵前镇'),
	(61, 04, 22, 109, N'新兴镇'),
	(61, 04, 22, 110, N'嵯峨镇'),
	(61, 04, 22, 111, N'渠岸镇');

/* 陕西省 咸阳市 泾阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 23, 001, N'泾干街道办事处'),
	(61, 04, 23, 101, N'永乐镇'),
	(61, 04, 23, 102, N'云阳镇'),
	(61, 04, 23, 103, N'桥底镇'),
	(61, 04, 23, 104, N'王桥镇'),
	(61, 04, 23, 105, N'口镇'),
	(61, 04, 23, 107, N'三渠镇'),
	(61, 04, 23, 108, N'高庄镇'),
	(61, 04, 23, 111, N'太平镇'),
	(61, 04, 23, 112, N'崇文镇'),
	(61, 04, 23, 113, N'安吴镇'),
	(61, 04, 23, 114, N'兴隆镇'),
	(61, 04, 23, 115, N'中张镇');

/* 陕西省 咸阳市 乾县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 24, 001, N'城关街道办事处'),
	(61, 04, 24, 101, N'薛录镇'),
	(61, 04, 24, 102, N'梁村镇'),
	(61, 04, 24, 103, N'临平镇'),
	(61, 04, 24, 104, N'姜村镇'),
	(61, 04, 24, 105, N'王村镇'),
	(61, 04, 24, 106, N'马连镇'),
	(61, 04, 24, 107, N'阳峪镇'),
	(61, 04, 24, 108, N'峰阳镇'),
	(61, 04, 24, 109, N'注泔镇'),
	(61, 04, 24, 110, N'灵源镇'),
	(61, 04, 24, 111, N'阳洪镇'),
	(61, 04, 24, 112, N'梁山镇'),
	(61, 04, 24, 113, N'周城镇'),
	(61, 04, 24, 114, N'新阳镇'),
	(61, 04, 24, 115, N'大杨镇');

/* 陕西省 咸阳市 礼泉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 25, 001, N'城关街道办事处'),
	(61, 04, 25, 101, N'史德镇'),
	(61, 04, 25, 102, N'西张堡镇'),
	(61, 04, 25, 103, N'阡东镇'),
	(61, 04, 25, 104, N'烽火镇'),
	(61, 04, 25, 105, N'烟霞镇'),
	(61, 04, 25, 106, N'赵镇'),
	(61, 04, 25, 108, N'叱干镇'),
	(61, 04, 25, 109, N'南坊镇'),
	(61, 04, 25, 110, N'石潭镇'),
	(61, 04, 25, 111, N'昭陵镇'),
	(61, 04, 25, 112, N'骏马镇');

/* 陕西省 咸阳市 永寿县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 26, 001, N'监军街道办事处'),
	(61, 04, 26, 101, N'店头镇'),
	(61, 04, 26, 102, N'常宁镇'),
	(61, 04, 26, 104, N'甘井镇'),
	(61, 04, 26, 105, N'马坊镇'),
	(61, 04, 26, 108, N'渠子镇'),
	(61, 04, 26, 110, N'永平镇');

/* 陕西省 咸阳市 彬县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 27, 001, N'城关街道办事处'),
	(61, 04, 27, 101, N'北极镇'),
	(61, 04, 27, 102, N'新民镇'),
	(61, 04, 27, 103, N'龙高镇'),
	(61, 04, 27, 105, N'永乐镇'),
	(61, 04, 27, 106, N'义门镇'),
	(61, 04, 27, 107, N'水口镇'),
	(61, 04, 27, 108, N'韩家镇'),
	(61, 04, 27, 109, N'太峪镇');

/* 陕西省 咸阳市 长武县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 28, 001, N'昭仁街道办事处'),
	(61, 04, 28, 101, N'相公镇'),
	(61, 04, 28, 102, N'巨家镇'),
	(61, 04, 28, 103, N'丁家镇'),
	(61, 04, 28, 104, N'洪家镇'),
	(61, 04, 28, 105, N'亭口镇'),
	(61, 04, 28, 106, N'彭公镇'),
	(61, 04, 28, 108, N'枣元镇');

/* 陕西省 咸阳市 旬邑县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 29, 001, N'城关街道办事处'),
	(61, 04, 29, 101, N'土桥镇'),
	(61, 04, 29, 102, N'职田镇'),
	(61, 04, 29, 103, N'张洪镇'),
	(61, 04, 29, 104, N'太村镇'),
	(61, 04, 29, 105, N'郑家镇'),
	(61, 04, 29, 106, N'湫坡头镇'),
	(61, 04, 29, 107, N'底庙镇'),
	(61, 04, 29, 109, N'马栏镇'),
	(61, 04, 29, 110, N'清塬镇');

/* 陕西省 咸阳市 淳化县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 30, 001, N'城关街道办事处'),
	(61, 04, 30, 101, N'官庄镇'),
	(61, 04, 30, 103, N'方里镇'),
	(61, 04, 30, 104, N'润镇'),
	(61, 04, 30, 105, N'车坞镇'),
	(61, 04, 30, 106, N'铁王镇'),
	(61, 04, 30, 107, N'石桥镇'),
	(61, 04, 30, 109, N'十里塬镇');

/* 陕西省 咸阳市 武功县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 31, 001, N'普集街道办事处'),
	(61, 04, 31, 101, N'苏坊镇'),
	(61, 04, 31, 102, N'武功镇'),
	(61, 04, 31, 103, N'游风镇'),
	(61, 04, 31, 104, N'贞元镇'),
	(61, 04, 31, 105, N'长宁镇'),
	(61, 04, 31, 106, N'小村镇'),
	(61, 04, 31, 107, N'大庄镇');

/* 陕西省 咸阳市 兴平市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 04, 81, 001, N'东城街道办事处'),
	(61, 04, 81, 002, N'西城街道办事处'),
	(61, 04, 81, 003, N'店张街道办事处'),
	(61, 04, 81, 004, N'西吴街道办事处'),
	(61, 04, 81, 005, N'马嵬街道办事处'),
	(61, 04, 81, 101, N'赵村镇'),
	(61, 04, 81, 102, N'桑镇'),
	(61, 04, 81, 104, N'南市镇'),
	(61, 04, 81, 105, N'庄头镇'),
	(61, 04, 81, 106, N'南位镇'),
	(61, 04, 81, 107, N'阜寨镇'),
	(61, 04, 81, 108, N'丰仪镇'),
	(61, 04, 81, 109, N'汤坊镇');

/* 陕西省 渭南市 临渭区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 05, 02, 001, N'杜桥街道办事处'),
	(61, 05, 02, 002, N'人民街道办事处'),
	(61, 05, 02, 003, N'解放街道办事处'),
	(61, 05, 02, 004, N'向阳街道办事处'),
	(61, 05, 02, 005, N'站南街道办事处'),
	(61, 05, 02, 006, N'双王街道办事处'),
	(61, 05, 02, 007, N'良田街道办事处'),
	(61, 05, 02, 008, N'崇业路街道办事处'),
	(61, 05, 02, 100, N'桥南镇'),
	(61, 05, 02, 101, N'阳郭镇'),
	(61, 05, 02, 102, N'故市镇'),
	(61, 05, 02, 103, N'下邽镇'),
	(61, 05, 02, 104, N'三张镇'),
	(61, 05, 02, 105, N'交斜镇'),
	(61, 05, 02, 106, N'辛市镇'),
	(61, 05, 02, 107, N'崇宁镇'),
	(61, 05, 02, 108, N'孝义镇'),
	(61, 05, 02, 109, N'吝店镇'),
	(61, 05, 02, 111, N'官底镇'),
	(61, 05, 02, 112, N'官路镇'),
	(61, 05, 02, 113, N'丰原镇'),
	(61, 05, 02, 114, N'阎村镇'),
	(61, 05, 02, 115, N'龙背镇'),
	(61, 05, 02, 116, N'官道镇');

/* 陕西省 渭南市 华县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 05, 21, 001, N'华州街道办事处'),
	(61, 05, 21, 101, N'杏林镇'),
	(61, 05, 21, 102, N'赤水镇'),
	(61, 05, 21, 103, N'高塘镇'),
	(61, 05, 21, 104, N'大明镇'),
	(61, 05, 21, 105, N'瓜坡镇'),
	(61, 05, 21, 106, N'莲花寺镇'),
	(61, 05, 21, 107, N'柳枝镇'),
	(61, 05, 21, 108, N'下庙镇'),
	(61, 05, 21, 109, N'金堆镇');

/* 陕西省 渭南市 潼关县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 05, 22, 001, N'城关街道办事处'),
	(61, 05, 22, 101, N'秦东镇'),
	(61, 05, 22, 102, N'太要镇'),
	(61, 05, 22, 103, N'桐峪镇'),
	(61, 05, 22, 104, N'代字营镇');

/* 陕西省 渭南市 大荔县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 05, 23, 001, N'城关街道办事处'),
	(61, 05, 23, 101, N'许庄镇'),
	(61, 05, 23, 102, N'朝邑镇'),
	(61, 05, 23, 103, N'安仁镇'),
	(61, 05, 23, 104, N'两宜镇'),
	(61, 05, 23, 105, N'羌白镇'),
	(61, 05, 23, 106, N'官池镇'),
	(61, 05, 23, 107, N'冯村镇'),
	(61, 05, 23, 108, N'双泉镇'),
	(61, 05, 23, 110, N'下寨镇'),
	(61, 05, 23, 111, N'韦林镇'),
	(61, 05, 23, 112, N'范家镇'),
	(61, 05, 23, 113, N'苏村镇'),
	(61, 05, 23, 114, N'赵渡镇'),
	(61, 05, 23, 116, N'埝桥镇'),
	(61, 05, 23, 117, N'段家镇');

/* 陕西省 渭南市 合阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 05, 24, 001, N'城关街道办事处'),
	(61, 05, 24, 101, N'甘井镇'),
	(61, 05, 24, 102, N'坊镇'),
	(61, 05, 24, 103, N'洽川镇'),
	(61, 05, 24, 104, N'新池镇'),
	(61, 05, 24, 105, N'黑池镇'),
	(61, 05, 24, 106, N'路井镇'),
	(61, 05, 24, 107, N'和家庄镇'),
	(61, 05, 24, 108, N'王村镇'),
	(61, 05, 24, 110, N'同家庄镇'),
	(61, 05, 24, 111, N'百良镇'),
	(61, 05, 24, 112, N'金峪镇');

/* 陕西省 渭南市 澄城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 05, 25, 001, N'城关街道办事处'),
	(61, 05, 25, 101, N'冯原镇'),
	(61, 05, 25, 102, N'王庄镇'),
	(61, 05, 25, 103, N'尧头镇'),
	(61, 05, 25, 104, N'赵庄镇'),
	(61, 05, 25, 105, N'交道镇'),
	(61, 05, 25, 106, N'寺前镇'),
	(61, 05, 25, 107, N'韦庄镇'),
	(61, 05, 25, 108, N'安里镇'),
	(61, 05, 25, 109, N'庄头镇');

/* 陕西省 渭南市 蒲城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 05, 26, 001, N'城关街道办事处'),
	(61, 05, 26, 101, N'罕井镇'),
	(61, 05, 26, 102, N'孙镇'),
	(61, 05, 26, 103, N'兴镇'),
	(61, 05, 26, 104, N'党睦镇'),
	(61, 05, 26, 105, N'高阳镇'),
	(61, 05, 26, 106, N'永丰镇'),
	(61, 05, 26, 107, N'荆姚镇'),
	(61, 05, 26, 108, N'苏坊镇'),
	(61, 05, 26, 109, N'龙阳镇'),
	(61, 05, 26, 112, N'洛滨镇'),
	(61, 05, 26, 113, N'陈庄镇'),
	(61, 05, 26, 114, N'桥陵镇'),
	(61, 05, 26, 116, N'尧山镇'),
	(61, 05, 26, 117, N'椿林镇'),
	(61, 05, 26, 118, N'龙池镇');

/* 陕西省 渭南市 白水县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 05, 27, 001, N'城关街道办事处'),
	(61, 05, 27, 102, N'尧禾镇'),
	(61, 05, 27, 103, N'杜康镇'),
	(61, 05, 27, 104, N'西固镇'),
	(61, 05, 27, 105, N'林皋镇'),
	(61, 05, 27, 106, N'史官镇'),
	(61, 05, 27, 107, N'北塬镇'),
	(61, 05, 27, 109, N'雷牙镇');

/* 陕西省 渭南市 富平县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 05, 28, 001, N'城关街道办事处'),
	(61, 05, 28, 101, N'庄里镇'),
	(61, 05, 28, 102, N'张桥镇'),
	(61, 05, 28, 103, N'美原镇'),
	(61, 05, 28, 104, N'流曲镇'),
	(61, 05, 28, 105, N'淡村镇'),
	(61, 05, 28, 107, N'留古镇'),
	(61, 05, 28, 108, N'老庙镇'),
	(61, 05, 28, 109, N'薛镇'),
	(61, 05, 28, 110, N'到贤镇'),
	(61, 05, 28, 111, N'曹村镇'),
	(61, 05, 28, 112, N'宫里镇'),
	(61, 05, 28, 113, N'梅家坪镇'),
	(61, 05, 28, 114, N'刘集镇'),
	(61, 05, 28, 115, N'齐村镇');

/* 陕西省 渭南市 韩城市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 05, 81, 001, N'新城街道办事处'),
	(61, 05, 81, 002, N'金城街道办事处'),
	(61, 05, 81, 100, N'龙门镇'),
	(61, 05, 81, 101, N'桑树坪镇'),
	(61, 05, 81, 103, N'芝川镇'),
	(61, 05, 81, 104, N'西庄镇'),
	(61, 05, 81, 106, N'芝阳镇'),
	(61, 05, 81, 107, N'板桥镇');

/* 陕西省 渭南市 华阴市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 05, 82, 001, N'太华路街道办事处'),
	(61, 05, 82, 002, N'岳庙街道办事处'),
	(61, 05, 82, 100, N'孟塬镇'),
	(61, 05, 82, 103, N'华西镇'),
	(61, 05, 82, 104, N'罗敷镇'),
	(61, 05, 82, 105, N'华山镇');

/* 陕西省 延安市 宝塔区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 02, 001, N'宝塔山街道办事处'),
	(61, 06, 02, 002, N'南市街道办事处'),
	(61, 06, 02, 003, N'凤凰山街道办事处'),
	(61, 06, 02, 004, N'枣园街道办事处'),
	(61, 06, 02, 005, N'桥沟街道办事处'),
	(61, 06, 02, 102, N'河庄坪镇'),
	(61, 06, 02, 103, N'李渠镇'),
	(61, 06, 02, 104, N'姚店镇'),
	(61, 06, 02, 105, N'青化砭镇'),
	(61, 06, 02, 106, N'蟠龙镇'),
	(61, 06, 02, 107, N'柳林镇'),
	(61, 06, 02, 108, N'南泥湾镇'),
	(61, 06, 02, 109, N'临镇'),
	(61, 06, 02, 110, N'甘谷驿镇'),
	(61, 06, 02, 200, N'川口乡'),
	(61, 06, 02, 202, N'冯庄乡'),
	(61, 06, 02, 205, N'麻洞川乡'),
	(61, 06, 02, 208, N'万花山乡');

/* 陕西省 延安市 延长县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 21, 001, N'七里村街道办事处'),
	(61, 06, 21, 101, N'黑家堡镇'),
	(61, 06, 21, 102, N'郑庄镇'),
	(61, 06, 21, 103, N'张家滩镇'),
	(61, 06, 21, 104, N'交口镇'),
	(61, 06, 21, 106, N'雷赤镇'),
	(61, 06, 21, 107, N'罗子山镇'),
	(61, 06, 21, 108, N'安沟镇');

/* 陕西省 延安市 延川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 22, 001, N'大禹街道办事处'),
	(61, 06, 22, 101, N'永坪镇'),
	(61, 06, 22, 102, N'延水关镇'),
	(61, 06, 22, 103, N'文安驿镇'),
	(61, 06, 22, 104, N'杨家圪台镇'),
	(61, 06, 22, 105, N'贾家坪镇'),
	(61, 06, 22, 107, N'关庄镇'),
	(61, 06, 22, 108, N'乾坤湾镇');

/* 陕西省 延安市 子长县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 23, 001, N'瓦窑堡街道办事处'),
	(61, 06, 23, 101, N'杨家园子镇'),
	(61, 06, 23, 102, N'玉家湾镇'),
	(61, 06, 23, 103, N'安定镇'),
	(61, 06, 23, 104, N'马家砭镇'),
	(61, 06, 23, 105, N'南沟岔镇'),
	(61, 06, 23, 106, N'涧峪岔镇'),
	(61, 06, 23, 107, N'李家岔镇'),
	(61, 06, 23, 108, N'余家坪镇');

/* 陕西省 延安市 安塞县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 24, 001, N'真武洞街道办事处'),
	(61, 06, 24, 101, N'砖窑湾镇'),
	(61, 06, 24, 102, N'沿河湾镇'),
	(61, 06, 24, 103, N'招安镇'),
	(61, 06, 24, 104, N'化子坪镇'),
	(61, 06, 24, 105, N'坪桥镇'),
	(61, 06, 24, 106, N'建华镇'),
	(61, 06, 24, 107, N'高桥镇'),
	(61, 06, 24, 108, N'镰刀湾镇');

/* 陕西省 延安市 志丹县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 25, 001, N'保安街道办事处'),
	(61, 06, 25, 101, N'杏河镇'),
	(61, 06, 25, 102, N'顺宁镇'),
	(61, 06, 25, 103, N'旦八镇'),
	(61, 06, 25, 104, N'金丁镇'),
	(61, 06, 25, 105, N'永宁镇'),
	(61, 06, 25, 106, N'义正镇'),
	(61, 06, 25, 107, N'双河镇');

/* 陕西省 延安市 吴起县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 26, 001, N'吴起街道办事处'),
	(61, 06, 26, 101, N'铁边城镇'),
	(61, 06, 26, 102, N'周湾镇'),
	(61, 06, 26, 103, N'白豹镇'),
	(61, 06, 26, 104, N'长官庙镇'),
	(61, 06, 26, 105, N'长城镇'),
	(61, 06, 26, 106, N'五谷城镇'),
	(61, 06, 26, 107, N'吴仓堡镇'),
	(61, 06, 26, 108, N'庙沟镇');

/* 陕西省 延安市 甘泉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 27, 001, N'美水街道办事处'),
	(61, 06, 27, 101, N'下寺湾镇'),
	(61, 06, 27, 102, N'道镇'),
	(61, 06, 27, 103, N'石门镇'),
	(61, 06, 27, 200, N'桥镇乡'),
	(61, 06, 27, 203, N'劳山乡');

/* 陕西省 延安市 富县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 28, 001, N'茶坊街道办事处'),
	(61, 06, 28, 101, N'羊泉镇'),
	(61, 06, 28, 102, N'张村驿镇'),
	(61, 06, 28, 103, N'张家湾镇'),
	(61, 06, 28, 104, N'直罗镇'),
	(61, 06, 28, 106, N'牛武镇'),
	(61, 06, 28, 109, N'寺仙镇'),
	(61, 06, 28, 204, N'北道德乡');

/* 陕西省 延安市 洛川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 29, 001, N'凤栖街道办事处'),
	(61, 06, 29, 101, N'旧县镇'),
	(61, 06, 29, 102, N'交口河镇'),
	(61, 06, 29, 103, N'老庙镇'),
	(61, 06, 29, 104, N'土基镇'),
	(61, 06, 29, 105, N'石头镇'),
	(61, 06, 29, 106, N'槐柏镇'),
	(61, 06, 29, 107, N'永乡镇'),
	(61, 06, 29, 200, N'菩堤乡');

/* 陕西省 延安市 宜川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 30, 001, N'丹州街道办事处'),
	(61, 06, 30, 101, N'秋林镇'),
	(61, 06, 30, 102, N'云岩镇'),
	(61, 06, 30, 104, N'集义镇'),
	(61, 06, 30, 105, N'壶口镇'),
	(61, 06, 30, 200, N'英旺乡'),
	(61, 06, 30, 201, N'交里乡');

/* 陕西省 延安市 黄龙县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 31, 100, N'石堡镇'),
	(61, 06, 31, 101, N'白马滩镇'),
	(61, 06, 31, 102, N'瓦子街镇'),
	(61, 06, 31, 106, N'界头庙镇'),
	(61, 06, 31, 107, N'三岔镇'),
	(61, 06, 31, 205, N'圪台乡'),
	(61, 06, 31, 206, N'崾崄乡');

/* 陕西省 延安市 黄陵县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 06, 32, 001, N'桥山街道办事处'),
	(61, 06, 32, 101, N'店头镇'),
	(61, 06, 32, 102, N'隆坊镇'),
	(61, 06, 32, 103, N'田庄镇'),
	(61, 06, 32, 104, N'阿党镇'),
	(61, 06, 32, 105, N'双龙镇');

/* 陕西省 汉中市 汉台区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 07, 02, 001, N'北关街道办事处'),
	(61, 07, 02, 002, N'东大街街道办事处'),
	(61, 07, 02, 003, N'汉中路街道办事处'),
	(61, 07, 02, 004, N'中山街街道办事处'),
	(61, 07, 02, 005, N'东关街道办事处'),
	(61, 07, 02, 006, N'鑫源街道办事处'),
	(61, 07, 02, 008, N'七里街道办事处'),
	(61, 07, 02, 009, N'龙江街道办事处'),
	(61, 07, 02, 100, N'铺镇'),
	(61, 07, 02, 101, N'武乡镇'),
	(61, 07, 02, 102, N'河东店镇'),
	(61, 07, 02, 104, N'宗营镇'),
	(61, 07, 02, 105, N'老君镇'),
	(61, 07, 02, 106, N'汉王镇'),
	(61, 07, 02, 107, N'徐望镇');

/* 陕西省 汉中市 南郑县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 07, 21, 001, N'汉山街道办事处'),
	(61, 07, 21, 101, N'圣水镇'),
	(61, 07, 21, 102, N'大河坎镇'),
	(61, 07, 21, 103, N'协税镇'),
	(61, 07, 21, 104, N'梁山镇'),
	(61, 07, 21, 105, N'阳春镇'),
	(61, 07, 21, 106, N'高台镇'),
	(61, 07, 21, 107, N'新集镇'),
	(61, 07, 21, 108, N'濂水镇'),
	(61, 07, 21, 109, N'黄官镇'),
	(61, 07, 21, 110, N'青树镇'),
	(61, 07, 21, 111, N'红庙镇'),
	(61, 07, 21, 112, N'牟家坝镇'),
	(61, 07, 21, 113, N'法镇'),
	(61, 07, 21, 114, N'湘水镇'),
	(61, 07, 21, 115, N'小南海镇'),
	(61, 07, 21, 116, N'碑坝镇'),
	(61, 07, 21, 117, N'黎坪镇'),
	(61, 07, 21, 118, N'福成镇'),
	(61, 07, 21, 119, N'两河镇'),
	(61, 07, 21, 120, N'胡家营镇');

/* 陕西省 汉中市 城固县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 07, 22, 001, N'博望街道办事处'),
	(61, 07, 22, 002, N'莲花街道办事处'),
	(61, 07, 22, 101, N'龙头镇'),
	(61, 07, 22, 102, N'沙河营镇'),
	(61, 07, 22, 103, N'文川镇'),
	(61, 07, 22, 104, N'柳林镇'),
	(61, 07, 22, 105, N'老庄镇'),
	(61, 07, 22, 107, N'桔园镇'),
	(61, 07, 22, 108, N'原公镇'),
	(61, 07, 22, 109, N'上元观镇'),
	(61, 07, 22, 110, N'天明镇'),
	(61, 07, 22, 111, N'二里镇'),
	(61, 07, 22, 112, N'五堵镇'),
	(61, 07, 22, 114, N'双溪镇'),
	(61, 07, 22, 116, N'小河镇'),
	(61, 07, 22, 119, N'董家营镇'),
	(61, 07, 22, 120, N'三合镇');

/* 陕西省 汉中市 洋县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 07, 23, 001, N'洋州街道办事处'),
	(61, 07, 23, 002, N'纸坊街道办事处'),
	(61, 07, 23, 003, N'戚氏街道办事处'),
	(61, 07, 23, 103, N'龙亭镇'),
	(61, 07, 23, 104, N'谢村镇'),
	(61, 07, 23, 105, N'马畅镇'),
	(61, 07, 23, 107, N'溢水镇'),
	(61, 07, 23, 108, N'磨子桥镇'),
	(61, 07, 23, 109, N'黄家营镇'),
	(61, 07, 23, 110, N'黄安镇'),
	(61, 07, 23, 111, N'黄金峡镇'),
	(61, 07, 23, 112, N'槐树关镇'),
	(61, 07, 23, 113, N'金水镇'),
	(61, 07, 23, 114, N'华阳镇'),
	(61, 07, 23, 115, N'茅坪镇'),
	(61, 07, 23, 119, N'八里关镇'),
	(61, 07, 23, 120, N'桑溪镇'),
	(61, 07, 23, 121, N'关帝镇');

/* 陕西省 汉中市 西乡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 07, 24, 001, N'城北街道办事处'),
	(61, 07, 24, 002, N'城南街道办事处'),
	(61, 07, 24, 101, N'杨河镇'),
	(61, 07, 24, 102, N'柳树镇'),
	(61, 07, 24, 103, N'沙河镇'),
	(61, 07, 24, 104, N'私渡镇'),
	(61, 07, 24, 105, N'桑园镇'),
	(61, 07, 24, 106, N'白龙塘镇'),
	(61, 07, 24, 108, N'峡口镇'),
	(61, 07, 24, 109, N'堰口镇'),
	(61, 07, 24, 110, N'茶镇'),
	(61, 07, 24, 111, N'高川镇'),
	(61, 07, 24, 112, N'两河口镇'),
	(61, 07, 24, 114, N'大河镇'),
	(61, 07, 24, 116, N'骆家坝镇'),
	(61, 07, 24, 117, N'子午镇'),
	(61, 07, 24, 118, N'白勉峡镇');

/* 陕西省 汉中市 勉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 07, 25, 001, N'勉阳街道办事处'),
	(61, 07, 25, 101, N'武侯镇'),
	(61, 07, 25, 102, N'周家山镇'),
	(61, 07, 25, 103, N'同沟寺镇'),
	(61, 07, 25, 105, N'新街子镇'),
	(61, 07, 25, 106, N'老道寺镇'),
	(61, 07, 25, 107, N'褒城镇'),
	(61, 07, 25, 109, N'金泉镇'),
	(61, 07, 25, 110, N'定军山镇'),
	(61, 07, 25, 111, N'温泉镇'),
	(61, 07, 25, 112, N'元墩镇'),
	(61, 07, 25, 113, N'阜川镇'),
	(61, 07, 25, 114, N'新铺镇'),
	(61, 07, 25, 116, N'茶店镇'),
	(61, 07, 25, 117, N'镇川镇'),
	(61, 07, 25, 118, N'漆树坝镇'),
	(61, 07, 25, 119, N'张家河镇'),
	(61, 07, 25, 120, N'长沟河镇');

/* 陕西省 汉中市 宁强县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 07, 26, 001, N'汉源街道办事处'),
	(61, 07, 26, 002, N'高寨子街道办事处'),
	(61, 07, 26, 102, N'大安镇'),
	(61, 07, 26, 103, N'代家坝镇'),
	(61, 07, 26, 104, N'阳平关镇'),
	(61, 07, 26, 105, N'燕子砭镇'),
	(61, 07, 26, 106, N'广坪镇'),
	(61, 07, 26, 107, N'青木川镇'),
	(61, 07, 26, 108, N'毛坝河镇'),
	(61, 07, 26, 109, N'铁锁关镇'),
	(61, 07, 26, 110, N'胡家坝镇'),
	(61, 07, 26, 111, N'巴山镇'),
	(61, 07, 26, 112, N'巨亭镇'),
	(61, 07, 26, 113, N'舒家坝镇'),
	(61, 07, 26, 117, N'太阳岭镇'),
	(61, 07, 26, 118, N'安乐河镇'),
	(61, 07, 26, 119, N'二郎坝镇'),
	(61, 07, 26, 120, N'禅家岩镇');

/* 陕西省 汉中市 略阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 07, 27, 001, N'兴州街道办事处'),
	(61, 07, 27, 002, N'横现河街道办事处'),
	(61, 07, 27, 101, N'接官亭镇'),
	(61, 07, 27, 102, N'西淮坝镇'),
	(61, 07, 27, 103, N'两河口镇'),
	(61, 07, 27, 104, N'金家河镇'),
	(61, 07, 27, 105, N'徐家坪镇'),
	(61, 07, 27, 106, N'白水江镇'),
	(61, 07, 27, 107, N'硖口驿镇'),
	(61, 07, 27, 108, N'马蹄湾镇'),
	(61, 07, 27, 109, N'乐素河镇'),
	(61, 07, 27, 110, N'郭镇'),
	(61, 07, 27, 111, N'黑河镇'),
	(61, 07, 27, 112, N'白雀寺镇'),
	(61, 07, 27, 113, N'仙台坝镇'),
	(61, 07, 27, 114, N'五龙洞镇'),
	(61, 07, 27, 115, N'观音寺镇');

/* 陕西省 汉中市 镇巴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 07, 28, 001, N'泾洋街道办事处'),
	(61, 07, 28, 101, N'渔渡镇'),
	(61, 07, 28, 102, N'盐场镇'),
	(61, 07, 28, 103, N'观音镇'),
	(61, 07, 28, 104, N'巴庙镇'),
	(61, 07, 28, 105, N'兴隆镇'),
	(61, 07, 28, 106, N'长岭镇'),
	(61, 07, 28, 107, N'三元镇'),
	(61, 07, 28, 108, N'简池镇'),
	(61, 07, 28, 109, N'碾子镇'),
	(61, 07, 28, 110, N'小洋镇'),
	(61, 07, 28, 111, N'青水镇'),
	(61, 07, 28, 112, N'赤南镇'),
	(61, 07, 28, 113, N'平安镇'),
	(61, 07, 28, 114, N'杨家河镇'),
	(61, 07, 28, 115, N'巴山镇'),
	(61, 07, 28, 116, N'黎坝镇'),
	(61, 07, 28, 117, N'仁村镇'),
	(61, 07, 28, 118, N'大池镇'),
	(61, 07, 28, 120, N'永乐镇');

/* 陕西省 汉中市 留坝县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 07, 29, 001, N'紫柏街道办事处'),
	(61, 07, 29, 101, N'马道镇'),
	(61, 07, 29, 102, N'武关驿镇'),
	(61, 07, 29, 103, N'留侯镇'),
	(61, 07, 29, 104, N'江口镇'),
	(61, 07, 29, 105, N'玉皇庙镇'),
	(61, 07, 29, 106, N'火烧店镇'),
	(61, 07, 29, 107, N'青桥驿镇');

/* 陕西省 汉中市 佛坪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 07, 30, 001, N'袁家庄街道办事处'),
	(61, 07, 30, 101, N'陈家坝镇'),
	(61, 07, 30, 102, N'大河坝镇'),
	(61, 07, 30, 103, N'西岔河镇'),
	(61, 07, 30, 104, N'岳坝镇'),
	(61, 07, 30, 105, N'长角坝镇'),
	(61, 07, 30, 106, N'石墩河镇');

/* 陕西省 榆林市 榆阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 02, 001, N'鼓楼街道办事处'),
	(61, 08, 02, 002, N'青山路街道办事处'),
	(61, 08, 02, 003, N'上郡路街道办事处'),
	(61, 08, 02, 004, N'新明楼街道办事处'),
	(61, 08, 02, 005, N'驼峰路街道办事处'),
	(61, 08, 02, 006, N'崇文路街道办事处'),
	(61, 08, 02, 007, N'航宇路街道办事处'),
	(61, 08, 02, 008, N'长城路街道办事处'),
	(61, 08, 02, 100, N'鱼河镇'),
	(61, 08, 02, 101, N'上盐湾镇'),
	(61, 08, 02, 102, N'镇川镇'),
	(61, 08, 02, 105, N'麻黄梁镇'),
	(61, 08, 02, 106, N'牛家梁镇'),
	(61, 08, 02, 107, N'金鸡滩镇'),
	(61, 08, 02, 108, N'马合镇'),
	(61, 08, 02, 109, N'巴拉素镇'),
	(61, 08, 02, 111, N'鱼河峁镇'),
	(61, 08, 02, 112, N'青云镇'),
	(61, 08, 02, 113, N'古塔镇'),
	(61, 08, 02, 114, N'大河塔镇'),
	(61, 08, 02, 115, N'小纪汗镇'),
	(61, 08, 02, 116, N'芹河镇'),
	(61, 08, 02, 205, N'孟家湾乡'),
	(61, 08, 02, 206, N'小壕兔乡'),
	(61, 08, 02, 207, N'岔河则乡'),
	(61, 08, 02, 208, N'补浪河乡'),
	(61, 08, 02, 209, N'红石桥乡');

/* 陕西省 榆林市 神木县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 21, 100, N'神木镇'),
	(61, 08, 21, 101, N'高家堡镇'),
	(61, 08, 21, 102, N'店塔镇'),
	(61, 08, 21, 103, N'孙家岔镇'),
	(61, 08, 21, 104, N'大柳塔镇'),
	(61, 08, 21, 105, N'花石崖镇'),
	(61, 08, 21, 106, N'中鸡镇'),
	(61, 08, 21, 107, N'贺家川镇'),
	(61, 08, 21, 108, N'尔林兔镇'),
	(61, 08, 21, 109, N'万镇'),
	(61, 08, 21, 110, N'大保当镇'),
	(61, 08, 21, 111, N'马镇'),
	(61, 08, 21, 112, N'栏杆堡镇'),
	(61, 08, 21, 113, N'沙峁镇'),
	(61, 08, 21, 114, N'锦界镇');

/* 陕西省 榆林市 府谷县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 22, 100, N'府谷镇'),
	(61, 08, 22, 101, N'黄甫镇'),
	(61, 08, 22, 103, N'哈镇'),
	(61, 08, 22, 104, N'庙沟门镇'),
	(61, 08, 22, 105, N'新民镇'),
	(61, 08, 22, 106, N'孤山镇'),
	(61, 08, 22, 107, N'清水镇'),
	(61, 08, 22, 108, N'大昌汗镇'),
	(61, 08, 22, 109, N'古城镇'),
	(61, 08, 22, 110, N'三道沟镇'),
	(61, 08, 22, 111, N'老高川镇'),
	(61, 08, 22, 112, N'武家庄镇'),
	(61, 08, 22, 113, N'木瓜镇'),
	(61, 08, 22, 114, N'田家寨镇');

/* 陕西省 榆林市 横山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 23, 001, N'横山街道办事处'),
	(61, 08, 23, 101, N'石湾镇'),
	(61, 08, 23, 102, N'高镇'),
	(61, 08, 23, 103, N'武镇'),
	(61, 08, 23, 104, N'党岔镇'),
	(61, 08, 23, 105, N'响水镇'),
	(61, 08, 23, 106, N'波罗镇'),
	(61, 08, 23, 107, N'殿市镇'),
	(61, 08, 23, 108, N'塔湾镇'),
	(61, 08, 23, 109, N'赵石畔镇'),
	(61, 08, 23, 110, N'魏家楼镇'),
	(61, 08, 23, 111, N'韩岔镇'),
	(61, 08, 23, 112, N'白界镇'),
	(61, 08, 23, 113, N'雷龙湾镇');

/* 陕西省 榆林市 靖边县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 24, 001, N'张家畔街道办事处'),
	(61, 08, 24, 101, N'东坑镇'),
	(61, 08, 24, 102, N'青阳岔镇'),
	(61, 08, 24, 103, N'宁条梁镇'),
	(61, 08, 24, 104, N'周河镇'),
	(61, 08, 24, 105, N'红墩界镇'),
	(61, 08, 24, 106, N'杨桥畔镇'),
	(61, 08, 24, 107, N'王渠则镇'),
	(61, 08, 24, 108, N'中山涧镇'),
	(61, 08, 24, 109, N'杨米涧镇'),
	(61, 08, 24, 110, N'天赐湾镇'),
	(61, 08, 24, 111, N'小河镇'),
	(61, 08, 24, 112, N'龙洲镇'),
	(61, 08, 24, 113, N'黄蒿界镇'),
	(61, 08, 24, 114, N'海则滩镇'),
	(61, 08, 24, 115, N'席麻湾镇'),
	(61, 08, 24, 116, N'镇靖镇');

/* 陕西省 榆林市 定边县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 25, 001, N'定边街道办事处'),
	(61, 08, 25, 101, N'贺圈镇'),
	(61, 08, 25, 102, N'红柳沟镇'),
	(61, 08, 25, 103, N'砖井镇'),
	(61, 08, 25, 104, N'白泥井镇'),
	(61, 08, 25, 105, N'安边镇'),
	(61, 08, 25, 106, N'堆子梁镇'),
	(61, 08, 25, 107, N'白湾子镇'),
	(61, 08, 25, 108, N'姬塬镇'),
	(61, 08, 25, 109, N'杨井镇'),
	(61, 08, 25, 110, N'新安边镇'),
	(61, 08, 25, 111, N'张崾先镇'),
	(61, 08, 25, 112, N'樊学镇'),
	(61, 08, 25, 113, N'盐场堡镇'),
	(61, 08, 25, 114, N'郝滩镇'),
	(61, 08, 25, 202, N'石洞沟乡'),
	(61, 08, 25, 204, N'油房庄乡'),
	(61, 08, 25, 207, N'冯地坑乡'),
	(61, 08, 25, 210, N'学庄乡');

/* 陕西省 榆林市 绥德县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 26, 100, N'名州镇'),
	(61, 08, 26, 101, N'薛家峁镇'),
	(61, 08, 26, 102, N'崔家湾镇'),
	(61, 08, 26, 103, N'定仙墕镇'),
	(61, 08, 26, 104, N'枣林坪镇'),
	(61, 08, 26, 105, N'义合镇'),
	(61, 08, 26, 106, N'吉镇'),
	(61, 08, 26, 107, N'薛家河镇'),
	(61, 08, 26, 108, N'四十铺镇'),
	(61, 08, 26, 109, N'石家湾镇'),
	(61, 08, 26, 110, N'田庄镇'),
	(61, 08, 26, 111, N'中角镇'),
	(61, 08, 26, 112, N'满堂川镇'),
	(61, 08, 26, 113, N'张家砭镇'),
	(61, 08, 26, 114, N'白家硷镇');

/* 陕西省 榆林市 米脂县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 27, 001, N'银州街道办事处'),
	(61, 08, 27, 101, N'桃镇'),
	(61, 08, 27, 102, N'龙镇'),
	(61, 08, 27, 103, N'杨家沟镇'),
	(61, 08, 27, 104, N'杜家石沟镇'),
	(61, 08, 27, 105, N'沙家店镇'),
	(61, 08, 27, 106, N'印斗镇'),
	(61, 08, 27, 107, N'郭兴庄镇'),
	(61, 08, 27, 108, N'城郊镇');

/* 陕西省 榆林市 佳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 28, 001, N'佳州街道办事处'),
	(61, 08, 28, 101, N'坑镇'),
	(61, 08, 28, 102, N'店镇'),
	(61, 08, 28, 103, N'乌镇'),
	(61, 08, 28, 104, N'金明寺镇'),
	(61, 08, 28, 105, N'通镇'),
	(61, 08, 28, 106, N'王家砭镇'),
	(61, 08, 28, 107, N'方塌镇'),
	(61, 08, 28, 108, N'朱家坬镇'),
	(61, 08, 28, 109, N'螅镇'),
	(61, 08, 28, 110, N'朱官寨镇'),
	(61, 08, 28, 111, N'刘国具镇'),
	(61, 08, 28, 112, N'木头峪镇');

/* 陕西省 榆林市 吴堡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 29, 001, N'宋家川街道办事处'),
	(61, 08, 29, 101, N'辛家沟镇'),
	(61, 08, 29, 102, N'郭家沟镇'),
	(61, 08, 29, 103, N'寇家塬镇'),
	(61, 08, 29, 104, N'岔上镇'),
	(61, 08, 29, 105, N'张家山镇');

/* 陕西省 榆林市 清涧县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 30, 100, N'宽州镇'),
	(61, 08, 30, 101, N'石咀驿镇'),
	(61, 08, 30, 102, N'折家坪镇'),
	(61, 08, 30, 103, N'玉家河镇'),
	(61, 08, 30, 104, N'高杰村镇'),
	(61, 08, 30, 105, N'李家塔镇'),
	(61, 08, 30, 106, N'店则沟镇'),
	(61, 08, 30, 107, N'解家沟镇'),
	(61, 08, 30, 108, N'下廿里铺镇');

/* 陕西省 榆林市 子洲县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 08, 31, 001, N'双湖峪街道办事处'),
	(61, 08, 31, 101, N'何家集镇'),
	(61, 08, 31, 102, N'老君殿镇'),
	(61, 08, 31, 103, N'裴家湾镇'),
	(61, 08, 31, 104, N'苗家坪镇'),
	(61, 08, 31, 105, N'三川口镇'),
	(61, 08, 31, 106, N'马蹄沟镇'),
	(61, 08, 31, 107, N'周家硷镇'),
	(61, 08, 31, 108, N'电市镇'),
	(61, 08, 31, 109, N'砖庙镇'),
	(61, 08, 31, 110, N'淮宁湾镇'),
	(61, 08, 31, 111, N'马岔镇'),
	(61, 08, 31, 200, N'驼耳巷乡');

/* 陕西省 安康市 汉滨区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 09, 02, 001, N'老城街道办事处'),
	(61, 09, 02, 002, N'新城街道办事处'),
	(61, 09, 02, 003, N'江北街道办事处'),
	(61, 09, 02, 004, N'建民办事处'),
	(61, 09, 02, 100, N'关庙镇'),
	(61, 09, 02, 101, N'张滩镇'),
	(61, 09, 02, 102, N'瀛湖镇'),
	(61, 09, 02, 104, N'五里镇'),
	(61, 09, 02, 106, N'大同镇'),
	(61, 09, 02, 107, N'恒口镇'),
	(61, 09, 02, 109, N'吉河镇'),
	(61, 09, 02, 110, N'流水镇'),
	(61, 09, 02, 111, N'大竹园镇'),
	(61, 09, 02, 112, N'洪山镇'),
	(61, 09, 02, 114, N'茨沟镇'),
	(61, 09, 02, 115, N'大河镇'),
	(61, 09, 02, 116, N'沈坝镇'),
	(61, 09, 02, 117, N'双龙镇'),
	(61, 09, 02, 118, N'叶坪镇'),
	(61, 09, 02, 119, N'中原镇'),
	(61, 09, 02, 120, N'县河镇'),
	(61, 09, 02, 121, N'紫荆镇'),
	(61, 09, 02, 122, N'早阳镇'),
	(61, 09, 02, 123, N'关家镇'),
	(61, 09, 02, 124, N'石梯镇'),
	(61, 09, 02, 125, N'坝河镇'),
	(61, 09, 02, 128, N'牛蹄镇'),
	(61, 09, 02, 130, N'晏坝镇'),
	(61, 09, 02, 132, N'谭坝镇');

/* 陕西省 安康市 汉阴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 09, 21, 100, N'城关镇'),
	(61, 09, 21, 101, N'涧池镇'),
	(61, 09, 21, 102, N'蒲溪镇'),
	(61, 09, 21, 103, N'平梁镇'),
	(61, 09, 21, 104, N'双乳镇'),
	(61, 09, 21, 105, N'铁佛寺镇'),
	(61, 09, 21, 107, N'漩涡镇'),
	(61, 09, 21, 108, N'汉阳镇'),
	(61, 09, 21, 110, N'双河口镇'),
	(61, 09, 21, 112, N'观音河镇');

/* 陕西省 安康市 石泉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 09, 22, 100, N'城关镇'),
	(61, 09, 22, 101, N'饶峰镇'),
	(61, 09, 22, 102, N'两河镇'),
	(61, 09, 22, 103, N'迎丰镇'),
	(61, 09, 22, 104, N'池河镇'),
	(61, 09, 22, 105, N'后柳镇'),
	(61, 09, 22, 106, N'喜河镇'),
	(61, 09, 22, 107, N'熨斗镇'),
	(61, 09, 22, 108, N'云雾山镇'),
	(61, 09, 22, 109, N'中池镇'),
	(61, 09, 22, 110, N'曾溪镇');

/* 陕西省 安康市 宁陕县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 09, 23, 100, N'城关镇'),
	(61, 09, 23, 101, N'四亩地镇'),
	(61, 09, 23, 102, N'江口镇'),
	(61, 09, 23, 104, N'广货街镇'),
	(61, 09, 23, 105, N'龙王镇'),
	(61, 09, 23, 106, N'筒车湾镇'),
	(61, 09, 23, 108, N'金川镇'),
	(61, 09, 23, 109, N'皇冠镇'),
	(61, 09, 23, 110, N'太山庙镇'),
	(61, 09, 23, 111, N'梅子镇'),
	(61, 09, 23, 113, N'新场镇');

/* 陕西省 安康市 紫阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 09, 24, 100, N'城关镇'),
	(61, 09, 24, 101, N'蒿坪镇'),
	(61, 09, 24, 102, N'汉王镇'),
	(61, 09, 24, 103, N'焕古镇'),
	(61, 09, 24, 104, N'向阳镇'),
	(61, 09, 24, 105, N'洞河镇'),
	(61, 09, 24, 106, N'洄水镇'),
	(61, 09, 24, 108, N'双桥镇'),
	(61, 09, 24, 109, N'高桥镇'),
	(61, 09, 24, 110, N'红椿镇'),
	(61, 09, 24, 111, N'高滩镇'),
	(61, 09, 24, 112, N'毛坝镇'),
	(61, 09, 24, 113, N'瓦庙镇'),
	(61, 09, 24, 114, N'麻柳镇'),
	(61, 09, 24, 115, N'双安镇'),
	(61, 09, 24, 116, N'东木镇'),
	(61, 09, 24, 117, N'界岭镇');

/* 陕西省 安康市 岚皋县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 09, 25, 100, N'城关镇'),
	(61, 09, 25, 101, N'佐龙镇'),
	(61, 09, 25, 103, N'滔河镇'),
	(61, 09, 25, 104, N'官元镇'),
	(61, 09, 25, 105, N'石门镇'),
	(61, 09, 25, 106, N'民主镇'),
	(61, 09, 25, 107, N'大道河镇'),
	(61, 09, 25, 109, N'堰门镇'),
	(61, 09, 25, 111, N'蔺河镇'),
	(61, 09, 25, 112, N'四季镇'),
	(61, 09, 25, 114, N'孟石岭镇'),
	(61, 09, 25, 115, N'南宫山镇');

/* 陕西省 安康市 平利县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 09, 26, 100, N'城关镇'),
	(61, 09, 26, 101, N'兴隆镇'),
	(61, 09, 26, 102, N'老县镇'),
	(61, 09, 26, 103, N'大贵镇'),
	(61, 09, 26, 104, N'三阳镇'),
	(61, 09, 26, 105, N'洛河镇'),
	(61, 09, 26, 106, N'广佛镇'),
	(61, 09, 26, 107, N'八仙镇'),
	(61, 09, 26, 108, N'长安镇'),
	(61, 09, 26, 109, N'正阳镇'),
	(61, 09, 26, 110, N'西河镇');

/* 陕西省 安康市 镇坪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 09, 27, 100, N'城关镇'),
	(61, 09, 27, 101, N'曾家镇'),
	(61, 09, 27, 102, N'牛头店镇'),
	(61, 09, 27, 103, N'钟宝镇'),
	(61, 09, 27, 105, N'上竹镇'),
	(61, 09, 27, 106, N'华坪镇'),
	(61, 09, 27, 108, N'曙坪镇');

/* 陕西省 安康市 旬阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 09, 28, 100, N'城关镇'),
	(61, 09, 28, 101, N'棕溪镇'),
	(61, 09, 28, 102, N'关口镇'),
	(61, 09, 28, 103, N'蜀河镇'),
	(61, 09, 28, 104, N'双河镇'),
	(61, 09, 28, 105, N'小河镇'),
	(61, 09, 28, 106, N'赵湾镇'),
	(61, 09, 28, 107, N'麻坪镇'),
	(61, 09, 28, 108, N'甘溪镇'),
	(61, 09, 28, 109, N'白柳镇'),
	(61, 09, 28, 110, N'吕河镇'),
	(61, 09, 28, 111, N'神河镇'),
	(61, 09, 28, 112, N'铜钱关镇'),
	(61, 09, 28, 113, N'段家河镇'),
	(61, 09, 28, 114, N'仙河镇'),
	(61, 09, 28, 115, N'金寨镇'),
	(61, 09, 28, 116, N'桐木镇'),
	(61, 09, 28, 117, N'构元镇'),
	(61, 09, 28, 118, N'石门镇'),
	(61, 09, 28, 119, N'红军镇'),
	(61, 09, 28, 120, N'仁河口镇');

/* 陕西省 安康市 白河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 09, 29, 100, N'城关镇'),
	(61, 09, 29, 101, N'中厂镇'),
	(61, 09, 29, 102, N'构扒镇'),
	(61, 09, 29, 103, N'卡子镇'),
	(61, 09, 29, 104, N'茅坪镇'),
	(61, 09, 29, 105, N'宋家镇'),
	(61, 09, 29, 106, N'西营镇'),
	(61, 09, 29, 107, N'仓上镇'),
	(61, 09, 29, 108, N'冷水镇'),
	(61, 09, 29, 109, N'双丰镇'),
	(61, 09, 29, 110, N'麻虎镇');

/* 陕西省 商洛市 商州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 10, 02, 001, N'城关街道办事处'),
	(61, 10, 02, 002, N'大赵峪街道办事处'),
	(61, 10, 02, 003, N'陈塬街道办事处'),
	(61, 10, 02, 004, N'刘湾街道办事处'),
	(61, 10, 02, 101, N'夜村镇'),
	(61, 10, 02, 104, N'沙河子镇'),
	(61, 10, 02, 105, N'杨峪河镇'),
	(61, 10, 02, 106, N'金陵寺镇'),
	(61, 10, 02, 107, N'黑山镇'),
	(61, 10, 02, 108, N'杨斜镇'),
	(61, 10, 02, 109, N'麻街镇'),
	(61, 10, 02, 111, N'牧护关镇'),
	(61, 10, 02, 112, N'大荆镇'),
	(61, 10, 02, 113, N'腰市镇'),
	(61, 10, 02, 114, N'板桥镇'),
	(61, 10, 02, 115, N'北宽坪镇'),
	(61, 10, 02, 119, N'三岔河镇'),
	(61, 10, 02, 121, N'闫村镇');

/* 陕西省 商洛市 洛南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 10, 21, 001, N'城关街道办事处'),
	(61, 10, 21, 002, N'四皓街道办事处'),
	(61, 10, 21, 101, N'景村镇'),
	(61, 10, 21, 102, N'古城镇'),
	(61, 10, 21, 103, N'三要镇'),
	(61, 10, 21, 104, N'灵口镇'),
	(61, 10, 21, 106, N'寺耳镇'),
	(61, 10, 21, 107, N'巡检镇'),
	(61, 10, 21, 108, N'石坡镇'),
	(61, 10, 21, 109, N'石门镇'),
	(61, 10, 21, 110, N'麻坪镇'),
	(61, 10, 21, 111, N'洛源镇'),
	(61, 10, 21, 112, N'保安镇'),
	(61, 10, 21, 114, N'永丰镇'),
	(61, 10, 21, 117, N'柏峪寺镇'),
	(61, 10, 21, 118, N'高耀镇');

/* 陕西省 商洛市 丹凤县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 10, 22, 001, N'龙驹寨街道办事处'),
	(61, 10, 22, 101, N'庾岭镇'),
	(61, 10, 22, 102, N'蔡川镇'),
	(61, 10, 22, 103, N'峦庄镇'),
	(61, 10, 22, 104, N'铁峪铺镇'),
	(61, 10, 22, 105, N'武关镇'),
	(61, 10, 22, 106, N'竹林关镇'),
	(61, 10, 22, 107, N'土门镇'),
	(61, 10, 22, 108, N'寺坪镇'),
	(61, 10, 22, 109, N'商镇'),
	(61, 10, 22, 110, N'棣花镇'),
	(61, 10, 22, 115, N'花瓶子镇');

/* 陕西省 商洛市 商南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 10, 23, 001, N'城关街道办事处'),
	(61, 10, 23, 101, N'富水镇'),
	(61, 10, 23, 102, N'湘河镇'),
	(61, 10, 23, 104, N'赵川镇'),
	(61, 10, 23, 107, N'过风楼镇'),
	(61, 10, 23, 108, N'试马镇'),
	(61, 10, 23, 109, N'清油河镇'),
	(61, 10, 23, 110, N'十里坪镇'),
	(61, 10, 23, 111, N'金丝峡镇'),
	(61, 10, 23, 112, N'青山镇');

/* 陕西省 商洛市 山阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 10, 24, 001, N'城关街道办事处'),
	(61, 10, 24, 002, N'十里铺街道办事处'),
	(61, 10, 24, 101, N'高坝店镇'),
	(61, 10, 24, 102, N'天竺山镇'),
	(61, 10, 24, 103, N'中村镇'),
	(61, 10, 24, 104, N'银花镇'),
	(61, 10, 24, 105, N'西照川镇'),
	(61, 10, 24, 106, N'漫川关镇'),
	(61, 10, 24, 107, N'南宽坪镇'),
	(61, 10, 24, 108, N'户家塬镇'),
	(61, 10, 24, 109, N'杨地镇'),
	(61, 10, 24, 111, N'小河口镇'),
	(61, 10, 24, 112, N'色河铺镇'),
	(61, 10, 24, 113, N'板岩镇'),
	(61, 10, 24, 116, N'延坪镇'),
	(61, 10, 24, 117, N'两岭镇'),
	(61, 10, 24, 118, N'王阎镇'),
	(61, 10, 24, 121, N'法官镇');

/* 陕西省 商洛市 镇安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 10, 25, 001, N'永乐街道办事处'),
	(61, 10, 25, 101, N'回龙镇'),
	(61, 10, 25, 102, N'铁厂镇'),
	(61, 10, 25, 103, N'大坪镇'),
	(61, 10, 25, 104, N'米粮镇'),
	(61, 10, 25, 105, N'茅坪回族镇'),
	(61, 10, 25, 106, N'西口回族镇'),
	(61, 10, 25, 107, N'高峰镇'),
	(61, 10, 25, 108, N'青铜关镇'),
	(61, 10, 25, 109, N'柴坪镇'),
	(61, 10, 25, 110, N'达仁镇'),
	(61, 10, 25, 111, N'木王镇'),
	(61, 10, 25, 113, N'云盖寺镇'),
	(61, 10, 25, 114, N'庙沟镇'),
	(61, 10, 25, 117, N'月河镇');

/* 陕西省 商洛市 柞水县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(61, 10, 26, 001, N'乾佑街道办事处'),
	(61, 10, 26, 101, N'营盘镇'),
	(61, 10, 26, 102, N'下梁镇'),
	(61, 10, 26, 104, N'小岭镇'),
	(61, 10, 26, 105, N'凤凰镇'),
	(61, 10, 26, 106, N'红岩寺镇'),
	(61, 10, 26, 107, N'曹坪镇'),
	(61, 10, 26, 109, N'杏坪镇'),
	(61, 10, 26, 110, N'瓦房口镇');


/* 甘肃省 兰州市 城关区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 01, 02, 001, N'酒泉路街道'),
	(62, 01, 02, 002, N'张掖路街道'),
	(62, 01, 02, 003, N'雁南街道'),
	(62, 01, 02, 004, N'临夏路街道'),
	(62, 01, 02, 005, N'雁北街道'),
	(62, 01, 02, 006, N'五泉街道'),
	(62, 01, 02, 007, N'白银路街道'),
	(62, 01, 02, 008, N'皋兰路街道'),
	(62, 01, 02, 009, N'广武门街道'),
	(62, 01, 02, 010, N'伏龙坪街道'),
	(62, 01, 02, 011, N'靖远路街道'),
	(62, 01, 02, 012, N'草场街街道'),
	(62, 01, 02, 013, N'火车站街道'),
	(62, 01, 02, 014, N'拱星墩街道'),
	(62, 01, 02, 015, N'东岗街道'),
	(62, 01, 02, 016, N'团结新村街道'),
	(62, 01, 02, 017, N'东岗西路街道'),
	(62, 01, 02, 018, N'铁路东村街道'),
	(62, 01, 02, 019, N'铁路西村街道'),
	(62, 01, 02, 020, N'渭源路街道'),
	(62, 01, 02, 021, N'盐场路街道'),
	(62, 01, 02, 022, N'嘉峪关路街道'),
	(62, 01, 02, 023, N'焦家湾街道'),
	(62, 01, 02, 024, N'青白石街道');

/* 甘肃省 兰州市 七里河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 01, 03, 001, N'西园街道'),
	(62, 01, 03, 002, N'西湖街道'),
	(62, 01, 03, 003, N'建兰路街道'),
	(62, 01, 03, 004, N'敦煌路街道'),
	(62, 01, 03, 005, N'西站街道'),
	(62, 01, 03, 006, N'晏家坪街道'),
	(62, 01, 03, 007, N'龚家湾街道'),
	(62, 01, 03, 008, N'土门墩街道'),
	(62, 01, 03, 009, N'秀川街道'),
	(62, 01, 03, 100, N'阿干镇'),
	(62, 01, 03, 101, N'八里镇'),
	(62, 01, 03, 102, N'彭家坪镇'),
	(62, 01, 03, 103, N'西果园镇'),
	(62, 01, 03, 200, N'魏岭乡'),
	(62, 01, 03, 201, N'黄峪乡');

/* 甘肃省 兰州市 西固区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 01, 04, 001, N'陈坪街道'),
	(62, 01, 04, 002, N'先锋路街道'),
	(62, 01, 04, 003, N'福利路街道'),
	(62, 01, 04, 004, N'西固城街道'),
	(62, 01, 04, 005, N'四季青街道'),
	(62, 01, 04, 006, N'临洮街街道'),
	(62, 01, 04, 007, N'西柳沟街道'),
	(62, 01, 04, 100, N'新城镇'),
	(62, 01, 04, 101, N'东川镇'),
	(62, 01, 04, 102, N'河口镇'),
	(62, 01, 04, 200, N'达川乡'),
	(62, 01, 04, 203, N'柳泉乡'),
	(62, 01, 04, 204, N'金沟乡');

/* 甘肃省 兰州市 安宁区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 01, 05, 001, N'培黎街道'),
	(62, 01, 05, 002, N'西路街道'),
	(62, 01, 05, 003, N'沙井驿街道'),
	(62, 01, 05, 004, N'十里店街道'),
	(62, 01, 05, 005, N'孔家崖街道'),
	(62, 01, 05, 006, N'银滩路街道'),
	(62, 01, 05, 007, N'刘家堡街道'),
	(62, 01, 05, 008, N'安宁堡街道');

/* 甘肃省 兰州市 红古区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 01, 11, 001, N'窑街街道'),
	(62, 01, 11, 002, N'下窑街道'),
	(62, 01, 11, 003, N'矿区街道'),
	(62, 01, 11, 101, N'海石湾镇'),
	(62, 01, 11, 102, N'花庄镇'),
	(62, 01, 11, 103, N'平安镇'),
	(62, 01, 11, 104, N'红古镇');

/* 甘肃省 兰州市 永登县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 01, 21, 100, N'城关镇'),
	(62, 01, 21, 101, N'红城镇'),
	(62, 01, 21, 102, N'中堡镇'),
	(62, 01, 21, 103, N'武胜驿镇'),
	(62, 01, 21, 104, N'河桥镇'),
	(62, 01, 21, 105, N'连城镇'),
	(62, 01, 21, 106, N'苦水镇'),
	(62, 01, 21, 109, N'大同镇'),
	(62, 01, 21, 110, N'龙泉寺镇'),
	(62, 01, 21, 111, N'树屏镇'),
	(62, 01, 21, 112, N'上川镇'),
	(62, 01, 21, 200, N'柳树乡'),
	(62, 01, 21, 201, N'坪城乡'),
	(62, 01, 21, 202, N'民乐乡'),
	(62, 01, 21, 203, N'通远乡'),
	(62, 01, 21, 204, N'七山乡');

/* 甘肃省 兰州市 皋兰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 01, 22, 100, N'石洞镇'),
	(62, 01, 22, 102, N'忠和镇'),
	(62, 01, 22, 103, N'什川镇'),
	(62, 01, 22, 104, N'九合镇'),
	(62, 01, 22, 105, N'水阜镇'),
	(62, 01, 22, 106, N'黑石镇');

/* 甘肃省 兰州市 榆中县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 01, 23, 100, N'城关镇'),
	(62, 01, 23, 101, N'夏官营镇'),
	(62, 01, 23, 102, N'高崖镇'),
	(62, 01, 23, 103, N'金崖镇'),
	(62, 01, 23, 104, N'和平镇'),
	(62, 01, 23, 105, N'甘草店镇'),
	(62, 01, 23, 106, N'青城镇'),
	(62, 01, 23, 107, N'定远镇'),
	(62, 01, 23, 200, N'来紫堡乡'),
	(62, 01, 23, 201, N'三角城乡'),
	(62, 01, 23, 202, N'小康营乡'),
	(62, 01, 23, 203, N'连搭乡'),
	(62, 01, 23, 204, N'银山乡'),
	(62, 01, 23, 205, N'马坡乡'),
	(62, 01, 23, 206, N'新营乡'),
	(62, 01, 23, 207, N'清水驿乡'),
	(62, 01, 23, 208, N'龙泉乡'),
	(62, 01, 23, 209, N'韦营乡'),
	(62, 01, 23, 210, N'中连川乡'),
	(62, 01, 23, 211, N'贡井乡'),
	(62, 01, 23, 212, N'园子岔乡'),
	(62, 01, 23, 213, N'上花岔乡'),
	(62, 01, 23, 214, N'哈岘乡');

/* 甘肃省 嘉峪关市 市辖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 02, 01, 100, N'新城镇'),
	(62, 02, 01, 101, N'峪泉镇'),
	(62, 02, 01, 102, N'文殊镇');

/* 甘肃省 金昌市 金川区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 03, 02, 001, N'滨河路街道'),
	(62, 03, 02, 002, N'桂林路街道'),
	(62, 03, 02, 003, N'北京路街道'),
	(62, 03, 02, 004, N'金川路街道'),
	(62, 03, 02, 005, N'新华路街道'),
	(62, 03, 02, 006, N'广州路街道'),
	(62, 03, 02, 100, N'宁远堡镇'),
	(62, 03, 02, 101, N'双湾镇');

/* 甘肃省 金昌市 永昌县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 03, 21, 100, N'城关镇'),
	(62, 03, 21, 101, N'河西堡镇'),
	(62, 03, 21, 102, N'新城子镇'),
	(62, 03, 21, 103, N'朱王堡镇'),
	(62, 03, 21, 104, N'东寨镇'),
	(62, 03, 21, 105, N'水源镇'),
	(62, 03, 21, 200, N'红山窑乡'),
	(62, 03, 21, 201, N'焦家庄乡'),
	(62, 03, 21, 202, N'六坝乡'),
	(62, 03, 21, 203, N'南坝乡');

/* 甘肃省 白银市 白银区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 04, 02, 001, N'人民路街道'),
	(62, 04, 02, 002, N'公园路街道'),
	(62, 04, 02, 003, N'四龙路街道'),
	(62, 04, 02, 004, N'工农路街道'),
	(62, 04, 02, 005, N'纺织路街道'),
	(62, 04, 02, 100, N'水川镇'),
	(62, 04, 02, 101, N'四龙镇'),
	(62, 04, 02, 102, N'王岘镇'),
	(62, 04, 02, 201, N'强湾乡'),
	(62, 04, 02, 202, N'武川乡');

/* 甘肃省 白银市 平川区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 04, 03, 001, N'长征街道'),
	(62, 04, 03, 002, N'电力路街道'),
	(62, 04, 03, 003, N'红会路街道'),
	(62, 04, 03, 004, N'兴平路街道'),
	(62, 04, 03, 100, N'王家山镇'),
	(62, 04, 03, 101, N'水泉镇'),
	(62, 04, 03, 102, N'共和镇'),
	(62, 04, 03, 105, N'宝积镇'),
	(62, 04, 03, 202, N'黄峤乡'),
	(62, 04, 03, 203, N'种田乡'),
	(62, 04, 03, 204, N'复兴乡');

/* 甘肃省 白银市 靖远县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 04, 21, 101, N'北湾镇'),
	(62, 04, 21, 102, N'东湾镇'),
	(62, 04, 21, 103, N'乌兰镇'),
	(62, 04, 21, 104, N'刘川镇'),
	(62, 04, 21, 105, N'北滩镇'),
	(62, 04, 21, 200, N'平堡乡'),
	(62, 04, 21, 202, N'糜滩乡'),
	(62, 04, 21, 203, N'三滩乡'),
	(62, 04, 21, 205, N'大芦乡'),
	(62, 04, 21, 206, N'兴隆乡'),
	(62, 04, 21, 207, N'双龙乡'),
	(62, 04, 21, 208, N'石门乡'),
	(62, 04, 21, 210, N'高湾乡'),
	(62, 04, 21, 211, N'靖安乡'),
	(62, 04, 21, 212, N'五合乡'),
	(62, 04, 21, 213, N'东升乡'),
	(62, 04, 21, 215, N'永新乡'),
	(62, 04, 21, 216, N'若笠乡');

/* 甘肃省 白银市 会宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 04, 22, 100, N'会师镇'),
	(62, 04, 22, 101, N'郭城驿镇'),
	(62, 04, 22, 102, N'河畔镇'),
	(62, 04, 22, 103, N'头寨子镇'),
	(62, 04, 22, 104, N'太平店镇'),
	(62, 04, 22, 105, N'甘沟驿镇'),
	(62, 04, 22, 106, N'侯家川镇'),
	(62, 04, 22, 107, N'柴家门镇'),
	(62, 04, 22, 108, N'汉家岔镇'),
	(62, 04, 22, 109, N'刘家寨子镇'),
	(62, 04, 22, 110, N'白草塬镇'),
	(62, 04, 22, 111, N'大沟镇'),
	(62, 04, 22, 112, N'四房吴镇'),
	(62, 04, 22, 113, N'中川镇'),
	(62, 04, 22, 114, N'老君坡镇'),
	(62, 04, 22, 115, N'平头川镇'),
	(62, 04, 22, 200, N'丁家沟乡'),
	(62, 04, 22, 202, N'新添堡回族乡'),
	(62, 04, 22, 204, N'党家岘乡'),
	(62, 04, 22, 205, N'杨崖集乡'),
	(62, 04, 22, 209, N'翟家所乡'),
	(62, 04, 22, 213, N'八里湾乡'),
	(62, 04, 22, 215, N'韩家集乡'),
	(62, 04, 22, 221, N'土门岘乡'),
	(62, 04, 22, 222, N'新塬乡'),
	(62, 04, 22, 224, N'草滩乡'),
	(62, 04, 22, 225, N'土高山乡'),
	(62, 04, 22, 227, N'新庄乡');

/* 甘肃省 白银市 景泰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 04, 23, 100, N'一条山镇'),
	(62, 04, 23, 101, N'芦阳镇'),
	(62, 04, 23, 102, N'上沙沃镇'),
	(62, 04, 23, 103, N'喜泉镇'),
	(62, 04, 23, 104, N'草窝滩镇'),
	(62, 04, 23, 105, N'红水镇'),
	(62, 04, 23, 106, N'中泉镇'),
	(62, 04, 23, 107, N'正路镇'),
	(62, 04, 23, 203, N'寺滩乡'),
	(62, 04, 23, 205, N'五佛乡'),
	(62, 04, 23, 207, N'漫水滩乡');

/* 甘肃省 天水市 秦州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 05, 02, 001, N'大城街道'),
	(62, 05, 02, 002, N'七里墩街道'),
	(62, 05, 02, 003, N'东关街道'),
	(62, 05, 02, 004, N'中城街道'),
	(62, 05, 02, 005, N'西关街道'),
	(62, 05, 02, 006, N'石马坪街道'),
	(62, 05, 02, 007, N'天水郡街道'),
	(62, 05, 02, 100, N'玉泉镇'),
	(62, 05, 02, 101, N'太京镇'),
	(62, 05, 02, 102, N'藉口镇'),
	(62, 05, 02, 103, N'皂郊镇'),
	(62, 05, 02, 104, N'汪川镇'),
	(62, 05, 02, 105, N'牡丹镇'),
	(62, 05, 02, 106, N'关子镇'),
	(62, 05, 02, 107, N'平南镇'),
	(62, 05, 02, 108, N'天水镇'),
	(62, 05, 02, 109, N'娘娘坝镇'),
	(62, 05, 02, 110, N'中梁镇'),
	(62, 05, 02, 201, N'秦岭乡'),
	(62, 05, 02, 202, N'杨家寺乡'),
	(62, 05, 02, 203, N'齐寿乡'),
	(62, 05, 02, 204, N'华歧乡'),
	(62, 05, 02, 205, N'大门乡');

/* 甘肃省 天水市 麦积区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 05, 03, 001, N'道北街道'),
	(62, 05, 03, 002, N'北道埠街道'),
	(62, 05, 03, 003, N'桥南街道'),
	(62, 05, 03, 100, N'社棠镇'),
	(62, 05, 03, 101, N'马跑泉镇'),
	(62, 05, 03, 102, N'甘泉镇'),
	(62, 05, 03, 103, N'渭南镇'),
	(62, 05, 03, 104, N'东岔镇'),
	(62, 05, 03, 105, N'花牛镇'),
	(62, 05, 03, 106, N'中滩镇'),
	(62, 05, 03, 107, N'新阳镇'),
	(62, 05, 03, 108, N'元龙镇'),
	(62, 05, 03, 109, N'伯阳镇'),
	(62, 05, 03, 110, N'麦积镇'),
	(62, 05, 03, 111, N'石佛镇'),
	(62, 05, 03, 112, N'三岔镇'),
	(62, 05, 03, 201, N'五龙乡'),
	(62, 05, 03, 202, N'琥珀乡'),
	(62, 05, 03, 203, N'党川乡'),
	(62, 05, 03, 204, N'利桥乡');

/* 甘肃省 天水市 清水县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 05, 21, 100, N'永清镇'),
	(62, 05, 21, 101, N'红堡镇'),
	(62, 05, 21, 102, N'白驼镇'),
	(62, 05, 21, 103, N'金集镇'),
	(62, 05, 21, 104, N'秦亭镇'),
	(62, 05, 21, 105, N'山门镇'),
	(62, 05, 21, 106, N'白沙镇'),
	(62, 05, 21, 201, N'松树乡'),
	(62, 05, 21, 202, N'王河乡'),
	(62, 05, 21, 203, N'远门乡'),
	(62, 05, 21, 204, N'土门乡'),
	(62, 05, 21, 205, N'郭川乡'),
	(62, 05, 21, 206, N'贾川乡'),
	(62, 05, 21, 207, N'丰望乡'),
	(62, 05, 21, 208, N'草川铺乡'),
	(62, 05, 21, 209, N'陇东乡'),
	(62, 05, 21, 210, N'黄门乡'),
	(62, 05, 21, 211, N'新城乡');

/* 甘肃省 天水市 秦安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 05, 22, 100, N'兴国镇'),
	(62, 05, 22, 101, N'莲花镇'),
	(62, 05, 22, 102, N'西川镇'),
	(62, 05, 22, 103, N'陇城镇'),
	(62, 05, 22, 104, N'郭嘉镇'),
	(62, 05, 22, 105, N'五营镇'),
	(62, 05, 22, 106, N'叶堡镇'),
	(62, 05, 22, 107, N'魏店镇'),
	(62, 05, 22, 200, N'刘坪乡'),
	(62, 05, 22, 202, N'中山乡'),
	(62, 05, 22, 204, N'安伏乡'),
	(62, 05, 22, 206, N'王铺乡'),
	(62, 05, 22, 207, N'千户乡'),
	(62, 05, 22, 208, N'王窑乡'),
	(62, 05, 22, 209, N'云山乡'),
	(62, 05, 22, 210, N'王尹乡'),
	(62, 05, 22, 211, N'兴丰乡');

/* 甘肃省 天水市 甘谷县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 05, 23, 100, N'大像山镇'),
	(62, 05, 23, 101, N'磐安镇'),
	(62, 05, 23, 102, N'新兴镇'),
	(62, 05, 23, 103, N'安远镇'),
	(62, 05, 23, 104, N'六峰镇'),
	(62, 05, 23, 105, N'金山镇'),
	(62, 05, 23, 204, N'八里湾乡'),
	(62, 05, 23, 205, N'西坪乡'),
	(62, 05, 23, 206, N'大庄乡'),
	(62, 05, 23, 208, N'大石乡'),
	(62, 05, 23, 209, N'礼辛乡'),
	(62, 05, 23, 211, N'谢家湾乡'),
	(62, 05, 23, 213, N'武家河乡'),
	(62, 05, 23, 214, N'古坡乡'),
	(62, 05, 23, 215, N'白家湾乡');

/* 甘肃省 天水市 武山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 05, 24, 100, N'城关镇'),
	(62, 05, 24, 101, N'洛门镇'),
	(62, 05, 24, 102, N'鸳鸯镇'),
	(62, 05, 24, 103, N'滩歌镇'),
	(62, 05, 24, 104, N'四门镇'),
	(62, 05, 24, 105, N'马力镇'),
	(62, 05, 24, 106, N'山丹镇'),
	(62, 05, 24, 201, N'榆盘乡'),
	(62, 05, 24, 202, N'咀头乡'),
	(62, 05, 24, 203, N'桦林乡'),
	(62, 05, 24, 204, N'高楼乡'),
	(62, 05, 24, 205, N'杨河乡'),
	(62, 05, 24, 206, N'沿安乡'),
	(62, 05, 24, 207, N'温泉乡'),
	(62, 05, 24, 208, N'龙台乡');

/* 甘肃省 天水市 张家川回族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 05, 25, 100, N'张家川镇'),
	(62, 05, 25, 101, N'龙山镇'),
	(62, 05, 25, 102, N'恭门镇'),
	(62, 05, 25, 201, N'刘堡乡'),
	(62, 05, 25, 202, N'张棉乡'),
	(62, 05, 25, 203, N'胡川乡'),
	(62, 05, 25, 204, N'木河乡'),
	(62, 05, 25, 206, N'大阳乡'),
	(62, 05, 25, 207, N'川王乡'),
	(62, 05, 25, 208, N'马关乡'),
	(62, 05, 25, 209, N'连五乡'),
	(62, 05, 25, 210, N'梁山乡'),
	(62, 05, 25, 213, N'平安乡'),
	(62, 05, 25, 214, N'阎家乡'),
	(62, 05, 25, 215, N'马鹿乡');

/* 甘肃省 武威市 凉州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 06, 02, 001, N'东大街街道办事处'),
	(62, 06, 02, 002, N'西大街街道办事处'),
	(62, 06, 02, 003, N'东关街街道办事处'),
	(62, 06, 02, 004, N'西关街街道办事处'),
	(62, 06, 02, 005, N'火车站街街道办事处'),
	(62, 06, 02, 006, N'地质新村街街道办事处'),
	(62, 06, 02, 007, N'荣华街街道办事处'),
	(62, 06, 02, 008, N'黄羊河街道办事处'),
	(62, 06, 02, 100, N'黄羊镇'),
	(62, 06, 02, 101, N'武南镇'),
	(62, 06, 02, 102, N'清源镇'),
	(62, 06, 02, 103, N'永昌镇'),
	(62, 06, 02, 104, N'双城镇'),
	(62, 06, 02, 105, N'丰乐镇'),
	(62, 06, 02, 106, N'高坝镇'),
	(62, 06, 02, 107, N'金羊镇'),
	(62, 06, 02, 108, N'和平镇'),
	(62, 06, 02, 109, N'羊下坝镇'),
	(62, 06, 02, 110, N'中坝镇'),
	(62, 06, 02, 111, N'永丰镇'),
	(62, 06, 02, 112, N'古城镇'),
	(62, 06, 02, 113, N'张义镇'),
	(62, 06, 02, 114, N'发放镇'),
	(62, 06, 02, 115, N'西营镇'),
	(62, 06, 02, 116, N'四坝镇'),
	(62, 06, 02, 117, N'洪祥镇'),
	(62, 06, 02, 118, N'谢河镇'),
	(62, 06, 02, 119, N'金沙镇'),
	(62, 06, 02, 120, N'松树镇'),
	(62, 06, 02, 121, N'怀安镇'),
	(62, 06, 02, 122, N'下双镇'),
	(62, 06, 02, 123, N'清水镇'),
	(62, 06, 02, 124, N'河东镇'),
	(62, 06, 02, 200, N'五和乡'),
	(62, 06, 02, 201, N'韩佐乡'),
	(62, 06, 02, 203, N'大柳乡'),
	(62, 06, 02, 204, N'长城乡'),
	(62, 06, 02, 206, N'柏树乡'),
	(62, 06, 02, 207, N'金塔乡'),
	(62, 06, 02, 209, N'九墩乡'),
	(62, 06, 02, 211, N'金山乡'),
	(62, 06, 02, 213, N'吴家井乡'),
	(62, 06, 02, 214, N'新华乡'),
	(62, 06, 02, 215, N'康宁乡'),
	(62, 06, 02, 216, N'东河乡');

/* 甘肃省 武威市 民勤县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 06, 21, 100, N'三雷镇'),
	(62, 06, 21, 101, N'东坝镇'),
	(62, 06, 21, 102, N'泉山镇'),
	(62, 06, 21, 103, N'西渠镇'),
	(62, 06, 21, 104, N'东湖镇'),
	(62, 06, 21, 105, N'红沙岗镇'),
	(62, 06, 21, 106, N'昌宁镇'),
	(62, 06, 21, 107, N'重兴镇'),
	(62, 06, 21, 108, N'薛百镇'),
	(62, 06, 21, 109, N'大坝镇'),
	(62, 06, 21, 110, N'苏武镇'),
	(62, 06, 21, 111, N'大滩镇'),
	(62, 06, 21, 112, N'双茨科镇'),
	(62, 06, 21, 113, N'红沙梁镇'),
	(62, 06, 21, 201, N'蔡旗乡'),
	(62, 06, 21, 206, N'夹河乡'),
	(62, 06, 21, 210, N'收成乡'),
	(62, 06, 21, 211, N'南湖乡');

/* 甘肃省 武威市 古浪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 06, 22, 100, N'古浪镇'),
	(62, 06, 22, 101, N'泗水镇'),
	(62, 06, 22, 102, N'土门镇'),
	(62, 06, 22, 103, N'大靖镇'),
	(62, 06, 22, 104, N'裴家营镇'),
	(62, 06, 22, 105, N'海子滩镇'),
	(62, 06, 22, 106, N'定宁镇'),
	(62, 06, 22, 107, N'黄羊川镇'),
	(62, 06, 22, 108, N'黑松驿镇'),
	(62, 06, 22, 109, N'永丰滩镇'),
	(62, 06, 22, 110, N'黄花滩镇'),
	(62, 06, 22, 111, N'西靖镇'),
	(62, 06, 22, 203, N'民权乡'),
	(62, 06, 22, 204, N'直滩乡'),
	(62, 06, 22, 205, N'新堡乡'),
	(62, 06, 22, 206, N'干城乡'),
	(62, 06, 22, 207, N'横梁乡'),
	(62, 06, 22, 208, N'十八里堡乡'),
	(62, 06, 22, 209, N'古丰乡');

/* 甘肃省 武威市 天祝藏族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 06, 23, 100, N'华藏寺镇'),
	(62, 06, 23, 101, N'打柴沟镇'),
	(62, 06, 23, 102, N'安远镇'),
	(62, 06, 23, 103, N'炭山岭镇'),
	(62, 06, 23, 104, N'哈溪镇'),
	(62, 06, 23, 105, N'赛什斯镇'),
	(62, 06, 23, 106, N'石门镇'),
	(62, 06, 23, 107, N'松山镇'),
	(62, 06, 23, 108, N'天堂镇'),
	(62, 06, 23, 109, N'朵什镇'),
	(62, 06, 23, 201, N'东坪乡'),
	(62, 06, 23, 202, N'赛拉隆乡'),
	(62, 06, 23, 203, N'东大滩乡'),
	(62, 06, 23, 204, N'抓喜秀龙乡'),
	(62, 06, 23, 205, N'西大滩乡'),
	(62, 06, 23, 207, N'大红沟乡'),
	(62, 06, 23, 208, N'毛藏乡'),
	(62, 06, 23, 209, N'祁连乡'),
	(62, 06, 23, 210, N'旦马乡');

/* 甘肃省 张掖市 甘州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 07, 02, 001, N'东街街道'),
	(62, 07, 02, 002, N'南街街道'),
	(62, 07, 02, 003, N'西街街道'),
	(62, 07, 02, 004, N'北街街道'),
	(62, 07, 02, 005, N'火车站街道'),
	(62, 07, 02, 100, N'梁家墩镇'),
	(62, 07, 02, 101, N'上秦镇'),
	(62, 07, 02, 102, N'大满镇'),
	(62, 07, 02, 103, N'沙井镇'),
	(62, 07, 02, 104, N'乌江镇'),
	(62, 07, 02, 105, N'甘浚镇'),
	(62, 07, 02, 106, N'新墩镇'),
	(62, 07, 02, 107, N'党寨镇'),
	(62, 07, 02, 108, N'碱滩镇'),
	(62, 07, 02, 109, N'三闸镇'),
	(62, 07, 02, 110, N'小满镇'),
	(62, 07, 02, 111, N'明永镇'),
	(62, 07, 02, 112, N'长安镇'),
	(62, 07, 02, 203, N'安阳乡'),
	(62, 07, 02, 204, N'花寨乡'),
	(62, 07, 02, 205, N'龙渠乡'),
	(62, 07, 02, 207, N'靖安乡'),
	(62, 07, 02, 211, N'平山湖蒙古族乡');

/* 甘肃省 张掖市 肃南裕固族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 07, 21, 100, N'红湾寺镇'),
	(62, 07, 21, 101, N'皇城镇'),
	(62, 07, 21, 200, N'马蹄藏族乡'),
	(62, 07, 21, 201, N'康乐乡'),
	(62, 07, 21, 202, N'白银蒙古族乡'),
	(62, 07, 21, 203, N'大河乡'),
	(62, 07, 21, 204, N'明花乡'),
	(62, 07, 21, 205, N'祁丰蔵族乡');

/* 甘肃省 张掖市 民乐县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 07, 22, 101, N'洪水镇'),
	(62, 07, 22, 102, N'六坝镇'),
	(62, 07, 22, 103, N'新天镇'),
	(62, 07, 22, 104, N'南古镇'),
	(62, 07, 22, 105, N'永固镇'),
	(62, 07, 22, 106, N'三堡镇'),
	(62, 07, 22, 200, N'南丰乡'),
	(62, 07, 22, 201, N'民联乡'),
	(62, 07, 22, 203, N'顺化乡'),
	(62, 07, 22, 204, N'丰乐乡');

/* 甘肃省 张掖市 临泽县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 07, 23, 101, N'沙河镇'),
	(62, 07, 23, 102, N'新华镇'),
	(62, 07, 23, 103, N'蓼泉镇'),
	(62, 07, 23, 104, N'平川镇'),
	(62, 07, 23, 105, N'板桥镇'),
	(62, 07, 23, 106, N'鸭暖镇'),
	(62, 07, 23, 107, N'倪家营镇');

/* 甘肃省 张掖市 高台县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 07, 24, 100, N'城关镇'),
	(62, 07, 24, 101, N'宣化镇'),
	(62, 07, 24, 102, N'南华镇'),
	(62, 07, 24, 103, N'巷道镇'),
	(62, 07, 24, 104, N'合黎镇'),
	(62, 07, 24, 105, N'骆驼城镇'),
	(62, 07, 24, 106, N'新坝镇'),
	(62, 07, 24, 201, N'黑泉乡'),
	(62, 07, 24, 202, N'罗城乡');

/* 甘肃省 张掖市 山丹县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 07, 25, 101, N'清泉镇'),
	(62, 07, 25, 102, N'位奇镇'),
	(62, 07, 25, 103, N'霍城镇'),
	(62, 07, 25, 104, N'陈户镇'),
	(62, 07, 25, 105, N'大马营镇'),
	(62, 07, 25, 106, N'东乐镇'),
	(62, 07, 25, 203, N'老军乡'),
	(62, 07, 25, 204, N'李桥乡');

/* 甘肃省 平凉市 崆峒区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 08, 02, 001, N'东关街道'),
	(62, 08, 02, 002, N'中街街道'),
	(62, 08, 02, 003, N'西郊街道'),
	(62, 08, 02, 101, N'崆峒镇'),
	(62, 08, 02, 102, N'白水镇'),
	(62, 08, 02, 103, N'草峰镇'),
	(62, 08, 02, 104, N'安国镇'),
	(62, 08, 02, 105, N'柳湖镇'),
	(62, 08, 02, 202, N'花所乡'),
	(62, 08, 02, 203, N'索罗乡'),
	(62, 08, 02, 204, N'香莲乡'),
	(62, 08, 02, 205, N'西阳乡'),
	(62, 08, 02, 206, N'大秦乡'),
	(62, 08, 02, 207, N'白庙乡'),
	(62, 08, 02, 208, N'寨河乡'),
	(62, 08, 02, 209, N'大寨乡'),
	(62, 08, 02, 210, N'上杨乡'),
	(62, 08, 02, 211, N'麻武乡'),
	(62, 08, 02, 212, N'峡门乡');

/* 甘肃省 平凉市 泾川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 08, 21, 001, N'街道办事处'),
	(62, 08, 21, 100, N'城关镇'),
	(62, 08, 21, 101, N'玉都镇'),
	(62, 08, 21, 102, N'高平镇'),
	(62, 08, 21, 103, N'荔堡镇'),
	(62, 08, 21, 104, N'王村镇'),
	(62, 08, 21, 105, N'窑店镇'),
	(62, 08, 21, 106, N'飞云镇'),
	(62, 08, 21, 107, N'丰台镇'),
	(62, 08, 21, 108, N'党原镇'),
	(62, 08, 21, 200, N'汭丰乡'),
	(62, 08, 21, 201, N'罗汉洞乡'),
	(62, 08, 21, 202, N'泾明乡'),
	(62, 08, 21, 203, N'红河乡'),
	(62, 08, 21, 205, N'太平乡');

/* 甘肃省 平凉市 灵台县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 08, 22, 001, N'街道办事处'),
	(62, 08, 22, 100, N'中台镇'),
	(62, 08, 22, 101, N'邵寨镇'),
	(62, 08, 22, 102, N'独店镇'),
	(62, 08, 22, 103, N'什字镇'),
	(62, 08, 22, 104, N'朝那镇'),
	(62, 08, 22, 105, N'西屯镇'),
	(62, 08, 22, 106, N'上良镇'),
	(62, 08, 22, 201, N'新开乡'),
	(62, 08, 22, 204, N'梁原乡'),
	(62, 08, 22, 205, N'龙门乡'),
	(62, 08, 22, 206, N'星火乡'),
	(62, 08, 22, 207, N'百里乡'),
	(62, 08, 22, 208, N'蒲窝乡');

/* 甘肃省 平凉市 崇信县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 08, 23, 001, N'锦屏街道办'),
	(62, 08, 23, 100, N'锦屏镇'),
	(62, 08, 23, 101, N'新窑镇'),
	(62, 08, 23, 102, N'柏树镇'),
	(62, 08, 23, 201, N'黄寨乡'),
	(62, 08, 23, 202, N'黄花乡'),
	(62, 08, 23, 203, N'木林乡');

/* 甘肃省 平凉市 华亭县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 08, 24, 001, N'东华街道办事处'),
	(62, 08, 24, 100, N'东华镇'),
	(62, 08, 24, 101, N'安口镇'),
	(62, 08, 24, 102, N'西华镇'),
	(62, 08, 24, 103, N'马峡镇'),
	(62, 08, 24, 104, N'策底镇'),
	(62, 08, 24, 105, N'上关镇'),
	(62, 08, 24, 201, N'神峪乡'),
	(62, 08, 24, 202, N'山寨乡'),
	(62, 08, 24, 203, N'河西乡'),
	(62, 08, 24, 204, N'砚峡乡');

/* 甘肃省 平凉市 庄浪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 08, 25, 001, N'水洛街道办事处'),
	(62, 08, 25, 100, N'水洛镇'),
	(62, 08, 25, 101, N'南湖镇'),
	(62, 08, 25, 102, N'朱店镇'),
	(62, 08, 25, 103, N'万泉镇'),
	(62, 08, 25, 104, N'韩店镇'),
	(62, 08, 25, 105, N'卧龙镇'),
	(62, 08, 25, 106, N'阳川镇'),
	(62, 08, 25, 107, N'盘安镇'),
	(62, 08, 25, 200, N'岳堡乡'),
	(62, 08, 25, 201, N'杨河乡'),
	(62, 08, 25, 202, N'赵墩乡'),
	(62, 08, 25, 203, N'柳梁乡'),
	(62, 08, 25, 207, N'大庄乡'),
	(62, 08, 25, 211, N'良邑乡'),
	(62, 08, 25, 213, N'通化乡'),
	(62, 08, 25, 214, N'永宁乡'),
	(62, 08, 25, 215, N'郑河乡'),
	(62, 08, 25, 217, N'南坪乡');

/* 甘肃省 平凉市 静宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 08, 26, 001, N'城区街道'),
	(62, 08, 26, 100, N'城关镇'),
	(62, 08, 26, 101, N'威戎镇'),
	(62, 08, 26, 102, N'界石铺镇'),
	(62, 08, 26, 103, N'八里镇'),
	(62, 08, 26, 104, N'李店镇'),
	(62, 08, 26, 105, N'古城镇'),
	(62, 08, 26, 106, N'仁大镇'),
	(62, 08, 26, 107, N'甘沟镇'),
	(62, 08, 26, 200, N'城川乡'),
	(62, 08, 26, 201, N'司桥乡'),
	(62, 08, 26, 202, N'曹务乡'),
	(62, 08, 26, 204, N'双岘乡'),
	(62, 08, 26, 205, N'雷大乡'),
	(62, 08, 26, 206, N'余湾乡'),
	(62, 08, 26, 208, N'贾河乡'),
	(62, 08, 26, 209, N'深沟乡'),
	(62, 08, 26, 210, N'治平乡'),
	(62, 08, 26, 211, N'新店乡'),
	(62, 08, 26, 213, N'四河乡'),
	(62, 08, 26, 214, N'红寺乡'),
	(62, 08, 26, 215, N'细巷乡'),
	(62, 08, 26, 216, N'三合乡'),
	(62, 08, 26, 217, N'原安乡'),
	(62, 08, 26, 218, N'灵芝乡');

/* 甘肃省 酒泉市 肃州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 09, 02, 001, N'东北街街道办事处'),
	(62, 09, 02, 002, N'东南街街道办事处'),
	(62, 09, 02, 003, N'工业园街道办事处'),
	(62, 09, 02, 004, N'新城街道办事处'),
	(62, 09, 02, 005, N'西北街街道办事处'),
	(62, 09, 02, 006, N'西南街街道办事处'),
	(62, 09, 02, 007, N'玉管局生活基地街道办事处'),
	(62, 09, 02, 100, N'西洞镇'),
	(62, 09, 02, 101, N'清水镇'),
	(62, 09, 02, 102, N'总寨镇'),
	(62, 09, 02, 103, N'金佛寺镇'),
	(62, 09, 02, 104, N'上坝镇'),
	(62, 09, 02, 105, N'三墩镇'),
	(62, 09, 02, 106, N'银达镇'),
	(62, 09, 02, 107, N'西峰镇'),
	(62, 09, 02, 108, N'泉湖镇'),
	(62, 09, 02, 109, N'果园镇'),
	(62, 09, 02, 205, N'下河清乡'),
	(62, 09, 02, 207, N'黄泥堡乡'),
	(62, 09, 02, 208, N'铧尖乡'),
	(62, 09, 02, 209, N'东洞乡'),
	(62, 09, 02, 211, N'丰乐乡');

/* 甘肃省 酒泉市 金塔县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 09, 21, 100, N'中东镇'),
	(62, 09, 21, 101, N'鼎新镇'),
	(62, 09, 21, 102, N'金塔镇'),
	(62, 09, 21, 103, N'东坝镇'),
	(62, 09, 21, 105, N'航天镇'),
	(62, 09, 21, 203, N'大庄子乡'),
	(62, 09, 21, 204, N'古城乡'),
	(62, 09, 21, 205, N'西坝乡'),
	(62, 09, 21, 209, N'羊井子湾乡');

/* 甘肃省 酒泉市 瓜州县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 09, 22, 100, N'渊泉镇'),
	(62, 09, 22, 101, N'柳园镇'),
	(62, 09, 22, 102, N'三道沟镇'),
	(62, 09, 22, 103, N'南岔镇'),
	(62, 09, 22, 104, N'锁阳城镇'),
	(62, 09, 22, 200, N'河东乡'),
	(62, 09, 22, 201, N'布隆吉乡'),
	(62, 09, 22, 203, N'西湖乡'),
	(62, 09, 22, 204, N'瓜州乡'),
	(62, 09, 22, 209, N'腰站子东乡族乡'),
	(62, 09, 22, 212, N'七墩回族东乡族乡'),
	(62, 09, 22, 213, N'双塔乡'),
	(62, 09, 22, 214, N'广至藏族乡'),
	(62, 09, 22, 215, N'沙河回族乡'),
	(62, 09, 22, 216, N'梁湖乡');

/* 甘肃省 酒泉市 肃北蒙古族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 09, 23, 100, N'党城湾镇'),
	(62, 09, 23, 101, N'马鬃山镇'),
	(62, 09, 23, 201, N'盐池湾乡'),
	(62, 09, 23, 202, N'石包城乡');

/* 甘肃省 酒泉市 阿克塞哈萨克族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 09, 24, 100, N'红柳湾镇'),
	(62, 09, 24, 200, N'阿克旗乡'),
	(62, 09, 24, 203, N'阿勒腾乡');

/* 甘肃省 酒泉市 玉门市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 09, 81, 002, N'新市区街道办事处'),
	(62, 09, 81, 101, N'玉门镇'),
	(62, 09, 81, 102, N'赤金镇'),
	(62, 09, 81, 103, N'花海镇'),
	(62, 09, 81, 104, N'老君庙镇'),
	(62, 09, 81, 105, N'黄闸湾镇'),
	(62, 09, 81, 106, N'下西号镇'),
	(62, 09, 81, 107, N'柳河镇'),
	(62, 09, 81, 203, N'昌马乡'),
	(62, 09, 81, 206, N'小金湾东乡族乡'),
	(62, 09, 81, 207, N'柳湖乡'),
	(62, 09, 81, 208, N'独山子东乡族乡'),
	(62, 09, 81, 209, N'六墩乡');

/* 甘肃省 酒泉市 敦煌市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 09, 82, 100, N'七里镇'),
	(62, 09, 82, 101, N'沙州镇'),
	(62, 09, 82, 102, N'肃州镇'),
	(62, 09, 82, 103, N'莫高镇'),
	(62, 09, 82, 104, N'转渠口镇'),
	(62, 09, 82, 105, N'阳关镇'),
	(62, 09, 82, 106, N'月牙泉镇'),
	(62, 09, 82, 107, N'郭家堡镇'),
	(62, 09, 82, 108, N'黄渠镇');

/* 甘肃省 庆阳市 西峰区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 10, 02, 001, N'北街办事处'),
	(62, 10, 02, 002, N'南街办事处'),
	(62, 10, 02, 003, N'西街办事处'),
	(62, 10, 02, 100, N'肖金镇'),
	(62, 10, 02, 101, N'董志镇'),
	(62, 10, 02, 102, N'后官寨镇'),
	(62, 10, 02, 103, N'彭原镇'),
	(62, 10, 02, 104, N'温泉镇'),
	(62, 10, 02, 203, N'什社乡'),
	(62, 10, 02, 204, N'显胜乡');

/* 甘肃省 庆阳市 庆城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 10, 21, 100, N'庆城镇'),
	(62, 10, 21, 101, N'驿马镇'),
	(62, 10, 21, 102, N'三十里铺镇'),
	(62, 10, 21, 103, N'马岭镇'),
	(62, 10, 21, 104, N'玄马镇'),
	(62, 10, 21, 200, N'赤城乡'),
	(62, 10, 21, 201, N'白马铺乡'),
	(62, 10, 21, 202, N'桐川乡'),
	(62, 10, 21, 203, N'太白梁乡'),
	(62, 10, 21, 204, N'土桥乡'),
	(62, 10, 21, 205, N'蔡口集乡'),
	(62, 10, 21, 206, N'高楼乡'),
	(62, 10, 21, 207, N'南庄乡'),
	(62, 10, 21, 208, N'翟家河乡'),
	(62, 10, 21, 209, N'蔡家庙乡');

/* 甘肃省 庆阳市 环县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 10, 22, 100, N'环城镇'),
	(62, 10, 22, 101, N'曲子镇'),
	(62, 10, 22, 102, N'甜水镇'),
	(62, 10, 22, 103, N'木钵镇'),
	(62, 10, 22, 104, N'洪德镇'),
	(62, 10, 22, 200, N'天池乡'),
	(62, 10, 22, 201, N'演武乡'),
	(62, 10, 22, 202, N'合道乡'),
	(62, 10, 22, 203, N'樊家川乡'),
	(62, 10, 22, 204, N'八珠乡'),
	(62, 10, 22, 206, N'耿湾乡'),
	(62, 10, 22, 207, N'秦团庄乡'),
	(62, 10, 22, 208, N'山城乡'),
	(62, 10, 22, 209, N'南湫乡'),
	(62, 10, 22, 210, N'罗山川乡'),
	(62, 10, 22, 211, N'虎洞乡'),
	(62, 10, 22, 212, N'小南沟乡'),
	(62, 10, 22, 213, N'车道乡'),
	(62, 10, 22, 214, N'毛井乡'),
	(62, 10, 22, 215, N'芦家湾乡');

/* 甘肃省 庆阳市 华池县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 10, 23, 100, N'悦乐镇'),
	(62, 10, 23, 101, N'柔远镇'),
	(62, 10, 23, 102, N'元城镇'),
	(62, 10, 23, 103, N'南梁镇'),
	(62, 10, 23, 104, N'城壕镇'),
	(62, 10, 23, 105, N'五蛟镇'),
	(62, 10, 23, 202, N'上里塬乡'),
	(62, 10, 23, 203, N'王咀子乡'),
	(62, 10, 23, 204, N'白马乡'),
	(62, 10, 23, 205, N'怀安乡'),
	(62, 10, 23, 206, N'乔川乡'),
	(62, 10, 23, 207, N'乔河乡'),
	(62, 10, 23, 208, N'山庄乡'),
	(62, 10, 23, 210, N'林镇乡'),
	(62, 10, 23, 211, N'紫坊畔乡');

/* 甘肃省 庆阳市 合水县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 10, 24, 100, N'西华池镇'),
	(62, 10, 24, 101, N'老城镇'),
	(62, 10, 24, 102, N'太白镇'),
	(62, 10, 24, 103, N'板桥镇'),
	(62, 10, 24, 104, N'何家畔镇'),
	(62, 10, 24, 200, N'吉岘乡'),
	(62, 10, 24, 201, N'肖咀乡'),
	(62, 10, 24, 202, N'段家集乡'),
	(62, 10, 24, 203, N'固城乡'),
	(62, 10, 24, 204, N'太莪乡'),
	(62, 10, 24, 205, N'店子乡'),
	(62, 10, 24, 208, N'蒿咀铺乡');

/* 甘肃省 庆阳市 正宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 10, 25, 100, N'山河镇'),
	(62, 10, 25, 101, N'榆林子镇'),
	(62, 10, 25, 102, N'宫河镇'),
	(62, 10, 25, 103, N'永和镇'),
	(62, 10, 25, 104, N'永正镇'),
	(62, 10, 25, 105, N'周家镇'),
	(62, 10, 25, 106, N'湫头镇'),
	(62, 10, 25, 200, N'西坡乡'),
	(62, 10, 25, 204, N'五顷原乡'),
	(62, 10, 25, 205, N'三嘉乡');

/* 甘肃省 庆阳市 宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 10, 26, 100, N'新宁镇'),
	(62, 10, 26, 101, N'平子镇'),
	(62, 10, 26, 102, N'早胜镇'),
	(62, 10, 26, 103, N'长庆桥镇'),
	(62, 10, 26, 104, N'和盛镇'),
	(62, 10, 26, 105, N'湘乐镇'),
	(62, 10, 26, 106, N'新庄镇'),
	(62, 10, 26, 107, N'盘克镇'),
	(62, 10, 26, 108, N'中村镇'),
	(62, 10, 26, 109, N'焦村镇'),
	(62, 10, 26, 200, N'米桥乡'),
	(62, 10, 26, 201, N'良平乡'),
	(62, 10, 26, 203, N'太昌乡'),
	(62, 10, 26, 205, N'南义乡'),
	(62, 10, 26, 206, N'瓦斜乡'),
	(62, 10, 26, 207, N'金村乡'),
	(62, 10, 26, 208, N'九岘乡'),
	(62, 10, 26, 209, N'春荣乡');

/* 甘肃省 庆阳市 镇原县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 10, 27, 100, N'城关镇'),
	(62, 10, 27, 101, N'屯字镇'),
	(62, 10, 27, 102, N'孟坝镇'),
	(62, 10, 27, 103, N'三岔镇'),
	(62, 10, 27, 104, N'平泉镇'),
	(62, 10, 27, 105, N'开边镇'),
	(62, 10, 27, 106, N'太平镇'),
	(62, 10, 27, 107, N'临泾镇'),
	(62, 10, 27, 201, N'南川乡'),
	(62, 10, 27, 202, N'上肖乡'),
	(62, 10, 27, 203, N'新集乡'),
	(62, 10, 27, 204, N'方山乡'),
	(62, 10, 27, 205, N'殷家城乡'),
	(62, 10, 27, 206, N'马渠乡'),
	(62, 10, 27, 207, N'庙渠乡'),
	(62, 10, 27, 208, N'武沟乡'),
	(62, 10, 27, 209, N'郭原乡'),
	(62, 10, 27, 210, N'中原乡'),
	(62, 10, 27, 211, N'新城乡');

/* 甘肃省 定西市 安定区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 11, 02, 001, N'中华路街道办事处'),
	(62, 11, 02, 002, N'永定路街道办事处'),
	(62, 11, 02, 101, N'凤翔镇'),
	(62, 11, 02, 102, N'内官镇'),
	(62, 11, 02, 103, N'馋口镇'),
	(62, 11, 02, 104, N'称钩驿镇'),
	(62, 11, 02, 105, N'鲁家沟镇'),
	(62, 11, 02, 106, N'西巩驿镇'),
	(62, 11, 02, 107, N'宁远镇'),
	(62, 11, 02, 108, N'李家堡镇'),
	(62, 11, 02, 109, N'团结镇'),
	(62, 11, 02, 110, N'香泉镇'),
	(62, 11, 02, 111, N'符家川镇'),
	(62, 11, 02, 112, N'葛家岔镇'),
	(62, 11, 02, 204, N'白碌乡'),
	(62, 11, 02, 207, N'石峡湾乡'),
	(62, 11, 02, 208, N'新集乡'),
	(62, 11, 02, 209, N'青岚山乡'),
	(62, 11, 02, 210, N'高峰乡'),
	(62, 11, 02, 211, N'石泉乡'),
	(62, 11, 02, 214, N'杏园乡');

/* 甘肃省 定西市 通渭县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 11, 21, 100, N'平襄镇'),
	(62, 11, 21, 101, N'马营镇'),
	(62, 11, 21, 102, N'鸡川镇'),
	(62, 11, 21, 103, N'榜罗镇'),
	(62, 11, 21, 104, N'常家河镇'),
	(62, 11, 21, 105, N'义岗川镇'),
	(62, 11, 21, 200, N'陇阳乡'),
	(62, 11, 21, 201, N'陇山乡'),
	(62, 11, 21, 202, N'陇川乡'),
	(62, 11, 21, 203, N'新景乡'),
	(62, 11, 21, 204, N'碧玉乡'),
	(62, 11, 21, 206, N'襄南乡'),
	(62, 11, 21, 207, N'李家店乡'),
	(62, 11, 21, 210, N'什川乡'),
	(62, 11, 21, 212, N'第三铺乡'),
	(62, 11, 21, 214, N'华家岭乡'),
	(62, 11, 21, 215, N'寺子川乡'),
	(62, 11, 21, 216, N'北城铺乡');

/* 甘肃省 定西市 陇西县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 11, 22, 100, N'巩昌镇'),
	(62, 11, 22, 101, N'文峰镇'),
	(62, 11, 22, 102, N'首阳镇'),
	(62, 11, 22, 103, N'菜子镇'),
	(62, 11, 22, 104, N'福星镇'),
	(62, 11, 22, 105, N'通安驿镇'),
	(62, 11, 22, 106, N'云田镇'),
	(62, 11, 22, 107, N'碧岩镇'),
	(62, 11, 22, 108, N'马河镇'),
	(62, 11, 22, 200, N'渭阳乡'),
	(62, 11, 22, 201, N'宏伟乡'),
	(62, 11, 22, 202, N'和平乡'),
	(62, 11, 22, 203, N'柯寨乡'),
	(62, 11, 22, 204, N'双泉乡'),
	(62, 11, 22, 205, N'德兴乡'),
	(62, 11, 22, 206, N'永吉乡'),
	(62, 11, 22, 207, N'权家湾乡');

/* 甘肃省 定西市 渭源县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 11, 23, 100, N'清源镇'),
	(62, 11, 23, 101, N'莲峰镇'),
	(62, 11, 23, 102, N'会川镇'),
	(62, 11, 23, 103, N'五竹镇'),
	(62, 11, 23, 104, N'路园镇'),
	(62, 11, 23, 105, N'北寨镇'),
	(62, 11, 23, 106, N'新寨镇'),
	(62, 11, 23, 107, N'麻家集镇'),
	(62, 11, 23, 200, N'锹峪乡'),
	(62, 11, 23, 203, N'大安乡'),
	(62, 11, 23, 204, N'秦祁乡'),
	(62, 11, 23, 206, N'庆坪乡'),
	(62, 11, 23, 207, N'祁家庙乡'),
	(62, 11, 23, 208, N'上湾乡'),
	(62, 11, 23, 209, N'峡城乡'),
	(62, 11, 23, 210, N'田家河乡');

/* 甘肃省 定西市 临洮县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 11, 24, 100, N'洮阳镇'),
	(62, 11, 24, 101, N'八里铺镇'),
	(62, 11, 24, 102, N'新添镇'),
	(62, 11, 24, 103, N'辛店镇'),
	(62, 11, 24, 104, N'太石镇'),
	(62, 11, 24, 105, N'中铺镇'),
	(62, 11, 24, 106, N'峡口镇'),
	(62, 11, 24, 107, N'龙门镇'),
	(62, 11, 24, 108, N'窑店镇'),
	(62, 11, 24, 109, N'玉井镇'),
	(62, 11, 24, 110, N'衙下集镇'),
	(62, 11, 24, 111, N'南屏镇'),
	(62, 11, 24, 200, N'红旗乡'),
	(62, 11, 24, 201, N'上营乡'),
	(62, 11, 24, 202, N'康家集乡'),
	(62, 11, 24, 203, N'站滩乡'),
	(62, 11, 24, 204, N'漫洼乡'),
	(62, 11, 24, 205, N'连儿湾乡');

/* 甘肃省 定西市 漳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 11, 25, 100, N'武阳镇'),
	(62, 11, 25, 101, N'三岔镇'),
	(62, 11, 25, 102, N'新寺镇'),
	(62, 11, 25, 103, N'金钟镇'),
	(62, 11, 25, 201, N'盐井乡'),
	(62, 11, 25, 202, N'殪虎桥乡'),
	(62, 11, 25, 203, N'大草滩乡'),
	(62, 11, 25, 204, N'马泉乡'),
	(62, 11, 25, 205, N'四族乡'),
	(62, 11, 25, 206, N'石川乡'),
	(62, 11, 25, 207, N'草滩乡'),
	(62, 11, 25, 208, N'武当乡'),
	(62, 11, 25, 209, N'东泉乡');

/* 甘肃省 定西市 岷县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 11, 26, 100, N'岷阳镇'),
	(62, 11, 26, 101, N'蒲麻镇'),
	(62, 11, 26, 102, N'西寨镇'),
	(62, 11, 26, 103, N'梅川镇'),
	(62, 11, 26, 104, N'西江镇'),
	(62, 11, 26, 105, N'闾井镇'),
	(62, 11, 26, 106, N'十里镇'),
	(62, 11, 26, 107, N'茶埠镇'),
	(62, 11, 26, 108, N'中寨镇'),
	(62, 11, 26, 200, N'清水乡'),
	(62, 11, 26, 201, N'马坞乡'),
	(62, 11, 26, 202, N'寺沟乡'),
	(62, 11, 26, 203, N'麻子川乡'),
	(62, 11, 26, 204, N'秦许乡'),
	(62, 11, 26, 205, N'禾驮乡'),
	(62, 11, 26, 206, N'维新乡'),
	(62, 11, 26, 207, N'申都乡'),
	(62, 11, 26, 208, N'锁龙乡');

/* 甘肃省 陇南市 武都区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 12, 02, 001, N'钟楼滩街道办事处'),
	(62, 12, 02, 002, N'吉石坝街道办事处'),
	(62, 12, 02, 003, N'江北街道办事处'),
	(62, 12, 02, 004, N'江南街道办事处'),
	(62, 12, 02, 100, N'城关镇'),
	(62, 12, 02, 101, N'安化镇'),
	(62, 12, 02, 102, N'东江镇'),
	(62, 12, 02, 103, N'两水镇'),
	(62, 12, 02, 104, N'汉王镇'),
	(62, 12, 02, 105, N'洛塘镇'),
	(62, 12, 02, 106, N'角弓镇'),
	(62, 12, 02, 107, N'马街镇'),
	(62, 12, 02, 108, N'三河镇'),
	(62, 12, 02, 109, N'甘泉镇'),
	(62, 12, 02, 110, N'鱼龙镇'),
	(62, 12, 02, 111, N'琵琶镇'),
	(62, 12, 02, 112, N'外纳镇'),
	(62, 12, 02, 113, N'马营镇'),
	(62, 12, 02, 114, N'柏林镇'),
	(62, 12, 02, 115, N'姚寨镇'),
	(62, 12, 02, 201, N'坪垭藏族乡'),
	(62, 12, 02, 203, N'蒲池乡'),
	(62, 12, 02, 204, N'石门乡'),
	(62, 12, 02, 207, N'汉林乡'),
	(62, 12, 02, 211, N'池坝乡'),
	(62, 12, 02, 213, N'佛崖乡'),
	(62, 12, 02, 215, N'黄坪乡'),
	(62, 12, 02, 217, N'隆兴乡'),
	(62, 12, 02, 218, N'龙坝乡'),
	(62, 12, 02, 219, N'龙凤乡'),
	(62, 12, 02, 220, N'桔柑乡'),
	(62, 12, 02, 221, N'磨坝藏族乡'),
	(62, 12, 02, 225, N'玉皇乡'),
	(62, 12, 02, 226, N'郭河乡'),
	(62, 12, 02, 229, N'枫相乡'),
	(62, 12, 02, 230, N'三仓乡'),
	(62, 12, 02, 231, N'五库乡'),
	(62, 12, 02, 233, N'月照乡'),
	(62, 12, 02, 235, N'五马乡'),
	(62, 12, 02, 237, N'裕河乡');

/* 甘肃省 陇南市 成县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 12, 21, 100, N'城关镇'),
	(62, 12, 21, 101, N'黄渚镇'),
	(62, 12, 21, 102, N'红川镇'),
	(62, 12, 21, 103, N'小川镇'),
	(62, 12, 21, 104, N'纸坊镇'),
	(62, 12, 21, 105, N'抛沙镇'),
	(62, 12, 21, 107, N'店村镇'),
	(62, 12, 21, 108, N'王磨镇'),
	(62, 12, 21, 109, N'陈院镇'),
	(62, 12, 21, 110, N'沙坝镇'),
	(62, 12, 21, 111, N'黄陈镇'),
	(62, 12, 21, 112, N'鸡峰镇'),
	(62, 12, 21, 203, N'宋坪乡'),
	(62, 12, 21, 206, N'二郎乡'),
	(62, 12, 21, 209, N'苏元乡'),
	(62, 12, 21, 210, N'索池乡'),
	(62, 12, 21, 213, N'镡河乡');

/* 甘肃省 陇南市 文县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 12, 22, 100, N'城关镇'),
	(62, 12, 22, 101, N'碧口镇'),
	(62, 12, 22, 102, N'尚德镇'),
	(62, 12, 22, 103, N'中寨镇'),
	(62, 12, 22, 104, N'临江镇'),
	(62, 12, 22, 105, N'桥头镇'),
	(62, 12, 22, 200, N'铁楼藏族乡'),
	(62, 12, 22, 203, N'丹堡乡'),
	(62, 12, 22, 205, N'刘家坪乡'),
	(62, 12, 22, 206, N'玉垒乡'),
	(62, 12, 22, 207, N'范坝乡'),
	(62, 12, 22, 210, N'中庙乡'),
	(62, 12, 22, 211, N'口头坝乡'),
	(62, 12, 22, 212, N'尖山乡'),
	(62, 12, 22, 214, N'黎坪乡'),
	(62, 12, 22, 215, N'舍书乡'),
	(62, 12, 22, 216, N'天池乡'),
	(62, 12, 22, 218, N'堡子坝乡'),
	(62, 12, 22, 219, N'石坊乡'),
	(62, 12, 22, 220, N'石鸡坝乡');

/* 甘肃省 陇南市 宕昌县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 12, 23, 100, N'城关镇'),
	(62, 12, 23, 101, N'哈达铺镇'),
	(62, 12, 23, 102, N'理川镇'),
	(62, 12, 23, 103, N'南阳镇'),
	(62, 12, 23, 104, N'官亭镇'),
	(62, 12, 23, 105, N'沙湾镇'),
	(62, 12, 23, 200, N'阿坞乡'),
	(62, 12, 23, 204, N'南河乡'),
	(62, 12, 23, 205, N'八力乡'),
	(62, 12, 23, 206, N'木耳乡'),
	(62, 12, 23, 207, N'庞家乡'),
	(62, 12, 23, 209, N'何家堡乡'),
	(62, 12, 23, 211, N'贾河乡'),
	(62, 12, 23, 212, N'将台乡'),
	(62, 12, 23, 213, N'车拉乡'),
	(62, 12, 23, 214, N'新城子藏族乡'),
	(62, 12, 23, 215, N'临江乡'),
	(62, 12, 23, 216, N'好梯乡'),
	(62, 12, 23, 217, N'韩院乡'),
	(62, 12, 23, 218, N'竹院乡'),
	(62, 12, 23, 219, N'兴化乡'),
	(62, 12, 23, 220, N'甘江头乡'),
	(62, 12, 23, 223, N'新寨乡'),
	(62, 12, 23, 224, N'狮子乡'),
	(62, 12, 23, 225, N'两河口乡');

/* 甘肃省 陇南市 康县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 12, 24, 100, N'城关镇'),
	(62, 12, 24, 101, N'平洛镇'),
	(62, 12, 24, 102, N'大堡镇'),
	(62, 12, 24, 103, N'岸门口镇'),
	(62, 12, 24, 104, N'两河镇'),
	(62, 12, 24, 105, N'长坝镇'),
	(62, 12, 24, 106, N'云台镇'),
	(62, 12, 24, 107, N'阳坝镇'),
	(62, 12, 24, 108, N'王坝镇'),
	(62, 12, 24, 109, N'碾坝镇'),
	(62, 12, 24, 110, N'豆坝镇'),
	(62, 12, 24, 111, N'望关镇'),
	(62, 12, 24, 112, N'大南峪镇'),
	(62, 12, 24, 113, N'周家坝镇'),
	(62, 12, 24, 202, N'寺台乡'),
	(62, 12, 24, 204, N'迷坝乡'),
	(62, 12, 24, 209, N'店子乡'),
	(62, 12, 24, 212, N'白杨乡'),
	(62, 12, 24, 214, N'太石乡'),
	(62, 12, 24, 215, N'铜钱乡'),
	(62, 12, 24, 218, N'三河坝乡');

/* 甘肃省 陇南市 西和县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 12, 25, 100, N'汉源镇'),
	(62, 12, 25, 101, N'长道镇'),
	(62, 12, 25, 102, N'何坝镇'),
	(62, 12, 25, 103, N'姜席镇'),
	(62, 12, 25, 104, N'石峡镇'),
	(62, 12, 25, 105, N'洛峪镇'),
	(62, 12, 25, 106, N'西峪镇'),
	(62, 12, 25, 107, N'马元镇'),
	(62, 12, 25, 108, N'大桥镇'),
	(62, 12, 25, 201, N'石堡乡'),
	(62, 12, 25, 203, N'苏河乡'),
	(62, 12, 25, 204, N'卢河乡'),
	(62, 12, 25, 205, N'兴隆乡'),
	(62, 12, 25, 206, N'稍峪乡'),
	(62, 12, 25, 208, N'晒经乡'),
	(62, 12, 25, 211, N'十里乡'),
	(62, 12, 25, 217, N'蒿林乡'),
	(62, 12, 25, 218, N'太石河乡'),
	(62, 12, 25, 220, N'六巷乡'),
	(62, 12, 25, 221, N'西高山乡');

/* 甘肃省 陇南市 礼县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 12, 26, 100, N'城关镇'),
	(62, 12, 26, 101, N'盐官镇'),
	(62, 12, 26, 102, N'石桥镇'),
	(62, 12, 26, 103, N'白河镇'),
	(62, 12, 26, 104, N'宽川镇'),
	(62, 12, 26, 105, N'永兴镇'),
	(62, 12, 26, 106, N'祁山镇'),
	(62, 12, 26, 107, N'红河镇'),
	(62, 12, 26, 108, N'永坪镇'),
	(62, 12, 26, 109, N'中坝镇'),
	(62, 12, 26, 110, N'罗坝镇'),
	(62, 12, 26, 111, N'雷坝镇'),
	(62, 12, 26, 203, N'马河乡'),
	(62, 12, 26, 209, N'固城乡'),
	(62, 12, 26, 210, N'崖城乡'),
	(62, 12, 26, 212, N'湫山乡'),
	(62, 12, 26, 214, N'洮坪乡'),
	(62, 12, 26, 215, N'上坪乡'),
	(62, 12, 26, 218, N'江口乡'),
	(62, 12, 26, 219, N'雷王乡'),
	(62, 12, 26, 220, N'龙林乡'),
	(62, 12, 26, 222, N'白关乡'),
	(62, 12, 26, 224, N'沙金乡'),
	(62, 12, 26, 227, N'桥头乡'),
	(62, 12, 26, 228, N'草坪乡'),
	(62, 12, 26, 230, N'王坝乡'),
	(62, 12, 26, 231, N'肖良乡'),
	(62, 12, 26, 232, N'三峪乡'),
	(62, 12, 26, 233, N'滩坪乡');

/* 甘肃省 陇南市 徽县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 12, 27, 100, N'城关镇'),
	(62, 12, 27, 101, N'伏家镇'),
	(62, 12, 27, 102, N'江洛镇'),
	(62, 12, 27, 103, N'泥阳镇'),
	(62, 12, 27, 104, N'柳林镇'),
	(62, 12, 27, 105, N'嘉陵镇'),
	(62, 12, 27, 106, N'永宁镇'),
	(62, 12, 27, 201, N'银杏树乡'),
	(62, 12, 27, 202, N'水阳乡'),
	(62, 12, 27, 203, N'栗川乡'),
	(62, 12, 27, 205, N'麻沿河乡'),
	(62, 12, 27, 206, N'高桥乡'),
	(62, 12, 27, 208, N'榆树乡'),
	(62, 12, 27, 210, N'大河店乡'),
	(62, 12, 27, 211, N'虞关乡');

/* 甘肃省 陇南市 两当县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 12, 28, 100, N'城关镇'),
	(62, 12, 28, 101, N'站儿巷镇'),
	(62, 12, 28, 102, N'西坡镇'),
	(62, 12, 28, 200, N'杨店乡'),
	(62, 12, 28, 201, N'左家乡'),
	(62, 12, 28, 202, N'显龙乡'),
	(62, 12, 28, 203, N'鱼池乡'),
	(62, 12, 28, 204, N'兴化乡'),
	(62, 12, 28, 207, N'张家乡'),
	(62, 12, 28, 209, N'云屏乡'),
	(62, 12, 28, 210, N'泰山乡'),
	(62, 12, 28, 212, N'金洞乡');

/* 甘肃省 临夏回族自治州 临夏市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 29, 01, 001, N'城南街道'),
	(62, 29, 01, 002, N'城北街道'),
	(62, 29, 01, 003, N'东关街道'),
	(62, 29, 01, 004, N'西关街道'),
	(62, 29, 01, 005, N'八坊街道'),
	(62, 29, 01, 006, N'红园街道'),
	(62, 29, 01, 100, N'城郊镇'),
	(62, 29, 01, 101, N'枹罕镇'),
	(62, 29, 01, 102, N'南龙镇'),
	(62, 29, 01, 103, N'折桥镇');

/* 甘肃省 临夏回族自治州 临夏县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 29, 21, 100, N'韩集镇'),
	(62, 29, 21, 101, N'土桥镇'),
	(62, 29, 21, 102, N'马集镇'),
	(62, 29, 21, 103, N'莲花镇'),
	(62, 29, 21, 104, N'新集镇'),
	(62, 29, 21, 105, N'尹集镇'),
	(62, 29, 21, 200, N'营滩乡'),
	(62, 29, 21, 201, N'掌子沟乡'),
	(62, 29, 21, 202, N'麻尼寺沟乡'),
	(62, 29, 21, 204, N'漠泥沟乡'),
	(62, 29, 21, 205, N'刁祁乡'),
	(62, 29, 21, 208, N'漫路乡'),
	(62, 29, 21, 209, N'榆林乡'),
	(62, 29, 21, 210, N'井沟乡'),
	(62, 29, 21, 211, N'北塬乡'),
	(62, 29, 21, 213, N'坡头乡'),
	(62, 29, 21, 214, N'桥寺乡'),
	(62, 29, 21, 215, N'先锋乡'),
	(62, 29, 21, 216, N'河西乡'),
	(62, 29, 21, 217, N'安家坡乡'),
	(62, 29, 21, 218, N'南塬乡'),
	(62, 29, 21, 220, N'红台乡'),
	(62, 29, 21, 222, N'黄泥湾乡'),
	(62, 29, 21, 223, N'路盘乡'),
	(62, 29, 21, 224, N'民主乡');

/* 甘肃省 临夏回族自治州 康乐县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 29, 22, 100, N'附城镇'),
	(62, 29, 22, 101, N'苏集镇'),
	(62, 29, 22, 102, N'胭脂镇'),
	(62, 29, 22, 103, N'景古镇'),
	(62, 29, 22, 104, N'莲麓镇'),
	(62, 29, 22, 200, N'康丰乡'),
	(62, 29, 22, 201, N'虎关乡'),
	(62, 29, 22, 202, N'流川乡'),
	(62, 29, 22, 203, N'白王乡'),
	(62, 29, 22, 205, N'八松乡'),
	(62, 29, 22, 206, N'鸣鹿乡'),
	(62, 29, 22, 207, N'八丹乡'),
	(62, 29, 22, 208, N'上湾乡'),
	(62, 29, 22, 211, N'草滩乡'),
	(62, 29, 22, 212, N'五户乡');

/* 甘肃省 临夏回族自治州 永靖县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 29, 23, 100, N'刘家峡镇'),
	(62, 29, 23, 101, N'盐锅峡镇'),
	(62, 29, 23, 102, N'太极镇'),
	(62, 29, 23, 103, N'西河镇'),
	(62, 29, 23, 104, N'三塬镇'),
	(62, 29, 23, 105, N'岘塬镇'),
	(62, 29, 23, 106, N'陈井镇'),
	(62, 29, 23, 107, N'川城镇'),
	(62, 29, 23, 108, N'王台镇'),
	(62, 29, 23, 109, N'红泉镇'),
	(62, 29, 23, 200, N'关山乡'),
	(62, 29, 23, 201, N'徐顶乡'),
	(62, 29, 23, 202, N'三条岘乡'),
	(62, 29, 23, 203, N'坪沟乡'),
	(62, 29, 23, 206, N'新寺乡'),
	(62, 29, 23, 207, N'小岭乡'),
	(62, 29, 23, 208, N'杨塔乡');

/* 甘肃省 临夏回族自治州 广河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 29, 24, 100, N'城关镇'),
	(62, 29, 24, 101, N'三甲集镇'),
	(62, 29, 24, 102, N'祁家集镇'),
	(62, 29, 24, 103, N'庄禾集镇'),
	(62, 29, 24, 104, N'买家巷镇'),
	(62, 29, 24, 105, N'齐家镇'),
	(62, 29, 24, 202, N'水泉乡'),
	(62, 29, 24, 203, N'官坊乡'),
	(62, 29, 24, 204, N'阿力麻土东乡族乡');

/* 甘肃省 临夏回族自治州 和政县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 29, 25, 100, N'城关镇'),
	(62, 29, 25, 101, N'三合镇'),
	(62, 29, 25, 102, N'三十里铺镇'),
	(62, 29, 25, 103, N'马家堡镇'),
	(62, 29, 25, 104, N'买家集镇'),
	(62, 29, 25, 105, N'松鸣镇'),
	(62, 29, 25, 200, N'梁家寺乡'),
	(62, 29, 25, 201, N'陈家集乡'),
	(62, 29, 25, 202, N'罗家集乡'),
	(62, 29, 25, 203, N'卜家庄乡'),
	(62, 29, 25, 204, N'新营乡'),
	(62, 29, 25, 205, N'新庄乡'),
	(62, 29, 25, 207, N'达浪乡');

/* 甘肃省 临夏回族自治州 东乡族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 29, 26, 100, N'锁南镇'),
	(62, 29, 26, 101, N'达板镇'),
	(62, 29, 26, 102, N'河滩镇'),
	(62, 29, 26, 103, N'那勒寺镇'),
	(62, 29, 26, 104, N'唐汪镇'),
	(62, 29, 26, 200, N'春台乡'),
	(62, 29, 26, 201, N'柳树乡'),
	(62, 29, 26, 202, N'东塬乡'),
	(62, 29, 26, 204, N'坪庄乡'),
	(62, 29, 26, 205, N'百和乡'),
	(62, 29, 26, 206, N'关卜乡'),
	(62, 29, 26, 208, N'赵家乡'),
	(62, 29, 26, 209, N'五家乡'),
	(62, 29, 26, 210, N'果园乡'),
	(62, 29, 26, 212, N'沿岭乡'),
	(62, 29, 26, 213, N'汪集乡'),
	(62, 29, 26, 214, N'风山乡'),
	(62, 29, 26, 215, N'车家湾乡'),
	(62, 29, 26, 216, N'高山乡'),
	(62, 29, 26, 219, N'大树乡'),
	(62, 29, 26, 220, N'北岭乡'),
	(62, 29, 26, 221, N'龙泉乡'),
	(62, 29, 26, 222, N'考勒乡'),
	(62, 29, 26, 223, N'董岭乡');

/* 甘肃省 临夏回族自治州 积石山保安族东乡族撒拉族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 29, 27, 100, N'吹麻滩镇'),
	(62, 29, 27, 101, N'大河家镇'),
	(62, 29, 27, 102, N'居集镇'),
	(62, 29, 27, 103, N'癿藏镇'),
	(62, 29, 27, 200, N'刘集乡'),
	(62, 29, 27, 201, N'石塬乡'),
	(62, 29, 27, 202, N'柳沟乡'),
	(62, 29, 27, 203, N'关家川乡'),
	(62, 29, 27, 204, N'胡林家乡'),
	(62, 29, 27, 205, N'安集乡'),
	(62, 29, 27, 206, N'寨子沟乡'),
	(62, 29, 27, 207, N'郭干乡'),
	(62, 29, 27, 208, N'徐扈家乡'),
	(62, 29, 27, 209, N'中咀岭乡'),
	(62, 29, 27, 210, N'小关乡'),
	(62, 29, 27, 211, N'铺川乡'),
	(62, 29, 27, 212, N'银川乡');

/* 甘肃省 甘南藏族自治州 合作市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 30, 01, 001, N'当周街道办事处'),
	(62, 30, 01, 002, N'伊合昂街道办事处'),
	(62, 30, 01, 003, N'坚木克尔街道办事处'),
	(62, 30, 01, 004, N'通钦街道办事处'),
	(62, 30, 01, 200, N'卡加曼乡'),
	(62, 30, 01, 201, N'卡加道乡'),
	(62, 30, 01, 202, N'佐盖多玛乡'),
	(62, 30, 01, 203, N'佐盖曼玛乡'),
	(62, 30, 01, 204, N'勒秀乡'),
	(62, 30, 01, 205, N'那吾乡');

/* 甘肃省 甘南藏族自治州 临潭县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 30, 21, 100, N'城关镇'),
	(62, 30, 21, 101, N'新城镇'),
	(62, 30, 21, 102, N'冶力关镇'),
	(62, 30, 21, 200, N'初布乡'),
	(62, 30, 21, 201, N'古战回族乡'),
	(62, 30, 21, 202, N'卓洛回族乡'),
	(62, 30, 21, 203, N'长川回族乡'),
	(62, 30, 21, 204, N'羊永乡'),
	(62, 30, 21, 205, N'流顺乡'),
	(62, 30, 21, 206, N'店子乡'),
	(62, 30, 21, 207, N'洮滨乡'),
	(62, 30, 21, 208, N'三岔乡'),
	(62, 30, 21, 209, N'王旗乡'),
	(62, 30, 21, 210, N'石门乡'),
	(62, 30, 21, 211, N'羊沙乡'),
	(62, 30, 21, 212, N'八角乡');

/* 甘肃省 甘南藏族自治州 卓尼县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 30, 22, 100, N'柳林镇'),
	(62, 30, 22, 101, N'木耳镇'),
	(62, 30, 22, 102, N'扎古录镇'),
	(62, 30, 22, 200, N'纳浪乡'),
	(62, 30, 22, 201, N'喀尔钦乡'),
	(62, 30, 22, 202, N'刀告乡'),
	(62, 30, 22, 203, N'尼巴乡'),
	(62, 30, 22, 204, N'完冒乡'),
	(62, 30, 22, 205, N'阿子塘乡'),
	(62, 30, 22, 206, N'申藏乡'),
	(62, 30, 22, 207, N'恰盖乡'),
	(62, 30, 22, 208, N'康多乡'),
	(62, 30, 22, 209, N'勺哇土族乡'),
	(62, 30, 22, 210, N'洮砚乡'),
	(62, 30, 22, 211, N'藏巴哇乡');

/* 甘肃省 甘南藏族自治州 舟曲县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 30, 23, 100, N'城关镇'),
	(62, 30, 23, 101, N'大川镇'),
	(62, 30, 23, 102, N'峰迭镇'),
	(62, 30, 23, 200, N'曲瓦乡'),
	(62, 30, 23, 201, N'巴藏乡'),
	(62, 30, 23, 202, N'大峪乡'),
	(62, 30, 23, 203, N'立节乡'),
	(62, 30, 23, 204, N'憨班乡'),
	(62, 30, 23, 205, N'坪定乡'),
	(62, 30, 23, 206, N'江盘乡'),
	(62, 30, 23, 207, N'东山乡'),
	(62, 30, 23, 208, N'南峪乡'),
	(62, 30, 23, 209, N'果耶乡'),
	(62, 30, 23, 210, N'八楞乡'),
	(62, 30, 23, 211, N'武坪乡'),
	(62, 30, 23, 212, N'插岗乡'),
	(62, 30, 23, 213, N'拱坝乡'),
	(62, 30, 23, 214, N'曲告纳乡'),
	(62, 30, 23, 215, N'博峪乡');

/* 甘肃省 甘南藏族自治州 迭部县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 30, 24, 100, N'电尕镇'),
	(62, 30, 24, 200, N'益哇乡'),
	(62, 30, 24, 201, N'卡坝乡'),
	(62, 30, 24, 202, N'达拉乡'),
	(62, 30, 24, 203, N'尼傲乡'),
	(62, 30, 24, 204, N'旺藏乡'),
	(62, 30, 24, 205, N'阿夏乡'),
	(62, 30, 24, 206, N'多儿乡'),
	(62, 30, 24, 207, N'桑坝乡'),
	(62, 30, 24, 208, N'腊子口乡'),
	(62, 30, 24, 209, N'洛大乡');

/* 甘肃省 甘南藏族自治州 玛曲县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 30, 25, 100, N'尼玛镇'),
	(62, 30, 25, 200, N'欧拉乡'),
	(62, 30, 25, 201, N'欧拉秀玛乡'),
	(62, 30, 25, 202, N'阿万仓乡'),
	(62, 30, 25, 203, N'木西合乡'),
	(62, 30, 25, 204, N'齐哈玛乡'),
	(62, 30, 25, 205, N'采日玛乡'),
	(62, 30, 25, 206, N'曼日玛乡');

/* 甘肃省 甘南藏族自治州 碌曲县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 30, 26, 100, N'郎木寺镇'),
	(62, 30, 26, 101, N'玛艾镇'),
	(62, 30, 26, 200, N'尕海乡'),
	(62, 30, 26, 201, N'西仓乡'),
	(62, 30, 26, 202, N'拉仁关乡'),
	(62, 30, 26, 203, N'双岔乡'),
	(62, 30, 26, 204, N'阿拉乡');

/* 甘肃省 甘南藏族自治州 夏河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(62, 30, 27, 100, N'拉卜楞镇'),
	(62, 30, 27, 101, N'王格尔塘镇'),
	(62, 30, 27, 102, N'阿木去乎镇'),
	(62, 30, 27, 200, N'桑科乡'),
	(62, 30, 27, 201, N'甘加乡'),
	(62, 30, 27, 202, N'达麦乡'),
	(62, 30, 27, 203, N'麻当乡'),
	(62, 30, 27, 204, N'曲奥乡'),
	(62, 30, 27, 205, N'唐尕昂乡'),
	(62, 30, 27, 206, N'扎油乡'),
	(62, 30, 27, 207, N'博拉乡'),
	(62, 30, 27, 208, N'吉仓乡'),
	(62, 30, 27, 209, N'科才乡');


/* 青海省 西宁市 城东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 01, 02, 001, N'东关大街社区公共服务中心'),
	(63, 01, 02, 002, N'清真巷社区公共服务中心'),
	(63, 01, 02, 003, N'大众街社区公共服务中心'),
	(63, 01, 02, 004, N'周家泉社区公共服务中心'),
	(63, 01, 02, 005, N'火车站社区公共服务中心'),
	(63, 01, 02, 006, N'康乐社区公共服务中心'),
	(63, 01, 02, 007, N'林家崖社区公共服务中心'),
	(63, 01, 02, 008, N'国际村社区公共服务中心'),
	(63, 01, 02, 009, N'富强巷社区公共服务中心'),
	(63, 01, 02, 010, N'青藏花园社区公共服务中心'),
	(63, 01, 02, 011, N'泰宁社区公共服务中心'),
	(63, 01, 02, 012, N'互助中路社区公共服务中心'),
	(63, 01, 02, 100, N'乐家湾镇政府'),
	(63, 01, 02, 101, N'韵家口镇政府');

/* 青海省 西宁市 城中区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 01, 03, 001, N'人民街街道办事处'),
	(63, 01, 03, 002, N'南滩街道办事处'),
	(63, 01, 03, 003, N'仓门街街道办事处'),
	(63, 01, 03, 004, N'礼让街街道办事处'),
	(63, 01, 03, 005, N'饮马街街道办事处'),
	(63, 01, 03, 006, N'南川东路街道办事处'),
	(63, 01, 03, 007, N'南川西路街道办事处'),
	(63, 01, 03, 100, N'总寨镇');

/* 青海省 西宁市 城西区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 01, 04, 001, N'西关大街街道办事处'),
	(63, 01, 04, 002, N'古城台街道办事处'),
	(63, 01, 04, 003, N'虎台街道办事处'),
	(63, 01, 04, 004, N'胜利路街道办事处'),
	(63, 01, 04, 005, N'兴海路街道办事处'),
	(63, 01, 04, 100, N'彭家寨镇');

/* 青海省 西宁市 城北区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 01, 05, 001, N'朝阳街道办事处'),
	(63, 01, 05, 002, N'小桥大街街道办事处'),
	(63, 01, 05, 003, N'马坊街道办事处'),
	(63, 01, 05, 100, N'大堡子镇'),
	(63, 01, 05, 101, N'廿里铺镇');

/* 青海省 西宁市 大通回族土族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 01, 21, 100, N'桥头镇'),
	(63, 01, 21, 101, N'城关镇'),
	(63, 01, 21, 102, N'塔尔镇'),
	(63, 01, 21, 103, N'东峡镇'),
	(63, 01, 21, 104, N'黄家寨镇'),
	(63, 01, 21, 105, N'长宁镇'),
	(63, 01, 21, 106, N'景阳镇'),
	(63, 01, 21, 107, N'多林镇'),
	(63, 01, 21, 108, N'新庄镇'),
	(63, 01, 21, 200, N'青林乡'),
	(63, 01, 21, 201, N'青山乡'),
	(63, 01, 21, 202, N'逊让乡'),
	(63, 01, 21, 203, N'极乐乡'),
	(63, 01, 21, 204, N'石山乡'),
	(63, 01, 21, 205, N'宝库乡'),
	(63, 01, 21, 206, N'斜沟乡'),
	(63, 01, 21, 207, N'良教乡'),
	(63, 01, 21, 208, N'向化藏族乡'),
	(63, 01, 21, 209, N'桦林乡'),
	(63, 01, 21, 210, N'朔北藏族乡');

/* 青海省 西宁市 湟中县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 01, 22, 001, N'康川街道办事处'),
	(63, 01, 22, 100, N'鲁沙尔镇'),
	(63, 01, 22, 101, N'西堡镇'),
	(63, 01, 22, 102, N'上新庄镇'),
	(63, 01, 22, 103, N'田家寨镇'),
	(63, 01, 22, 104, N'甘河滩镇'),
	(63, 01, 22, 105, N'共和镇'),
	(63, 01, 22, 106, N'多巴镇'),
	(63, 01, 22, 107, N'拦隆口镇'),
	(63, 01, 22, 108, N'上五庄镇'),
	(63, 01, 22, 109, N'李家山镇'),
	(63, 01, 22, 200, N'群加乡'),
	(63, 01, 22, 201, N'土门关乡'),
	(63, 01, 22, 202, N'汉东乡'),
	(63, 01, 22, 203, N'大才乡'),
	(63, 01, 22, 204, N'海子沟乡');

/* 青海省 西宁市 湟源县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 01, 23, 100, N'城关镇'),
	(63, 01, 23, 101, N'大华镇'),
	(63, 01, 23, 200, N'东峡乡'),
	(63, 01, 23, 201, N'日月乡'),
	(63, 01, 23, 202, N'和平乡'),
	(63, 01, 23, 203, N'波航乡'),
	(63, 01, 23, 204, N'申中乡'),
	(63, 01, 23, 205, N'巴燕乡'),
	(63, 01, 23, 206, N'寺寨乡');

/* 青海省 海东市 乐都区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 02, 02, 100, N'碾伯镇'),
	(63, 02, 02, 101, N'雨润镇'),
	(63, 02, 02, 102, N'寿乐镇'),
	(63, 02, 02, 103, N'高庙镇'),
	(63, 02, 02, 104, N'洪水镇'),
	(63, 02, 02, 105, N'高店镇'),
	(63, 02, 02, 106, N'瞿昙镇'),
	(63, 02, 02, 200, N'共和乡'),
	(63, 02, 02, 201, N'中岭乡'),
	(63, 02, 02, 202, N'李家乡'),
	(63, 02, 02, 203, N'下营乡'),
	(63, 02, 02, 204, N'芦化乡'),
	(63, 02, 02, 205, N'马营乡'),
	(63, 02, 02, 206, N'马厂乡'),
	(63, 02, 02, 207, N'蒲台乡'),
	(63, 02, 02, 208, N'中坝乡'),
	(63, 02, 02, 209, N'峰堆乡'),
	(63, 02, 02, 210, N'城台乡'),
	(63, 02, 02, 211, N'达拉乡');

/* 青海省 海东市 平安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 02, 03, 100, N'平安镇'),
	(63, 02, 03, 101, N'小峡镇'),
	(63, 02, 03, 102, N'三合镇'),
	(63, 02, 03, 200, N'洪水泉乡'),
	(63, 02, 03, 201, N'石灰窑乡'),
	(63, 02, 03, 202, N'古城乡'),
	(63, 02, 03, 203, N'沙沟乡'),
	(63, 02, 03, 204, N'巴藏沟乡');

/* 青海省 海东市 民和回族土族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 02, 22, 100, N'川口镇'),
	(63, 02, 22, 101, N'古鄯镇'),
	(63, 02, 22, 102, N'马营镇'),
	(63, 02, 22, 103, N'官亭镇'),
	(63, 02, 22, 104, N'巴州镇'),
	(63, 02, 22, 105, N'满坪镇'),
	(63, 02, 22, 106, N'李二堡镇'),
	(63, 02, 22, 107, N'峡门镇'),
	(63, 02, 22, 200, N'马场垣乡'),
	(63, 02, 22, 201, N'北山乡'),
	(63, 02, 22, 202, N'松树乡'),
	(63, 02, 22, 203, N'西沟乡'),
	(63, 02, 22, 204, N'总堡乡'),
	(63, 02, 22, 205, N'隆治乡'),
	(63, 02, 22, 206, N'大庄乡'),
	(63, 02, 22, 207, N'转导乡'),
	(63, 02, 22, 208, N'前河乡'),
	(63, 02, 22, 209, N'甘沟乡'),
	(63, 02, 22, 210, N'中川乡'),
	(63, 02, 22, 211, N'杏儿乡'),
	(63, 02, 22, 212, N'核桃庄乡'),
	(63, 02, 22, 213, N'新民乡');

/* 青海省 海东市 互助土族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 02, 23, 100, N'威远镇'),
	(63, 02, 23, 101, N'丹麻镇'),
	(63, 02, 23, 102, N'高寨镇'),
	(63, 02, 23, 103, N'南门峡镇'),
	(63, 02, 23, 104, N'加定镇'),
	(63, 02, 23, 105, N'塘川镇'),
	(63, 02, 23, 106, N'五十镇'),
	(63, 02, 23, 107, N'五峰镇'),
	(63, 02, 23, 200, N'台子乡'),
	(63, 02, 23, 201, N'西山乡'),
	(63, 02, 23, 202, N'红崖子沟乡'),
	(63, 02, 23, 203, N'巴扎藏族乡'),
	(63, 02, 23, 204, N'哈拉直沟乡'),
	(63, 02, 23, 205, N'松多藏族乡'),
	(63, 02, 23, 206, N'东山乡'),
	(63, 02, 23, 207, N'东和乡'),
	(63, 02, 23, 208, N'东沟乡'),
	(63, 02, 23, 209, N'林川乡'),
	(63, 02, 23, 210, N'蔡家堡乡');

/* 青海省 海东市 化隆回族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 02, 24, 100, N'巴燕镇'),
	(63, 02, 24, 101, N'群科镇'),
	(63, 02, 24, 102, N'牙什尕镇'),
	(63, 02, 24, 103, N'甘都镇'),
	(63, 02, 24, 104, N'扎巴镇'),
	(63, 02, 24, 105, N'昂思多镇'),
	(63, 02, 24, 200, N'雄先藏族乡'),
	(63, 02, 24, 201, N'初麻乡'),
	(63, 02, 24, 202, N'查甫藏族乡'),
	(63, 02, 24, 203, N'塔加藏族乡'),
	(63, 02, 24, 204, N'金源藏族乡'),
	(63, 02, 24, 205, N'二塘乡'),
	(63, 02, 24, 206, N'谢家滩乡'),
	(63, 02, 24, 207, N'德恒隆乡'),
	(63, 02, 24, 208, N'沙连堡乡'),
	(63, 02, 24, 209, N'阿什奴乡'),
	(63, 02, 24, 210, N'石大仓乡');

/* 青海省 海东市 循化撒拉族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 02, 25, 100, N'积石镇'),
	(63, 02, 25, 101, N'白庄镇'),
	(63, 02, 25, 102, N'街子镇'),
	(63, 02, 25, 200, N'道帏藏族乡'),
	(63, 02, 25, 201, N'清水乡'),
	(63, 02, 25, 202, N'岗察藏族乡'),
	(63, 02, 25, 203, N'查汗都斯乡'),
	(63, 02, 25, 204, N'文都藏族乡'),
	(63, 02, 25, 205, N'尕楞藏族乡');

/* 青海省 海北藏族自治州 门源回族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 22, 21, 100, N'浩门镇'),
	(63, 22, 21, 101, N'青石咀镇'),
	(63, 22, 21, 102, N'泉口镇'),
	(63, 22, 21, 103, N'东川镇'),
	(63, 22, 21, 200, N'北山乡'),
	(63, 22, 21, 201, N'麻莲乡'),
	(63, 22, 21, 202, N'西滩乡'),
	(63, 22, 21, 203, N'阴田乡'),
	(63, 22, 21, 204, N'仙米乡'),
	(63, 22, 21, 205, N'珠固乡'),
	(63, 22, 21, 206, N'苏吉滩乡'),
	(63, 22, 21, 207, N'皇城蒙古族乡');

/* 青海省 海北藏族自治州 祁连县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 22, 22, 100, N'八宝镇'),
	(63, 22, 22, 101, N'峨堡镇'),
	(63, 22, 22, 102, N'默勒镇'),
	(63, 22, 22, 200, N'扎麻什乡'),
	(63, 22, 22, 201, N'阿柔乡'),
	(63, 22, 22, 202, N'野牛沟乡'),
	(63, 22, 22, 203, N'央隆乡');

/* 青海省 海北藏族自治州 海晏县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 22, 23, 100, N'三角城镇'),
	(63, 22, 23, 101, N'西海镇（海北州政府驻地）'),
	(63, 22, 23, 200, N'金滩乡'),
	(63, 22, 23, 201, N'哈勒景蒙古族乡'),
	(63, 22, 23, 202, N'青海湖乡'),
	(63, 22, 23, 203, N'甘子河乡');

/* 青海省 海北藏族自治州 刚察县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 22, 24, 100, N'沙柳河镇'),
	(63, 22, 24, 101, N'哈尔盖镇'),
	(63, 22, 24, 200, N'伊克乌兰乡'),
	(63, 22, 24, 201, N'泉吉乡'),
	(63, 22, 24, 202, N'吉尔孟乡');

/* 青海省 黄南藏族自治州 同仁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 23, 21, 100, N'隆务镇'),
	(63, 23, 21, 101, N'保安镇'),
	(63, 23, 21, 102, N'多哇镇'),
	(63, 23, 21, 200, N'兰采乡'),
	(63, 23, 21, 201, N'双朋西乡'),
	(63, 23, 21, 202, N'扎毛乡'),
	(63, 23, 21, 203, N'黄乃亥乡'),
	(63, 23, 21, 204, N'曲库乎乡'),
	(63, 23, 21, 205, N'年都乎乡'),
	(63, 23, 21, 207, N'瓜什则乡'),
	(63, 23, 21, 208, N'加吾乡');

/* 青海省 黄南藏族自治州 尖扎县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 23, 22, 100, N'马克堂镇'),
	(63, 23, 22, 101, N'康扬镇'),
	(63, 23, 22, 102, N'坎布拉镇'),
	(63, 23, 22, 200, N'贾加乡'),
	(63, 23, 22, 201, N'措周乡'),
	(63, 23, 22, 202, N'昂拉乡'),
	(63, 23, 22, 203, N'能科乡'),
	(63, 23, 22, 204, N'当顺乡'),
	(63, 23, 22, 205, N'尖扎滩乡');

/* 青海省 黄南藏族自治州 泽库县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 23, 23, 100, N'泽曲镇'),
	(63, 23, 23, 101, N'麦秀镇'),
	(63, 23, 23, 102, N'和日镇'),
	(63, 23, 23, 200, N'宁秀乡'),
	(63, 23, 23, 202, N'王加乡'),
	(63, 23, 23, 203, N'西卜沙乡'),
	(63, 23, 23, 204, N'多禾茂乡');

/* 青海省 黄南藏族自治州 河南蒙古族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 23, 24, 100, N'优干宁镇'),
	(63, 23, 24, 101, N'宁木特镇'),
	(63, 23, 24, 201, N'多松乡'),
	(63, 23, 24, 202, N'赛尔龙乡'),
	(63, 23, 24, 203, N'柯生乡');

/* 青海省 海南藏族自治州 共和县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 25, 21, 100, N'恰卜恰镇'),
	(63, 25, 21, 101, N'倒淌河镇'),
	(63, 25, 21, 102, N'龙羊峡镇'),
	(63, 25, 21, 103, N'塘格木镇'),
	(63, 25, 21, 200, N'黑马河乡'),
	(63, 25, 21, 201, N'石乃亥乡'),
	(63, 25, 21, 202, N'沙珠玉乡'),
	(63, 25, 21, 203, N'铁盖乡'),
	(63, 25, 21, 204, N'廿地乡'),
	(63, 25, 21, 205, N'切吉乡'),
	(63, 25, 21, 206, N'江西沟乡');

/* 青海省 海南藏族自治州 同德县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 25, 22, 100, N'尕巴松多镇'),
	(63, 25, 22, 101, N'唐谷镇'),
	(63, 25, 22, 200, N'巴沟乡'),
	(63, 25, 22, 201, N'秀麻乡'),
	(63, 25, 22, 202, N'河北乡');

/* 青海省 海南藏族自治州 贵德县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 25, 23, 100, N'河阴镇'),
	(63, 25, 23, 101, N'河西镇'),
	(63, 25, 23, 102, N'拉西瓦镇'),
	(63, 25, 23, 103, N'常牧镇'),
	(63, 25, 23, 200, N'河东乡'),
	(63, 25, 23, 201, N'新街回族乡'),
	(63, 25, 23, 202, N'尕让乡');

/* 青海省 海南藏族自治州 兴海县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 25, 24, 100, N'子科滩镇'),
	(63, 25, 24, 101, N'河卡镇'),
	(63, 25, 24, 102, N'曲什安镇'),
	(63, 25, 24, 200, N'温泉乡'),
	(63, 25, 24, 201, N'龙藏乡'),
	(63, 25, 24, 202, N'中铁乡'),
	(63, 25, 24, 203, N'唐乃亥乡');

/* 青海省 海南藏族自治州 贵南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 25, 25, 100, N'茫曲镇'),
	(63, 25, 25, 101, N'过马营镇'),
	(63, 25, 25, 102, N'森多镇'),
	(63, 25, 25, 200, N'沙沟乡'),
	(63, 25, 25, 202, N'茫拉乡'),
	(63, 25, 25, 203, N'塔秀乡');

/* 青海省 果洛藏族自治州 玛沁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 26, 21, 100, N'大武镇'),
	(63, 26, 21, 101, N'拉加镇'),
	(63, 26, 21, 200, N'大武乡'),
	(63, 26, 21, 201, N'东倾沟乡'),
	(63, 26, 21, 202, N'雪山乡'),
	(63, 26, 21, 203, N'下大武乡'),
	(63, 26, 21, 204, N'优云乡'),
	(63, 26, 21, 205, N'当洛乡');

/* 青海省 果洛藏族自治州 班玛县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 26, 22, 100, N'赛来塘镇'),
	(63, 26, 22, 200, N'多贡麻乡'),
	(63, 26, 22, 201, N'马可河乡'),
	(63, 26, 22, 202, N'吉卡乡'),
	(63, 26, 22, 203, N'达卡乡'),
	(63, 26, 22, 204, N'知钦乡'),
	(63, 26, 22, 205, N'江日堂乡'),
	(63, 26, 22, 206, N'亚尔堂乡'),
	(63, 26, 22, 207, N'灯塔乡');

/* 青海省 果洛藏族自治州 甘德县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 26, 23, 100, N'柯曲镇'),
	(63, 26, 23, 200, N'上贡麻乡'),
	(63, 26, 23, 201, N'下贡麻乡'),
	(63, 26, 23, 202, N'岗龙乡'),
	(63, 26, 23, 203, N'青珍乡'),
	(63, 26, 23, 204, N'江千乡'),
	(63, 26, 23, 205, N'下藏科乡');

/* 青海省 果洛藏族自治州 达日县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 26, 24, 100, N'吉迈镇'),
	(63, 26, 24, 200, N'满掌乡'),
	(63, 26, 24, 201, N'德昂乡'),
	(63, 26, 24, 202, N'窝赛乡'),
	(63, 26, 24, 203, N'莫坝乡'),
	(63, 26, 24, 204, N'上红科乡'),
	(63, 26, 24, 205, N'下红科乡'),
	(63, 26, 24, 206, N'建设乡'),
	(63, 26, 24, 207, N'桑日麻乡'),
	(63, 26, 24, 208, N'特合土乡');

/* 青海省 果洛藏族自治州 久治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 26, 25, 100, N'智青松多镇'),
	(63, 26, 25, 200, N'门堂乡'),
	(63, 26, 25, 201, N'哇赛乡'),
	(63, 26, 25, 202, N'索呼日麻乡'),
	(63, 26, 25, 203, N'白玉乡'),
	(63, 26, 25, 204, N'哇尔依乡');

/* 青海省 果洛藏族自治州 玛多县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 26, 26, 100, N'玛查理镇'),
	(63, 26, 26, 101, N'花石峡镇'),
	(63, 26, 26, 200, N'黄河乡'),
	(63, 26, 26, 201, N'扎陵湖乡');

/* 青海省 玉树藏族自治州 玉树市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 27, 01, 001, N'结古镇街道办事处'),
	(63, 27, 01, 002, N'扎西科街道办事处'),
	(63, 27, 01, 003, N'西杭街道办事处'),
	(63, 27, 01, 004, N'新寨街道办事处'),
	(63, 27, 01, 101, N'隆宝镇'),
	(63, 27, 01, 102, N'下拉秀镇'),
	(63, 27, 01, 200, N'仲达乡'),
	(63, 27, 01, 201, N'巴塘乡'),
	(63, 27, 01, 202, N'小苏莽乡'),
	(63, 27, 01, 203, N'上拉秀乡'),
	(63, 27, 01, 204, N'哈秀乡'),
	(63, 27, 01, 205, N'安冲乡');

/* 青海省 玉树藏族自治州 杂多县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 27, 22, 100, N'萨呼腾镇'),
	(63, 27, 22, 200, N'昂赛乡'),
	(63, 27, 22, 201, N'结多乡'),
	(63, 27, 22, 202, N'阿多乡'),
	(63, 27, 22, 203, N'苏鲁乡'),
	(63, 27, 22, 204, N'查旦乡'),
	(63, 27, 22, 205, N'莫云乡'),
	(63, 27, 22, 206, N'扎青乡');

/* 青海省 玉树藏族自治州 称多县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 27, 23, 100, N'称文镇'),
	(63, 27, 23, 101, N'歇武镇'),
	(63, 27, 23, 102, N'扎朵镇'),
	(63, 27, 23, 103, N'清水河镇'),
	(63, 27, 23, 104, N'珍秦镇'),
	(63, 27, 23, 200, N'尕朵乡'),
	(63, 27, 23, 201, N'拉布乡');

/* 青海省 玉树藏族自治州 治多县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 27, 24, 100, N'加吉博洛格镇'),
	(63, 27, 24, 200, N'索加乡'),
	(63, 27, 24, 201, N'扎河乡'),
	(63, 27, 24, 202, N'多彩乡'),
	(63, 27, 24, 203, N'治渠乡'),
	(63, 27, 24, 204, N'立新乡');

/* 青海省 玉树藏族自治州 囊谦县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 27, 25, 100, N'香达镇'),
	(63, 27, 25, 200, N'白扎乡'),
	(63, 27, 25, 201, N'吉曲乡'),
	(63, 27, 25, 202, N'娘拉乡'),
	(63, 27, 25, 203, N'毛庄乡'),
	(63, 27, 25, 204, N'觉拉乡'),
	(63, 27, 25, 205, N'东坝乡'),
	(63, 27, 25, 206, N'尕羊乡'),
	(63, 27, 25, 207, N'吉尼赛乡'),
	(63, 27, 25, 208, N'着晓乡');

/* 青海省 玉树藏族自治州 曲麻莱县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 27, 26, 100, N'约改镇'),
	(63, 27, 26, 200, N'巴干乡'),
	(63, 27, 26, 201, N'秋智乡'),
	(63, 27, 26, 202, N'叶格乡'),
	(63, 27, 26, 203, N'麻多乡'),
	(63, 27, 26, 204, N'曲麻河乡');

/* 青海省 海西蒙古族藏族自治州 格尔木市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 28, 01, 001, N'昆仑路街道办事处'),
	(63, 28, 01, 002, N'黄河路街道办事处'),
	(63, 28, 01, 003, N'金峰路街道办事处'),
	(63, 28, 01, 004, N'河西街道办事处'),
	(63, 28, 01, 005, N'西藏路街道办事处'),
	(63, 28, 01, 100, N'郭勒木德镇'),
	(63, 28, 01, 101, N'唐古拉镇'),
	(63, 28, 01, 200, N'大格勒乡'),
	(63, 28, 01, 201, N'乌图美仁乡');

/* 青海省 海西蒙古族藏族自治州 德令哈市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 28, 02, 001, N'河西街道办事处'),
	(63, 28, 02, 002, N'河东街道办事处'),
	(63, 28, 02, 003, N'火车站街道办事处'),
	(63, 28, 02, 100, N'尕海镇'),
	(63, 28, 02, 101, N'怀头他拉镇'),
	(63, 28, 02, 102, N'柯鲁柯镇'),
	(63, 28, 02, 200, N'蓄集乡');

/* 青海省 海西蒙古族藏族自治州 乌兰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 28, 21, 100, N'希里沟镇'),
	(63, 28, 21, 101, N'茶卡镇'),
	(63, 28, 21, 102, N'柯柯镇'),
	(63, 28, 21, 103, N'铜普镇');

/* 青海省 海西蒙古族藏族自治州 都兰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 28, 22, 100, N'察汉乌苏镇'),
	(63, 28, 22, 101, N'香日德镇'),
	(63, 28, 22, 102, N'夏日哈镇'),
	(63, 28, 22, 103, N'宗加镇'),
	(63, 28, 22, 200, N'热水乡'),
	(63, 28, 22, 201, N'香加乡'),
	(63, 28, 22, 202, N'沟里乡'),
	(63, 28, 22, 203, N'巴隆乡');

/* 青海省 海西蒙古族藏族自治州 天峻县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 28, 23, 100, N'新源镇'),
	(63, 28, 23, 101, N'木里镇'),
	(63, 28, 23, 102, N'江河镇'),
	(63, 28, 23, 200, N'快尔玛乡'),
	(63, 28, 23, 201, N'舟群乡'),
	(63, 28, 23, 202, N'织合玛乡'),
	(63, 28, 23, 203, N'苏里乡'),
	(63, 28, 23, 204, N'生格乡'),
	(63, 28, 23, 205, N'阳康乡'),
	(63, 28, 23, 206, N'龙门乡');

/* 青海省 海西蒙古族藏族自治州 大柴旦行政委员会 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 28, 57, 100, N'柴旦镇'),
	(63, 28, 57, 101, N'锡铁山镇');

/* 青海省 海西蒙古族藏族自治州 冷湖行政委员会 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 28, 58, 100, N'冷湖镇');

/* 青海省 海西蒙古族藏族自治州 茫崖行政委员会 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(63, 28, 59, 100, N'花土沟镇'),
	(63, 28, 59, 101, N'茫崖镇');
