SET NOCOUNT ON;
SET XACT_ABORT ON;

/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

/*
 * 《2015年统计用区划代码和城乡划分代码（截止2015年09月30日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2015/index.html）
 * 数据范围：宁夏回族自治区(64)、新疆维吾尔自治区(65)、西藏自治区(54)。
 */

/* 宁夏回族自治区 银川市 兴庆区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 01, 04, 001, N'凤凰北街街道办事处'),
	(64, 01, 04, 002, N'解放西街街道办事处'),
	(64, 01, 04, 003, N'文化街街道办事处'),
	(64, 01, 04, 004, N'富宁街街道办事处'),
	(64, 01, 04, 005, N'新华街街道办事处'),
	(64, 01, 04, 006, N'玉皇阁北街街道办事处'),
	(64, 01, 04, 007, N'前进街街道办事处'),
	(64, 01, 04, 008, N'中山南街街道办事处'),
	(64, 01, 04, 009, N'银古路街道办事处'),
	(64, 01, 04, 010, N'胜利街街道办事处'),
	(64, 01, 04, 011, N'丽景街街道办事处'),
	(64, 01, 04, 100, N'掌政镇'),
	(64, 01, 04, 101, N'大新镇'),
	(64, 01, 04, 200, N'通贵乡'),
	(64, 01, 04, 201, N'月牙湖乡');

/* 宁夏回族自治区 银川市 西夏区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 01, 05, 001, N'西花园街道办事处'),
	(64, 01, 05, 002, N'北京西路街道办事处'),
	(64, 01, 05, 003, N'文昌路街道办事处'),
	(64, 01, 05, 004, N'朔方路街道办事处'),
	(64, 01, 05, 005, N'宁华路街道办事处'),
	(64, 01, 05, 006, N'贺兰山西路街道办事处'),
	(64, 01, 05, 100, N'兴泾镇'),
	(64, 01, 05, 101, N'镇北堡镇');

/* 宁夏回族自治区 银川市 金凤区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 01, 06, 001, N'满城北街街道办事处'),
	(64, 01, 06, 002, N'黄河东路街道办事处'),
	(64, 01, 06, 003, N'长城中路街道办事处'),
	(64, 01, 06, 004, N'北京中路街道办事处'),
	(64, 01, 06, 005, N'上海西路街道办事处'),
	(64, 01, 06, 100, N'良田镇'),
	(64, 01, 06, 101, N'丰登镇');

/* 宁夏回族自治区 银川市 永宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 01, 21, 100, N'杨和镇'),
	(64, 01, 21, 101, N'李俊镇'),
	(64, 01, 21, 102, N'望远镇'),
	(64, 01, 21, 103, N'望洪镇'),
	(64, 01, 21, 104, N'闽宁镇'),
	(64, 01, 21, 200, N'胜利乡');

/* 宁夏回族自治区 银川市 贺兰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 01, 22, 100, N'习岗镇'),
	(64, 01, 22, 101, N'金贵镇'),
	(64, 01, 22, 102, N'立岗镇'),
	(64, 01, 22, 103, N'洪广镇'),
	(64, 01, 22, 200, N'常信乡');

/* 宁夏回族自治区 银川市 灵武市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 01, 81, 001, N'城区街道办事处'),
	(64, 01, 81, 100, N'东塔镇'),
	(64, 01, 81, 101, N'郝家桥镇'),
	(64, 01, 81, 102, N'崇兴镇'),
	(64, 01, 81, 103, N'宁东镇'),
	(64, 01, 81, 104, N'马家滩镇'),
	(64, 01, 81, 105, N'临河镇'),
	(64, 01, 81, 200, N'梧桐树乡'),
	(64, 01, 81, 201, N'白土岗乡');

/* 宁夏回族自治区 石嘴山市 大武口区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 02, 02, 001, N'长胜街道办事处'),
	(64, 02, 02, 002, N'朝阳街道办事处'),
	(64, 02, 02, 003, N'人民路街道办事处'),
	(64, 02, 02, 004, N'长城街道办事处'),
	(64, 02, 02, 005, N'青山街道办事处'),
	(64, 02, 02, 006, N'石炭井街道办事处'),
	(64, 02, 02, 007, N'白芨沟街道办事处'),
	(64, 02, 02, 008, N'沟口街道办事处'),
	(64, 02, 02, 010, N'长兴街道办事处'),
	(64, 02, 02, 011, N'锦林街道办事处'),
	(64, 02, 02, 100, N'星海镇');

/* 宁夏回族自治区 石嘴山市 惠农区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 02, 05, 001, N'育才路街道办事处'),
	(64, 02, 05, 002, N'南街街道办事处'),
	(64, 02, 05, 003, N'中街街道办事处'),
	(64, 02, 05, 004, N'北街街道办事处'),
	(64, 02, 05, 005, N'河滨街道办事处'),
	(64, 02, 05, 006, N'火车站街道办事处'),
	(64, 02, 05, 100, N'红果子镇'),
	(64, 02, 05, 101, N'尾闸镇'),
	(64, 02, 05, 102, N'园艺镇'),
	(64, 02, 05, 200, N'庙台乡'),
	(64, 02, 05, 201, N'礼和乡'),
	(64, 02, 05, 202, N'燕子墩乡');

/* 宁夏回族自治区 石嘴山市 平罗县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 02, 21, 100, N'城关镇'),
	(64, 02, 21, 101, N'黄渠桥镇'),
	(64, 02, 21, 102, N'宝丰镇'),
	(64, 02, 21, 103, N'头闸镇'),
	(64, 02, 21, 104, N'姚伏镇'),
	(64, 02, 21, 105, N'崇岗镇'),
	(64, 02, 21, 106, N'陶乐镇'),
	(64, 02, 21, 200, N'高庄乡'),
	(64, 02, 21, 201, N'灵沙乡'),
	(64, 02, 21, 202, N'渠口乡'),
	(64, 02, 21, 203, N'通伏乡'),
	(64, 02, 21, 204, N'高仁乡'),
	(64, 02, 21, 205, N'红崖子乡');

/* 宁夏回族自治区 吴忠市 利通区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 03, 02, 100, N'金积镇'),
	(64, 03, 02, 101, N'金银滩镇'),
	(64, 03, 02, 102, N'高闸镇'),
	(64, 03, 02, 103, N'扁担沟镇'),
	(64, 03, 02, 104, N'上桥镇'),
	(64, 03, 02, 105, N'古城镇'),
	(64, 03, 02, 106, N'金星镇'),
	(64, 03, 02, 107, N'胜利镇'),
	(64, 03, 02, 200, N'东塔寺乡'),
	(64, 03, 02, 201, N'板桥乡'),
	(64, 03, 02, 202, N'马莲渠乡'),
	(64, 03, 02, 203, N'郭家桥乡');

/* 宁夏回族自治区 吴忠市 红寺堡区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 03, 03, 001, N'红寺堡区新民街道办事处'),
	(64, 03, 03, 100, N'红寺堡区红寺堡镇'),
	(64, 03, 03, 101, N'红寺堡区太阳山镇'),
	(64, 03, 03, 200, N'红寺堡区大河乡'),
	(64, 03, 03, 201, N'红寺堡区新庄集乡'),
	(64, 03, 03, 202, N'红寺堡区柳泉乡');

/* 宁夏回族自治区 吴忠市 盐池县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 03, 23, 100, N'花马池镇'),
	(64, 03, 23, 101, N'大水坑镇'),
	(64, 03, 23, 102, N'惠安堡镇'),
	(64, 03, 23, 103, N'高沙窝镇'),
	(64, 03, 23, 200, N'王乐井乡'),
	(64, 03, 23, 201, N'冯记沟乡'),
	(64, 03, 23, 202, N'青山乡'),
	(64, 03, 23, 203, N'麻黄山乡');

/* 宁夏回族自治区 吴忠市 同心县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 03, 24, 100, N'豫海镇'),
	(64, 03, 24, 101, N'河西镇'),
	(64, 03, 24, 102, N'韦州镇'),
	(64, 03, 24, 103, N'下马关镇'),
	(64, 03, 24, 104, N'预旺镇'),
	(64, 03, 24, 105, N'王团镇'),
	(64, 03, 24, 106, N'丁塘镇'),
	(64, 03, 24, 201, N'田老庄乡'),
	(64, 03, 24, 202, N'马高庄乡'),
	(64, 03, 24, 203, N'张家塬乡'),
	(64, 03, 24, 204, N'兴隆乡');

/* 宁夏回族自治区 吴忠市 青铜峡市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 03, 81, 001, N'裕民街道办事处'),
	(64, 03, 81, 100, N'小坝镇'),
	(64, 03, 81, 101, N'大坝镇'),
	(64, 03, 81, 102, N'青铜峡镇'),
	(64, 03, 81, 103, N'叶盛镇'),
	(64, 03, 81, 104, N'瞿靖镇'),
	(64, 03, 81, 105, N'峡口镇'),
	(64, 03, 81, 106, N'邵岗镇'),
	(64, 03, 81, 107, N'陈袁滩镇');

/* 宁夏回族自治区 固原市 原州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 04, 02, 001, N'南关街道办事处'),
	(64, 04, 02, 002, N'古雁街道办事处'),
	(64, 04, 02, 003, N'北塬街道办事处'),
	(64, 04, 02, 100, N'三营镇'),
	(64, 04, 02, 103, N'官厅镇'),
	(64, 04, 02, 104, N'开城镇'),
	(64, 04, 02, 105, N'张易镇'),
	(64, 04, 02, 106, N'彭堡镇'),
	(64, 04, 02, 107, N'头营镇'),
	(64, 04, 02, 108, N'黄铎堡镇'),
	(64, 04, 02, 200, N'中河乡'),
	(64, 04, 02, 201, N'河川乡'),
	(64, 04, 02, 204, N'炭山乡'),
	(64, 04, 02, 205, N'寨科乡');

/* 宁夏回族自治区 固原市 西吉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 04, 22, 100, N'吉强镇'),
	(64, 04, 22, 101, N'兴隆镇'),
	(64, 04, 22, 102, N'平峰镇'),
	(64, 04, 22, 200, N'新营乡'),
	(64, 04, 22, 201, N'红耀乡'),
	(64, 04, 22, 202, N'田坪乡'),
	(64, 04, 22, 203, N'马建乡'),
	(64, 04, 22, 204, N'震湖乡'),
	(64, 04, 22, 205, N'兴平乡'),
	(64, 04, 22, 206, N'西滩乡'),
	(64, 04, 22, 207, N'王民乡'),
	(64, 04, 22, 208, N'什字乡'),
	(64, 04, 22, 209, N'马莲乡'),
	(64, 04, 22, 210, N'将台乡'),
	(64, 04, 22, 211, N'硝河乡'),
	(64, 04, 22, 212, N'偏城乡'),
	(64, 04, 22, 213, N'沙沟乡'),
	(64, 04, 22, 214, N'白崖乡'),
	(64, 04, 22, 215, N'火石寨乡');

/* 宁夏回族自治区 固原市 隆德县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 04, 23, 100, N'城关镇'),
	(64, 04, 23, 101, N'沙塘镇'),
	(64, 04, 23, 102, N'联财镇'),
	(64, 04, 23, 200, N'陈靳乡'),
	(64, 04, 23, 201, N'好水乡'),
	(64, 04, 23, 202, N'观庄乡'),
	(64, 04, 23, 203, N'杨河乡'),
	(64, 04, 23, 204, N'神林乡'),
	(64, 04, 23, 205, N'张程乡'),
	(64, 04, 23, 206, N'凤岭乡'),
	(64, 04, 23, 207, N'山河乡'),
	(64, 04, 23, 208, N'温堡乡'),
	(64, 04, 23, 209, N'奠安乡');

/* 宁夏回族自治区 固原市 泾源县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 04, 24, 100, N'香水镇'),
	(64, 04, 24, 101, N'泾河源镇'),
	(64, 04, 24, 102, N'六盘山镇'),
	(64, 04, 24, 200, N'新民乡'),
	(64, 04, 24, 201, N'兴盛乡'),
	(64, 04, 24, 202, N'黄花乡'),
	(64, 04, 24, 203, N'大湾乡');

/* 宁夏回族自治区 固原市 彭阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 04, 25, 100, N'白阳镇'),
	(64, 04, 25, 101, N'王洼镇'),
	(64, 04, 25, 102, N'古城镇'),
	(64, 04, 25, 103, N'红河镇'),
	(64, 04, 25, 200, N'新集乡'),
	(64, 04, 25, 201, N'城阳乡'),
	(64, 04, 25, 203, N'冯庄乡'),
	(64, 04, 25, 204, N'小岔乡'),
	(64, 04, 25, 205, N'孟塬乡'),
	(64, 04, 25, 206, N'罗洼乡'),
	(64, 04, 25, 207, N'交岔乡'),
	(64, 04, 25, 208, N'草庙乡');

/* 宁夏回族自治区 中卫市 沙坡头区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 05, 02, 100, N'滨河镇'),
	(64, 05, 02, 101, N'文昌镇'),
	(64, 05, 02, 102, N'东园镇'),
	(64, 05, 02, 103, N'柔远镇'),
	(64, 05, 02, 104, N'镇罗镇'),
	(64, 05, 02, 105, N'宣和镇'),
	(64, 05, 02, 106, N'永康镇'),
	(64, 05, 02, 107, N'常乐镇'),
	(64, 05, 02, 108, N'迎水桥镇'),
	(64, 05, 02, 109, N'兴仁镇'),
	(64, 05, 02, 200, N'香山乡'),
	(64, 05, 02, 201, N'蒿川乡');

/* 宁夏回族自治区 中卫市 中宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 05, 21, 100, N'宁安镇'),
	(64, 05, 21, 101, N'鸣沙镇'),
	(64, 05, 21, 102, N'石空镇'),
	(64, 05, 21, 103, N'新堡镇'),
	(64, 05, 21, 104, N'恩和镇'),
	(64, 05, 21, 105, N'大战场镇'),
	(64, 05, 21, 200, N'舟塔乡'),
	(64, 05, 21, 201, N'白马乡'),
	(64, 05, 21, 202, N'余丁乡'),
	(64, 05, 21, 204, N'喊叫水乡'),
	(64, 05, 21, 205, N'徐套乡');

/* 宁夏回族自治区 中卫市 海原县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(64, 05, 22, 100, N'海城镇'),
	(64, 05, 22, 101, N'李旺镇'),
	(64, 05, 22, 103, N'西安镇'),
	(64, 05, 22, 104, N'三河镇'),
	(64, 05, 22, 105, N'七营镇'),
	(64, 05, 22, 200, N'史店乡'),
	(64, 05, 22, 201, N'树台乡'),
	(64, 05, 22, 202, N'关桥乡'),
	(64, 05, 22, 206, N'高崖乡'),
	(64, 05, 22, 207, N'郑旗乡'),
	(64, 05, 22, 208, N'贾塘乡'),
	(64, 05, 22, 209, N'曹洼乡'),
	(64, 05, 22, 210, N'九彩乡'),
	(64, 05, 22, 211, N'李俊乡'),
	(64, 05, 22, 212, N'红羊乡'),
	(64, 05, 22, 213, N'关庄乡'),
	(64, 05, 22, 214, N'甘城乡');


/* 新疆维吾尔自治区 乌鲁木齐市 天山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 01, 02, 002, N'燕儿窝街道'),
	(65, 01, 02, 003, N'胜利路街道'),
	(65, 01, 02, 004, N'团结路街道'),
	(65, 01, 02, 005, N'解放南路街道'),
	(65, 01, 02, 006, N'新华南路街道'),
	(65, 01, 02, 007, N'和平路街道'),
	(65, 01, 02, 008, N'解放北路街道'),
	(65, 01, 02, 009, N'幸福路街道'),
	(65, 01, 02, 010, N'东门街道'),
	(65, 01, 02, 011, N'新华北路街道'),
	(65, 01, 02, 012, N'青年路街道'),
	(65, 01, 02, 013, N'碱泉街道'),
	(65, 01, 02, 014, N'延安路街道'),
	(65, 01, 02, 015, N'红雁街道办事处'),
	(65, 01, 02, 016, N'南草滩街道办事处');

/* 新疆维吾尔自治区 乌鲁木齐市 沙依巴克区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 01, 03, 001, N'长江路街道'),
	(65, 01, 03, 002, N'和田街街道'),
	(65, 01, 03, 003, N'扬子江路街道'),
	(65, 01, 03, 004, N'友好南路街道'),
	(65, 01, 03, 005, N'友好北路街道'),
	(65, 01, 03, 006, N'八一街道'),
	(65, 01, 03, 007, N'炉院街街道'),
	(65, 01, 03, 008, N'西山街道办事处'),
	(65, 01, 03, 009, N'雅玛里克山街道'),
	(65, 01, 03, 010, N'红庙子街道'),
	(65, 01, 03, 011, N'长胜东街道办事处'),
	(65, 01, 03, 012, N'长胜西街道办事处'),
	(65, 01, 03, 013, N'长胜南街道办事处'),
	(65, 01, 03, 014, N'火车南站街道办事处'),
	(65, 01, 03, 015, N'仓房沟片区街道办事处'),
	(65, 01, 03, 016, N'环卫路街道办事处'),
	(65, 01, 03, 017, N'骑马山街道办事处'),
	(65, 01, 03, 018, N'平顶山街道办事处');

/* 新疆维吾尔自治区 乌鲁木齐市 新市区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 01, 04, 001, N'北京路街道'),
	(65, 01, 04, 002, N'二工街道'),
	(65, 01, 04, 003, N'三工街道'),
	(65, 01, 04, 004, N'石油新村街道'),
	(65, 01, 04, 005, N'迎宾路街道'),
	(65, 01, 04, 006, N'喀什东路街道'),
	(65, 01, 04, 007, N'北站东路街道'),
	(65, 01, 04, 009, N'天津路街道'),
	(65, 01, 04, 010, N'银川路街道'),
	(65, 01, 04, 011, N'南纬路街道'),
	(65, 01, 04, 012, N'杭州路街道'),
	(65, 01, 04, 100, N'安宁渠镇'),
	(65, 01, 04, 200, N'二工乡'),
	(65, 01, 04, 201, N'地窝堡乡'),
	(65, 01, 04, 202, N'青格达湖乡'),
	(65, 01, 04, 203, N'六十户乡');

/* 新疆维吾尔自治区 乌鲁木齐市 水磨沟区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 01, 05, 001, N'水磨沟街道办事处'),
	(65, 01, 05, 002, N'六道湾街道办事处'),
	(65, 01, 05, 003, N'苇湖梁街道办事处'),
	(65, 01, 05, 004, N'八道湾街道办事处'),
	(65, 01, 05, 005, N'新民路街道办事处'),
	(65, 01, 05, 006, N'南湖南路街道办事处'),
	(65, 01, 05, 007, N'南湖北路街道办事处'),
	(65, 01, 05, 008, N'七道湾街道办事处'),
	(65, 01, 05, 010, N'榆树沟街道办事处'),
	(65, 01, 05, 011, N'石人子沟街道办事处');

/* 新疆维吾尔自治区 乌鲁木齐市 头屯河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 01, 06, 001, N'头屯河街道'),
	(65, 01, 06, 002, N'火车西站街道'),
	(65, 01, 06, 003, N'王家沟街道'),
	(65, 01, 06, 004, N'乌昌路街道'),
	(65, 01, 06, 005, N'北站西路街道办事处'),
	(65, 01, 06, 198, N'头屯河区乡类似乡镇单位');

/* 新疆维吾尔自治区 乌鲁木齐市 达坂城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 01, 07, 001, N'艾维尔沟街道'),
	(65, 01, 07, 004, N'乌拉泊街道'),
	(65, 01, 07, 006, N'达坂城区盐湖街道办事处'),
	(65, 01, 07, 100, N'达坂城镇'),
	(65, 01, 07, 200, N'东沟乡'),
	(65, 01, 07, 201, N'西沟乡'),
	(65, 01, 07, 202, N'阿克苏乡');

/* 新疆维吾尔自治区 乌鲁木齐市 米东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 01, 09, 001, N'石化街道'),
	(65, 01, 09, 002, N'地磅街道'),
	(65, 01, 09, 003, N'卡子湾街道'),
	(65, 01, 09, 004, N'古牧地东路街道'),
	(65, 01, 09, 005, N'古牧地西路街道'),
	(65, 01, 09, 006, N'南路街道'),
	(65, 01, 09, 100, N'古牧地镇'),
	(65, 01, 09, 101, N'铁厂沟镇'),
	(65, 01, 09, 102, N'长山子镇'),
	(65, 01, 09, 103, N'羊毛工镇'),
	(65, 01, 09, 104, N'三道坝镇'),
	(65, 01, 09, 200, N'柏杨河乡'),
	(65, 01, 09, 201, N'芦草沟乡');

/* 新疆维吾尔自治区 乌鲁木齐市 乌鲁木齐县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 01, 21, 100, N'水西沟镇'),
	(65, 01, 21, 207, N'萨尔达坂乡'),
	(65, 01, 21, 208, N'甘沟乡'),
	(65, 01, 21, 210, N'永丰乡'),
	(65, 01, 21, 212, N'板房沟乡'),
	(65, 01, 21, 213, N'托里乡');

/* 新疆维吾尔自治区 克拉玛依市 独山子区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 02, 02, 001, N'金山路街道办事处'),
	(65, 02, 02, 002, N'西宁路街道办事处'),
	(65, 02, 02, 003, N'新北区办事处');

/* 新疆维吾尔自治区 克拉玛依市 克拉玛依区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 02, 03, 001, N'天山路街道办事处'),
	(65, 02, 03, 002, N'胜利路街道办事处'),
	(65, 02, 03, 003, N'昆仑路街道办事处'),
	(65, 02, 03, 004, N'银河路街道办事处'),
	(65, 02, 03, 005, N'金龙镇街道办事处'),
	(65, 02, 03, 006, N'五五新镇街道办事处'),
	(65, 02, 03, 200, N'小拐乡');

/* 新疆维吾尔自治区 克拉玛依市 白碱滩区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 02, 04, 001, N'中兴路街道'),
	(65, 02, 04, 002, N'三平路街道');

/* 新疆维吾尔自治区 克拉玛依市 乌尔禾区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 02, 05, 001, N'柳树街街道办事处'),
	(65, 02, 05, 100, N'乌尔禾镇');

/* 新疆维吾尔自治区 吐鲁番市 高昌区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 04, 02, 001, N'老城街道办事处'),
	(65, 04, 02, 002, N'高昌街道办事处'),
	(65, 04, 02, 003, N'葡萄沟街道办事处'),
	(65, 04, 02, 100, N'七泉湖镇'),
	(65, 04, 02, 101, N'大河沿镇'),
	(65, 04, 02, 102, N'亚尔镇'),
	(65, 04, 02, 201, N'艾丁湖乡'),
	(65, 04, 02, 202, N'葡萄乡'),
	(65, 04, 02, 203, N'恰特喀勒乡'),
	(65, 04, 02, 204, N'二堡乡'),
	(65, 04, 02, 205, N'三堡乡'),
	(65, 04, 02, 206, N'胜金乡');

/* 新疆维吾尔自治区 吐鲁番市 鄯善县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 04, 21, 100, N'鄯善镇'),
	(65, 04, 21, 101, N'七克台镇'),
	(65, 04, 21, 102, N'火车站镇'),
	(65, 04, 21, 103, N'连木沁镇'),
	(65, 04, 21, 104, N'鲁克沁镇'),
	(65, 04, 21, 200, N'辟展乡'),
	(65, 04, 21, 201, N'东巴扎回族民族乡'),
	(65, 04, 21, 202, N'吐峪沟乡'),
	(65, 04, 21, 203, N'达浪坎乡'),
	(65, 04, 21, 204, N'迪坎乡');

/* 新疆维吾尔自治区 吐鲁番市 托克逊县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 04, 22, 100, N'托克逊镇'),
	(65, 04, 22, 101, N'库米什镇'),
	(65, 04, 22, 102, N'库加依镇'),
	(65, 04, 22, 103, N'阿乐惠镇'),
	(65, 04, 22, 104, N'伊拉湖镇'),
	(65, 04, 22, 200, N'夏乡'),
	(65, 04, 22, 201, N'郭勒布依乡'),
	(65, 04, 22, 203, N'博斯坦乡');

/* 新疆维吾尔自治区 哈密地区 哈密市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 22, 01, 001, N'东河区街道'),
	(65, 22, 01, 002, N'西河区街道'),
	(65, 22, 01, 003, N'新市区街道'),
	(65, 22, 01, 004, N'丽园街道办事处'),
	(65, 22, 01, 005, N'石油新城街道办事处'),
	(65, 22, 01, 100, N'雅满苏镇'),
	(65, 22, 01, 101, N'七角井镇'),
	(65, 22, 01, 102, N'星星峡镇'),
	(65, 22, 01, 103, N'二堡镇'),
	(65, 22, 01, 104, N'陶家宫镇'),
	(65, 22, 01, 105, N'五堡镇'),
	(65, 22, 01, 200, N'沁城乡'),
	(65, 22, 01, 201, N'乌拉台哈萨克民族乡'),
	(65, 22, 01, 202, N'双井子乡'),
	(65, 22, 01, 203, N'大泉湾乡'),
	(65, 22, 01, 205, N'回城乡'),
	(65, 22, 01, 206, N'花园乡'),
	(65, 22, 01, 207, N'南湖乡'),
	(65, 22, 01, 209, N'德外里都如克哈萨克乡'),
	(65, 22, 01, 210, N'西山乡'),
	(65, 22, 01, 211, N'天山乡'),
	(65, 22, 01, 212, N'白石头乡'),
	(65, 22, 01, 214, N'柳树沟乡');

/* 新疆维吾尔自治区 哈密地区 巴里坤哈萨克自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 22, 22, 100, N'巴里坤镇'),
	(65, 22, 22, 101, N'博尔羌吉镇'),
	(65, 22, 22, 102, N'大河镇'),
	(65, 22, 22, 103, N'奎苏镇'),
	(65, 22, 22, 104, N'三塘湖镇'),
	(65, 22, 22, 200, N'萨尔乔克乡'),
	(65, 22, 22, 201, N'海子沿乡'),
	(65, 22, 22, 202, N'下涝坝乡'),
	(65, 22, 22, 205, N'石人子乡'),
	(65, 22, 22, 206, N'花园乡'),
	(65, 22, 22, 208, N'大红柳峡乡'),
	(65, 22, 22, 209, N'八墙子乡');

/* 新疆维吾尔自治区 哈密地区 伊吾县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 22, 23, 100, N'伊吾镇'),
	(65, 22, 23, 101, N'淖毛湖镇'),
	(65, 22, 23, 102, N'盐池镇'),
	(65, 22, 23, 201, N'苇子峡乡'),
	(65, 22, 23, 202, N'下马崖乡'),
	(65, 22, 23, 204, N'吐葫芦乡'),
	(65, 22, 23, 205, N'前山哈萨克民族乡');

/* 新疆维吾尔自治区 昌吉回族自治州 昌吉市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 23, 01, 001, N'宁边路办事处'),
	(65, 23, 01, 002, N'延安北路办事处'),
	(65, 23, 01, 003, N'北京南路办事处'),
	(65, 23, 01, 004, N'建国路办事处'),
	(65, 23, 01, 005, N'中山路街道办事处'),
	(65, 23, 01, 006, N'绿洲路街道办事处'),
	(65, 23, 01, 100, N'硫磺沟镇'),
	(65, 23, 01, 101, N'三工镇'),
	(65, 23, 01, 102, N'榆树沟镇'),
	(65, 23, 01, 103, N'二六工镇'),
	(65, 23, 01, 104, N'大西渠镇'),
	(65, 23, 01, 105, N'六工镇'),
	(65, 23, 01, 106, N'滨湖镇'),
	(65, 23, 01, 107, N'佃坝镇'),
	(65, 23, 01, 202, N'阿什里哈萨克民族乡'),
	(65, 23, 01, 203, N'庙尔沟乡');

/* 新疆维吾尔自治区 昌吉回族自治州 阜康市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 23, 02, 001, N'博峰街办事处'),
	(65, 23, 02, 002, N'阜新街办事处'),
	(65, 23, 02, 003, N'准东办事处'),
	(65, 23, 02, 100, N'甘河子镇'),
	(65, 23, 02, 101, N'城关镇'),
	(65, 23, 02, 102, N'九运街镇'),
	(65, 23, 02, 103, N'滋泥泉子镇'),
	(65, 23, 02, 201, N'上户沟哈萨克民族乡'),
	(65, 23, 02, 202, N'水磨沟乡'),
	(65, 23, 02, 203, N'三工河哈萨克民族乡');

/* 新疆维吾尔自治区 昌吉回族自治州 呼图壁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 23, 23, 100, N'呼图壁镇'),
	(65, 23, 23, 101, N'大丰镇'),
	(65, 23, 23, 102, N'雀尔沟镇'),
	(65, 23, 23, 103, N'二十里店镇'),
	(65, 23, 23, 104, N'园户村镇'),
	(65, 23, 23, 105, N'五工台镇'),
	(65, 23, 23, 201, N'石梯子哈萨克民族乡');

/* 新疆维吾尔自治区 昌吉回族自治州 玛纳斯县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 23, 24, 100, N'玛纳斯镇'),
	(65, 23, 24, 101, N'乐土驿镇'),
	(65, 23, 24, 102, N'包家店镇'),
	(65, 23, 24, 103, N'凉州户镇'),
	(65, 23, 24, 104, N'北五岔镇'),
	(65, 23, 24, 105, N'六户地镇'),
	(65, 23, 24, 106, N'兰州湾镇'),
	(65, 23, 24, 201, N'广东地乡'),
	(65, 23, 24, 202, N'清水河子哈萨克民族乡'),
	(65, 23, 24, 203, N'塔西河哈萨克民族乡'),
	(65, 23, 24, 204, N'旱卡子滩哈萨克民族乡');

/* 新疆维吾尔自治区 昌吉回族自治州 奇台县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 23, 25, 100, N'奇台镇'),
	(65, 23, 25, 101, N'老奇台镇'),
	(65, 23, 25, 102, N'半截沟镇'),
	(65, 23, 25, 103, N'吉布库镇'),
	(65, 23, 25, 104, N'东湾镇'),
	(65, 23, 25, 105, N'西地镇'),
	(65, 23, 25, 106, N'碧流河镇'),
	(65, 23, 25, 107, N'三个庄子镇'),
	(65, 23, 25, 201, N'西北湾乡'),
	(65, 23, 25, 202, N'坎尔孜乡'),
	(65, 23, 25, 203, N'五马场乡'),
	(65, 23, 25, 204, N'古城乡'),
	(65, 23, 25, 205, N'乔仁乡'),
	(65, 23, 25, 206, N'七户乡'),
	(65, 23, 25, 208, N'塔塔尔乡');

/* 新疆维吾尔自治区 昌吉回族自治州 吉木萨尔县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 23, 27, 100, N'吉木萨尔镇'),
	(65, 23, 27, 101, N'三台镇'),
	(65, 23, 27, 102, N'泉子街镇'),
	(65, 23, 27, 103, N'北庭镇'),
	(65, 23, 27, 104, N'二工镇'),
	(65, 23, 27, 105, N'大有镇'),
	(65, 23, 27, 202, N'庆阳湖乡'),
	(65, 23, 27, 203, N'老台乡'),
	(65, 23, 27, 205, N'新地乡');

/* 新疆维吾尔自治区 昌吉回族自治州 木垒哈萨克自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 23, 28, 100, N'木垒镇'),
	(65, 23, 28, 101, N'木垒县西吉尔镇'),
	(65, 23, 28, 102, N'木垒县东城镇'),
	(65, 23, 28, 103, N'新户镇'),
	(65, 23, 28, 200, N'英格堡乡'),
	(65, 23, 28, 201, N'照壁山乡'),
	(65, 23, 28, 203, N'雀仁乡'),
	(65, 23, 28, 204, N'白杨河乡'),
	(65, 23, 28, 205, N'大石头乡'),
	(65, 23, 28, 206, N'大南沟乌孜别克乡'),
	(65, 23, 28, 207, N'博斯坦乡');

/* 新疆维吾尔自治区 博尔塔拉蒙古自治州 博乐市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 27, 01, 001, N'青得里街道'),
	(65, 27, 01, 002, N'顾里木图街道'),
	(65, 27, 01, 004, N'南城区街道'),
	(65, 27, 01, 100, N'小营盘镇'),
	(65, 27, 01, 101, N'达勒特镇'),
	(65, 27, 01, 102, N'乌图布拉格镇'),
	(65, 27, 01, 200, N'青得里乡'),
	(65, 27, 01, 201, N'贝林哈日莫墩乡');

/* 新疆维吾尔自治区 博尔塔拉蒙古自治州 阿拉山口市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 27, 02, 001, N'阿拉套街道'),
	(65, 27, 02, 100, N'艾比湖镇');

/* 新疆维吾尔自治区 博尔塔拉蒙古自治州 精河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 27, 22, 100, N'精河镇'),
	(65, 27, 22, 101, N'大河沿子镇'),
	(65, 27, 22, 102, N'托里镇'),
	(65, 27, 22, 200, N'茫丁乡'),
	(65, 27, 22, 202, N'托托乡');

/* 新疆维吾尔自治区 博尔塔拉蒙古自治州 温泉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 27, 23, 100, N'博格达尔镇'),
	(65, 27, 23, 101, N'哈日布呼镇'),
	(65, 27, 23, 102, N'安格里格镇'),
	(65, 27, 23, 201, N'查干屯格乡'),
	(65, 27, 23, 202, N'扎勒木特乡'),
	(65, 27, 23, 203, N'塔秀乡');

/* 新疆维吾尔自治区 巴音郭楞蒙古自治州 库尔勒市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 28, 01, 001, N'团结街道'),
	(65, 28, 01, 002, N'萨依巴格街道'),
	(65, 28, 01, 003, N'天山街道'),
	(65, 28, 01, 004, N'新城街道'),
	(65, 28, 01, 005, N'建设街道'),
	(65, 28, 01, 100, N'塔什店镇'),
	(65, 28, 01, 101, N'上户镇'),
	(65, 28, 01, 102, N'库尔勒市西尼尔镇'),
	(65, 28, 01, 200, N'铁克其乡'),
	(65, 28, 01, 201, N'恰尔巴格乡'),
	(65, 28, 01, 202, N'英下乡'),
	(65, 28, 01, 203, N'库尔勒市兰干乡'),
	(65, 28, 01, 204, N'和什力克乡'),
	(65, 28, 01, 205, N'哈拉玉宫乡'),
	(65, 28, 01, 206, N'阿瓦提乡'),
	(65, 28, 01, 207, N'库尔勒市托布力其乡'),
	(65, 28, 01, 208, N'普惠乡');

/* 新疆维吾尔自治区 巴音郭楞蒙古自治州 轮台县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 28, 22, 100, N'轮台镇'),
	(65, 28, 22, 101, N'轮南镇'),
	(65, 28, 22, 102, N'群巴克镇'),
	(65, 28, 22, 103, N'阳霞镇'),
	(65, 28, 22, 201, N'哈尔巴克乡'),
	(65, 28, 22, 202, N'野云沟乡'),
	(65, 28, 22, 203, N'阿克萨来乡'),
	(65, 28, 22, 204, N'塔尔拉克乡'),
	(65, 28, 22, 205, N'草湖乡'),
	(65, 28, 22, 206, N'铁热克巴扎乡'),
	(65, 28, 22, 207, N'策达雅乡');

/* 新疆维吾尔自治区 巴音郭楞蒙古自治州 尉犁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 28, 23, 100, N'尉犁镇'),
	(65, 28, 23, 200, N'塔里木乡'),
	(65, 28, 23, 201, N'兴平乡'),
	(65, 28, 23, 202, N'团结乡'),
	(65, 28, 23, 203, N'墩阔坦乡'),
	(65, 28, 23, 204, N'喀尔曲尕乡'),
	(65, 28, 23, 205, N'阿克苏普乡'),
	(65, 28, 23, 206, N'古勒巴格乡');

/* 新疆维吾尔自治区 巴音郭楞蒙古自治州 若羌县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 28, 24, 100, N'若羌镇'),
	(65, 28, 24, 101, N'依吞布拉克镇'),
	(65, 28, 24, 102, N'罗布泊镇'),
	(65, 28, 24, 103, N'瓦石峡镇'),
	(65, 28, 24, 104, N'铁干里克镇'),
	(65, 28, 24, 201, N'吾塔木乡'),
	(65, 28, 24, 203, N'铁木里克乡'),
	(65, 28, 24, 204, N'祁曼塔克乡');

/* 新疆维吾尔自治区 巴音郭楞蒙古自治州 且末县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 28, 25, 100, N'且末镇'),
	(65, 28, 25, 101, N'奥依亚依拉克镇'),
	(65, 28, 25, 102, N'塔提让镇'),
	(65, 28, 25, 103, N'塔中镇'),
	(65, 28, 25, 200, N'阿热勒乡'),
	(65, 28, 25, 201, N'琼库勒乡'),
	(65, 28, 25, 202, N'托格拉克勒克乡'),
	(65, 28, 25, 203, N'巴格艾日克乡'),
	(65, 28, 25, 204, N'英吾斯塘乡'),
	(65, 28, 25, 205, N'阿克提坎墩乡'),
	(65, 28, 25, 206, N'阔什萨特玛乡'),
	(65, 28, 25, 208, N'阿羌乡'),
	(65, 28, 25, 209, N'库拉木勒克乡');

/* 新疆维吾尔自治区 巴音郭楞蒙古自治州 焉耆回族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 28, 26, 100, N'焉耆镇'),
	(65, 28, 26, 101, N'七个星镇'),
	(65, 28, 26, 102, N'永宁镇'),
	(65, 28, 26, 103, N'四十里城子镇'),
	(65, 28, 26, 200, N'北大渠乡'),
	(65, 28, 26, 201, N'五号渠乡'),
	(65, 28, 26, 203, N'查汗采开乡'),
	(65, 28, 26, 204, N'包尔海乡');

/* 新疆维吾尔自治区 巴音郭楞蒙古自治州 和静县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 28, 27, 100, N'和静镇'),
	(65, 28, 27, 101, N'巴仑台镇'),
	(65, 28, 27, 102, N'巴润哈尔莫墩镇'),
	(65, 28, 27, 103, N'哈尔莫墩镇'),
	(65, 28, 27, 104, N'巴音布鲁克镇'),
	(65, 28, 27, 105, N'巩乃斯镇'),
	(65, 28, 27, 106, N'乃门莫墩镇'),
	(65, 28, 27, 201, N'协比乃尔布呼乡'),
	(65, 28, 27, 203, N'克尔古提乡'),
	(65, 28, 27, 204, N'阿拉沟乡'),
	(65, 28, 27, 205, N'额勒再特乌鲁乡'),
	(65, 28, 27, 206, N'巴音郭愣乡');

/* 新疆维吾尔自治区 巴音郭楞蒙古自治州 和硕县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 28, 28, 100, N'特吾里克镇'),
	(65, 28, 28, 101, N'塔哈其镇'),
	(65, 28, 28, 102, N'曲惠镇'),
	(65, 28, 28, 200, N'乌什塔拉回族民族乡'),
	(65, 28, 28, 203, N'苏哈特乡'),
	(65, 28, 28, 204, N'乃仁克尔乡'),
	(65, 28, 28, 205, N'新塔热乡');

/* 新疆维吾尔自治区 巴音郭楞蒙古自治州 博湖县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 28, 29, 100, N'博湖镇'),
	(65, 28, 29, 101, N'本布图镇'),
	(65, 28, 29, 200, N'塔温觉肯乡'),
	(65, 28, 29, 202, N'乌兰再格森乡'),
	(65, 28, 29, 203, N'才坎诺尔乡'),
	(65, 28, 29, 204, N'查干诺尔乡'),
	(65, 28, 29, 205, N'博斯腾湖乡');

/* 新疆维吾尔自治区 阿克苏地区 阿克苏市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 29, 01, 001, N'栏杆街道办事处'),
	(65, 29, 01, 002, N'英巴扎街道办事处'),
	(65, 29, 01, 003, N'红桥街道办事处'),
	(65, 29, 01, 004, N'新城街道办事处'),
	(65, 29, 01, 005, N'南城街道办事处'),
	(65, 29, 01, 006, N'柯柯牙街道办事处'),
	(65, 29, 01, 007, N'多浪街道办事处'),
	(65, 29, 01, 100, N'喀勒塔勒镇'),
	(65, 29, 01, 101, N'阿依库勒镇'),
	(65, 29, 01, 200, N'依干其乡'),
	(65, 29, 01, 201, N'拜什吐格曼乡'),
	(65, 29, 01, 202, N'托普鲁克乡'),
	(65, 29, 01, 203, N'库木巴希乡');

/* 新疆维吾尔自治区 阿克苏地区 温宿县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 29, 22, 100, N'温宿镇'),
	(65, 29, 22, 101, N'吐木秀克镇'),
	(65, 29, 22, 102, N'克孜勒镇'),
	(65, 29, 22, 103, N'阿热勒镇'),
	(65, 29, 22, 104, N'佳木镇'),
	(65, 29, 22, 200, N'托乎拉乡'),
	(65, 29, 22, 202, N'恰格拉克乡'),
	(65, 29, 22, 204, N'依希来木其乡'),
	(65, 29, 22, 206, N'古勒阿瓦提乡'),
	(65, 29, 22, 207, N'博孜墩柯尔克孜族乡');

/* 新疆维吾尔自治区 阿克苏地区 库车县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 29, 23, 001, N'热斯坦街道办事处'),
	(65, 29, 23, 002, N'萨克萨克街道办事处'),
	(65, 29, 23, 003, N'新城街道办事处'),
	(65, 29, 23, 004, N'东城街道办事处'),
	(65, 29, 23, 101, N'乌恰镇'),
	(65, 29, 23, 102, N'阿拉哈格镇'),
	(65, 29, 23, 103, N'齐满镇'),
	(65, 29, 23, 104, N'墩阔坦镇'),
	(65, 29, 23, 105, N'牙哈镇'),
	(65, 29, 23, 106, N'乌尊镇'),
	(65, 29, 23, 107, N'依西哈拉镇'),
	(65, 29, 23, 108, N'雅克拉镇'),
	(65, 29, 23, 201, N'玉奇吾斯塘乡'),
	(65, 29, 23, 202, N'比西巴格乡'),
	(65, 29, 23, 203, N'哈尼喀塔木乡'),
	(65, 29, 23, 204, N'阿克吾斯塘乡'),
	(65, 29, 23, 205, N'阿格乡'),
	(65, 29, 23, 206, N'塔里木乡');

/* 新疆维吾尔自治区 阿克苏地区 沙雅县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 29, 24, 100, N'沙雅镇'),
	(65, 29, 24, 101, N'托依堡勒迪镇'),
	(65, 29, 24, 102, N'红旗镇'),
	(65, 29, 24, 103, N'英买力镇'),
	(65, 29, 24, 104, N'沙雅县哈德墩镇'),
	(65, 29, 24, 105, N'古勒巴格镇'),
	(65, 29, 24, 204, N'海楼乡'),
	(65, 29, 24, 205, N'努尔巴格乡'),
	(65, 29, 24, 206, N'塔里木乡'),
	(65, 29, 24, 207, N'盖孜库木乡'),
	(65, 29, 24, 208, N'央塔克协海尔乡');

/* 新疆维吾尔自治区 阿克苏地区 新和县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 29, 25, 100, N'新和镇'),
	(65, 29, 25, 101, N'尤鲁都斯巴格镇'),
	(65, 29, 25, 200, N'依其艾日克乡'),
	(65, 29, 25, 201, N'排先拜巴扎乡'),
	(65, 29, 25, 202, N'塔什艾日克乡'),
	(65, 29, 25, 203, N'渭干乡'),
	(65, 29, 25, 204, N'玉奇喀特乡'),
	(65, 29, 25, 205, N'塔木托格拉克乡');

/* 新疆维吾尔自治区 阿克苏地区 拜城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 29, 26, 100, N'拜城镇'),
	(65, 29, 26, 101, N'铁热克镇'),
	(65, 29, 26, 102, N'察尔其镇'),
	(65, 29, 26, 103, N'赛里木镇'),
	(65, 29, 26, 200, N'黑英山乡'),
	(65, 29, 26, 201, N'克孜尔乡'),
	(65, 29, 26, 203, N'托克逊乡'),
	(65, 29, 26, 204, N'亚吐尔乡'),
	(65, 29, 26, 205, N'康其乡'),
	(65, 29, 26, 206, N'布隆乡'),
	(65, 29, 26, 207, N'米吉克乡'),
	(65, 29, 26, 208, N'温巴什乡'),
	(65, 29, 26, 209, N'大桥乡'),
	(65, 29, 26, 210, N'老虎台乡');

/* 新疆维吾尔自治区 阿克苏地区 乌什县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 29, 27, 100, N'乌什镇'),
	(65, 29, 27, 101, N'阿合雅镇'),
	(65, 29, 27, 102, N'依麻木镇'),
	(65, 29, 27, 200, N'阿克托海乡'),
	(65, 29, 27, 201, N'亚科瑞克乡'),
	(65, 29, 27, 202, N'阿恰塔格乡'),
	(65, 29, 27, 205, N'英阿瓦提乡'),
	(65, 29, 27, 206, N'亚曼苏柯尔克孜族乡'),
	(65, 29, 27, 207, N'奥特贝希乡');

/* 新疆维吾尔自治区 阿克苏地区 阿瓦提县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 29, 28, 100, N'阿瓦提镇'),
	(65, 29, 28, 101, N'乌鲁却勒镇'),
	(65, 29, 28, 102, N'拜什艾日克镇'),
	(65, 29, 28, 200, N'阿依巴格乡'),
	(65, 29, 28, 201, N'塔木托格拉克乡'),
	(65, 29, 28, 202, N'英艾日克乡'),
	(65, 29, 28, 203, N'多浪乡'),
	(65, 29, 28, 204, N'巴格托格拉克乡');

/* 新疆维吾尔自治区 阿克苏地区 柯坪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 29, 29, 100, N'柯坪镇'),
	(65, 29, 29, 101, N'盖孜力克镇'),
	(65, 29, 29, 102, N'阿恰勒镇'),
	(65, 29, 29, 201, N'玉尔其乡'),
	(65, 29, 29, 203, N'启浪乡');

/* 新疆维吾尔自治区 克孜勒苏柯尔克孜自治州 阿图什市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 30, 01, 001, N'幸福路街道办事处'),
	(65, 30, 01, 002, N'光明路街道办事处'),
	(65, 30, 01, 100, N'上阿图什镇'),
	(65, 30, 01, 200, N'松他克乡'),
	(65, 30, 01, 201, N'阿扎克乡'),
	(65, 30, 01, 202, N'阿湖乡'),
	(65, 30, 01, 204, N'格达良乡'),
	(65, 30, 01, 205, N'哈拉峻乡'),
	(65, 30, 01, 206, N'吐古买提乡');

/* 新疆维吾尔自治区 克孜勒苏柯尔克孜自治州 阿克陶县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 30, 22, 100, N'阿克陶镇'),
	(65, 30, 22, 101, N'奥依塔克镇'),
	(65, 30, 22, 200, N'玉麦乡'),
	(65, 30, 22, 201, N'皮拉勒乡'),
	(65, 30, 22, 202, N'巴仁乡'),
	(65, 30, 22, 203, N'喀热克其克乡'),
	(65, 30, 22, 204, N'加马铁热克乡'),
	(65, 30, 22, 205, N'木吉乡'),
	(65, 30, 22, 206, N'布伦口乡'),
	(65, 30, 22, 207, N'克孜勒陶乡'),
	(65, 30, 22, 208, N'恰尔隆乡'),
	(65, 30, 22, 209, N'库斯拉甫乡'),
	(65, 30, 22, 210, N'塔尔塔吉克族乡');

/* 新疆维吾尔自治区 克孜勒苏柯尔克孜自治州 阿合奇县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 30, 23, 100, N'阿合奇镇'),
	(65, 30, 23, 200, N'库兰萨日克乡'),
	(65, 30, 23, 201, N'色帕巴依乡'),
	(65, 30, 23, 202, N'苏木塔什乡'),
	(65, 30, 23, 203, N'哈拉奇乡'),
	(65, 30, 23, 204, N'哈拉布拉克乡');

/* 新疆维吾尔自治区 克孜勒苏柯尔克孜自治州 乌恰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 30, 24, 100, N'乌恰镇'),
	(65, 30, 24, 101, N'康苏镇'),
	(65, 30, 24, 200, N'乌鲁克恰提乡'),
	(65, 30, 24, 201, N'吾合沙鲁乡'),
	(65, 30, 24, 202, N'膘尔托阔依乡'),
	(65, 30, 24, 203, N'黑孜韦乡'),
	(65, 30, 24, 204, N'托云乡'),
	(65, 30, 24, 205, N'铁列克乡'),
	(65, 30, 24, 206, N'巴音库鲁提乡'),
	(65, 30, 24, 207, N'波斯坦铁列克乡'),
	(65, 30, 24, 208, N'吉根乡');

/* 新疆维吾尔自治区 喀什地区 喀什市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 01, 001, N'恰萨街道办事处'),
	(65, 31, 01, 002, N'亚瓦格街道办事处'),
	(65, 31, 01, 003, N'吾斯塘博依街道办事处'),
	(65, 31, 01, 004, N'库木德尔瓦扎街道办事处'),
	(65, 31, 01, 100, N'乃则尔巴格镇'),
	(65, 31, 01, 101, N'夏马勒巴格镇'),
	(65, 31, 01, 202, N'多来特巴格乡'),
	(65, 31, 01, 203, N'浩罕乡'),
	(65, 31, 01, 204, N'色满乡'),
	(65, 31, 01, 205, N'荒地乡'),
	(65, 31, 01, 206, N'帕哈太克里乡'),
	(65, 31, 01, 207, N'伯什克然木乡'),
	(65, 31, 01, 208, N'阿瓦提乡'),
	(65, 31, 01, 209, N'英吾斯坦乡'),
	(65, 31, 01, 210, N'阿克喀什乡');

/* 新疆维吾尔自治区 喀什地区 疏附县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 21, 100, N'托克扎克镇'),
	(65, 31, 21, 101, N'兰干镇'),
	(65, 31, 21, 102, N'吾库萨克镇'),
	(65, 31, 21, 103, N'乌帕尔镇'),
	(65, 31, 21, 201, N'塔什米里克乡'),
	(65, 31, 21, 202, N'铁日木乡'),
	(65, 31, 21, 203, N'布拉克苏乡'),
	(65, 31, 21, 204, N'萨依巴格乡'),
	(65, 31, 21, 205, N'站敏乡'),
	(65, 31, 21, 211, N'木什乡');

/* 新疆维吾尔自治区 喀什地区 疏勒县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 22, 100, N'疏勒镇'),
	(65, 31, 22, 101, N'罕南力克镇'),
	(65, 31, 22, 102, N'牙甫泉镇'),
	(65, 31, 22, 200, N'巴仁乡'),
	(65, 31, 22, 201, N'洋大曼乡'),
	(65, 31, 22, 202, N'亚曼牙乡'),
	(65, 31, 22, 203, N'巴合齐乡'),
	(65, 31, 22, 204, N'塔孜洪乡'),
	(65, 31, 22, 205, N'英尔力克乡'),
	(65, 31, 22, 206, N'库木西力克乡'),
	(65, 31, 22, 207, N'塔合其乡'),
	(65, 31, 22, 208, N'艾尔木东乡'),
	(65, 31, 22, 209, N'阿拉力乡'),
	(65, 31, 22, 210, N'阿拉甫乡'),
	(65, 31, 22, 211, N'英阿瓦提乡');

/* 新疆维吾尔自治区 喀什地区 英吉沙县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 23, 100, N'城镇'),
	(65, 31, 23, 200, N'城关乡'),
	(65, 31, 23, 201, N'乔勒潘乡'),
	(65, 31, 23, 202, N'龙甫乡'),
	(65, 31, 23, 203, N'芒辛乡'),
	(65, 31, 23, 204, N'色提力乡'),
	(65, 31, 23, 205, N'萨罕乡'),
	(65, 31, 23, 206, N'英也尔乡'),
	(65, 31, 23, 207, N'克孜勒乡'),
	(65, 31, 23, 208, N'托普鲁克乡'),
	(65, 31, 23, 209, N'苏盖提乡'),
	(65, 31, 23, 210, N'乌恰乡'),
	(65, 31, 23, 211, N'艾古斯乡'),
	(65, 31, 23, 212, N'依格孜也尔乡');

/* 新疆维吾尔自治区 喀什地区 泽普县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 24, 100, N'泽普镇'),
	(65, 31, 24, 101, N'奎依巴格镇'),
	(65, 31, 24, 200, N'波斯喀木乡'),
	(65, 31, 24, 201, N'泽普县依玛乡'),
	(65, 31, 24, 202, N'古勒巴格乡'),
	(65, 31, 24, 203, N'赛力乡'),
	(65, 31, 24, 204, N'依肯苏乡'),
	(65, 31, 24, 205, N'图呼其乡'),
	(65, 31, 24, 206, N'奎依巴格乡'),
	(65, 31, 24, 207, N'阿克塔木乡'),
	(65, 31, 24, 208, N'阿依库勒乡'),
	(65, 31, 24, 209, N'布依鲁克塔吉克族乡');

/* 新疆维吾尔自治区 喀什地区 莎车县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 25, 001, N'叶尔羌街道办事处'),
	(65, 31, 25, 100, N'莎车镇'),
	(65, 31, 25, 101, N'恰热克镇'),
	(65, 31, 25, 102, N'艾力西湖镇'),
	(65, 31, 25, 103, N'荒地镇'),
	(65, 31, 25, 104, N'阿瓦提镇'),
	(65, 31, 25, 105, N'白什坎特镇'),
	(65, 31, 25, 106, N'依盖尔其镇'),
	(65, 31, 25, 107, N'古勒巴格镇'),
	(65, 31, 25, 201, N'阿热勒乡'),
	(65, 31, 25, 202, N'恰尔巴格乡'),
	(65, 31, 25, 203, N'托木吾斯塘乡'),
	(65, 31, 25, 204, N'英吾斯塘乡'),
	(65, 31, 25, 205, N'乌达力克乡'),
	(65, 31, 25, 206, N'阿尔斯兰巴格乡'),
	(65, 31, 25, 207, N'孜热甫夏提塔吉克族乡'),
	(65, 31, 25, 208, N'亚喀艾日克乡'),
	(65, 31, 25, 209, N'喀群乡'),
	(65, 31, 25, 210, N'霍什拉甫乡'),
	(65, 31, 25, 211, N'达木斯乡'),
	(65, 31, 25, 212, N'米夏乡'),
	(65, 31, 25, 213, N'伊什库力乡'),
	(65, 31, 25, 214, N'拍克其乡'),
	(65, 31, 25, 215, N'塔尕尔其乡'),
	(65, 31, 25, 216, N'阔什艾日克乡'),
	(65, 31, 25, 217, N'墩巴格乡'),
	(65, 31, 25, 218, N'阿拉买提乡'),
	(65, 31, 25, 219, N'阿扎特巴格乡'),
	(65, 31, 25, 220, N'巴格阿瓦提乡'),
	(65, 31, 25, 221, N'喀拉苏乡');

/* 新疆维吾尔自治区 喀什地区 叶城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 26, 100, N'喀格勒克镇'),
	(65, 31, 26, 101, N'恰尔巴格镇'),
	(65, 31, 26, 102, N'乌夏巴什镇'),
	(65, 31, 26, 200, N'洛克乡'),
	(65, 31, 26, 201, N'伯西热克乡'),
	(65, 31, 26, 202, N'铁提乡'),
	(65, 31, 26, 203, N'恰萨美其特乡'),
	(65, 31, 26, 204, N'吐古其乡'),
	(65, 31, 26, 205, N'江格勒斯乡'),
	(65, 31, 26, 206, N'加依提勒克乡'),
	(65, 31, 26, 207, N'巴仁乡'),
	(65, 31, 26, 208, N'乌吉热克乡'),
	(65, 31, 26, 209, N'夏合甫乡'),
	(65, 31, 26, 210, N'依力克其乡'),
	(65, 31, 26, 211, N'依提木孔乡'),
	(65, 31, 26, 212, N'宗朗乡'),
	(65, 31, 26, 213, N'柯克亚乡'),
	(65, 31, 26, 214, N'西合休乡'),
	(65, 31, 26, 215, N'棋盘乡'),
	(65, 31, 26, 216, N'萨依巴格乡');

/* 新疆维吾尔自治区 喀什地区 麦盖提县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 27, 100, N'麦盖提镇'),
	(65, 31, 27, 200, N'巴扎结米乡'),
	(65, 31, 27, 201, N'希依提墩乡'),
	(65, 31, 27, 202, N'央塔克乡'),
	(65, 31, 27, 203, N'吐曼塔勒乡'),
	(65, 31, 27, 204, N'尕孜库勒乡'),
	(65, 31, 27, 205, N'克孜勒阿瓦提乡'),
	(65, 31, 27, 206, N'库木库萨尔乡'),
	(65, 31, 27, 207, N'昂格特勒克乡'),
	(65, 31, 27, 208, N'库尔玛乡');

/* 新疆维吾尔自治区 喀什地区 岳普湖县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 28, 100, N'岳普湖镇'),
	(65, 31, 28, 101, N'艾西曼镇'),
	(65, 31, 28, 102, N'铁热木镇'),
	(65, 31, 28, 103, N'也克先拜巴扎镇'),
	(65, 31, 28, 200, N'岳普湖乡'),
	(65, 31, 28, 203, N'阿其克乡'),
	(65, 31, 28, 204, N'色也克乡'),
	(65, 31, 28, 206, N'巴依阿瓦提乡'),
	(65, 31, 28, 207, N'阿洪鲁库木乡');

/* 新疆维吾尔自治区 喀什地区 伽师县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 29, 100, N'巴仁镇'),
	(65, 31, 29, 101, N'西克尔库勒镇'),
	(65, 31, 29, 102, N'夏普吐勒镇'),
	(65, 31, 29, 200, N'铁日木乡'),
	(65, 31, 29, 201, N'英买里乡'),
	(65, 31, 29, 202, N'江巴孜乡'),
	(65, 31, 29, 203, N'卧里托格拉克乡'),
	(65, 31, 29, 204, N'克孜勒博依乡'),
	(65, 31, 29, 205, N'米夏乡'),
	(65, 31, 29, 207, N'和夏阿瓦提乡'),
	(65, 31, 29, 208, N'克孜勒苏乡'),
	(65, 31, 29, 209, N'古勒鲁克乡'),
	(65, 31, 29, 210, N'玉代克力克乡');

/* 新疆维吾尔自治区 喀什地区 巴楚县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 30, 100, N'巴楚镇'),
	(65, 31, 30, 101, N'色力布亚镇'),
	(65, 31, 30, 102, N'阿瓦提镇'),
	(65, 31, 30, 103, N'三岔口镇'),
	(65, 31, 30, 200, N'恰尔巴格乡'),
	(65, 31, 30, 201, N'多来提巴格乡'),
	(65, 31, 30, 202, N'阿纳库勒乡'),
	(65, 31, 30, 203, N'夏马勒乡'),
	(65, 31, 30, 204, N'阿克萨克玛热勒乡'),
	(65, 31, 30, 205, N'阿拉根乡'),
	(65, 31, 30, 206, N'琼库恰克乡'),
	(65, 31, 30, 207, N'英吾斯坦乡');

/* 新疆维吾尔自治区 喀什地区 塔什库尔干塔吉克自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 31, 31, 100, N'塔什库尔干镇'),
	(65, 31, 31, 101, N'塔吉克阿巴提镇'),
	(65, 31, 31, 200, N'塔什库尔干乡'),
	(65, 31, 31, 201, N'塔合曼乡'),
	(65, 31, 31, 202, N'科克亚尔柯尔克孜族乡'),
	(65, 31, 31, 203, N'提孜那甫乡'),
	(65, 31, 31, 204, N'达布达尔乡'),
	(65, 31, 31, 205, N'马尔洋乡'),
	(65, 31, 31, 206, N'瓦恰乡'),
	(65, 31, 31, 207, N'班迪尔乡'),
	(65, 31, 31, 208, N'库科西鲁格乡'),
	(65, 31, 31, 210, N'大同乡');

/* 新疆维吾尔自治区 和田地区 和田市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 32, 01, 001, N'奴尔巴格街道办事处'),
	(65, 32, 01, 002, N'古江巴格街道办事处'),
	(65, 32, 01, 003, N'古勒巴格街道办事处'),
	(65, 32, 01, 004, N'纳尔巴格街道办事处'),
	(65, 32, 01, 100, N'拉斯奎镇'),
	(65, 32, 01, 101, N'玉龙喀什镇'),
	(65, 32, 01, 200, N'肖尔巴格乡'),
	(65, 32, 01, 201, N'伊里其乡'),
	(65, 32, 01, 202, N'古江巴格乡'),
	(65, 32, 01, 203, N'吐沙拉乡'),
	(65, 32, 01, 204, N'吉亚乡'),
	(65, 32, 01, 205, N'阿克恰勒乡');

/* 新疆维吾尔自治区 和田地区 和田县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 32, 21, 100, N'巴格其镇'),
	(65, 32, 21, 102, N'罕艾日克镇'),
	(65, 32, 21, 202, N'英阿瓦提乡'),
	(65, 32, 21, 203, N'英艾日克乡'),
	(65, 32, 21, 204, N'布扎克乡'),
	(65, 32, 21, 205, N'拉依喀乡'),
	(65, 32, 21, 206, N'朗如乡'),
	(65, 32, 21, 207, N'塔瓦库勒乡'),
	(65, 32, 21, 208, N'伊斯拉木阿瓦提乡'),
	(65, 32, 21, 209, N'色格孜库勒乡'),
	(65, 32, 21, 210, N'喀什塔什乡'),
	(65, 32, 21, 211, N'吾宗肖乡');

/* 新疆维吾尔自治区 和田地区 墨玉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 32, 22, 100, N'喀拉喀什镇'),
	(65, 32, 22, 101, N'扎瓦镇'),
	(65, 32, 22, 102, N'奎牙镇'),
	(65, 32, 22, 103, N'喀尔赛镇'),
	(65, 32, 22, 203, N'阿克萨拉依乡'),
	(65, 32, 22, 204, N'乌尔其乡'),
	(65, 32, 22, 205, N'托胡拉乡'),
	(65, 32, 22, 206, N'萨依巴格乡'),
	(65, 32, 22, 207, N'加汗巴格乡'),
	(65, 32, 22, 208, N'普恰克其乡'),
	(65, 32, 22, 209, N'芒来乡'),
	(65, 32, 22, 210, N'阔依其乡'),
	(65, 32, 22, 211, N'雅瓦乡'),
	(65, 32, 22, 212, N'吐外特乡'),
	(65, 32, 22, 213, N'英也尔乡'),
	(65, 32, 22, 214, N'喀瓦克乡');

/* 新疆维吾尔自治区 和田地区 皮山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 32, 23, 001, N'街道办事处'),
	(65, 32, 23, 100, N'固玛镇'),
	(65, 32, 23, 101, N'杜瓦镇'),
	(65, 32, 23, 102, N'赛图拉镇'),
	(65, 32, 23, 103, N'木吉镇'),
	(65, 32, 23, 104, N'阔什塔格镇'),
	(65, 32, 23, 201, N'克里阳乡'),
	(65, 32, 23, 202, N'科克铁热克乡'),
	(65, 32, 23, 203, N'桑株乡'),
	(65, 32, 23, 205, N'乔达乡'),
	(65, 32, 23, 206, N'木奎拉乡'),
	(65, 32, 23, 207, N'藏桂乡'),
	(65, 32, 23, 208, N'皮亚勒玛乡'),
	(65, 32, 23, 209, N'皮西那乡'),
	(65, 32, 23, 210, N'巴什兰干乡'),
	(65, 32, 23, 211, N'垴阿巴提塔吉克民族乡'),
	(65, 32, 23, 212, N'康克尔柯尔克孜民族乡');

/* 新疆维吾尔自治区 和田地区 洛浦县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 32, 24, 001, N'城区街道办事处'),
	(65, 32, 24, 100, N'洛浦镇'),
	(65, 32, 24, 101, N'山普鲁镇'),
	(65, 32, 24, 201, N'布亚乡'),
	(65, 32, 24, 203, N'恰尔巴格乡'),
	(65, 32, 24, 204, N'杭桂乡'),
	(65, 32, 24, 205, N'多鲁乡'),
	(65, 32, 24, 206, N'纳瓦乡'),
	(65, 32, 24, 207, N'拜什托格拉克乡'),
	(65, 32, 24, 208, N'阿其克乡');

/* 新疆维吾尔自治区 和田地区 策勒县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 32, 25, 100, N'策勒镇'),
	(65, 32, 25, 101, N'固拉合玛镇'),
	(65, 32, 25, 200, N'策勒乡'),
	(65, 32, 25, 202, N'达玛沟乡'),
	(65, 32, 25, 203, N'恰哈乡'),
	(65, 32, 25, 204, N'乌鲁克萨依乡'),
	(65, 32, 25, 205, N'奴尔乡'),
	(65, 32, 25, 206, N'博斯坦乡');

/* 新疆维吾尔自治区 和田地区 于田县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 32, 26, 100, N'木尕拉镇'),
	(65, 32, 26, 101, N'先拜巴扎镇'),
	(65, 32, 26, 200, N'加依乡'),
	(65, 32, 26, 201, N'科克亚乡'),
	(65, 32, 26, 202, N'阿热勒乡'),
	(65, 32, 26, 203, N'阿日希乡'),
	(65, 32, 26, 204, N'兰干乡'),
	(65, 32, 26, 205, N'斯也克乡'),
	(65, 32, 26, 206, N'托格日尕孜乡'),
	(65, 32, 26, 207, N'喀拉克尔乡'),
	(65, 32, 26, 208, N'奥依托格拉克乡'),
	(65, 32, 26, 209, N'阿羌乡'),
	(65, 32, 26, 210, N'英巴格乡'),
	(65, 32, 26, 211, N'希吾勒乡'),
	(65, 32, 26, 212, N'达里雅布依乡');

/* 新疆维吾尔自治区 和田地区 民丰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 32, 27, 100, N'尼雅镇'),
	(65, 32, 27, 200, N'尼雅乡'),
	(65, 32, 27, 201, N'若克雅乡'),
	(65, 32, 27, 202, N'萨勒吾则克乡'),
	(65, 32, 27, 203, N'叶亦克乡'),
	(65, 32, 27, 204, N'安迪尔乡'),
	(65, 32, 27, 205, N'亚瓦通古孜乡');

/* 新疆维吾尔自治区 伊犁哈萨克自治州 伊宁市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 40, 02, 001, N'萨依布依街道办事处'),
	(65, 40, 02, 002, N'墩买里街道办事处'),
	(65, 40, 02, 003, N'伊犁河路街道办事处'),
	(65, 40, 02, 004, N'喀赞其街道办事处'),
	(65, 40, 02, 005, N'都来提巴格街道办事处'),
	(65, 40, 02, 006, N'琼科瑞克街道办事处'),
	(65, 40, 02, 007, N'艾兰木巴格街道办事处'),
	(65, 40, 02, 008, N'解放路街道办事处'),
	(65, 40, 02, 009, N'伊宁市边境经济合作区管委会'),
	(65, 40, 02, 100, N'巴彦岱镇'),
	(65, 40, 02, 200, N'英也尔乡'),
	(65, 40, 02, 201, N'汉宾乡'),
	(65, 40, 02, 202, N'塔什科瑞克乡'),
	(65, 40, 02, 203, N'喀尔墩乡'),
	(65, 40, 02, 204, N'托格拉克乡'),
	(65, 40, 02, 205, N'克伯克圩孜乡'),
	(65, 40, 02, 206, N'达达木图乡'),
	(65, 40, 02, 207, N'潘津乡');

/* 新疆维吾尔自治区 伊犁哈萨克自治州 奎屯市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 40, 03, 001, N'团结路街道办'),
	(65, 40, 03, 002, N'乌东路街道办'),
	(65, 40, 03, 003, N'北京路街道办事处'),
	(65, 40, 03, 004, N'乌鲁木齐西路街道办事处'),
	(65, 40, 03, 005, N'火车站街道办'),
	(65, 40, 03, 201, N'开干齐乡');

/* 新疆维吾尔自治区 伊犁哈萨克自治州 霍尔果斯市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 40, 04, 001, N'卡拉苏河街道'),
	(65, 40, 04, 002, N'亚欧东路街道'),
	(65, 40, 04, 003, N'亚欧西路街道'),
	(65, 40, 04, 004, N'工业园区街道'),
	(65, 40, 04, 200, N'伊车嘎善乡');

/* 新疆维吾尔自治区 伊犁哈萨克自治州 伊宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 40, 21, 100, N'吉里于孜镇'),
	(65, 40, 21, 101, N'墩麻扎镇'),
	(65, 40, 21, 102, N'英塔木镇'),
	(65, 40, 21, 103, N'胡地于孜镇'),
	(65, 40, 21, 201, N'吐鲁番于孜乡'),
	(65, 40, 21, 202, N'喀拉亚尕奇乡'),
	(65, 40, 21, 203, N'武功乡'),
	(65, 40, 21, 204, N'萨地克于孜乡'),
	(65, 40, 21, 205, N'愉群翁回族乡'),
	(65, 40, 21, 206, N'阿热吾斯塘乡'),
	(65, 40, 21, 208, N'巴依托海乡'),
	(65, 40, 21, 209, N'维吾尔玉其温乡'),
	(65, 40, 21, 210, N'萨木于孜乡'),
	(65, 40, 21, 211, N'喀什乡'),
	(65, 40, 21, 212, N'麻扎乡'),
	(65, 40, 21, 213, N'温亚尔乡'),
	(65, 40, 21, 214, N'阿乌利亚乡'),
	(65, 40, 21, 215, N'曲鲁海乡');

/* 新疆维吾尔自治区 伊犁哈萨克自治州 察布查尔锡伯自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 40, 22, 100, N'察布查尔镇'),
	(65, 40, 22, 101, N'爱新色里镇'),
	(65, 40, 22, 102, N'孙扎齐牛录镇'),
	(65, 40, 22, 200, N'堆齐牛录乡'),
	(65, 40, 22, 202, N'绰霍尔乡'),
	(65, 40, 22, 203, N'纳达齐牛录乡'),
	(65, 40, 22, 204, N'扎库齐牛录乡'),
	(65, 40, 22, 205, N'米粮泉回族乡'),
	(65, 40, 22, 206, N'坎乡'),
	(65, 40, 22, 207, N'阔洪奇乡'),
	(65, 40, 22, 208, N'海努克乡'),
	(65, 40, 22, 209, N'加尕斯台乡'),
	(65, 40, 22, 210, N'琼博拉乡');

/* 新疆维吾尔自治区 伊犁哈萨克自治州 霍城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 40, 23, 100, N'水定镇'),
	(65, 40, 23, 101, N'清水河镇'),
	(65, 40, 23, 102, N'芦草沟镇'),
	(65, 40, 23, 103, N'惠远镇'),
	(65, 40, 23, 104, N'萨尔布拉克镇'),
	(65, 40, 23, 200, N'兰干乡'),
	(65, 40, 23, 201, N'三道河乡'),
	(65, 40, 23, 204, N'三宫乡'),
	(65, 40, 23, 205, N'大西沟乡');

/* 新疆维吾尔自治区 伊犁哈萨克自治州 巩留县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 40, 24, 100, N'巩留镇'),
	(65, 40, 24, 101, N'阿克吐别克镇'),
	(65, 40, 24, 102, N'库尔德宁镇'),
	(65, 40, 24, 103, N'东买里镇'),
	(65, 40, 24, 104, N'阿尕尔森镇'),
	(65, 40, 24, 201, N'吉尔格郎乡'),
	(65, 40, 24, 204, N'塔斯托别乡'),
	(65, 40, 24, 205, N'提克阿热克乡');

/* 新疆维吾尔自治区 伊犁哈萨克自治州 新源县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 40, 25, 100, N'新源镇'),
	(65, 40, 25, 101, N'则克台镇'),
	(65, 40, 25, 102, N'阿热勒托别镇'),
	(65, 40, 25, 103, N'塔勒德镇'),
	(65, 40, 25, 104, N'那拉提镇'),
	(65, 40, 25, 105, N'肖尔布拉克镇'),
	(65, 40, 25, 106, N'喀拉布拉镇'),
	(65, 40, 25, 107, N'阿勒玛勒镇'),
	(65, 40, 25, 200, N'别斯托别乡'),
	(65, 40, 25, 201, N'坎苏乡'),
	(65, 40, 25, 204, N'吐尔根乡');

/* 新疆维吾尔自治区 伊犁哈萨克自治州 昭苏县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 40, 26, 100, N'昭苏镇'),
	(65, 40, 26, 101, N'喀夏加尔镇'),
	(65, 40, 26, 102, N'阿克达拉镇'),
	(65, 40, 26, 200, N'洪纳海乡'),
	(65, 40, 26, 201, N'乌尊布拉克乡'),
	(65, 40, 26, 203, N'萨尔阔布乡'),
	(65, 40, 26, 205, N'喀拉苏乡'),
	(65, 40, 26, 206, N'察汗乌苏蒙古族乡'),
	(65, 40, 26, 207, N'夏特柯尔克孜族乡'),
	(65, 40, 26, 208, N'胡松图喀尔逊蒙古族乡');

/* 新疆维吾尔自治区 伊犁哈萨克自治州 特克斯县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 40, 27, 100, N'特克斯镇'),
	(65, 40, 27, 101, N'乔拉克铁热克镇'),
	(65, 40, 27, 102, N'喀拉达拉镇'),
	(65, 40, 27, 103, N'齐勒乌泽克镇'),
	(65, 40, 27, 104, N'喀拉托海镇'),
	(65, 40, 27, 200, N'呼吉尔特蒙古民族乡'),
	(65, 40, 27, 201, N'阔克苏乡'),
	(65, 40, 27, 203, N'阔克铁热克柯尔克孜民族乡');

/* 新疆维吾尔自治区 伊犁哈萨克自治州 尼勒克县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 40, 28, 100, N'尼勒克镇'),
	(65, 40, 28, 200, N'苏布台乡'),
	(65, 40, 28, 201, N'喀拉苏乡'),
	(65, 40, 28, 202, N'加哈乌拉斯台乡'),
	(65, 40, 28, 203, N'尼勒克县乌赞乡'),
	(65, 40, 28, 204, N'科克浩特浩尔蒙古民族乡'),
	(65, 40, 28, 205, N'乌拉斯台乡'),
	(65, 40, 28, 206, N'克令乡'),
	(65, 40, 28, 207, N'喀拉托别乡'),
	(65, 40, 28, 208, N'胡吉尔台乡'),
	(65, 40, 28, 209, N'木斯乡');

/* 新疆维吾尔自治区 塔城地区 塔城市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 42, 01, 001, N'和平街道办事处'),
	(65, 42, 01, 002, N'杜别克街道办事处'),
	(65, 42, 01, 003, N'新城街道办事处'),
	(65, 42, 01, 100, N'二工镇'),
	(65, 42, 01, 101, N'恰夏镇'),
	(65, 42, 01, 200, N'喀拉哈巴克乡'),
	(65, 42, 01, 202, N'阿西尔达斡尔民族乡'),
	(65, 42, 01, 203, N'阿不都拉乡'),
	(65, 42, 01, 204, N'也门勒乡');

/* 新疆维吾尔自治区 塔城地区 乌苏市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 42, 02, 001, N'南苑街道'),
	(65, 42, 02, 002, N'虹桥街道'),
	(65, 42, 02, 003, N'新市区街道'),
	(65, 42, 02, 100, N'白杨沟镇'),
	(65, 42, 02, 101, N'哈图布呼镇'),
	(65, 42, 02, 102, N'皇宫镇'),
	(65, 42, 02, 103, N'车排子镇'),
	(65, 42, 02, 104, N'甘河子镇'),
	(65, 42, 02, 105, N'百泉镇'),
	(65, 42, 02, 106, N'四棵树镇'),
	(65, 42, 02, 107, N'古尔图镇'),
	(65, 42, 02, 108, N'西湖镇'),
	(65, 42, 02, 109, N'西大沟镇'),
	(65, 42, 02, 200, N'八十四户乡'),
	(65, 42, 02, 201, N'夹河子乡'),
	(65, 42, 02, 202, N'九间楼乡'),
	(65, 42, 02, 203, N'石桥乡'),
	(65, 42, 02, 204, N'头台乡'),
	(65, 42, 02, 205, N'吉尔格勒特郭愣蒙古民族乡'),
	(65, 42, 02, 206, N'塔布勒合特蒙古民族乡');

/* 新疆维吾尔自治区 塔城地区 额敏县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 42, 21, 100, N'额敏镇'),
	(65, 42, 21, 101, N'玉什喀拉苏镇'),
	(65, 42, 21, 102, N'杰勒阿尕什镇'),
	(65, 42, 21, 103, N'上户镇'),
	(65, 42, 21, 104, N'玛热勒苏镇'),
	(65, 42, 21, 105, N'喀拉也木勒镇'),
	(65, 42, 21, 200, N'郊区乡'),
	(65, 42, 21, 202, N'额玛勒郭楞蒙古民族乡'),
	(65, 42, 21, 207, N'喇嘛昭乡'),
	(65, 42, 21, 208, N'霍吉尔特蒙古民族乡'),
	(65, 42, 21, 209, N'二道桥乡');

/* 新疆维吾尔自治区 塔城地区 沙湾县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 42, 23, 100, N'三道河子镇'),
	(65, 42, 23, 101, N'四道河子镇'),
	(65, 42, 23, 102, N'老沙湾镇'),
	(65, 42, 23, 103, N'乌兰乌苏镇'),
	(65, 42, 23, 104, N'安集海镇'),
	(65, 42, 23, 105, N'东湾镇'),
	(65, 42, 23, 106, N'西戈壁镇'),
	(65, 42, 23, 107, N'柳毛湾镇'),
	(65, 42, 23, 108, N'金沟河镇'),
	(65, 42, 23, 200, N'商户地乡'),
	(65, 42, 23, 201, N'大泉乡'),
	(65, 42, 23, 202, N'博尔通古乡');

/* 新疆维吾尔自治区 塔城地区 托里县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 42, 24, 100, N'托里镇'),
	(65, 42, 24, 101, N'铁厂沟镇'),
	(65, 42, 24, 102, N'庙尔沟镇'),
	(65, 42, 24, 200, N'多拉特乡'),
	(65, 42, 24, 201, N'乌雪特乡'),
	(65, 42, 24, 202, N'库普乡'),
	(65, 42, 24, 203, N'阿克别里斗乡');

/* 新疆维吾尔自治区 塔城地区 裕民县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 42, 25, 100, N'哈拉布拉镇'),
	(65, 42, 25, 101, N'吉也克镇'),
	(65, 42, 25, 200, N'哈拉布拉乡'),
	(65, 42, 25, 201, N'新地乡'),
	(65, 42, 25, 202, N'阿勒腾也木勒乡'),
	(65, 42, 25, 204, N'江格斯乡');

/* 新疆维吾尔自治区 塔城地区 和布克赛尔蒙古自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 42, 26, 100, N'和布克赛尔镇'),
	(65, 42, 26, 101, N'和什托洛盖镇'),
	(65, 42, 26, 200, N'夏孜盖乡'),
	(65, 42, 26, 201, N'铁布肯乌散乡'),
	(65, 42, 26, 202, N'查干库勒乡'),
	(65, 42, 26, 203, N'巴音傲瓦乡'),
	(65, 42, 26, 204, N'莫特格乡'),
	(65, 42, 26, 205, N'查和特乡');

/* 新疆维吾尔自治区 阿勒泰地区 阿勒泰市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 43, 01, 001, N'金山路办事处'),
	(65, 43, 01, 002, N'解放路办事处'),
	(65, 43, 01, 003, N'团结路办事处'),
	(65, 43, 01, 100, N'北屯镇'),
	(65, 43, 01, 101, N'阿苇滩镇'),
	(65, 43, 01, 102, N'红墩镇'),
	(65, 43, 01, 103, N'切木尔切克镇'),
	(65, 43, 01, 104, N'阿拉哈克镇'),
	(65, 43, 01, 202, N'汗德尕特蒙古族乡'),
	(65, 43, 01, 203, N'拉斯特乡'),
	(65, 43, 01, 204, N'喀拉希力克乡'),
	(65, 43, 01, 205, N'萨尔胡松乡'),
	(65, 43, 01, 206, N'巴里巴盖乡'),
	(65, 43, 01, 207, N'切尔克齐乡');

/* 新疆维吾尔自治区 阿勒泰地区 布尔津县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 43, 21, 100, N'布尔津镇'),
	(65, 43, 21, 101, N'冲乎尔镇'),
	(65, 43, 21, 200, N'窝依莫克乡'),
	(65, 43, 21, 201, N'杜来提乡'),
	(65, 43, 21, 202, N'阔斯特克乡'),
	(65, 43, 21, 204, N'也格孜托别乡'),
	(65, 43, 21, 205, N'禾木哈纳斯蒙古民族乡');

/* 新疆维吾尔自治区 阿勒泰地区 富蕴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 43, 22, 100, N'库额尔齐斯镇'),
	(65, 43, 22, 101, N'可可托海镇'),
	(65, 43, 22, 102, N'恰库尔图镇'),
	(65, 43, 22, 103, N'喀拉通克镇'),
	(65, 43, 22, 104, N'杜热镇'),
	(65, 43, 22, 200, N'吐尔洪乡'),
	(65, 43, 22, 202, N'库尔特乡'),
	(65, 43, 22, 203, N'克孜勒希力克乡'),
	(65, 43, 22, 204, N'铁买克乡'),
	(65, 43, 22, 205, N'喀拉布勒根乡');

/* 新疆维吾尔自治区 阿勒泰地区 福海县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 43, 23, 100, N'福海镇'),
	(65, 43, 23, 101, N'喀拉玛盖镇'),
	(65, 43, 23, 102, N'解特阿热勒镇'),
	(65, 43, 23, 201, N'阔克阿尕什乡'),
	(65, 43, 23, 202, N'齐干吉迭乡'),
	(65, 43, 23, 204, N'阿尔达乡');

/* 新疆维吾尔自治区 阿勒泰地区 哈巴河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 43, 24, 100, N'阿克齐镇'),
	(65, 43, 24, 101, N'萨尔布拉克镇'),
	(65, 43, 24, 102, N'齐巴尔镇'),
	(65, 43, 24, 200, N'萨尔塔木乡'),
	(65, 43, 24, 201, N'加依勒玛乡'),
	(65, 43, 24, 202, N'库勒拜乡'),
	(65, 43, 24, 204, N'铁热克提乡');

/* 新疆维吾尔自治区 阿勒泰地区 青河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 43, 25, 100, N'青河镇'),
	(65, 43, 25, 101, N'塔克什肯镇'),
	(65, 43, 25, 102, N'阿热勒托别镇'),
	(65, 43, 25, 200, N'阿热勒乡'),
	(65, 43, 25, 202, N'萨尔托海乡'),
	(65, 43, 25, 203, N'查干郭勒乡'),
	(65, 43, 25, 204, N'阿尕什敖包乡');

/* 新疆维吾尔自治区 阿勒泰地区 吉木乃县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 43, 26, 100, N'托普铁热克镇'),
	(65, 43, 26, 101, N'吉木乃镇'),
	(65, 43, 26, 102, N'喀尔交镇'),
	(65, 43, 26, 200, N'托普铁热克乡'),
	(65, 43, 26, 201, N'托斯特乡'),
	(65, 43, 26, 202, N'恰勒什海乡'),
	(65, 43, 26, 204, N'别斯铁热克乡');

/* 新疆维吾尔自治区 自治区直辖县级行政区划 石河子市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 90, 01, 001, N'新城街道办事处'),
	(65, 90, 01, 002, N'向阳街道办事处'),
	(65, 90, 01, 003, N'红山街道办事处'),
	(65, 90, 01, 004, N'老街街道办事处'),
	(65, 90, 01, 005, N'东城街道办事处'),
	(65, 90, 01, 100, N'北泉镇'),
	(65, 90, 01, 101, N'石河子镇');

/* 新疆维吾尔自治区 自治区直辖县级行政区划 阿拉尔市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 90, 02, 001, N'金银川路街道办事处'),
	(65, 90, 02, 002, N'幸福路街道办事处'),
	(65, 90, 02, 003, N'青松路街道办事处'),
	(65, 90, 02, 004, N'南口街道办事处'),
	(65, 90, 02, 200, N'托喀依乡');

/* 新疆维吾尔自治区 自治区直辖县级行政区划 图木舒克市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 90, 03, 001, N'齐干却勒街道办事处'),
	(65, 90, 03, 002, N'前海街道办事处'),
	(65, 90, 03, 003, N'永安坝街道办事处');

/* 新疆维吾尔自治区 自治区直辖县级行政区划 五家渠市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(65, 90, 04, 001, N'军垦路街道办事处'),
	(65, 90, 04, 002, N'青湖路街道办事处'),
	(65, 90, 04, 003, N'人民路街道办事处');


/* 西藏自治区 拉萨市 城关区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 01, 02, 002, N'八廓街道办事处'),
	(54, 01, 02, 003, N'吉日街道办事处'),
	(54, 01, 02, 004, N'吉崩岗街道办事处'),
	(54, 01, 02, 005, N'扎细街道办事处'),
	(54, 01, 02, 006, N'公德林街道办事处'),
	(54, 01, 02, 007, N'嘎玛贡桑街道办事处'),
	(54, 01, 02, 008, N'两岛街道办事处'),
	(54, 01, 02, 009, N'金珠西路街道办事处'),
	(54, 01, 02, 200, N'蔡公堂乡'),
	(54, 01, 02, 201, N'纳金乡'),
	(54, 01, 02, 202, N'娘热乡'),
	(54, 01, 02, 203, N'夺底乡');

/* 西藏自治区 拉萨市 林周县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 01, 21, 100, N'甘丹曲果镇'),
	(54, 01, 21, 200, N'春堆乡'),
	(54, 01, 21, 201, N'松盘乡'),
	(54, 01, 21, 202, N'强嘎乡'),
	(54, 01, 21, 203, N'卡孜乡'),
	(54, 01, 21, 204, N'边交林乡'),
	(54, 01, 21, 205, N'江热夏乡'),
	(54, 01, 21, 206, N'阿朗乡'),
	(54, 01, 21, 207, N'唐古乡'),
	(54, 01, 21, 208, N'旁多乡');

/* 西藏自治区 拉萨市 当雄县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 01, 22, 100, N'当曲卡镇'),
	(54, 01, 22, 101, N'羊八井镇'),
	(54, 01, 22, 200, N'格达乡'),
	(54, 01, 22, 201, N'宁中乡'),
	(54, 01, 22, 202, N'公塘乡'),
	(54, 01, 22, 203, N'龙仁乡'),
	(54, 01, 22, 204, N'乌玛塘乡'),
	(54, 01, 22, 205, N'纳木湖乡');

/* 西藏自治区 拉萨市 尼木县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 01, 23, 100, N'塔荣镇'),
	(54, 01, 23, 200, N'麻江乡'),
	(54, 01, 23, 201, N'普松乡'),
	(54, 01, 23, 202, N'卡如乡'),
	(54, 01, 23, 203, N'尼木乡'),
	(54, 01, 23, 204, N'续迈乡'),
	(54, 01, 23, 205, N'帕古乡'),
	(54, 01, 23, 206, N'吞巴乡');

/* 西藏自治区 拉萨市 曲水县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 01, 24, 100, N'曲水镇'),
	(54, 01, 24, 200, N'达嘎乡'),
	(54, 01, 24, 201, N'才纳乡'),
	(54, 01, 24, 202, N'南木乡'),
	(54, 01, 24, 203, N'聂当乡'),
	(54, 01, 24, 204, N'茶巴拉乡');

/* 西藏自治区 拉萨市 堆龙德庆县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 01, 25, 100, N'东嘎镇'),
	(54, 01, 25, 101, N'乃琼镇'),
	(54, 01, 25, 200, N'羊达乡'),
	(54, 01, 25, 201, N'古荣乡'),
	(54, 01, 25, 202, N'柳梧乡'),
	(54, 01, 25, 203, N'马乡'),
	(54, 01, 25, 204, N'德庆乡');

/* 西藏自治区 拉萨市 达孜县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 01, 26, 100, N'德庆镇'),
	(54, 01, 26, 200, N'塔杰乡'),
	(54, 01, 26, 201, N'章多乡'),
	(54, 01, 26, 202, N'唐嘎乡'),
	(54, 01, 26, 203, N'雪乡'),
	(54, 01, 26, 204, N'帮堆乡');

/* 西藏自治区 拉萨市 墨竹工卡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 01, 27, 100, N'工卡镇'),
	(54, 01, 27, 200, N'扎雪乡'),
	(54, 01, 27, 201, N'门巴乡'),
	(54, 01, 27, 202, N'扎西岗乡'),
	(54, 01, 27, 203, N'日多乡'),
	(54, 01, 27, 204, N'尼玛江热乡'),
	(54, 01, 27, 205, N'甲玛乡'),
	(54, 01, 27, 206, N'唐加乡');

/* 西藏自治区 日喀则市 桑珠孜区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 02, 001, N'城北办事处'),
	(54, 02, 02, 002, N'城南办事处'),
	(54, 02, 02, 200, N'曲美乡'),
	(54, 02, 02, 201, N'聂日雄乡'),
	(54, 02, 02, 202, N'曲布雄乡'),
	(54, 02, 02, 203, N'联乡'),
	(54, 02, 02, 204, N'甲措雄乡'),
	(54, 02, 02, 205, N'纳尔乡'),
	(54, 02, 02, 206, N'年木乡'),
	(54, 02, 02, 207, N'东嘎乡'),
	(54, 02, 02, 208, N'边雄乡'),
	(54, 02, 02, 209, N'江当乡');

/* 西藏自治区 日喀则市 南木林县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 21, 100, N'南木林镇'),
	(54, 02, 21, 200, N'普当乡'),
	(54, 02, 21, 201, N'仁堆乡'),
	(54, 02, 21, 202, N'拉布普乡'),
	(54, 02, 21, 203, N'多角乡'),
	(54, 02, 21, 204, N'卡孜乡'),
	(54, 02, 21, 205, N'土布加乡'),
	(54, 02, 21, 206, N'艾玛乡'),
	(54, 02, 21, 207, N'奴玛乡'),
	(54, 02, 21, 208, N'达孜乡'),
	(54, 02, 21, 209, N'索金乡'),
	(54, 02, 21, 210, N'茶尔乡'),
	(54, 02, 21, 211, N'秋木乡'),
	(54, 02, 21, 212, N'达那乡'),
	(54, 02, 21, 213, N'芒热乡'),
	(54, 02, 21, 214, N'热当乡'),
	(54, 02, 21, 215, N'甲措乡');

/* 西藏自治区 日喀则市 江孜县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 22, 100, N'江孜镇'),
	(54, 02, 22, 200, N'纳如乡'),
	(54, 02, 22, 201, N'卡麦乡'),
	(54, 02, 22, 202, N'卡堆乡'),
	(54, 02, 22, 203, N'藏改乡'),
	(54, 02, 22, 204, N'日朗乡'),
	(54, 02, 22, 205, N'达孜乡'),
	(54, 02, 22, 206, N'热索乡'),
	(54, 02, 22, 207, N'重孜乡'),
	(54, 02, 22, 208, N'龙马乡'),
	(54, 02, 22, 209, N'紫金乡'),
	(54, 02, 22, 210, N'江热乡'),
	(54, 02, 22, 211, N'年堆乡'),
	(54, 02, 22, 212, N'康卓乡'),
	(54, 02, 22, 213, N'金嘎乡'),
	(54, 02, 22, 214, N'日星乡'),
	(54, 02, 22, 215, N'热龙乡'),
	(54, 02, 22, 216, N'车仁乡'),
	(54, 02, 22, 217, N'加克西乡');

/* 西藏自治区 日喀则市 定日县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 23, 100, N'协格尔镇'),
	(54, 02, 23, 101, N'岗嘎镇'),
	(54, 02, 23, 200, N'加措乡'),
	(54, 02, 23, 201, N'绒辖乡'),
	(54, 02, 23, 202, N'尼辖乡'),
	(54, 02, 23, 203, N'盆吉乡'),
	(54, 02, 23, 204, N'曲当乡'),
	(54, 02, 23, 205, N'扎果乡'),
	(54, 02, 23, 206, N'扎西宗乡'),
	(54, 02, 23, 207, N'长所乡'),
	(54, 02, 23, 208, N'曲洛乡'),
	(54, 02, 23, 209, N'措果乡'),
	(54, 02, 23, 210, N'克玛乡');

/* 西藏自治区 日喀则市 萨迦县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 24, 100, N'萨迦镇'),
	(54, 02, 24, 101, N'吉定镇'),
	(54, 02, 24, 200, N'木拉乡'),
	(54, 02, 24, 201, N'查荣乡'),
	(54, 02, 24, 202, N'拉洛乡'),
	(54, 02, 24, 203, N'赛乡'),
	(54, 02, 24, 204, N'扯休乡'),
	(54, 02, 24, 205, N'扎西岗乡'),
	(54, 02, 24, 206, N'雄玛乡'),
	(54, 02, 24, 207, N'麻布加乡'),
	(54, 02, 24, 208, N'雄麦乡');

/* 西藏自治区 日喀则市 拉孜县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 25, 100, N'曲下镇'),
	(54, 02, 25, 101, N'拉孜镇'),
	(54, 02, 25, 200, N'扎西宗乡'),
	(54, 02, 25, 201, N'曲玛乡'),
	(54, 02, 25, 202, N'彭措林乡'),
	(54, 02, 25, 203, N'扎西岗乡'),
	(54, 02, 25, 204, N'柳乡'),
	(54, 02, 25, 205, N'热萨乡'),
	(54, 02, 25, 206, N'芒普乡'),
	(54, 02, 25, 207, N'锡钦乡'),
	(54, 02, 25, 208, N'查务乡');

/* 西藏自治区 日喀则市 昂仁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 26, 100, N'卡嘎镇'),
	(54, 02, 26, 101, N'桑桑镇'),
	(54, 02, 26, 200, N'切热乡'),
	(54, 02, 26, 201, N'秋窝乡'),
	(54, 02, 26, 202, N'达居乡'),
	(54, 02, 26, 203, N'亚木乡'),
	(54, 02, 26, 204, N'贡久布乡'),
	(54, 02, 26, 205, N'达若乡'),
	(54, 02, 26, 206, N'措迈乡'),
	(54, 02, 26, 207, N'尼果乡'),
	(54, 02, 26, 208, N'孔隆乡'),
	(54, 02, 26, 209, N'如萨乡'),
	(54, 02, 26, 210, N'阿木雄乡'),
	(54, 02, 26, 211, N'查孜乡'),
	(54, 02, 26, 212, N'日吾其乡'),
	(54, 02, 26, 213, N'多白乡'),
	(54, 02, 26, 214, N'雄巴乡');

/* 西藏自治区 日喀则市 谢通门县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 27, 100, N'卡嘎镇'),
	(54, 02, 27, 200, N'达木夏乡'),
	(54, 02, 27, 201, N'查布乡'),
	(54, 02, 27, 202, N'春哲乡'),
	(54, 02, 27, 203, N'则许乡'),
	(54, 02, 27, 204, N'娘热乡'),
	(54, 02, 27, 205, N'措布西乡'),
	(54, 02, 27, 206, N'纳当乡'),
	(54, 02, 27, 207, N'青都乡'),
	(54, 02, 27, 208, N'切琼乡'),
	(54, 02, 27, 209, N'美巴切勤乡'),
	(54, 02, 27, 210, N'列巴乡'),
	(54, 02, 27, 211, N'塔定乡'),
	(54, 02, 27, 212, N'荣玛乡'),
	(54, 02, 27, 213, N'通门乡'),
	(54, 02, 27, 214, N'仁钦则乡'),
	(54, 02, 27, 215, N'达那普乡'),
	(54, 02, 27, 216, N'达那塔乡'),
	(54, 02, 27, 217, N'南木切乡');

/* 西藏自治区 日喀则市 白朗县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 28, 100, N'洛江镇'),
	(54, 02, 28, 101, N'嘎东镇'),
	(54, 02, 28, 200, N'巴扎乡'),
	(54, 02, 28, 201, N'玛乡'),
	(54, 02, 28, 202, N'旺丹乡'),
	(54, 02, 28, 203, N'曲奴乡'),
	(54, 02, 28, 204, N'杜琼乡'),
	(54, 02, 28, 205, N'强堆乡'),
	(54, 02, 28, 206, N'嘎普乡'),
	(54, 02, 28, 207, N'者下乡'),
	(54, 02, 28, 208, N'东喜乡');

/* 西藏自治区 日喀则市 仁布县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 29, 100, N'德吉林镇'),
	(54, 02, 29, 200, N'帕当乡'),
	(54, 02, 29, 201, N'康雄乡'),
	(54, 02, 29, 202, N'普松乡'),
	(54, 02, 29, 203, N'然巴乡'),
	(54, 02, 29, 204, N'茶巴乡'),
	(54, 02, 29, 205, N'切洼乡'),
	(54, 02, 29, 206, N'母乡'),
	(54, 02, 29, 207, N'仁布乡');

/* 西藏自治区 日喀则市 康马县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 30, 100, N'康马镇'),
	(54, 02, 30, 200, N'涅如麦乡'),
	(54, 02, 30, 201, N'涅如堆乡'),
	(54, 02, 30, 202, N'嘎拉乡'),
	(54, 02, 30, 203, N'萨玛达乡'),
	(54, 02, 30, 204, N'康如乡'),
	(54, 02, 30, 205, N'少岗乡'),
	(54, 02, 30, 206, N'南尼乡'),
	(54, 02, 30, 207, N'雄章乡');

/* 西藏自治区 日喀则市 定结县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 31, 100, N'江嘎镇'),
	(54, 02, 31, 101, N'陈塘镇'),
	(54, 02, 31, 102, N'日屋镇'),
	(54, 02, 31, 200, N'确布乡'),
	(54, 02, 31, 201, N'扎西岗乡'),
	(54, 02, 31, 202, N'多布扎乡'),
	(54, 02, 31, 203, N'定结乡'),
	(54, 02, 31, 204, N'琼孜乡'),
	(54, 02, 31, 205, N'萨尔乡'),
	(54, 02, 31, 206, N'郭加乡');

/* 西藏自治区 日喀则市 仲巴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 32, 100, N'帕羊镇'),
	(54, 02, 32, 200, N'拉让乡'),
	(54, 02, 32, 201, N'帕江乡'),
	(54, 02, 32, 202, N'仁多乡'),
	(54, 02, 32, 203, N'吉玛乡'),
	(54, 02, 32, 204, N'隆格尔乡'),
	(54, 02, 32, 205, N'霍尔巴乡'),
	(54, 02, 32, 206, N'吉拉乡'),
	(54, 02, 32, 207, N'纳久乡'),
	(54, 02, 32, 208, N'偏吉乡'),
	(54, 02, 32, 209, N'布多乡'),
	(54, 02, 32, 210, N'亚热乡'),
	(54, 02, 32, 211, N'琼果乡');

/* 西藏自治区 日喀则市 亚东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 33, 100, N'下司马镇'),
	(54, 02, 33, 101, N'帕里镇'),
	(54, 02, 33, 200, N'下亚东乡'),
	(54, 02, 33, 201, N'堆纳乡'),
	(54, 02, 33, 202, N'上亚东乡'),
	(54, 02, 33, 203, N'吉汝乡'),
	(54, 02, 33, 204, N'康布乡');

/* 西藏自治区 日喀则市 吉隆县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 34, 100, N'宗嘎镇'),
	(54, 02, 34, 101, N'吉隆镇'),
	(54, 02, 34, 200, N'折巴乡'),
	(54, 02, 34, 201, N'贡当乡'),
	(54, 02, 34, 202, N'差那乡'),
	(54, 02, 34, 203, N'萨勒乡');

/* 西藏自治区 日喀则市 聂拉木县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 35, 100, N'聂拉木镇'),
	(54, 02, 35, 101, N'樟木镇'),
	(54, 02, 35, 200, N'亚来乡'),
	(54, 02, 35, 201, N'锁作乡'),
	(54, 02, 35, 202, N'门布乡'),
	(54, 02, 35, 203, N'乃龙乡'),
	(54, 02, 35, 204, N'波绒乡');

/* 西藏自治区 日喀则市 萨嘎县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 36, 100, N'加加镇'),
	(54, 02, 36, 200, N'夏如乡'),
	(54, 02, 36, 201, N'旦嘎乡'),
	(54, 02, 36, 202, N'达吉岭乡'),
	(54, 02, 36, 203, N'如角乡'),
	(54, 02, 36, 204, N'拉藏乡'),
	(54, 02, 36, 205, N'雄如乡'),
	(54, 02, 36, 206, N'昌果乡');

/* 西藏自治区 日喀则市 岗巴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 02, 37, 100, N'岗巴镇'),
	(54, 02, 37, 200, N'昌龙乡'),
	(54, 02, 37, 201, N'直克乡'),
	(54, 02, 37, 202, N'孔玛乡'),
	(54, 02, 37, 203, N'龙中乡');

/* 西藏自治区 昌都市 卡若区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 03, 02, 100, N'城关镇'),
	(54, 03, 02, 101, N'俄洛镇'),
	(54, 03, 02, 102, N'卡若镇'),
	(54, 03, 02, 200, N'芒达乡'),
	(54, 03, 02, 201, N'沙贡乡'),
	(54, 03, 02, 202, N'若巴乡'),
	(54, 03, 02, 203, N'埃西乡'),
	(54, 03, 02, 204, N'如意乡'),
	(54, 03, 02, 205, N'日通乡'),
	(54, 03, 02, 206, N'柴维乡'),
	(54, 03, 02, 207, N'妥坝乡'),
	(54, 03, 02, 208, N'嘎玛乡'),
	(54, 03, 02, 209, N'面达乡'),
	(54, 03, 02, 210, N'约巴乡'),
	(54, 03, 02, 211, N'拉多乡');

/* 西藏自治区 昌都市 江达县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 03, 21, 100, N'江达镇'),
	(54, 03, 21, 101, N'岗托镇'),
	(54, 03, 21, 200, N'邓柯乡'),
	(54, 03, 21, 201, N'岩比乡'),
	(54, 03, 21, 202, N'卡贡乡'),
	(54, 03, 21, 203, N'生达乡'),
	(54, 03, 21, 204, N'娘西乡'),
	(54, 03, 21, 205, N'字呷乡'),
	(54, 03, 21, 206, N'青泥洞乡'),
	(54, 03, 21, 207, N'汪布顶乡'),
	(54, 03, 21, 208, N'德登乡'),
	(54, 03, 21, 209, N'同普乡'),
	(54, 03, 21, 210, N'波罗乡');

/* 西藏自治区 昌都市 贡觉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 03, 22, 100, N'莫洛镇'),
	(54, 03, 22, 200, N'敏都乡'),
	(54, 03, 22, 201, N'则巴乡'),
	(54, 03, 22, 202, N'罗麦乡'),
	(54, 03, 22, 203, N'沙东乡'),
	(54, 03, 22, 204, N'克日乡'),
	(54, 03, 22, 205, N'木协乡'),
	(54, 03, 22, 206, N'阿旺乡'),
	(54, 03, 22, 207, N'拉妥乡'),
	(54, 03, 22, 208, N'雄松乡'),
	(54, 03, 22, 209, N'哈加乡'),
	(54, 03, 22, 210, N'相皮乡');

/* 西藏自治区 昌都市 类乌齐县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 03, 23, 100, N'桑多镇'),
	(54, 03, 23, 101, N'类乌齐镇'),
	(54, 03, 23, 200, N'吉多乡'),
	(54, 03, 23, 201, N'岗色乡'),
	(54, 03, 23, 202, N'宾达乡'),
	(54, 03, 23, 203, N'卡玛多乡'),
	(54, 03, 23, 204, N'尚卡乡'),
	(54, 03, 23, 205, N'伊日乡'),
	(54, 03, 23, 206, N'甲桑卡乡'),
	(54, 03, 23, 207, N'长毛岭乡');

/* 西藏自治区 昌都市 丁青县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 03, 24, 100, N'丁青镇'),
	(54, 03, 24, 101, N'尺犊镇'),
	(54, 03, 24, 200, N'木塔乡'),
	(54, 03, 24, 201, N'布塔乡'),
	(54, 03, 24, 202, N'巴达乡'),
	(54, 03, 24, 203, N'甘岩乡'),
	(54, 03, 24, 204, N'嘎塔乡'),
	(54, 03, 24, 205, N'色扎乡'),
	(54, 03, 24, 206, N'协雄乡'),
	(54, 03, 24, 207, N'桑多乡'),
	(54, 03, 24, 208, N'当堆乡'),
	(54, 03, 24, 209, N'沙贡乡'),
	(54, 03, 24, 210, N'觉恩乡');

/* 西藏自治区 昌都市 察雅县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 03, 25, 100, N'烟多镇'),
	(54, 03, 25, 101, N'吉塘镇'),
	(54, 03, 25, 102, N'香堆镇'),
	(54, 03, 25, 200, N'宗沙乡'),
	(54, 03, 25, 201, N'肯通乡'),
	(54, 03, 25, 202, N'扩达乡'),
	(54, 03, 25, 203, N'新卡乡'),
	(54, 03, 25, 204, N'王卡乡'),
	(54, 03, 25, 205, N'阿孜乡'),
	(54, 03, 25, 206, N'巴日乡'),
	(54, 03, 25, 207, N'荣周乡'),
	(54, 03, 25, 208, N'卡贡乡'),
	(54, 03, 25, 209, N'察拉乡');

/* 西藏自治区 昌都市 八宿县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 03, 26, 100, N'白玛镇'),
	(54, 03, 26, 101, N'然乌镇'),
	(54, 03, 26, 102, N'帮达镇'),
	(54, 03, 26, 103, N'同卡镇'),
	(54, 03, 26, 200, N'林卡乡'),
	(54, 03, 26, 201, N'夏里乡'),
	(54, 03, 26, 202, N'拥乡'),
	(54, 03, 26, 203, N'瓦乡'),
	(54, 03, 26, 204, N'吉达乡'),
	(54, 03, 26, 205, N'卡瓦白庆乡'),
	(54, 03, 26, 206, N'集中乡'),
	(54, 03, 26, 207, N'益庆乡'),
	(54, 03, 26, 208, N'拉根乡'),
	(54, 03, 26, 209, N'郭庆乡');

/* 西藏自治区 昌都市 左贡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 03, 27, 100, N'旺达镇'),
	(54, 03, 27, 101, N'田妥镇'),
	(54, 03, 27, 102, N'扎玉镇'),
	(54, 03, 27, 200, N'东坝乡'),
	(54, 03, 27, 201, N'中林卡乡'),
	(54, 03, 27, 202, N'美玉乡'),
	(54, 03, 27, 203, N'下林卡乡'),
	(54, 03, 27, 204, N'碧土乡'),
	(54, 03, 27, 205, N'仁果乡'),
	(54, 03, 27, 206, N'绕金乡');

/* 西藏自治区 昌都市 芒康县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 03, 28, 100, N'嘎托镇'),
	(54, 03, 28, 101, N'如美镇'),
	(54, 03, 28, 200, N'曲孜卡乡'),
	(54, 03, 28, 201, N'木许乡'),
	(54, 03, 28, 202, N'纳西民族乡'),
	(54, 03, 28, 203, N'朱巴龙乡'),
	(54, 03, 28, 204, N'曲登乡'),
	(54, 03, 28, 205, N'徐中乡'),
	(54, 03, 28, 206, N'帮达乡'),
	(54, 03, 28, 207, N'戈波乡'),
	(54, 03, 28, 208, N'洛尼乡'),
	(54, 03, 28, 209, N'措瓦乡'),
	(54, 03, 28, 210, N'昂多乡'),
	(54, 03, 28, 211, N'宗西乡'),
	(54, 03, 28, 212, N'莽岭乡'),
	(54, 03, 28, 213, N'索多西乡');

/* 西藏自治区 昌都市 洛隆县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 03, 29, 100, N'孜托镇'),
	(54, 03, 29, 101, N'硕督镇'),
	(54, 03, 29, 102, N'康沙镇'),
	(54, 03, 29, 103, N'马利镇'),
	(54, 03, 29, 200, N'玉西乡'),
	(54, 03, 29, 201, N'新荣乡'),
	(54, 03, 29, 202, N'达龙乡'),
	(54, 03, 29, 203, N'腊久乡'),
	(54, 03, 29, 204, N'俄西乡'),
	(54, 03, 29, 205, N'中亦乡'),
	(54, 03, 29, 206, N'白达乡');

/* 西藏自治区 昌都市 边坝县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 03, 30, 100, N'草卡镇'),
	(54, 03, 30, 101, N'边坝镇'),
	(54, 03, 30, 200, N'马武乡'),
	(54, 03, 30, 201, N'热玉乡'),
	(54, 03, 30, 202, N'尼木乡'),
	(54, 03, 30, 203, N'沙丁乡'),
	(54, 03, 30, 204, N'金岭乡'),
	(54, 03, 30, 205, N'加贡乡'),
	(54, 03, 30, 206, N'马秀乡'),
	(54, 03, 30, 207, N'都瓦乡'),
	(54, 03, 30, 208, N'拉孜乡');

/* 西藏自治区 林芝市 巴宜区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 04, 02, 100, N'林芝镇'),
	(54, 04, 02, 101, N'百巴镇'),
	(54, 04, 02, 102, N'八一镇'),
	(54, 04, 02, 103, N'鲁朗镇'),
	(54, 04, 02, 200, N'更章门巴民族乡'),
	(54, 04, 02, 201, N'布久乡'),
	(54, 04, 02, 202, N'米瑞乡');

/* 西藏自治区 林芝市 工布江达县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 04, 21, 100, N'工布江达镇'),
	(54, 04, 21, 101, N'金达镇'),
	(54, 04, 21, 102, N'巴河镇'),
	(54, 04, 21, 200, N'错高乡'),
	(54, 04, 21, 201, N'朱拉乡'),
	(54, 04, 21, 202, N'仲莎乡'),
	(54, 04, 21, 203, N'江达乡'),
	(54, 04, 21, 204, N'娘蒲乡'),
	(54, 04, 21, 205, N'加兴乡');

/* 西藏自治区 林芝市 米林县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 04, 22, 100, N'米林镇'),
	(54, 04, 22, 101, N'卧龙镇'),
	(54, 04, 22, 102, N'派镇'),
	(54, 04, 22, 200, N'丹娘乡'),
	(54, 04, 22, 201, N'南伊珞巴民族乡'),
	(54, 04, 22, 202, N'羌纳乡'),
	(54, 04, 22, 203, N'里龙乡'),
	(54, 04, 22, 204, N'扎西绕登乡');

/* 西藏自治区 林芝市 墨脱县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 04, 23, 100, N'墨脱镇'),
	(54, 04, 23, 200, N'甘登乡'),
	(54, 04, 23, 201, N'加热萨乡'),
	(54, 04, 23, 202, N'达木珞巴民族乡'),
	(54, 04, 23, 203, N'帮辛乡'),
	(54, 04, 23, 204, N'格当乡'),
	(54, 04, 23, 205, N'德兴乡'),
	(54, 04, 23, 206, N'背崩乡');

/* 西藏自治区 林芝市 波密县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 04, 24, 100, N'扎木镇'),
	(54, 04, 24, 101, N'倾多镇'),
	(54, 04, 24, 102, N'松宗镇'),
	(54, 04, 24, 200, N'古乡'),
	(54, 04, 24, 201, N'玉许乡'),
	(54, 04, 24, 202, N'多吉乡'),
	(54, 04, 24, 203, N'康玉乡'),
	(54, 04, 24, 204, N'玉普乡'),
	(54, 04, 24, 205, N'易贡乡'),
	(54, 04, 24, 206, N'八盖乡');

/* 西藏自治区 林芝市 察隅县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 04, 25, 100, N'竹瓦根镇'),
	(54, 04, 25, 101, N'上察隅镇'),
	(54, 04, 25, 102, N'下察隅镇'),
	(54, 04, 25, 200, N'古玉乡'),
	(54, 04, 25, 201, N'古拉乡'),
	(54, 04, 25, 202, N'察瓦龙乡');

/* 西藏自治区 林芝市 朗县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 04, 26, 100, N'朗镇'),
	(54, 04, 26, 101, N'仲达镇'),
	(54, 04, 26, 102, N'洞嘎镇'),
	(54, 04, 26, 200, N'金东乡'),
	(54, 04, 26, 201, N'拉多乡'),
	(54, 04, 26, 202, N'登木乡');

/* 西藏自治区 山南地区 乃东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 21, 100, N'泽当镇'),
	(54, 22, 21, 101, N'昌珠镇'),
	(54, 22, 21, 200, N'颇章乡'),
	(54, 22, 21, 201, N'结巴乡'),
	(54, 22, 21, 202, N'多颇章乡'),
	(54, 22, 21, 203, N'索珠乡'),
	(54, 22, 21, 204, N'亚堆乡');

/* 西藏自治区 山南地区 扎囊县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 22, 100, N'扎唐镇'),
	(54, 22, 22, 101, N'桑耶镇'),
	(54, 22, 22, 200, N'阿扎乡'),
	(54, 22, 22, 201, N'扎其乡'),
	(54, 22, 22, 202, N'吉汝乡');

/* 西藏自治区 山南地区 贡嘎县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 23, 100, N'吉雄镇'),
	(54, 22, 23, 101, N'岗堆镇'),
	(54, 22, 23, 102, N'甲竹林镇'),
	(54, 22, 23, 103, N'江塘镇'),
	(54, 22, 23, 104, N'杰德秀镇'),
	(54, 22, 23, 200, N'朗杰学乡'),
	(54, 22, 23, 201, N'昌果乡'),
	(54, 22, 23, 202, N'东拉乡');

/* 西藏自治区 山南地区 桑日县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 24, 100, N'桑日镇'),
	(54, 22, 24, 200, N'增期乡'),
	(54, 22, 24, 201, N'白堆乡'),
	(54, 22, 24, 202, N'绒乡');

/* 西藏自治区 山南地区 琼结县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 25, 100, N'琼结镇'),
	(54, 22, 25, 200, N'拉玉乡'),
	(54, 22, 25, 201, N'下水乡'),
	(54, 22, 25, 202, N'加麻乡');

/* 西藏自治区 山南地区 曲松县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 26, 100, N'曲松镇'),
	(54, 22, 26, 101, N'罗布沙镇'),
	(54, 22, 26, 200, N'邱多江乡'),
	(54, 22, 26, 201, N'堆随乡'),
	(54, 22, 26, 202, N'下江乡');

/* 西藏自治区 山南地区 措美县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 27, 100, N'措美镇'),
	(54, 22, 27, 101, N'哲古镇'),
	(54, 22, 27, 200, N'乃西乡'),
	(54, 22, 27, 201, N'古堆乡');

/* 西藏自治区 山南地区 洛扎县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 28, 100, N'洛扎镇'),
	(54, 22, 28, 101, N'拉康镇'),
	(54, 22, 28, 200, N'生格乡'),
	(54, 22, 28, 201, N'边巴乡'),
	(54, 22, 28, 202, N'扎日乡'),
	(54, 22, 28, 203, N'色乡'),
	(54, 22, 28, 204, N'拉郊乡');

/* 西藏自治区 山南地区 加查县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 29, 100, N'加查镇'),
	(54, 22, 29, 101, N'安绕镇'),
	(54, 22, 29, 200, N'拉绥乡'),
	(54, 22, 29, 201, N'崔久乡'),
	(54, 22, 29, 202, N'坝乡'),
	(54, 22, 29, 203, N'冷达乡'),
	(54, 22, 29, 204, N'洛林乡');

/* 西藏自治区 山南地区 隆子县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 31, 100, N'隆子镇'),
	(54, 22, 31, 101, N'日当镇'),
	(54, 22, 31, 200, N'加玉乡'),
	(54, 22, 31, 201, N'列麦乡'),
	(54, 22, 31, 202, N'热荣乡'),
	(54, 22, 31, 203, N'三安曲林乡'),
	(54, 22, 31, 204, N'准巴乡'),
	(54, 22, 31, 205, N'斗玉珞巴民族乡'),
	(54, 22, 31, 206, N'雪沙乡'),
	(54, 22, 31, 207, N'扎日乡'),
	(54, 22, 31, 208, N'玉麦乡');

/* 西藏自治区 山南地区 错那县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 32, 100, N'错那镇'),
	(54, 22, 32, 200, N'勒门巴民族乡'),
	(54, 22, 32, 201, N'贡日门巴民族乡'),
	(54, 22, 32, 202, N'吉巴门巴民族乡'),
	(54, 22, 32, 203, N'麻玛门巴民族乡'),
	(54, 22, 32, 204, N'库局乡'),
	(54, 22, 32, 205, N'曲卓木乡'),
	(54, 22, 32, 206, N'浪坡乡'),
	(54, 22, 32, 207, N'觉拉乡'),
	(54, 22, 32, 208, N'卡达乡');

/* 西藏自治区 山南地区 浪卡子县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 22, 33, 100, N'浪卡子镇'),
	(54, 22, 33, 101, N'打隆镇'),
	(54, 22, 33, 200, N'张达乡'),
	(54, 22, 33, 201, N'伦布雪乡'),
	(54, 22, 33, 202, N'多却乡'),
	(54, 22, 33, 203, N'普玛江塘乡'),
	(54, 22, 33, 204, N'阿扎乡'),
	(54, 22, 33, 205, N'卡龙乡'),
	(54, 22, 33, 206, N'白地乡'),
	(54, 22, 33, 207, N'卡热乡');

/* 西藏自治区 那曲地区 那曲县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 24, 21, 100, N'那曲镇'),
	(54, 24, 21, 101, N'罗玛镇'),
	(54, 24, 21, 102, N'古露镇'),
	(54, 24, 21, 200, N'香茂乡'),
	(54, 24, 21, 201, N'油恰乡'),
	(54, 24, 21, 202, N'那么切乡'),
	(54, 24, 21, 203, N'孔玛乡'),
	(54, 24, 21, 204, N'达萨乡'),
	(54, 24, 21, 205, N'劳麦乡'),
	(54, 24, 21, 206, N'色雄乡'),
	(54, 24, 21, 207, N'尼玛乡'),
	(54, 24, 21, 208, N'达前乡');

/* 西藏自治区 那曲地区 嘉黎县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 24, 22, 100, N'阿扎镇'),
	(54, 24, 22, 101, N'嘉黎镇'),
	(54, 24, 22, 200, N'鸽群乡'),
	(54, 24, 22, 201, N'藏比乡'),
	(54, 24, 22, 202, N'忠玉乡'),
	(54, 24, 22, 203, N'措多乡'),
	(54, 24, 22, 204, N'措拉乡'),
	(54, 24, 22, 205, N'林堤乡'),
	(54, 24, 22, 206, N'夏玛乡'),
	(54, 24, 22, 207, N'绒多乡');

/* 西藏自治区 那曲地区 比如县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 24, 23, 100, N'比如镇'),
	(54, 24, 23, 101, N'夏曲镇'),
	(54, 24, 23, 200, N'白嘎乡'),
	(54, 24, 23, 201, N'羊秀乡'),
	(54, 24, 23, 202, N'香曲乡'),
	(54, 24, 23, 203, N'达塘乡'),
	(54, 24, 23, 204, N'良曲乡'),
	(54, 24, 23, 205, N'茶曲乡'),
	(54, 24, 23, 206, N'扎拉乡'),
	(54, 24, 23, 207, N'恰则乡');

/* 西藏自治区 那曲地区 聂荣县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 24, 24, 100, N'聂荣镇'),
	(54, 24, 24, 200, N'尼玛乡'),
	(54, 24, 24, 201, N'查当乡'),
	(54, 24, 24, 202, N'当木江乡'),
	(54, 24, 24, 203, N'永曲乡'),
	(54, 24, 24, 204, N'索雄乡'),
	(54, 24, 24, 205, N'白雄乡'),
	(54, 24, 24, 206, N'桑荣乡'),
	(54, 24, 24, 207, N'下曲乡'),
	(54, 24, 24, 208, N'色庆乡');

/* 西藏自治区 那曲地区 安多县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 24, 25, 100, N'扎仁镇'),
	(54, 24, 25, 101, N'雁石坪镇'),
	(54, 24, 25, 102, N'强玛镇'),
	(54, 24, 25, 103, N'帕那镇'),
	(54, 24, 25, 200, N'措玛乡'),
	(54, 24, 25, 201, N'滩堆乡'),
	(54, 24, 25, 202, N'扎曲乡'),
	(54, 24, 25, 203, N'岗尼乡'),
	(54, 24, 25, 204, N'玛曲乡'),
	(54, 24, 25, 205, N'色务乡'),
	(54, 24, 25, 206, N'玛荣乡'),
	(54, 24, 25, 207, N'多玛乡'),
	(54, 24, 25, 208, N'帮爱乡');

/* 西藏自治区 那曲地区 申扎县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 24, 26, 100, N'申扎镇'),
	(54, 24, 26, 101, N'雄梅镇'),
	(54, 24, 26, 200, N'马跃乡'),
	(54, 24, 26, 201, N'买巴乡'),
	(54, 24, 26, 202, N'塔尔玛乡'),
	(54, 24, 26, 203, N'下过乡'),
	(54, 24, 26, 204, N'卡乡'),
	(54, 24, 26, 205, N'巴扎乡');

/* 西藏自治区 那曲地区 索县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 24, 27, 100, N'亚拉镇'),
	(54, 24, 27, 101, N'荣布镇'),
	(54, 24, 27, 200, N'若达乡'),
	(54, 24, 27, 201, N'热瓦乡'),
	(54, 24, 27, 202, N'西昌乡'),
	(54, 24, 27, 203, N'嘎木乡'),
	(54, 24, 27, 204, N'赤多乡'),
	(54, 24, 27, 205, N'嘎美乡'),
	(54, 24, 27, 206, N'加勤乡'),
	(54, 24, 27, 207, N'江达乡');

/* 西藏自治区 那曲地区 班戈县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 24, 28, 100, N'普保镇'),
	(54, 24, 28, 101, N'北拉镇'),
	(54, 24, 28, 102, N'佳琼镇'),
	(54, 24, 28, 103, N'德庆镇'),
	(54, 24, 28, 200, N'马前乡'),
	(54, 24, 28, 201, N'门当乡'),
	(54, 24, 28, 202, N'保吉乡'),
	(54, 24, 28, 203, N'青龙乡'),
	(54, 24, 28, 204, N'新吉乡'),
	(54, 24, 28, 205, N'尼玛乡');

/* 西藏自治区 那曲地区 巴青县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 24, 29, 100, N'雅安镇'),
	(54, 24, 29, 101, N'拉西镇'),
	(54, 24, 29, 102, N'杂色镇'),
	(54, 24, 29, 200, N'江绵乡'),
	(54, 24, 29, 201, N'岗切乡'),
	(54, 24, 29, 202, N'巴青乡'),
	(54, 24, 29, 203, N'阿秀乡'),
	(54, 24, 29, 204, N'玛如乡'),
	(54, 24, 29, 205, N'本塔乡'),
	(54, 24, 29, 206, N'贡日乡');

/* 西藏自治区 那曲地区 尼玛县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 24, 30, 100, N'尼玛镇'),
	(54, 24, 30, 200, N'文布乡'),
	(54, 24, 30, 201, N'中仓乡'),
	(54, 24, 30, 202, N'卓瓦乡'),
	(54, 24, 30, 203, N'卓尼乡'),
	(54, 24, 30, 204, N'吉瓦乡'),
	(54, 24, 30, 205, N'甲谷乡'),
	(54, 24, 30, 206, N'阿索乡'),
	(54, 24, 30, 207, N'俄久乡'),
	(54, 24, 30, 208, N'荣玛乡'),
	(54, 24, 30, 209, N'达果乡'),
	(54, 24, 30, 210, N'申亚乡'),
	(54, 24, 30, 211, N'来多乡'),
	(54, 24, 30, 212, N'军仓乡');

/* 西藏自治区 那曲地区 双湖县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 24, 31, 100, N'措折罗玛镇'),
	(54, 24, 31, 200, N'协德乡'),
	(54, 24, 31, 201, N'雅曲乡'),
	(54, 24, 31, 202, N'嘎措乡'),
	(54, 24, 31, 203, N'措折强玛乡'),
	(54, 24, 31, 204, N'多玛乡'),
	(54, 24, 31, 205, N'巴岭乡');

/* 西藏自治区 阿里地区 普兰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 25, 21, 100, N'普兰镇'),
	(54, 25, 21, 200, N'巴嘎乡'),
	(54, 25, 21, 201, N'霍尔乡');

/* 西藏自治区 阿里地区 札达县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 25, 22, 100, N'托林镇'),
	(54, 25, 22, 200, N'萨让乡'),
	(54, 25, 22, 201, N'达巴乡'),
	(54, 25, 22, 202, N'底雅乡'),
	(54, 25, 22, 203, N'香孜乡'),
	(54, 25, 22, 204, N'曲松乡'),
	(54, 25, 22, 205, N'楚鲁松杰乡');

/* 西藏自治区 阿里地区 噶尔县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 25, 23, 100, N'狮泉河镇'),
	(54, 25, 23, 200, N'昆莎乡'),
	(54, 25, 23, 201, N'左左乡'),
	(54, 25, 23, 202, N'门士乡'),
	(54, 25, 23, 203, N'扎西岗乡');

/* 西藏自治区 阿里地区 日土县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 25, 24, 100, N'日土镇'),
	(54, 25, 24, 200, N'热帮乡'),
	(54, 25, 24, 201, N'日松乡'),
	(54, 25, 24, 202, N'东汝乡'),
	(54, 25, 24, 203, N'多玛乡');

/* 西藏自治区 阿里地区 革吉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 25, 25, 100, N'革吉镇'),
	(54, 25, 25, 200, N'雄巴乡'),
	(54, 25, 25, 201, N'亚热乡'),
	(54, 25, 25, 202, N'盐湖乡'),
	(54, 25, 25, 203, N'文布当桑乡');

/* 西藏自治区 阿里地区 改则县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 25, 26, 100, N'改则镇'),
	(54, 25, 26, 200, N'物玛乡'),
	(54, 25, 26, 201, N'先遣乡'),
	(54, 25, 26, 202, N'麻米乡'),
	(54, 25, 26, 203, N'洞措乡'),
	(54, 25, 26, 204, N'古姆乡'),
	(54, 25, 26, 205, N'察布乡');

/* 西藏自治区 阿里地区 措勤县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(54, 25, 27, 100, N'措勤镇'),
	(54, 25, 27, 200, N'磁石乡'),
	(54, 25, 27, 201, N'曲洛乡'),
	(54, 25, 27, 202, N'江让乡'),
	(54, 25, 27, 203, N'达雄乡');
