SET NOCOUNT ON;
SET XACT_ABORT ON;

/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

/*
 * 《2015年统计用区划代码和城乡划分代码（截止2015年09月30日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2015/index.html）
 * 数据范围：江苏省(32)、浙江省(33)、安徽省(34)。
 */

/* 江苏省，南京市，玄武区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 01, 02, 002, N'梅园新村街道'),
	(32, 01, 02, 003, N'新街口街道'),
	(32, 01, 02, 005, N'玄武门街道'),
	(32, 01, 02, 007, N'锁金村街道'),
	(32, 01, 02, 008, N'红山街道'),
	(32, 01, 02, 009, N'孝陵卫街道'),
	(32, 01, 02, 010, N'玄武湖街道');

/* 江苏省，南京市，秦淮区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 01, 04, 001, N'秦虹街道'),
	(32, 01, 04, 002, N'夫子庙街道'),
	(32, 01, 04, 003, N'红花街道'),
	(32, 01, 04, 004, N'双塘街道'),
	(32, 01, 04, 005, N'中华门街道'),
	(32, 01, 04, 006, N'五老村街道'),
	(32, 01, 04, 007, N'洪武路街道'),
	(32, 01, 04, 008, N'大光路街道'),
	(32, 01, 04, 009, N'瑞金路街道'),
	(32, 01, 04, 010, N'月牙湖街道'),
	(32, 01, 04, 011, N'光华路街道'),
	(32, 01, 04, 012, N'朝天宫街道');

/* 江苏省，南京市，建邺区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 01, 05, 001, N'莫愁湖街道'),
	(32, 01, 05, 002, N'沙洲街道'),
	(32, 01, 05, 003, N'双闸街道'),
	(32, 01, 05, 004, N'江心洲街道'),
	(32, 01, 05, 006, N'兴隆街道'),
	(32, 01, 05, 007, N'南苑街道');

/* 江苏省，南京市，鼓楼区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 01, 06, 001, N'宁海路街道'),
	(32, 01, 06, 002, N'华侨路街道'),
	(32, 01, 06, 003, N'湖南路街道'),
	(32, 01, 06, 004, N'中央门街道'),
	(32, 01, 06, 005, N'挹江门街道'),
	(32, 01, 06, 006, N'江东街道'),
	(32, 01, 06, 007, N'凤凰街道'),
	(32, 01, 06, 008, N'阅江楼街道'),
	(32, 01, 06, 009, N'热河南路街道'),
	(32, 01, 06, 010, N'幕府山街道'),
	(32, 01, 06, 011, N'建宁路街道'),
	(32, 01, 06, 012, N'宝塔桥街道'),
	(32, 01, 06, 013, N'小市街道');

/* 江苏省，南京市，浦口区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 01, 11, 001, N'泰山街道'),
	(32, 01, 11, 002, N'顶山街道'),
	(32, 01, 11, 003, N'沿江街道'),
	(32, 01, 11, 004, N'江浦街道'),
	(32, 01, 11, 005, N'桥林街道'),
	(32, 01, 11, 006, N'汤泉街道'),
	(32, 01, 11, 007, N'盘城街道'),
	(32, 01, 11, 008, N'星甸街道'),
	(32, 01, 11, 009, N'永宁街道');

/* 江苏省，南京市，栖霞区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 01, 13, 001, N'尧化街道'),
	(32, 01, 13, 002, N'马群街道'),
	(32, 01, 13, 003, N'迈皋桥街道'),
	(32, 01, 13, 004, N'燕子矶街道'),
	(32, 01, 13, 005, N'栖霞街道'),
	(32, 01, 13, 006, N'龙潭街道'),
	(32, 01, 13, 007, N'仙林街道'),
	(32, 01, 13, 009, N'八卦洲街道'),
	(32, 01, 13, 010, N'西岗街道');

/* 江苏省，南京市，雨花台区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 01, 14, 001, N'雨花街道'),
	(32, 01, 14, 002, N'赛虹桥街道'),
	(32, 01, 14, 004, N'西善桥街道'),
	(32, 01, 14, 005, N'板桥街道'),
	(32, 01, 14, 006, N'铁心桥街道'),
	(32, 01, 14, 007, N'梅山街道');

/* 江苏省，南京市，江宁区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 01, 15, 001, N'东山街道'),
	(32, 01, 15, 002, N'秣陵街道'),
	(32, 01, 15, 003, N'汤山街道'),
	(32, 01, 15, 004, N'淳化街道'),
	(32, 01, 15, 005, N'禄口街道'),
	(32, 01, 15, 006, N'江宁街道'),
	(32, 01, 15, 007, N'谷里街道'),
	(32, 01, 15, 008, N'湖熟街道'),
	(32, 01, 15, 009, N'横溪街道'),
	(32, 01, 15, 010, N'麒麟街道');

/* 江苏省，南京市，六合区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 01, 16, 001, N'大厂街道'),
	(32, 01, 16, 004, N'葛塘街道'),
	(32, 01, 16, 005, N'长芦街道'),
	(32, 01, 16, 006, N'雄州街道'),
	(32, 01, 16, 007, N'龙池街道'),
	(32, 01, 16, 008, N'程桥街道'),
	(32, 01, 16, 009, N'金牛湖街道'),
	(32, 01, 16, 010, N'横梁街道'),
	(32, 01, 16, 011, N'龙袍街道'),
	(32, 01, 16, 012, N'马鞍街道'),
	(32, 01, 16, 013, N'冶山街道'),
	(32, 01, 16, 110, N'竹镇镇');

/* 江苏省，南京市，溧水区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 01, 17, 001, N'永阳街道'),
	(32, 01, 17, 002, N'柘塘街道'),
	(32, 01, 17, 101, N'白马镇'),
	(32, 01, 17, 102, N'东屏镇'),
	(32, 01, 17, 104, N'石湫镇'),
	(32, 01, 17, 105, N'洪蓝镇'),
	(32, 01, 17, 106, N'晶桥镇'),
	(32, 01, 17, 107, N'和凤镇');

/* 江苏省，南京市，高淳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 01, 18, 001, N'淳溪街道'),
	(32, 01, 18, 002, N'古柏街道'),
	(32, 01, 18, 101, N'阳江镇'),
	(32, 01, 18, 102, N'砖墙镇'),
	(32, 01, 18, 104, N'漆桥镇'),
	(32, 01, 18, 105, N'固城镇'),
	(32, 01, 18, 106, N'东坝镇'),
	(32, 01, 18, 108, N'桠溪镇');

/* 江苏省，无锡市，崇安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 02, 02, 001, N'崇安寺街道'),
	(32, 02, 02, 002, N'通江街道'),
	(32, 02, 02, 003, N'广瑞路街道'),
	(32, 02, 02, 004, N'上马墩街道'),
	(32, 02, 02, 005, N'江海街道'),
	(32, 02, 02, 006, N'广益街道');

/* 江苏省，无锡市，南长区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 02, 03, 001, N'迎龙桥街道'),
	(32, 02, 03, 002, N'南禅寺街道'),
	(32, 02, 03, 003, N'清名桥街道'),
	(32, 02, 03, 004, N'金星街道'),
	(32, 02, 03, 005, N'金匮街道'),
	(32, 02, 03, 006, N'扬名街道');

/* 江苏省，无锡市，北塘区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 02, 04, 001, N'黄巷街道'),
	(32, 02, 04, 002, N'山北街道'),
	(32, 02, 04, 003, N'北大街街道'),
	(32, 02, 04, 004, N'惠山街道');

/* 江苏省，无锡市，锡山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 02, 05, 001, N'东亭街道'),
	(32, 02, 05, 002, N'安镇街道'),
	(32, 02, 05, 003, N'东北塘街道'),
	(32, 02, 05, 102, N'羊尖镇'),
	(32, 02, 05, 103, N'鹅湖镇'),
	(32, 02, 05, 105, N'锡北镇'),
	(32, 02, 05, 106, N'东港镇');

/* 江苏省，无锡市，惠山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 02, 06, 001, N'堰桥街道'),
	(32, 02, 06, 002, N'长安街道'),
	(32, 02, 06, 003, N'钱桥街道'),
	(32, 02, 06, 004, N'前洲街道'),
	(32, 02, 06, 005, N'玉祁街道'),
	(32, 02, 06, 102, N'洛社镇'),
	(32, 02, 06, 103, N'阳山镇');

/* 江苏省，无锡市，滨湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 02, 11, 001, N'河埒街道'),
	(32, 02, 11, 002, N'荣巷街道'),
	(32, 02, 11, 003, N'蠡园街道'),
	(32, 02, 11, 004, N'蠡湖街道'),
	(32, 02, 11, 006, N'华庄街道'),
	(32, 02, 11, 007, N'太湖街道'),
	(32, 02, 11, 008, N'雪浪街道'),
	(32, 02, 11, 009, N'马山街道'),
	(32, 02, 11, 101, N'胡埭镇');

/* 江苏省，无锡市，江阴市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 02, 81, 001, N'澄江街道'),
	(32, 02, 81, 004, N'南闸街道'),
	(32, 02, 81, 005, N'云亭街道'),
	(32, 02, 81, 006, N'临港街道'),
	(32, 02, 81, 100, N'璜土镇'),
	(32, 02, 81, 102, N'月城镇'),
	(32, 02, 81, 103, N'青阳镇'),
	(32, 02, 81, 104, N'徐霞客镇'),
	(32, 02, 81, 107, N'华士镇'),
	(32, 02, 81, 108, N'周庄镇'),
	(32, 02, 81, 109, N'新桥镇'),
	(32, 02, 81, 110, N'长泾镇'),
	(32, 02, 81, 111, N'顾山镇'),
	(32, 02, 81, 112, N'祝塘镇');

/* 江苏省，无锡市，宜兴市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 02, 82, 001, N'宜城街道'),
	(32, 02, 82, 002, N'屺亭街道'),
	(32, 02, 82, 003, N'新庄街道'),
	(32, 02, 82, 004, N'新街街道'),
	(32, 02, 82, 005, N'芳桥街道'),
	(32, 02, 82, 100, N'张渚镇'),
	(32, 02, 82, 101, N'西渚镇'),
	(32, 02, 82, 102, N'太华镇'),
	(32, 02, 82, 103, N'徐舍镇'),
	(32, 02, 82, 104, N'官林镇'),
	(32, 02, 82, 105, N'杨巷镇'),
	(32, 02, 82, 106, N'新建镇'),
	(32, 02, 82, 107, N'和桥镇'),
	(32, 02, 82, 108, N'高塍镇'),
	(32, 02, 82, 109, N'万石镇'),
	(32, 02, 82, 110, N'周铁镇'),
	(32, 02, 82, 112, N'丁蜀镇'),
	(32, 02, 82, 113, N'湖父镇');

/* 江苏省，徐州市，鼓楼区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 03, 02, 001, N'黄楼街道'),
	(32, 03, 02, 002, N'丰财街道'),
	(32, 03, 02, 003, N'琵琶街道'),
	(32, 03, 02, 004, N'牌楼街道'),
	(32, 03, 02, 005, N'铜沛街道'),
	(32, 03, 02, 006, N'环城街道'),
	(32, 03, 02, 007, N'九里街道');

/* 江苏省，徐州市，云龙区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 03, 03, 001, N'彭城街道'),
	(32, 03, 03, 002, N'子房街道'),
	(32, 03, 03, 003, N'黄山街道'),
	(32, 03, 03, 004, N'骆驼山街道'),
	(32, 03, 03, 005, N'大郭庄街道'),
	(32, 03, 03, 006, N'翠屏山街道'),
	(32, 03, 03, 007, N'大龙湖街道'),
	(32, 03, 03, 008, N'潘塘街道');

/* 江苏省，徐州市，贾汪区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 03, 05, 001, N'老矿街道'),
	(32, 03, 05, 003, N'大泉街道'),
	(32, 03, 05, 004, N'大吴街道'),
	(32, 03, 05, 005, N'潘安湖街道'),
	(32, 03, 05, 102, N'青山泉镇'),
	(32, 03, 05, 104, N'紫庄镇'),
	(32, 03, 05, 105, N'塔山镇'),
	(32, 03, 05, 106, N'汴塘镇'),
	(32, 03, 05, 107, N'江庄镇');

/* 江苏省，徐州市，泉山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 03, 11, 001, N'王陵街道'),
	(32, 03, 11, 002, N'七里沟街道'),
	(32, 03, 11, 003, N'永安街道'),
	(32, 03, 11, 004, N'湖滨街道'),
	(32, 03, 11, 005, N'段庄街道'),
	(32, 03, 11, 006, N'翟山街道'),
	(32, 03, 11, 007, N'奎山街道'),
	(32, 03, 11, 008, N'和平街道'),
	(32, 03, 11, 009, N'金山街道'),
	(32, 03, 11, 010, N'泰山街道'),
	(32, 03, 11, 011, N'庞庄街道'),
	(32, 03, 11, 012, N'火花街道'),
	(32, 03, 11, 013, N'桃园街道'),
	(32, 03, 11, 014, N'苏山街道');

/* 江苏省，徐州市，铜山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 03, 12, 001, N'三河尖街道'),
	(32, 03, 12, 002, N'张双楼街道'),
	(32, 03, 12, 003, N'垞城街道'),
	(32, 03, 12, 004, N'张集街道'),
	(32, 03, 12, 005, N'义安街道'),
	(32, 03, 12, 006, N'利国街道'),
	(32, 03, 12, 007, N'电厂街道'),
	(32, 03, 12, 008, N'拾屯街道'),
	(32, 03, 12, 009, N'铜山街道办事处'),
	(32, 03, 12, 051, N'新区街道办事处'),
	(32, 03, 12, 052, N'三堡街道办事处'),
	(32, 03, 12, 102, N'何桥镇'),
	(32, 03, 12, 103, N'黄集镇'),
	(32, 03, 12, 104, N'马坡镇'),
	(32, 03, 12, 105, N'郑集镇'),
	(32, 03, 12, 106, N'柳新镇'),
	(32, 03, 12, 107, N'刘集镇'),
	(32, 03, 12, 108, N'大彭镇'),
	(32, 03, 12, 109, N'汉王镇'),
	(32, 03, 12, 111, N'棠张镇'),
	(32, 03, 12, 112, N'张集镇'),
	(32, 03, 12, 113, N'房村镇'),
	(32, 03, 12, 114, N'伊庄镇'),
	(32, 03, 12, 115, N'单集镇'),
	(32, 03, 12, 116, N'利国镇'),
	(32, 03, 12, 118, N'大许镇'),
	(32, 03, 12, 119, N'茅村镇'),
	(32, 03, 12, 120, N'柳泉镇');

/* 江苏省，徐州市，丰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 03, 21, 001, N'中阳里街道办事处'),
	(32, 03, 21, 002, N'凤城街道办事处'),
	(32, 03, 21, 003, N'孙楼街道办事处'),
	(32, 03, 21, 102, N'首羡镇'),
	(32, 03, 21, 103, N'顺河镇'),
	(32, 03, 21, 104, N'常店镇'),
	(32, 03, 21, 105, N'欢口镇'),
	(32, 03, 21, 106, N'师寨镇'),
	(32, 03, 21, 107, N'华山镇'),
	(32, 03, 21, 108, N'梁寨镇'),
	(32, 03, 21, 109, N'范楼镇'),
	(32, 03, 21, 111, N'宋楼镇'),
	(32, 03, 21, 112, N'大沙河镇'),
	(32, 03, 21, 113, N'王沟镇'),
	(32, 03, 21, 114, N'赵庄镇');

/* 江苏省，徐州市，沛县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 03, 22, 001, N'沛城街道办事处'),
	(32, 03, 22, 002, N'大屯街道办事处'),
	(32, 03, 22, 003, N'汉源街道办事处'),
	(32, 03, 22, 004, N'汉兴街道办事处'),
	(32, 03, 22, 101, N'龙固镇'),
	(32, 03, 22, 102, N'杨屯镇'),
	(32, 03, 22, 105, N'胡寨镇'),
	(32, 03, 22, 106, N'魏庙镇'),
	(32, 03, 22, 107, N'五段镇'),
	(32, 03, 22, 108, N'张庄镇'),
	(32, 03, 22, 109, N'张寨镇'),
	(32, 03, 22, 110, N'敬安镇'),
	(32, 03, 22, 111, N'河口镇'),
	(32, 03, 22, 112, N'栖山镇'),
	(32, 03, 22, 113, N'鹿楼镇'),
	(32, 03, 22, 114, N'朱寨镇'),
	(32, 03, 22, 115, N'安国镇');

/* 江苏省，徐州市，睢宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 03, 24, 101, N'睢城镇'),
	(32, 03, 24, 102, N'王集镇'),
	(32, 03, 24, 103, N'双沟镇'),
	(32, 03, 24, 104, N'岚山镇'),
	(32, 03, 24, 105, N'李集镇'),
	(32, 03, 24, 106, N'桃园镇'),
	(32, 03, 24, 107, N'官山镇'),
	(32, 03, 24, 108, N'高作镇'),
	(32, 03, 24, 109, N'沙集镇'),
	(32, 03, 24, 110, N'凌城镇'),
	(32, 03, 24, 111, N'邱集镇'),
	(32, 03, 24, 112, N'古邳镇'),
	(32, 03, 24, 113, N'姚集镇'),
	(32, 03, 24, 114, N'魏集镇'),
	(32, 03, 24, 115, N'梁集镇'),
	(32, 03, 24, 116, N'庆安镇');

/* 江苏省，徐州市，新沂市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 03, 81, 001, N'新安街道办事处'),
	(32, 03, 81, 002, N'北沟街道办事处'),
	(32, 03, 81, 003, N'墨河街道办事处'),
	(32, 03, 81, 004, N'唐店街道办事处'),
	(32, 03, 81, 102, N'瓦窑镇'),
	(32, 03, 81, 103, N'港头镇'),
	(32, 03, 81, 105, N'合沟镇'),
	(32, 03, 81, 106, N'草桥镇'),
	(32, 03, 81, 107, N'窑湾镇'),
	(32, 03, 81, 108, N'棋盘镇'),
	(32, 03, 81, 109, N'马陵山镇'),
	(32, 03, 81, 110, N'新店镇'),
	(32, 03, 81, 111, N'邵店镇'),
	(32, 03, 81, 113, N'时集镇'),
	(32, 03, 81, 114, N'高流镇'),
	(32, 03, 81, 115, N'阿湖镇'),
	(32, 03, 81, 116, N'双塘镇');

/* 江苏省，徐州市，邳州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 03, 82, 001, N'东湖街道办事处'),
	(32, 03, 82, 002, N'运河街道办事处'),
	(32, 03, 82, 003, N'戴圩街道办事处'),
	(32, 03, 82, 004, N'炮车街道办事处'),
	(32, 03, 82, 102, N'邳城镇'),
	(32, 03, 82, 103, N'官湖镇'),
	(32, 03, 82, 104, N'四户镇'),
	(32, 03, 82, 105, N'宿羊山镇'),
	(32, 03, 82, 106, N'八义集镇'),
	(32, 03, 82, 107, N'土山镇'),
	(32, 03, 82, 108, N'碾庄镇'),
	(32, 03, 82, 109, N'港上镇'),
	(32, 03, 82, 110, N'邹庄镇'),
	(32, 03, 82, 111, N'占城镇'),
	(32, 03, 82, 112, N'新河镇'),
	(32, 03, 82, 113, N'八路镇'),
	(32, 03, 82, 115, N'铁富镇'),
	(32, 03, 82, 116, N'岔河镇'),
	(32, 03, 82, 118, N'陈楼镇'),
	(32, 03, 82, 119, N'邢楼镇'),
	(32, 03, 82, 120, N'戴庄镇'),
	(32, 03, 82, 121, N'车辐山镇'),
	(32, 03, 82, 122, N'燕子埠镇'),
	(32, 03, 82, 123, N'赵墩镇'),
	(32, 03, 82, 124, N'议堂镇');

/* 江苏省，常州市，天宁区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 04, 02, 001, N'雕庄街道'),
	(32, 04, 02, 002, N'青龙街道'),
	(32, 04, 02, 003, N'茶山街道'),
	(32, 04, 02, 004, N'红梅街道'),
	(32, 04, 02, 005, N'天宁街道'),
	(32, 04, 02, 006, N'兰陵街道'),
	(32, 04, 02, 109, N'郑陆镇');

/* 江苏省，常州市，钟楼区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 04, 04, 001, N'五星街道'),
	(32, 04, 04, 002, N'永红街道'),
	(32, 04, 04, 003, N'北港街道'),
	(32, 04, 04, 004, N'西林街道'),
	(32, 04, 04, 005, N'南大街街道'),
	(32, 04, 04, 006, N'荷花池街道'),
	(32, 04, 04, 007, N'新闸街道'),
	(32, 04, 04, 116, N'邹区镇');

/* 江苏省，常州市，新北区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 04, 11, 001, N'河海街道'),
	(32, 04, 11, 002, N'三井街道'),
	(32, 04, 11, 003, N'龙虎塘街道'),
	(32, 04, 11, 100, N'春江镇'),
	(32, 04, 11, 101, N'孟河镇'),
	(32, 04, 11, 102, N'新桥镇'),
	(32, 04, 11, 103, N'薛家镇'),
	(32, 04, 11, 104, N'罗溪镇'),
	(32, 04, 11, 105, N'西夏墅镇'),
	(32, 04, 11, 122, N'奔牛镇');

/* 江苏省，常州市，武进区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 04, 12, 001, N'戚墅堰街道'),
	(32, 04, 12, 002, N'丁堰街道'),
	(32, 04, 12, 003, N'潞城街道'),
	(32, 04, 12, 100, N'湖塘镇'),
	(32, 04, 12, 102, N'牛塘镇'),
	(32, 04, 12, 103, N'洛阳镇'),
	(32, 04, 12, 104, N'遥观镇'),
	(32, 04, 12, 105, N'横林镇'),
	(32, 04, 12, 106, N'横山桥镇'),
	(32, 04, 12, 110, N'雪堰镇'),
	(32, 04, 12, 113, N'前黄镇'),
	(32, 04, 12, 114, N'礼嘉镇'),
	(32, 04, 12, 119, N'嘉泽镇'),
	(32, 04, 12, 120, N'湟里镇');

/* 江苏省，常州市，金坛区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 04, 13, 001, N'西城街道'),
	(32, 04, 13, 100, N'金城镇'),
	(32, 04, 13, 104, N'儒林镇'),
	(32, 04, 13, 106, N'直溪镇'),
	(32, 04, 13, 108, N'朱林镇'),
	(32, 04, 13, 109, N'薛埠镇'),
	(32, 04, 13, 112, N'指前镇');

/* 江苏省，常州市，溧阳市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 04, 81, 100, N'溧城镇'),
	(32, 04, 81, 101, N'埭头镇'),
	(32, 04, 81, 102, N'上黄镇'),
	(32, 04, 81, 103, N'戴埠镇'),
	(32, 04, 81, 106, N'天目湖镇'),
	(32, 04, 81, 107, N'别桥镇'),
	(32, 04, 81, 109, N'上兴镇'),
	(32, 04, 81, 111, N'竹箦镇'),
	(32, 04, 81, 114, N'南渡镇'),
	(32, 04, 81, 116, N'社渚镇');

/* 江苏省，苏州市，虎丘区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 05, 05, 001, N'横塘街道'),
	(32, 05, 05, 002, N'狮山街道'),
	(32, 05, 05, 003, N'枫桥街道'),
	(32, 05, 05, 004, N'镇湖街道'),
	(32, 05, 05, 100, N'浒墅关镇'),
	(32, 05, 05, 101, N'通安镇'),
	(32, 05, 05, 102, N'东渚镇');

/* 江苏省，苏州市，吴中区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 05, 06, 001, N'长桥街道'),
	(32, 05, 06, 003, N'越溪街道'),
	(32, 05, 06, 004, N'郭巷街道'),
	(32, 05, 06, 005, N'横泾街道'),
	(32, 05, 06, 006, N'香山街道'),
	(32, 05, 06, 009, N'城南街道'),
	(32, 05, 06, 100, N'甪直镇'),
	(32, 05, 06, 103, N'木渎镇'),
	(32, 05, 06, 104, N'胥口镇'),
	(32, 05, 06, 107, N'东山镇'),
	(32, 05, 06, 108, N'光福镇'),
	(32, 05, 06, 109, N'金庭镇'),
	(32, 05, 06, 110, N'临湖镇');

/* 江苏省，苏州市，相城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 05, 07, 001, N'元和街道'),
	(32, 05, 07, 002, N'太平街道'),
	(32, 05, 07, 003, N'黄桥街道'),
	(32, 05, 07, 004, N'北桥街道'),
	(32, 05, 07, 005, N'北河泾街道'),
	(32, 05, 07, 006, N'漕湖街道'),
	(32, 05, 07, 100, N'望亭镇'),
	(32, 05, 07, 102, N'黄埭镇'),
	(32, 05, 07, 105, N'渭塘镇'),
	(32, 05, 07, 109, N'阳澄湖镇');

/* 江苏省，苏州市，姑苏区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 05, 08, 001, N'双塔街道'),
	(32, 05, 08, 002, N'沧浪街道'),
	(32, 05, 08, 003, N'胥江街道'),
	(32, 05, 08, 004, N'吴门桥街道'),
	(32, 05, 08, 005, N'葑门街道'),
	(32, 05, 08, 006, N'友新街道'),
	(32, 05, 08, 007, N'观前街道'),
	(32, 05, 08, 008, N'平江街道'),
	(32, 05, 08, 009, N'苏锦街道'),
	(32, 05, 08, 010, N'娄门街道'),
	(32, 05, 08, 011, N'城北街道'),
	(32, 05, 08, 012, N'桃花坞街道'),
	(32, 05, 08, 013, N'石路街道'),
	(32, 05, 08, 014, N'金阊街道'),
	(32, 05, 08, 015, N'留园街道'),
	(32, 05, 08, 016, N'虎丘街道'),
	(32, 05, 08, 017, N'白洋湾街道');

/* 江苏省，苏州市，吴江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 05, 09, 100, N'太湖新城镇'),
	(32, 05, 09, 104, N'平望镇'),
	(32, 05, 09, 105, N'盛泽镇'),
	(32, 05, 09, 107, N'七都镇'),
	(32, 05, 09, 108, N'震泽镇'),
	(32, 05, 09, 109, N'桃源镇'),
	(32, 05, 09, 110, N'黎里镇');

/* 江苏省，苏州市，常熟市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 05, 81, 100, N'虞山镇'),
	(32, 05, 81, 101, N'梅李镇'),
	(32, 05, 81, 102, N'海虞镇'),
	(32, 05, 81, 104, N'古里镇'),
	(32, 05, 81, 105, N'沙家浜镇'),
	(32, 05, 81, 106, N'支塘镇'),
	(32, 05, 81, 107, N'董浜镇'),
	(32, 05, 81, 110, N'辛庄镇'),
	(32, 05, 81, 111, N'尚湖镇');

/* 江苏省，苏州市，张家港市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 05, 82, 100, N'杨舍镇'),
	(32, 05, 82, 101, N'塘桥镇'),
	(32, 05, 82, 102, N'金港镇'),
	(32, 05, 82, 103, N'锦丰镇'),
	(32, 05, 82, 104, N'乐余镇'),
	(32, 05, 82, 105, N'凤凰镇'),
	(32, 05, 82, 106, N'南丰镇'),
	(32, 05, 82, 107, N'大新镇');

/* 江苏省，苏州市，昆山市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 05, 83, 100, N'玉山镇'),
	(32, 05, 83, 101, N'巴城镇'),
	(32, 05, 83, 102, N'周市镇'),
	(32, 05, 83, 103, N'陆家镇'),
	(32, 05, 83, 104, N'花桥镇'),
	(32, 05, 83, 105, N'淀山湖镇'),
	(32, 05, 83, 106, N'张浦镇'),
	(32, 05, 83, 107, N'周庄镇'),
	(32, 05, 83, 108, N'千灯镇'),
	(32, 05, 83, 109, N'锦溪镇');

/* 江苏省，苏州市，太仓市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 05, 85, 100, N'城厢镇'),
	(32, 05, 85, 101, N'沙溪镇'),
	(32, 05, 85, 102, N'浏河镇'),
	(32, 05, 85, 103, N'浮桥镇'),
	(32, 05, 85, 104, N'璜泾镇'),
	(32, 05, 85, 105, N'双凤镇');

/* 江苏省，南通市，崇川区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 06, 02, 001, N'城东街道'),
	(32, 06, 02, 002, N'和平桥街道'),
	(32, 06, 02, 003, N'任港街道'),
	(32, 06, 02, 004, N'新城桥街道'),
	(32, 06, 02, 005, N'虹桥街道'),
	(32, 06, 02, 006, N'学田街道'),
	(32, 06, 02, 007, N'钟秀街道'),
	(32, 06, 02, 008, N'文峰街道'),
	(32, 06, 02, 009, N'观音山街道'),
	(32, 06, 02, 010, N'狼山镇街道');

/* 江苏省，南通市，港闸区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 06, 11, 001, N'永兴街道'),
	(32, 06, 11, 002, N'唐闸镇街道'),
	(32, 06, 11, 003, N'天生港镇街道'),
	(32, 06, 11, 004, N'秦灶街道'),
	(32, 06, 11, 005, N'陈桥街道'),
	(32, 06, 11, 006, N'幸福街道');

/* 江苏省，南通市，通州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 06, 12, 001, N'金沙街道'),
	(32, 06, 12, 002, N'兴东街道'),
	(32, 06, 12, 003, N'先锋街道'),
	(32, 06, 12, 004, N'金新街道'),
	(32, 06, 12, 101, N'西亭镇'),
	(32, 06, 12, 102, N'二甲镇'),
	(32, 06, 12, 103, N'东社镇'),
	(32, 06, 12, 104, N'三余镇'),
	(32, 06, 12, 107, N'十总镇'),
	(32, 06, 12, 110, N'石港镇'),
	(32, 06, 12, 112, N'刘桥镇'),
	(32, 06, 12, 114, N'平潮镇'),
	(32, 06, 12, 116, N'五接镇'),
	(32, 06, 12, 117, N'兴仁镇'),
	(32, 06, 12, 119, N'张芝山镇'),
	(32, 06, 12, 120, N'川姜镇');

/* 江苏省，南通市，海安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 06, 21, 100, N'海安镇'),
	(32, 06, 21, 101, N'城东镇'),
	(32, 06, 21, 102, N'曲塘镇'),
	(32, 06, 21, 103, N'李堡镇'),
	(32, 06, 21, 105, N'角斜镇'),
	(32, 06, 21, 107, N'大公镇'),
	(32, 06, 21, 109, N'雅周镇'),
	(32, 06, 21, 111, N'白甸镇'),
	(32, 06, 21, 112, N'南莫镇'),
	(32, 06, 21, 113, N'墩头镇');

/* 江苏省，南通市，如东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 06, 23, 100, N'栟茶镇'),
	(32, 06, 23, 101, N'洋口镇'),
	(32, 06, 23, 102, N'苴镇'),
	(32, 06, 23, 103, N'长沙镇'),
	(32, 06, 23, 104, N'大豫镇'),
	(32, 06, 23, 105, N'掘港镇'),
	(32, 06, 23, 107, N'马塘镇'),
	(32, 06, 23, 108, N'丰利镇'),
	(32, 06, 23, 109, N'曹埠镇'),
	(32, 06, 23, 110, N'岔河镇'),
	(32, 06, 23, 111, N'双甸镇'),
	(32, 06, 23, 112, N'新店镇'),
	(32, 06, 23, 113, N'河口镇'),
	(32, 06, 23, 114, N'袁庄镇');

/* 江苏省，南通市，启东市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 06, 81, 100, N'汇龙镇'),
	(32, 06, 81, 102, N'惠萍镇'),
	(32, 06, 81, 104, N'东海镇'),
	(32, 06, 81, 106, N'南阳镇'),
	(32, 06, 81, 107, N'海复镇'),
	(32, 06, 81, 108, N'合作镇'),
	(32, 06, 81, 109, N'王鲍镇'),
	(32, 06, 81, 110, N'吕四港镇');

/* 江苏省，南通市，如皋市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 06, 82, 001, N'如城街道'),
	(32, 06, 82, 103, N'东陈镇'),
	(32, 06, 82, 104, N'丁堰镇'),
	(32, 06, 82, 105, N'白蒲镇'),
	(32, 06, 82, 107, N'下原镇'),
	(32, 06, 82, 108, N'九华镇'),
	(32, 06, 82, 110, N'石庄镇'),
	(32, 06, 82, 111, N'长江镇'),
	(32, 06, 82, 112, N'吴窑镇'),
	(32, 06, 82, 113, N'江安镇'),
	(32, 06, 82, 116, N'搬经镇'),
	(32, 06, 82, 117, N'磨头镇');

/* 江苏省，南通市，海门市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 06, 84, 106, N'常乐镇'),
	(32, 06, 84, 108, N'悦来镇'),
	(32, 06, 84, 111, N'四甲镇'),
	(32, 06, 84, 113, N'余东镇'),
	(32, 06, 84, 114, N'正余镇'),
	(32, 06, 84, 117, N'海永镇');

/* 江苏省，连云港市，连云区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 07, 03, 001, N'墟沟街道'),
	(32, 07, 03, 003, N'连云街道'),
	(32, 07, 03, 004, N'云山街道'),
	(32, 07, 03, 005, N'板桥街道'),
	(32, 07, 03, 006, N'连岛街道'),
	(32, 07, 03, 007, N'徐圩街道'),
	(32, 07, 03, 008, N'海州湾街道'),
	(32, 07, 03, 009, N'宿城街道'),
	(32, 07, 03, 010, N'高公岛街道'),
	(32, 07, 03, 203, N'前三岛乡');

/* 江苏省，连云港市，海州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 07, 06, 001, N'朐阳街道'),
	(32, 07, 06, 002, N'浦西街道'),
	(32, 07, 06, 003, N'新东街道'),
	(32, 07, 06, 004, N'新南街道'),
	(32, 07, 06, 005, N'路南街道'),
	(32, 07, 06, 006, N'新海街道'),
	(32, 07, 06, 007, N'南城街道'),
	(32, 07, 06, 008, N'花果山街道'),
	(32, 07, 06, 009, N'云台街道'),
	(32, 07, 06, 010, N'新浦街道'),
	(32, 07, 06, 011, N'海州街道'),
	(32, 07, 06, 012, N'幸福路街道'),
	(32, 07, 06, 013, N'洪门街道'),
	(32, 07, 06, 014, N'宁海街道'),
	(32, 07, 06, 100, N'锦屏镇'),
	(32, 07, 06, 101, N'浦南镇'),
	(32, 07, 06, 102, N'新坝镇'),
	(32, 07, 06, 103, N'板浦镇');

/* 江苏省，连云港市，赣榆区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 07, 07, 100, N'青口镇'),
	(32, 07, 07, 101, N'柘汪镇'),
	(32, 07, 07, 102, N'石桥镇'),
	(32, 07, 07, 103, N'金山镇'),
	(32, 07, 07, 104, N'黑林镇'),
	(32, 07, 07, 105, N'厉庄镇'),
	(32, 07, 07, 106, N'海头镇'),
	(32, 07, 07, 107, N'塔山镇'),
	(32, 07, 07, 108, N'赣马镇'),
	(32, 07, 07, 109, N'班庄镇'),
	(32, 07, 07, 110, N'城头镇'),
	(32, 07, 07, 112, N'城西镇'),
	(32, 07, 07, 114, N'宋庄镇'),
	(32, 07, 07, 115, N'沙河镇'),
	(32, 07, 07, 116, N'墩尚镇');

/* 江苏省，连云港市，东海县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 07, 22, 001, N'牛山街道办事处'),
	(32, 07, 22, 002, N'石榴街道办事处'),
	(32, 07, 22, 101, N'白塔埠镇'),
	(32, 07, 22, 103, N'黄川镇'),
	(32, 07, 22, 104, N'石梁河镇'),
	(32, 07, 22, 105, N'青湖镇'),
	(32, 07, 22, 107, N'温泉镇'),
	(32, 07, 22, 108, N'双店镇'),
	(32, 07, 22, 109, N'桃林镇'),
	(32, 07, 22, 110, N'洪庄镇'),
	(32, 07, 22, 111, N'安峰镇'),
	(32, 07, 22, 112, N'房山镇'),
	(32, 07, 22, 113, N'平明镇'),
	(32, 07, 22, 200, N'驼峰乡'),
	(32, 07, 22, 203, N'李埝乡'),
	(32, 07, 22, 204, N'山左口乡'),
	(32, 07, 22, 205, N'石湖乡'),
	(32, 07, 22, 206, N'曲阳乡'),
	(32, 07, 22, 207, N'张湾乡');

/* 江苏省，连云港市，灌云县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 07, 23, 100, N'伊山镇'),
	(32, 07, 23, 102, N'杨集镇'),
	(32, 07, 23, 103, N'燕尾港镇'),
	(32, 07, 23, 104, N'同兴镇'),
	(32, 07, 23, 105, N'四队镇'),
	(32, 07, 23, 106, N'圩丰镇'),
	(32, 07, 23, 107, N'龙苴镇'),
	(32, 07, 23, 108, N'下车镇'),
	(32, 07, 23, 203, N'图河乡'),
	(32, 07, 23, 207, N'东王集乡'),
	(32, 07, 23, 208, N'侍庄乡'),
	(32, 07, 23, 209, N'小伊乡'),
	(32, 07, 23, 212, N'南岗乡');

/* 江苏省，连云港市，灌南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 07, 24, 100, N'新安镇'),
	(32, 07, 24, 101, N'堆沟港镇'),
	(32, 07, 24, 102, N'田楼镇'),
	(32, 07, 24, 103, N'北陈集镇'),
	(32, 07, 24, 104, N'张店镇'),
	(32, 07, 24, 105, N'三口镇'),
	(32, 07, 24, 106, N'孟兴庄镇'),
	(32, 07, 24, 107, N'汤沟镇'),
	(32, 07, 24, 108, N'百禄镇'),
	(32, 07, 24, 109, N'新集镇'),
	(32, 07, 24, 204, N'李集乡');

/* 江苏省，淮安市，清河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 08, 02, 001, N'府前街道办事处'),
	(32, 08, 02, 002, N'长西街道办事处'),
	(32, 08, 02, 003, N'淮海街道办事处'),
	(32, 08, 02, 004, N'长东街道办事处'),
	(32, 08, 02, 005, N'柳树湾街道办事处'),
	(32, 08, 02, 006, N'水渡口街道办事处'),
	(32, 08, 02, 007, N'白鹭湖街道办事处');

/* 江苏省，淮安市，淮安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 08, 03, 100, N'淮城镇'),
	(32, 08, 03, 101, N'平桥镇'),
	(32, 08, 03, 102, N'上河镇'),
	(32, 08, 03, 103, N'马甸镇'),
	(32, 08, 03, 104, N'朱桥镇'),
	(32, 08, 03, 105, N'溪河镇'),
	(32, 08, 03, 106, N'施河镇'),
	(32, 08, 03, 107, N'车桥镇'),
	(32, 08, 03, 108, N'泾口镇'),
	(32, 08, 03, 109, N'流均镇'),
	(32, 08, 03, 110, N'博里镇'),
	(32, 08, 03, 111, N'仇桥镇'),
	(32, 08, 03, 112, N'复兴镇'),
	(32, 08, 03, 113, N'苏嘴镇'),
	(32, 08, 03, 114, N'钦工镇'),
	(32, 08, 03, 115, N'顺河镇'),
	(32, 08, 03, 116, N'季桥镇'),
	(32, 08, 03, 117, N'席桥镇'),
	(32, 08, 03, 118, N'林集镇'),
	(32, 08, 03, 119, N'南闸镇'),
	(32, 08, 03, 200, N'建淮乡'),
	(32, 08, 03, 201, N'茭陵乡'),
	(32, 08, 03, 202, N'宋集乡'),
	(32, 08, 03, 203, N'城东乡'),
	(32, 08, 03, 204, N'三堡乡');

/* 江苏省，淮安市，淮阴区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 08, 04, 100, N'王营镇'),
	(32, 08, 04, 101, N'赵集镇'),
	(32, 08, 04, 102, N'吴城镇'),
	(32, 08, 04, 103, N'南陈集镇'),
	(32, 08, 04, 104, N'码头镇'),
	(32, 08, 04, 105, N'王兴镇'),
	(32, 08, 04, 106, N'棉花庄镇'),
	(32, 08, 04, 107, N'丁集镇'),
	(32, 08, 04, 108, N'五里镇'),
	(32, 08, 04, 109, N'徐溜镇'),
	(32, 08, 04, 110, N'渔沟镇'),
	(32, 08, 04, 111, N'吴集镇'),
	(32, 08, 04, 112, N'西宋集镇'),
	(32, 08, 04, 113, N'三树镇'),
	(32, 08, 04, 200, N'韩桥乡'),
	(32, 08, 04, 201, N'新渡乡'),
	(32, 08, 04, 202, N'老张集乡'),
	(32, 08, 04, 203, N'凌桥乡'),
	(32, 08, 04, 204, N'袁集乡'),
	(32, 08, 04, 205, N'刘老庄乡'),
	(32, 08, 04, 206, N'古寨乡');

/* 江苏省，淮安市，青浦区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 08, 11, 001, N'清江街道办事处'),
	(32, 08, 11, 002, N'浦楼街道办事处'),
	(32, 08, 11, 003, N'闸口街道办事处'),
	(32, 08, 11, 004, N'清安街道办事处'),
	(32, 08, 11, 100, N'和平镇'),
	(32, 08, 11, 101, N'武墩镇'),
	(32, 08, 11, 102, N'盐河镇'),
	(32, 08, 11, 200, N'城南乡'),
	(32, 08, 11, 201, N'黄码乡');

/* 江苏省，淮安市，涟水县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 08, 26, 100, N'涟城镇'),
	(32, 08, 26, 101, N'高沟镇'),
	(32, 08, 26, 102, N'唐集镇'),
	(32, 08, 26, 103, N'保滩镇'),
	(32, 08, 26, 104, N'大东镇'),
	(32, 08, 26, 105, N'五港镇'),
	(32, 08, 26, 106, N'梁岔镇'),
	(32, 08, 26, 107, N'石湖镇'),
	(32, 08, 26, 108, N'朱码镇'),
	(32, 08, 26, 109, N'岔庙镇'),
	(32, 08, 26, 110, N'东胡集镇'),
	(32, 08, 26, 111, N'南集镇'),
	(32, 08, 26, 112, N'义兴镇'),
	(32, 08, 26, 113, N'成集镇'),
	(32, 08, 26, 114, N'红窑镇'),
	(32, 08, 26, 115, N'陈师镇'),
	(32, 08, 26, 116, N'前进镇'),
	(32, 08, 26, 200, N'徐集乡'),
	(32, 08, 26, 201, N'黄营乡');

/* 江苏省，淮安市，洪泽县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 08, 29, 001, N'高良涧街道'),
	(32, 08, 29, 002, N'朱坝街道'),
	(32, 08, 29, 003, N'黄集街道'),
	(32, 08, 29, 101, N'蒋坝镇'),
	(32, 08, 29, 103, N'岔河镇'),
	(32, 08, 29, 104, N'西顺河镇'),
	(32, 08, 29, 105, N'老子山镇'),
	(32, 08, 29, 106, N'三河镇'),
	(32, 08, 29, 110, N'东双沟镇');

/* 江苏省，淮安市，盱眙县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 08, 30, 001, N'盱城街道'),
	(32, 08, 30, 002, N'太和街道'),
	(32, 08, 30, 003, N'古桑街道'),
	(32, 08, 30, 101, N'马坝镇'),
	(32, 08, 30, 102, N'官滩镇'),
	(32, 08, 30, 103, N'旧铺镇'),
	(32, 08, 30, 104, N'桂五镇'),
	(32, 08, 30, 105, N'管镇镇'),
	(32, 08, 30, 106, N'河桥镇'),
	(32, 08, 30, 107, N'鲍集镇'),
	(32, 08, 30, 108, N'黄花塘镇'),
	(32, 08, 30, 109, N'明祖陵镇'),
	(32, 08, 30, 110, N'铁佛镇'),
	(32, 08, 30, 111, N'淮河镇'),
	(32, 08, 30, 112, N'仇集镇'),
	(32, 08, 30, 113, N'观音寺镇'),
	(32, 08, 30, 114, N'天泉湖镇'),
	(32, 08, 30, 200, N'维桥乡'),
	(32, 08, 30, 201, N'穆店乡'),
	(32, 08, 30, 204, N'兴隆乡');

/* 江苏省，淮安市，金湖县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 08, 31, 100, N'黎城镇'),
	(32, 08, 31, 101, N'金南镇'),
	(32, 08, 31, 102, N'闵桥镇'),
	(32, 08, 31, 103, N'塔集镇'),
	(32, 08, 31, 106, N'前锋镇'),
	(32, 08, 31, 107, N'吕良镇'),
	(32, 08, 31, 108, N'陈桥镇'),
	(32, 08, 31, 109, N'金北镇'),
	(32, 08, 31, 110, N'戴楼镇'),
	(32, 08, 31, 111, N'银涂镇');

/* 江苏省，盐城市，亭湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 09, 02, 001, N'五星街道'),
	(32, 09, 02, 002, N'文峰街道'),
	(32, 09, 02, 003, N'先锋街道'),
	(32, 09, 02, 004, N'毓龙街道'),
	(32, 09, 02, 007, N'新洋街道'),
	(32, 09, 02, 008, N'大洋街道'),
	(32, 09, 02, 050, N'伍佑街道（城南新区）'),
	(32, 09, 02, 051, N'黄海街道（城南新区）'),
	(32, 09, 02, 052, N'新河街道（城南新区）'),
	(32, 09, 02, 100, N'南洋镇'),
	(32, 09, 02, 102, N'新兴镇'),
	(32, 09, 02, 104, N'便仓镇'),
	(32, 09, 02, 107, N'盐东镇'),
	(32, 09, 02, 108, N'黄尖镇');

/* 江苏省，盐城市，盐都区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 09, 03, 002, N'张庄街道'),
	(32, 09, 03, 003, N'盐龙街道'),
	(32, 09, 03, 004, N'潘黄街道'),
	(32, 09, 03, 005, N'滨湖街道'),
	(32, 09, 03, 006, N'北龙港街道'),
	(32, 09, 03, 007, N'中兴街道'),
	(32, 09, 03, 008, N'葛武街道'),
	(32, 09, 03, 009, N'北蒋街道'),
	(32, 09, 03, 010, N'鞍湖街道'),
	(32, 09, 03, 011, N'冈中街道'),
	(32, 09, 03, 050, N'新都街道（城南新区）'),
	(32, 09, 03, 100, N'大纵湖镇'),
	(32, 09, 03, 102, N'楼王镇'),
	(32, 09, 03, 103, N'学富镇'),
	(32, 09, 03, 105, N'尚庄镇'),
	(32, 09, 03, 108, N'秦南镇'),
	(32, 09, 03, 109, N'龙冈镇'),
	(32, 09, 03, 111, N'郭猛镇'),
	(32, 09, 03, 112, N'大冈镇');

/* 江苏省，盐城市，大丰区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 09, 04, 100, N'大中镇'),
	(32, 09, 04, 101, N'草堰镇'),
	(32, 09, 04, 102, N'白驹镇'),
	(32, 09, 04, 103, N'刘庄镇'),
	(32, 09, 04, 104, N'西团镇'),
	(32, 09, 04, 105, N'小海镇'),
	(32, 09, 04, 106, N'大桥镇'),
	(32, 09, 04, 107, N'草庙镇'),
	(32, 09, 04, 108, N'万盈镇'),
	(32, 09, 04, 109, N'南阳镇'),
	(32, 09, 04, 110, N'新丰镇'),
	(32, 09, 04, 111, N'三龙镇');

/* 江苏省，盐城市，响水县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 09, 21, 100, N'响水镇'),
	(32, 09, 21, 101, N'陈家港镇'),
	(32, 09, 21, 102, N'小尖镇'),
	(32, 09, 21, 103, N'黄圩镇'),
	(32, 09, 21, 104, N'大有镇'),
	(32, 09, 21, 105, N'双港镇'),
	(32, 09, 21, 106, N'南河镇'),
	(32, 09, 21, 107, N'运河镇');

/* 江苏省，盐城市，滨海县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 09, 22, 100, N'东坎镇'),
	(32, 09, 22, 101, N'五汛镇'),
	(32, 09, 22, 102, N'蔡桥镇'),
	(32, 09, 22, 103, N'正红镇'),
	(32, 09, 22, 104, N'通榆镇'),
	(32, 09, 22, 105, N'界牌镇'),
	(32, 09, 22, 106, N'八巨镇'),
	(32, 09, 22, 107, N'八滩镇'),
	(32, 09, 22, 109, N'滨淮镇'),
	(32, 09, 22, 110, N'天场镇'),
	(32, 09, 22, 111, N'陈涛镇'),
	(32, 09, 22, 112, N'滨海港镇');

/* 江苏省，盐城市，阜宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 09, 23, 001, N'阜城街道办事处'),
	(32, 09, 23, 002, N'吴滩街道办事处'),
	(32, 09, 23, 003, N'花园街道办事处（开发区）'),
	(32, 09, 23, 004, N'金沙湖街道办事处'),
	(32, 09, 23, 100, N'沟墩镇'),
	(32, 09, 23, 101, N'陈良镇'),
	(32, 09, 23, 102, N'三灶镇'),
	(32, 09, 23, 103, N'郭墅镇（澳洋工业园）'),
	(32, 09, 23, 104, N'新沟镇'),
	(32, 09, 23, 105, N'陈集镇'),
	(32, 09, 23, 106, N'羊寨镇'),
	(32, 09, 23, 107, N'芦蒲镇'),
	(32, 09, 23, 108, N'板湖镇'),
	(32, 09, 23, 109, N'东沟镇'),
	(32, 09, 23, 110, N'益林镇'),
	(32, 09, 23, 111, N'古河镇'),
	(32, 09, 23, 112, N'罗桥镇');

/* 江苏省，盐城市，射阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 09, 24, 100, N'合德镇'),
	(32, 09, 24, 101, N'临海镇'),
	(32, 09, 24, 102, N'千秋镇'),
	(32, 09, 24, 104, N'四明镇'),
	(32, 09, 24, 106, N'海河镇'),
	(32, 09, 24, 108, N'海通镇'),
	(32, 09, 24, 109, N'兴桥镇'),
	(32, 09, 24, 110, N'新坍镇'),
	(32, 09, 24, 111, N'长荡镇'),
	(32, 09, 24, 112, N'盘湾镇'),
	(32, 09, 24, 113, N'特庸镇'),
	(32, 09, 24, 114, N'洋马镇'),
	(32, 09, 24, 117, N'黄沙港镇');

/* 江苏省，盐城市，建湖县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 09, 25, 001, N'近湖街道'),
	(32, 09, 25, 002, N'塘河街道（城南新区）'),
	(32, 09, 25, 050, N'开发区（钟庄街道）'),
	(32, 09, 25, 101, N'建阳镇'),
	(32, 09, 25, 102, N'九龙口镇'),
	(32, 09, 25, 103, N'恒济镇'),
	(32, 09, 25, 104, N'颜单镇'),
	(32, 09, 25, 105, N'沿河镇'),
	(32, 09, 25, 106, N'芦沟镇'),
	(32, 09, 25, 107, N'庆丰镇'),
	(32, 09, 25, 108, N'上冈镇'),
	(32, 09, 25, 111, N'冈西镇'),
	(32, 09, 25, 113, N'宝塔镇'),
	(32, 09, 25, 114, N'高作镇');

/* 江苏省，盐城市，东台市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 09, 81, 100, N'溱东镇'),
	(32, 09, 81, 101, N'时堰镇'),
	(32, 09, 81, 106, N'五烈镇'),
	(32, 09, 81, 107, N'梁垛镇'),
	(32, 09, 81, 108, N'安丰镇'),
	(32, 09, 81, 109, N'南沈灶镇'),
	(32, 09, 81, 110, N'富安镇'),
	(32, 09, 81, 112, N'唐洋镇'),
	(32, 09, 81, 113, N'新街镇'),
	(32, 09, 81, 114, N'许河镇'),
	(32, 09, 81, 115, N'三仓镇'),
	(32, 09, 81, 118, N'头灶镇'),
	(32, 09, 81, 121, N'弶港镇'),
	(32, 09, 81, 122, N'东台镇');

/* 江苏省，扬州市，广陵区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 10, 02, 001, N'东关街道'),
	(32, 10, 02, 002, N'汶河街道'),
	(32, 10, 02, 003, N'文峰街道'),
	(32, 10, 02, 004, N'曲江街道'),
	(32, 10, 02, 102, N'李典镇'),
	(32, 10, 02, 103, N'沙头镇'),
	(32, 10, 02, 104, N'头桥镇'),
	(32, 10, 02, 106, N'湾头镇'),
	(32, 10, 02, 200, N'汤汪乡');

/* 江苏省，扬州市，邗江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 10, 03, 001, N'邗上街道'),
	(32, 10, 03, 002, N'蒋王街道'),
	(32, 10, 03, 003, N'汊河街道'),
	(32, 10, 03, 005, N'双桥街道'),
	(32, 10, 03, 006, N'梅岭街道'),
	(32, 10, 03, 007, N'甘泉街道'),
	(32, 10, 03, 009, N'新盛街道'),
	(32, 10, 03, 010, N'竹西街道'),
	(32, 10, 03, 052, N'瘦西湖街道'),
	(32, 10, 03, 100, N'公道镇'),
	(32, 10, 03, 101, N'方巷镇'),
	(32, 10, 03, 102, N'槐泗镇'),
	(32, 10, 03, 103, N'瓜洲镇'),
	(32, 10, 03, 108, N'杨寿镇'),
	(32, 10, 03, 110, N'杨庙镇'),
	(32, 10, 03, 111, N'西湖镇'),
	(32, 10, 03, 201, N'双桥乡'),
	(32, 10, 03, 250, N'平山乡'),
	(32, 10, 03, 251, N'城北乡');

/* 江苏省，扬州市，江都区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 10, 12, 100, N'仙女镇'),
	(32, 10, 12, 101, N'小纪镇'),
	(32, 10, 12, 103, N'武坚镇'),
	(32, 10, 12, 106, N'樊川镇'),
	(32, 10, 12, 108, N'真武镇'),
	(32, 10, 12, 109, N'宜陵镇'),
	(32, 10, 12, 110, N'丁沟镇'),
	(32, 10, 12, 112, N'郭村镇'),
	(32, 10, 12, 114, N'邵伯镇'),
	(32, 10, 12, 116, N'丁伙镇'),
	(32, 10, 12, 118, N'大桥镇'),
	(32, 10, 12, 119, N'吴桥镇'),
	(32, 10, 12, 120, N'浦头镇');

/* 江苏省，扬州市，宝应县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 10, 23, 100, N'安宜镇'),
	(32, 10, 23, 101, N'氾水镇'),
	(32, 10, 23, 102, N'夏集镇'),
	(32, 10, 23, 103, N'柳堡镇'),
	(32, 10, 23, 104, N'射阳湖镇'),
	(32, 10, 23, 105, N'广洋湖镇'),
	(32, 10, 23, 106, N'鲁垛镇'),
	(32, 10, 23, 107, N'小官庄镇'),
	(32, 10, 23, 108, N'望直港镇'),
	(32, 10, 23, 109, N'曹甸镇'),
	(32, 10, 23, 110, N'西安丰镇'),
	(32, 10, 23, 111, N'山阳镇'),
	(32, 10, 23, 112, N'黄塍镇'),
	(32, 10, 23, 113, N'泾河镇');

/* 江苏省，扬州市，仪征市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 10, 81, 100, N'真州镇'),
	(32, 10, 81, 103, N'新集镇'),
	(32, 10, 81, 104, N'新城镇'),
	(32, 10, 81, 105, N'马集镇'),
	(32, 10, 81, 106, N'刘集镇'),
	(32, 10, 81, 107, N'陈集镇'),
	(32, 10, 81, 108, N'大仪镇'),
	(32, 10, 81, 109, N'月塘镇'),
	(32, 10, 81, 150, N'青山镇');

/* 江苏省，扬州市，高邮市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 10, 84, 001, N'高邮街道'),
	(32, 10, 84, 101, N'龙虬镇'),
	(32, 10, 84, 106, N'汤庄镇'),
	(32, 10, 84, 107, N'卸甲镇'),
	(32, 10, 84, 108, N'三垛镇'),
	(32, 10, 84, 109, N'甘垛镇'),
	(32, 10, 84, 112, N'界首镇'),
	(32, 10, 84, 113, N'周山镇'),
	(32, 10, 84, 115, N'临泽镇'),
	(32, 10, 84, 116, N'送桥镇'),
	(32, 10, 84, 200, N'菱塘回族乡');

/* 江苏省，镇江市，京口区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 11, 02, 001, N'正东路街道'),
	(32, 11, 02, 002, N'健康路街道'),
	(32, 11, 02, 003, N'大市口街道'),
	(32, 11, 02, 004, N'四牌楼街道'),
	(32, 11, 02, 005, N'象山街道'),
	(32, 11, 02, 006, N'谏壁街道');

/* 江苏省，镇江市，润州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 11, 11, 001, N'宝塔路街道'),
	(32, 11, 11, 002, N'和平路街道'),
	(32, 11, 11, 003, N'金山街道'),
	(32, 11, 11, 004, N'七里甸街道'),
	(32, 11, 11, 005, N'蒋乔街道'),
	(32, 11, 11, 006, N'官塘桥街道'),
	(32, 11, 11, 007, N'韦岗街道');

/* 江苏省，镇江市，丹徒区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 11, 12, 001, N'高资街道'),
	(32, 11, 12, 100, N'高桥镇'),
	(32, 11, 12, 101, N'辛丰镇'),
	(32, 11, 12, 102, N'谷阳镇'),
	(32, 11, 12, 103, N'上党镇'),
	(32, 11, 12, 104, N'宝堰镇'),
	(32, 11, 12, 105, N'世业镇');

/* 江苏省，镇江市，丹阳市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 11, 81, 001, N'云阳街道'),
	(32, 11, 81, 002, N'曲阿街道'),
	(32, 11, 81, 100, N'司徒镇'),
	(32, 11, 81, 101, N'延陵镇'),
	(32, 11, 81, 102, N'珥陵镇'),
	(32, 11, 81, 103, N'导墅镇'),
	(32, 11, 81, 104, N'皇塘镇'),
	(32, 11, 81, 105, N'吕城镇'),
	(32, 11, 81, 106, N'陵口镇'),
	(32, 11, 81, 107, N'访仙镇'),
	(32, 11, 81, 108, N'界牌镇'),
	(32, 11, 81, 113, N'丹北镇');

/* 江苏省，镇江市，扬中市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 11, 82, 001, N'三茅街道'),
	(32, 11, 82, 101, N'新坝镇'),
	(32, 11, 82, 102, N'油坊镇'),
	(32, 11, 82, 103, N'八桥镇'),
	(32, 11, 82, 104, N'西来桥镇');

/* 江苏省，镇江市，句容市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 11, 83, 002, N'华阳街道'),
	(32, 11, 83, 102, N'下蜀镇'),
	(32, 11, 83, 103, N'白兔镇'),
	(32, 11, 83, 104, N'边城镇'),
	(32, 11, 83, 105, N'茅山镇'),
	(32, 11, 83, 106, N'后白镇'),
	(32, 11, 83, 107, N'郭庄镇'),
	(32, 11, 83, 108, N'天王镇'),
	(32, 11, 83, 109, N'宝华镇');

/* 江苏省，泰州市，海陵区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 12, 02, 001, N'城东街道'),
	(32, 12, 02, 002, N'城西街道'),
	(32, 12, 02, 003, N'城南街道'),
	(32, 12, 02, 004, N'城中街道'),
	(32, 12, 02, 005, N'城北街道'),
	(32, 12, 02, 007, N'京泰路街道'),
	(32, 12, 02, 050, N'红旗街道'),
	(32, 12, 02, 100, N'九龙镇'),
	(32, 12, 02, 101, N'罡杨镇'),
	(32, 12, 02, 102, N'苏陈镇');

/* 江苏省，泰州市，高港区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 12, 03, 001, N'口岸街道'),
	(32, 12, 03, 002, N'刁铺街道'),
	(32, 12, 03, 003, N'许庄街道'),
	(32, 12, 03, 100, N'永安洲镇'),
	(32, 12, 03, 101, N'白马镇'),
	(32, 12, 03, 103, N'胡庄镇'),
	(32, 12, 03, 104, N'大泗镇');

/* 江苏省，泰州市，姜堰区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 12, 04, 001, N'罗塘街道办事处'),
	(32, 12, 04, 002, N'三水街道办事处'),
	(32, 12, 04, 101, N'溱潼镇'),
	(32, 12, 04, 102, N'蒋垛镇'),
	(32, 12, 04, 103, N'顾高镇'),
	(32, 12, 04, 104, N'大伦镇'),
	(32, 12, 04, 105, N'张甸镇'),
	(32, 12, 04, 107, N'梁徐镇'),
	(32, 12, 04, 109, N'桥头镇'),
	(32, 12, 04, 110, N'淤溪镇'),
	(32, 12, 04, 111, N'白米镇'),
	(32, 12, 04, 112, N'娄庄镇'),
	(32, 12, 04, 113, N'沈高镇'),
	(32, 12, 04, 114, N'兴泰镇'),
	(32, 12, 04, 115, N'俞垛镇'),
	(32, 12, 04, 116, N'华港镇');

/* 江苏省，泰州市，兴化市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 12, 81, 100, N'戴窑镇'),
	(32, 12, 81, 101, N'合陈镇'),
	(32, 12, 81, 102, N'永丰镇'),
	(32, 12, 81, 103, N'新垛镇'),
	(32, 12, 81, 104, N'安丰镇'),
	(32, 12, 81, 105, N'海南镇'),
	(32, 12, 81, 106, N'钓鱼镇'),
	(32, 12, 81, 107, N'大邹镇'),
	(32, 12, 81, 108, N'沙沟镇'),
	(32, 12, 81, 109, N'中堡镇'),
	(32, 12, 81, 110, N'李中镇'),
	(32, 12, 81, 111, N'西郊镇'),
	(32, 12, 81, 112, N'临城镇'),
	(32, 12, 81, 113, N'垛田镇'),
	(32, 12, 81, 114, N'竹泓镇'),
	(32, 12, 81, 115, N'沈沦镇'),
	(32, 12, 81, 116, N'大垛镇'),
	(32, 12, 81, 117, N'荻垛镇'),
	(32, 12, 81, 118, N'陶庄镇'),
	(32, 12, 81, 119, N'昌荣镇'),
	(32, 12, 81, 120, N'茅山镇'),
	(32, 12, 81, 121, N'周庄镇'),
	(32, 12, 81, 122, N'陈堡镇'),
	(32, 12, 81, 123, N'戴南镇'),
	(32, 12, 81, 124, N'张郭镇'),
	(32, 12, 81, 125, N'昭阳镇'),
	(32, 12, 81, 126, N'大营镇'),
	(32, 12, 81, 127, N'下圩镇'),
	(32, 12, 81, 128, N'城东镇'),
	(32, 12, 81, 200, N'老圩乡'),
	(32, 12, 81, 201, N'周奋乡'),
	(32, 12, 81, 202, N'缸顾乡'),
	(32, 12, 81, 203, N'西鲍乡'),
	(32, 12, 81, 204, N'林湖乡');

/* 江苏省，泰州市，靖江市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 12, 82, 001, N'靖城街道办'),
	(32, 12, 82, 101, N'新桥镇'),
	(32, 12, 82, 102, N'东兴镇'),
	(32, 12, 82, 103, N'斜桥镇'),
	(32, 12, 82, 104, N'西来镇'),
	(32, 12, 82, 105, N'季市镇'),
	(32, 12, 82, 106, N'孤山镇'),
	(32, 12, 82, 108, N'生祠镇'),
	(32, 12, 82, 109, N'马桥镇');

/* 江苏省，泰州市，泰兴市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 12, 83, 001, N'济川街道办事处'),
	(32, 12, 83, 100, N'黄桥镇'),
	(32, 12, 83, 101, N'分界镇'),
	(32, 12, 83, 102, N'古溪镇'),
	(32, 12, 83, 104, N'元竹镇'),
	(32, 12, 83, 105, N'珊瑚镇'),
	(32, 12, 83, 106, N'广陵镇'),
	(32, 12, 83, 108, N'曲霞镇'),
	(32, 12, 83, 109, N'张桥镇'),
	(32, 12, 83, 112, N'河失镇'),
	(32, 12, 83, 113, N'新街镇'),
	(32, 12, 83, 114, N'姚王镇'),
	(32, 12, 83, 115, N'宣堡镇'),
	(32, 12, 83, 123, N'滨江镇'),
	(32, 12, 83, 124, N'虹桥镇'),
	(32, 12, 83, 200, N'根思乡');

/* 江苏省，宿迁市，宿城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 13, 02, 001, N'幸福街道'),
	(32, 13, 02, 002, N'项里街道'),
	(32, 13, 02, 003, N'河滨街道'),
	(32, 13, 02, 004, N'古城街道'),
	(32, 13, 02, 100, N'双庄镇'),
	(32, 13, 02, 101, N'耿车镇'),
	(32, 13, 02, 102, N'埠子镇'),
	(32, 13, 02, 103, N'龙河镇'),
	(32, 13, 02, 104, N'洋北镇'),
	(32, 13, 02, 107, N'中扬镇'),
	(32, 13, 02, 109, N'陈集镇'),
	(32, 13, 02, 110, N'蔡集镇'),
	(32, 13, 02, 111, N'王官集镇'),
	(32, 13, 02, 150, N'洋河镇'),
	(32, 13, 02, 151, N'仓集镇'),
	(32, 13, 02, 152, N'郑楼镇'),
	(32, 13, 02, 201, N'罗圩乡'),
	(32, 13, 02, 203, N'屠园乡');

/* 江苏省，宿迁市，宿豫区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 13, 11, 001, N'顺河街道'),
	(32, 13, 11, 002, N'豫新街道'),
	(32, 13, 11, 003, N'下相街道'),
	(32, 13, 11, 105, N'仰化镇'),
	(32, 13, 11, 106, N'大兴镇'),
	(32, 13, 11, 107, N'丁嘴镇'),
	(32, 13, 11, 108, N'来龙镇'),
	(32, 13, 11, 110, N'陆集镇'),
	(32, 13, 11, 111, N'关庙镇'),
	(32, 13, 11, 112, N'侍岭镇'),
	(32, 13, 11, 113, N'新庄镇'),
	(32, 13, 11, 150, N'晓店镇'),
	(32, 13, 11, 151, N'皂河镇'),
	(32, 13, 11, 152, N'黄墩镇'),
	(32, 13, 11, 201, N'曹集乡'),
	(32, 13, 11, 202, N'保安乡'),
	(32, 13, 11, 250, N'井头乡');

/* 江苏省，宿迁市，沭阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 13, 22, 001, N'沭城街道办事处'),
	(32, 13, 22, 002, N'南湖街道办事处'),
	(32, 13, 22, 003, N'梦溪街道办事处'),
	(32, 13, 22, 004, N'十字街道办事处'),
	(32, 13, 22, 005, N'章集街道办事处'),
	(32, 13, 22, 006, N'七雄街道办事处'),
	(32, 13, 22, 101, N'陇集镇'),
	(32, 13, 22, 102, N'胡集镇'),
	(32, 13, 22, 103, N'钱集镇'),
	(32, 13, 22, 104, N'塘沟镇'),
	(32, 13, 22, 105, N'马厂镇'),
	(32, 13, 22, 106, N'沂涛镇'),
	(32, 13, 22, 107, N'庙头镇'),
	(32, 13, 22, 108, N'韩山镇'),
	(32, 13, 22, 109, N'华冲镇'),
	(32, 13, 22, 110, N'桑墟镇'),
	(32, 13, 22, 111, N'悦来镇'),
	(32, 13, 22, 112, N'刘集镇'),
	(32, 13, 22, 114, N'李恒镇'),
	(32, 13, 22, 115, N'扎下镇'),
	(32, 13, 22, 116, N'颜集镇'),
	(32, 13, 22, 117, N'潼阳镇'),
	(32, 13, 22, 118, N'龙庙镇'),
	(32, 13, 22, 119, N'高墟镇'),
	(32, 13, 22, 120, N'耿圩镇'),
	(32, 13, 22, 122, N'汤涧镇'),
	(32, 13, 22, 124, N'新河镇'),
	(32, 13, 22, 125, N'贤官镇'),
	(32, 13, 22, 126, N'吴集镇'),
	(32, 13, 22, 127, N'湖东镇'),
	(32, 13, 22, 128, N'青伊湖镇'),
	(32, 13, 22, 200, N'北丁集乡'),
	(32, 13, 22, 201, N'周集乡'),
	(32, 13, 22, 202, N'东小店乡'),
	(32, 13, 22, 203, N'张圩乡'),
	(32, 13, 22, 204, N'茆圩乡'),
	(32, 13, 22, 205, N'西圩乡'),
	(32, 13, 22, 206, N'万匹乡'),
	(32, 13, 22, 207, N'官墩乡');

/* 江苏省，宿迁市，泗阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 13, 23, 100, N'众兴镇'),
	(32, 13, 23, 101, N'爱园镇'),
	(32, 13, 23, 102, N'王集镇'),
	(32, 13, 23, 103, N'裴圩镇'),
	(32, 13, 23, 104, N'新袁镇'),
	(32, 13, 23, 105, N'李口镇'),
	(32, 13, 23, 106, N'临河镇'),
	(32, 13, 23, 107, N'穿城镇'),
	(32, 13, 23, 108, N'张家圩镇'),
	(32, 13, 23, 109, N'高渡镇'),
	(32, 13, 23, 110, N'卢集镇'),
	(32, 13, 23, 200, N'庄圩乡'),
	(32, 13, 23, 201, N'里仁乡'),
	(32, 13, 23, 202, N'三庄乡'),
	(32, 13, 23, 203, N'南刘集乡'),
	(32, 13, 23, 204, N'八集乡');

/* 江苏省，宿迁市，泗洪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(32, 13, 24, 100, N'青阳镇'),
	(32, 13, 24, 101, N'双沟镇'),
	(32, 13, 24, 102, N'上塘镇'),
	(32, 13, 24, 103, N'魏营镇'),
	(32, 13, 24, 104, N'临淮镇'),
	(32, 13, 24, 105, N'半城镇'),
	(32, 13, 24, 106, N'孙园镇'),
	(32, 13, 24, 107, N'梅花镇'),
	(32, 13, 24, 108, N'归仁镇'),
	(32, 13, 24, 109, N'金锁镇'),
	(32, 13, 24, 110, N'朱湖镇'),
	(32, 13, 24, 111, N'界集镇'),
	(32, 13, 24, 112, N'太平镇'),
	(32, 13, 24, 113, N'龙集镇'),
	(32, 13, 24, 200, N'四河乡'),
	(32, 13, 24, 201, N'峰山乡'),
	(32, 13, 24, 202, N'天岗湖乡'),
	(32, 13, 24, 203, N'车门乡'),
	(32, 13, 24, 204, N'瑶沟乡'),
	(32, 13, 24, 205, N'石集乡'),
	(32, 13, 24, 206, N'城头乡'),
	(32, 13, 24, 207, N'陈圩乡'),
	(32, 13, 24, 208, N'曹庙乡');


/* 浙江省，杭州市，上城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 02, 001, N'清波街道'),
	(33, 01, 02, 003, N'湖滨街道'),
	(33, 01, 02, 004, N'小营街道'),
	(33, 01, 02, 008, N'南星街道'),
	(33, 01, 02, 009, N'紫阳街道'),
	(33, 01, 02, 010, N'望江街道');

/* 浙江省，杭州市，下城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 03, 001, N'长庆街道'),
	(33, 01, 03, 002, N'武林街道'),
	(33, 01, 03, 003, N'天水街道'),
	(33, 01, 03, 005, N'潮鸣街道'),
	(33, 01, 03, 006, N'朝晖街道'),
	(33, 01, 03, 007, N'文晖街道'),
	(33, 01, 03, 008, N'东新街道'),
	(33, 01, 03, 009, N'石桥街道');

/* 浙江省，杭州市，江干区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 04, 005, N'凯旋街道'),
	(33, 01, 04, 006, N'采荷街道'),
	(33, 01, 04, 007, N'闸弄口街道'),
	(33, 01, 04, 008, N'四季青街道'),
	(33, 01, 04, 009, N'白杨街道'),
	(33, 01, 04, 010, N'下沙街道'),
	(33, 01, 04, 011, N'彭埠街道'),
	(33, 01, 04, 012, N'笕桥街道'),
	(33, 01, 04, 013, N'丁兰街道'),
	(33, 01, 04, 014, N'九堡街道');

/* 浙江省，杭州市，拱墅区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 05, 001, N'米市巷街道'),
	(33, 01, 05, 002, N'湖墅街道'),
	(33, 01, 05, 003, N'小河街道'),
	(33, 01, 05, 004, N'和睦街道'),
	(33, 01, 05, 005, N'拱宸桥街道'),
	(33, 01, 05, 007, N'大关街道'),
	(33, 01, 05, 008, N'上塘街道'),
	(33, 01, 05, 009, N'祥符街道'),
	(33, 01, 05, 010, N'康桥街道'),
	(33, 01, 05, 011, N'半山街道');

/* 浙江省，杭州市，西湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 06, 002, N'北山街道'),
	(33, 01, 06, 004, N'西溪街道'),
	(33, 01, 06, 005, N'翠苑街道'),
	(33, 01, 06, 007, N'古荡街道'),
	(33, 01, 06, 008, N'西湖街道'),
	(33, 01, 06, 009, N'留下街道'),
	(33, 01, 06, 010, N'转塘街道'),
	(33, 01, 06, 011, N'蒋村街道'),
	(33, 01, 06, 012, N'灵隐街道'),
	(33, 01, 06, 013, N'文新街道'),
	(33, 01, 06, 109, N'三墩镇'),
	(33, 01, 06, 110, N'双浦镇');

/* 浙江省，杭州市，滨江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 08, 001, N'西兴街道'),
	(33, 01, 08, 002, N'长河街道'),
	(33, 01, 08, 003, N'浦沿街道');

/* 浙江省，杭州市，萧山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 09, 001, N'城厢街道'),
	(33, 01, 09, 002, N'北干街道'),
	(33, 01, 09, 003, N'蜀山街道'),
	(33, 01, 09, 004, N'新塘街道'),
	(33, 01, 09, 005, N'靖江街道'),
	(33, 01, 09, 006, N'南阳街道'),
	(33, 01, 09, 007, N'义蓬街道'),
	(33, 01, 09, 008, N'河庄街道'),
	(33, 01, 09, 009, N'新湾街道'),
	(33, 01, 09, 010, N'临江街道'),
	(33, 01, 09, 011, N'前进街道'),
	(33, 01, 09, 012, N'闻堰街道'),
	(33, 01, 09, 013, N'宁围街道'),
	(33, 01, 09, 014, N'新街街道'),
	(33, 01, 09, 100, N'楼塔镇'),
	(33, 01, 09, 101, N'河上镇'),
	(33, 01, 09, 102, N'戴村镇'),
	(33, 01, 09, 103, N'浦阳镇'),
	(33, 01, 09, 104, N'进化镇'),
	(33, 01, 09, 105, N'临浦镇'),
	(33, 01, 09, 106, N'义桥镇'),
	(33, 01, 09, 107, N'所前镇'),
	(33, 01, 09, 108, N'衙前镇'),
	(33, 01, 09, 113, N'瓜沥镇'),
	(33, 01, 09, 115, N'益农镇'),
	(33, 01, 09, 120, N'党湾镇');

/* 浙江省，杭州市，余杭区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 10, 001, N'临平街道'),
	(33, 01, 10, 002, N'南苑街道'),
	(33, 01, 10, 003, N'东湖街道'),
	(33, 01, 10, 004, N'星桥街道'),
	(33, 01, 10, 005, N'五常街道'),
	(33, 01, 10, 006, N'乔司街道'),
	(33, 01, 10, 007, N'运河街道'),
	(33, 01, 10, 008, N'崇贤街道'),
	(33, 01, 10, 009, N'仁和街道'),
	(33, 01, 10, 010, N'良渚街道'),
	(33, 01, 10, 011, N'闲林街道'),
	(33, 01, 10, 012, N'仓前街道'),
	(33, 01, 10, 013, N'余杭街道'),
	(33, 01, 10, 014, N'中泰街道'),
	(33, 01, 10, 102, N'塘栖镇'),
	(33, 01, 10, 109, N'径山镇'),
	(33, 01, 10, 110, N'瓶窑镇'),
	(33, 01, 10, 111, N'鸬鸟镇'),
	(33, 01, 10, 112, N'百丈镇'),
	(33, 01, 10, 113, N'黄湖镇');

/* 浙江省，杭州市，富阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 11, 001, N'富春街道'),
	(33, 01, 11, 002, N'春江街道'),
	(33, 01, 11, 004, N'鹿山街道'),
	(33, 01, 11, 005, N'东洲街道'),
	(33, 01, 11, 006, N'银湖街道'),
	(33, 01, 11, 100, N'万市镇'),
	(33, 01, 11, 101, N'洞桥镇'),
	(33, 01, 11, 103, N'渌渚镇'),
	(33, 01, 11, 105, N'永昌镇'),
	(33, 01, 11, 108, N'里山镇'),
	(33, 01, 11, 109, N'常绿镇'),
	(33, 01, 11, 110, N'场口镇'),
	(33, 01, 11, 111, N'常安镇'),
	(33, 01, 11, 112, N'龙门镇'),
	(33, 01, 11, 115, N'新登镇'),
	(33, 01, 11, 116, N'胥口镇'),
	(33, 01, 11, 117, N'大源镇'),
	(33, 01, 11, 118, N'灵桥镇'),
	(33, 01, 11, 200, N'新桐乡'),
	(33, 01, 11, 201, N'上官乡'),
	(33, 01, 11, 204, N'环山乡'),
	(33, 01, 11, 205, N'湖源乡'),
	(33, 01, 11, 206, N'春建乡'),
	(33, 01, 11, 207, N'渔山乡');

/* 浙江省，杭州市，桐庐县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 22, 002, N'旧县街道'),
	(33, 01, 22, 003, N'桐君街道'),
	(33, 01, 22, 004, N'城南街道'),
	(33, 01, 22, 005, N'凤川街道'),
	(33, 01, 22, 101, N'富春江镇'),
	(33, 01, 22, 102, N'横村镇'),
	(33, 01, 22, 109, N'分水镇'),
	(33, 01, 22, 110, N'瑶琳镇'),
	(33, 01, 22, 112, N'百江镇'),
	(33, 01, 22, 113, N'江南镇'),
	(33, 01, 22, 201, N'莪山畲族乡'),
	(33, 01, 22, 202, N'钟山乡'),
	(33, 01, 22, 204, N'新合乡'),
	(33, 01, 22, 210, N'合村乡');

/* 浙江省，杭州市，淳安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 27, 100, N'千岛湖镇'),
	(33, 01, 27, 101, N'文昌镇'),
	(33, 01, 27, 102, N'石林镇'),
	(33, 01, 27, 103, N'临岐镇'),
	(33, 01, 27, 104, N'威坪镇'),
	(33, 01, 27, 106, N'姜家镇'),
	(33, 01, 27, 107, N'梓桐镇'),
	(33, 01, 27, 108, N'汾口镇'),
	(33, 01, 27, 109, N'中洲镇'),
	(33, 01, 27, 110, N'大墅镇'),
	(33, 01, 27, 111, N'枫树岭镇'),
	(33, 01, 27, 200, N'里商乡'),
	(33, 01, 27, 201, N'金峰乡'),
	(33, 01, 27, 202, N'富文乡'),
	(33, 01, 27, 203, N'左口乡'),
	(33, 01, 27, 205, N'屏门乡'),
	(33, 01, 27, 206, N'瑶山乡'),
	(33, 01, 27, 208, N'王阜乡'),
	(33, 01, 27, 210, N'宋村乡'),
	(33, 01, 27, 211, N'鸠坑乡'),
	(33, 01, 27, 212, N'浪川乡'),
	(33, 01, 27, 214, N'界首乡'),
	(33, 01, 27, 216, N'安阳乡');

/* 浙江省，杭州市，建德市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 82, 001, N'新安江街道'),
	(33, 01, 82, 002, N'洋溪街道'),
	(33, 01, 82, 003, N'更楼街道'),
	(33, 01, 82, 101, N'莲花镇'),
	(33, 01, 82, 102, N'乾潭镇'),
	(33, 01, 82, 104, N'梅城镇'),
	(33, 01, 82, 105, N'杨村桥镇'),
	(33, 01, 82, 106, N'下涯镇'),
	(33, 01, 82, 107, N'大洋镇'),
	(33, 01, 82, 108, N'三都镇'),
	(33, 01, 82, 109, N'寿昌镇'),
	(33, 01, 82, 110, N'航头镇'),
	(33, 01, 82, 111, N'大慈岩镇'),
	(33, 01, 82, 112, N'大同镇'),
	(33, 01, 82, 113, N'李家镇'),
	(33, 01, 82, 202, N'钦堂乡');

/* 浙江省，杭州市，临安市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 01, 85, 002, N'玲珑街道'),
	(33, 01, 85, 005, N'锦南街道'),
	(33, 01, 85, 006, N'锦城街道'),
	(33, 01, 85, 007, N'锦北街道'),
	(33, 01, 85, 008, N'青山湖街道'),
	(33, 01, 85, 102, N'高虹镇'),
	(33, 01, 85, 103, N'太湖源镇'),
	(33, 01, 85, 104, N'於潜镇'),
	(33, 01, 85, 106, N'太阳镇'),
	(33, 01, 85, 107, N'潜川镇'),
	(33, 01, 85, 108, N'昌化镇'),
	(33, 01, 85, 109, N'河桥镇'),
	(33, 01, 85, 111, N'湍口镇'),
	(33, 01, 85, 112, N'清凉峰镇'),
	(33, 01, 85, 113, N'岛石镇'),
	(33, 01, 85, 115, N'板桥镇'),
	(33, 01, 85, 116, N'天目山镇'),
	(33, 01, 85, 117, N'龙岗镇');

/* 浙江省，宁波市，海曙区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 02, 03, 001, N'南门街道'),
	(33, 02, 03, 002, N'江厦街道'),
	(33, 02, 03, 003, N'西门街道'),
	(33, 02, 03, 004, N'月湖街道'),
	(33, 02, 03, 005, N'鼓楼街道'),
	(33, 02, 03, 006, N'白云街道'),
	(33, 02, 03, 007, N'段塘街道'),
	(33, 02, 03, 008, N'望春街道');

/* 浙江省，宁波市，江东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 02, 04, 001, N'百丈街道'),
	(33, 02, 04, 002, N'东胜街道'),
	(33, 02, 04, 003, N'明楼街道'),
	(33, 02, 04, 004, N'白鹤街道'),
	(33, 02, 04, 005, N'东柳街道'),
	(33, 02, 04, 006, N'东郊街道'),
	(33, 02, 04, 007, N'福明街道'),
	(33, 02, 04, 008, N'新明街道');

/* 浙江省，宁波市，江北区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 02, 05, 001, N'中马街道'),
	(33, 02, 05, 002, N'白沙街道'),
	(33, 02, 05, 003, N'孔浦街道'),
	(33, 02, 05, 004, N'文教街道'),
	(33, 02, 05, 005, N'甬江街道'),
	(33, 02, 05, 006, N'庄桥街道'),
	(33, 02, 05, 007, N'洪塘街道'),
	(33, 02, 05, 103, N'慈城镇');

/* 浙江省，宁波市，北仑区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 02, 06, 001, N'大榭街道'),
	(33, 02, 06, 002, N'新碶街道'),
	(33, 02, 06, 003, N'小港街道'),
	(33, 02, 06, 004, N'大碶街道'),
	(33, 02, 06, 005, N'霞浦街道'),
	(33, 02, 06, 006, N'柴桥街道'),
	(33, 02, 06, 007, N'戚家山街道'),
	(33, 02, 06, 008, N'春晓街道'),
	(33, 02, 06, 009, N'梅山街道'),
	(33, 02, 06, 105, N'白峰镇');

/* 浙江省，宁波市，镇海区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 02, 11, 001, N'招宝山街道'),
	(33, 02, 11, 002, N'蛟川街道'),
	(33, 02, 11, 003, N'骆驼街道'),
	(33, 02, 11, 004, N'庄市街道'),
	(33, 02, 11, 005, N'贵驷街道'),
	(33, 02, 11, 100, N'澥浦镇'),
	(33, 02, 11, 101, N'九龙湖镇');

/* 浙江省，宁波市，鄞州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 02, 12, 001, N'下应街道'),
	(33, 02, 12, 002, N'钟公庙街道'),
	(33, 02, 12, 003, N'石碶街道'),
	(33, 02, 12, 004, N'梅墟街道'),
	(33, 02, 12, 005, N'中河街道'),
	(33, 02, 12, 006, N'首南街道'),
	(33, 02, 12, 007, N'潘火街道'),
	(33, 02, 12, 100, N'瞻岐镇'),
	(33, 02, 12, 101, N'咸祥镇'),
	(33, 02, 12, 102, N'塘溪镇'),
	(33, 02, 12, 103, N'东钱湖镇'),
	(33, 02, 12, 104, N'东吴镇'),
	(33, 02, 12, 105, N'五乡镇'),
	(33, 02, 12, 106, N'邱隘镇'),
	(33, 02, 12, 108, N'云龙镇'),
	(33, 02, 12, 109, N'横溪镇'),
	(33, 02, 12, 110, N'姜山镇'),
	(33, 02, 12, 113, N'高桥镇'),
	(33, 02, 12, 114, N'横街镇'),
	(33, 02, 12, 115, N'集士港镇'),
	(33, 02, 12, 116, N'古林镇'),
	(33, 02, 12, 118, N'洞桥镇'),
	(33, 02, 12, 119, N'鄞江镇'),
	(33, 02, 12, 120, N'章水镇'),
	(33, 02, 12, 200, N'龙观乡');

/* 浙江省，宁波市，象山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 02, 25, 001, N'丹东街道'),
	(33, 02, 25, 002, N'丹西街道'),
	(33, 02, 25, 003, N'爵溪街道'),
	(33, 02, 25, 101, N'石浦镇'),
	(33, 02, 25, 102, N'西周镇'),
	(33, 02, 25, 103, N'鹤浦镇'),
	(33, 02, 25, 104, N'贤庠镇'),
	(33, 02, 25, 105, N'墙头镇'),
	(33, 02, 25, 106, N'泗洲头镇'),
	(33, 02, 25, 107, N'定塘镇'),
	(33, 02, 25, 108, N'涂茨镇'),
	(33, 02, 25, 109, N'大徐镇'),
	(33, 02, 25, 110, N'新桥镇'),
	(33, 02, 25, 200, N'东陈乡'),
	(33, 02, 25, 201, N'晓塘乡'),
	(33, 02, 25, 202, N'黄避岙乡'),
	(33, 02, 25, 203, N'茅洋乡'),
	(33, 02, 25, 204, N'高塘岛乡');

/* 浙江省，宁波市，宁海县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 02, 26, 001, N'跃龙街道'),
	(33, 02, 26, 002, N'桃源街道'),
	(33, 02, 26, 003, N'梅林街道'),
	(33, 02, 26, 004, N'桥头胡街道'),
	(33, 02, 26, 101, N'长街镇'),
	(33, 02, 26, 102, N'力洋镇'),
	(33, 02, 26, 104, N'一市镇'),
	(33, 02, 26, 105, N'岔路镇'),
	(33, 02, 26, 106, N'前童镇'),
	(33, 02, 26, 107, N'桑洲镇'),
	(33, 02, 26, 108, N'黄坛镇'),
	(33, 02, 26, 109, N'大佳何镇'),
	(33, 02, 26, 110, N'强蛟镇'),
	(33, 02, 26, 111, N'西店镇'),
	(33, 02, 26, 112, N'深甽镇'),
	(33, 02, 26, 200, N'胡陈乡'),
	(33, 02, 26, 201, N'茶院乡'),
	(33, 02, 26, 202, N'越溪乡');

/* 浙江省，宁波市，余姚市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 02, 81, 001, N'梨洲街道'),
	(33, 02, 81, 002, N'凤山街道'),
	(33, 02, 81, 003, N'兰江街道'),
	(33, 02, 81, 004, N'阳明街道'),
	(33, 02, 81, 005, N'低塘街道'),
	(33, 02, 81, 006, N'朗霞街道'),
	(33, 02, 81, 100, N'临山镇'),
	(33, 02, 81, 101, N'黄家埠镇'),
	(33, 02, 81, 102, N'小曹娥镇'),
	(33, 02, 81, 103, N'泗门镇'),
	(33, 02, 81, 106, N'马渚镇'),
	(33, 02, 81, 108, N'牟山镇'),
	(33, 02, 81, 109, N'丈亭镇'),
	(33, 02, 81, 110, N'三七市镇'),
	(33, 02, 81, 111, N'河姆渡镇'),
	(33, 02, 81, 112, N'大隐镇'),
	(33, 02, 81, 113, N'陆埠镇'),
	(33, 02, 81, 114, N'梁弄镇'),
	(33, 02, 81, 115, N'大岚镇'),
	(33, 02, 81, 116, N'四明山镇'),
	(33, 02, 81, 201, N'鹿亭乡');

/* 浙江省，宁波市，慈溪市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 02, 82, 002, N'宗汉街道'),
	(33, 02, 82, 003, N'坎墩街道'),
	(33, 02, 82, 004, N'浒山街道'),
	(33, 02, 82, 005, N'白沙路街道'),
	(33, 02, 82, 006, N'古塘街道'),
	(33, 02, 82, 104, N'掌起镇'),
	(33, 02, 82, 107, N'观海卫镇'),
	(33, 02, 82, 108, N'附海镇'),
	(33, 02, 82, 109, N'桥头镇'),
	(33, 02, 82, 110, N'匡堰镇'),
	(33, 02, 82, 111, N'逍林镇'),
	(33, 02, 82, 112, N'新浦镇'),
	(33, 02, 82, 113, N'胜山镇'),
	(33, 02, 82, 114, N'横河镇'),
	(33, 02, 82, 116, N'崇寿镇'),
	(33, 02, 82, 118, N'庵东镇'),
	(33, 02, 82, 120, N'长河镇'),
	(33, 02, 82, 121, N'周巷镇'),
	(33, 02, 82, 123, N'龙山镇');

/* 浙江省，宁波市，奉化市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 02, 83, 001, N'锦屏街道'),
	(33, 02, 83, 002, N'岳林街道'),
	(33, 02, 83, 003, N'江口街道'),
	(33, 02, 83, 004, N'西坞街道'),
	(33, 02, 83, 005, N'萧王庙街道'),
	(33, 02, 83, 100, N'溪口镇'),
	(33, 02, 83, 103, N'尚田镇'),
	(33, 02, 83, 104, N'莼湖镇'),
	(33, 02, 83, 106, N'裘村镇'),
	(33, 02, 83, 107, N'大堰镇'),
	(33, 02, 83, 108, N'松岙镇');

/* 浙江省，温州市，鹿城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 03, 02, 006, N'五马街道'),
	(33, 03, 02, 023, N'七都街道'),
	(33, 03, 02, 024, N'滨江街道'),
	(33, 03, 02, 025, N'南汇街道'),
	(33, 03, 02, 026, N'松台街道'),
	(33, 03, 02, 027, N'双屿街道'),
	(33, 03, 02, 028, N'仰义街道'),
	(33, 03, 02, 029, N'大南街道'),
	(33, 03, 02, 030, N'蒲鞋市街道'),
	(33, 03, 02, 031, N'南郊街道'),
	(33, 03, 02, 032, N'广化街道'),
	(33, 03, 02, 033, N'丰门街道'),
	(33, 03, 02, 102, N'藤桥镇'),
	(33, 03, 02, 105, N'山福镇');

/* 浙江省，温州市，龙湾区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 03, 03, 001, N'永中街道'),
	(33, 03, 03, 002, N'蒲州街道'),
	(33, 03, 03, 003, N'海滨街道'),
	(33, 03, 03, 004, N'永兴街道'),
	(33, 03, 03, 006, N'状元街道'),
	(33, 03, 03, 007, N'瑶溪街道');

/* 浙江省，温州市，瓯海区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 03, 04, 001, N'景山街道'),
	(33, 03, 04, 002, N'梧田街道'),
	(33, 03, 04, 003, N'南白象街道'),
	(33, 03, 04, 004, N'茶山街道'),
	(33, 03, 04, 005, N'娄桥街道'),
	(33, 03, 04, 006, N'新桥街道'),
	(33, 03, 04, 007, N'三垟街道'),
	(33, 03, 04, 008, N'瞿溪街道'),
	(33, 03, 04, 009, N'郭溪街道'),
	(33, 03, 04, 010, N'潘桥街道'),
	(33, 03, 04, 011, N'丽岙街道'),
	(33, 03, 04, 012, N'仙岩街道'),
	(33, 03, 04, 108, N'泽雅镇');

/* 浙江省，温州市，洞头区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 03, 05, 001, N'北岙街道'),
	(33, 03, 05, 002, N'灵昆街道'),
	(33, 03, 05, 003, N'东屏街道'),
	(33, 03, 05, 004, N'元觉街道'),
	(33, 03, 05, 005, N'霓屿街道'),
	(33, 03, 05, 101, N'大门镇'),
	(33, 03, 05, 202, N'鹿西乡');

/* 浙江省，温州市，永嘉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 03, 24, 001, N'东城街道'),
	(33, 03, 24, 002, N'北城街道'),
	(33, 03, 24, 003, N'南城街道'),
	(33, 03, 24, 004, N'江北街道'),
	(33, 03, 24, 005, N'东瓯街道'),
	(33, 03, 24, 006, N'三江街道'),
	(33, 03, 24, 007, N'黄田街道'),
	(33, 03, 24, 008, N'乌牛街道'),
	(33, 03, 24, 102, N'桥头镇'),
	(33, 03, 24, 104, N'桥下镇'),
	(33, 03, 24, 105, N'大若岩镇'),
	(33, 03, 24, 106, N'碧莲镇'),
	(33, 03, 24, 107, N'巽宅镇'),
	(33, 03, 24, 108, N'岩头镇'),
	(33, 03, 24, 109, N'枫林镇'),
	(33, 03, 24, 110, N'岩坦镇'),
	(33, 03, 24, 111, N'沙头镇'),
	(33, 03, 24, 112, N'鹤盛镇');

/* 浙江省，温州市，平阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 03, 26, 100, N'昆阳镇'),
	(33, 03, 26, 101, N'鳌江镇'),
	(33, 03, 26, 102, N'水头镇'),
	(33, 03, 26, 103, N'萧江镇'),
	(33, 03, 26, 105, N'腾蛟镇'),
	(33, 03, 26, 107, N'山门镇'),
	(33, 03, 26, 108, N'顺溪镇'),
	(33, 03, 26, 109, N'南雁镇'),
	(33, 03, 26, 117, N'万全镇'),
	(33, 03, 26, 214, N'青街畲族乡');

/* 浙江省，温州市，苍南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 03, 27, 100, N'灵溪镇'),
	(33, 03, 27, 101, N'龙港镇'),
	(33, 03, 27, 103, N'宜山镇'),
	(33, 03, 27, 104, N'钱库镇'),
	(33, 03, 27, 107, N'金乡镇'),
	(33, 03, 27, 112, N'藻溪镇'),
	(33, 03, 27, 113, N'桥墩镇'),
	(33, 03, 27, 116, N'矾山镇'),
	(33, 03, 27, 117, N'赤溪镇'),
	(33, 03, 27, 118, N'马站镇'),
	(33, 03, 27, 216, N'凤阳畲族乡'),
	(33, 03, 27, 218, N'岱岭畲族乡');

/* 浙江省，温州市，文成县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 03, 28, 100, N'大峃镇'),
	(33, 03, 28, 101, N'百丈漈镇'),
	(33, 03, 28, 102, N'南田镇'),
	(33, 03, 28, 103, N'西坑畲族镇'),
	(33, 03, 28, 104, N'黄坦镇'),
	(33, 03, 28, 105, N'珊溪镇'),
	(33, 03, 28, 106, N'巨屿镇'),
	(33, 03, 28, 107, N'玉壶镇'),
	(33, 03, 28, 108, N'峃口镇'),
	(33, 03, 28, 217, N'周山畲族乡');

/* 浙江省，温州市，泰顺县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 03, 29, 100, N'罗阳镇'),
	(33, 03, 29, 101, N'司前畲族镇'),
	(33, 03, 29, 102, N'百丈镇'),
	(33, 03, 29, 103, N'筱村镇'),
	(33, 03, 29, 104, N'泗溪镇'),
	(33, 03, 29, 105, N'彭溪镇'),
	(33, 03, 29, 106, N'雅阳镇'),
	(33, 03, 29, 107, N'仕阳镇'),
	(33, 03, 29, 109, N'三魁镇'),
	(33, 03, 29, 204, N'竹里畲族乡');

/* 浙江省，温州市，瑞安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 03, 81, 001, N'安阳街道'),
	(33, 03, 81, 002, N'玉海街道'),
	(33, 03, 81, 003, N'锦湖街道'),
	(33, 03, 81, 004, N'东山街道'),
	(33, 03, 81, 005, N'上望街道'),
	(33, 03, 81, 007, N'莘塍街道'),
	(33, 03, 81, 008, N'汀田街道'),
	(33, 03, 81, 009, N'飞云街道'),
	(33, 03, 81, 010, N'仙降街道'),
	(33, 03, 81, 011, N'南滨街道'),
	(33, 03, 81, 101, N'塘下镇'),
	(33, 03, 81, 116, N'马屿镇'),
	(33, 03, 81, 120, N'陶山镇'),
	(33, 03, 81, 122, N'湖岭镇'),
	(33, 03, 81, 125, N'高楼镇');

/* 浙江省，温州市，乐清市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 03, 82, 001, N'城东街道办事处'),
	(33, 03, 82, 002, N'乐成街道办事处'),
	(33, 03, 82, 003, N'城南街道办事处'),
	(33, 03, 82, 004, N'盐盆街道办事处'),
	(33, 03, 82, 005, N'翁垟街道办事处'),
	(33, 03, 82, 006, N'白石街道办事处'),
	(33, 03, 82, 007, N'石帆街道办事处'),
	(33, 03, 82, 008, N'天成街道办事处'),
	(33, 03, 82, 101, N'大荆镇'),
	(33, 03, 82, 102, N'仙溪镇'),
	(33, 03, 82, 104, N'雁荡镇'),
	(33, 03, 82, 105, N'芙蓉镇'),
	(33, 03, 82, 106, N'清江镇'),
	(33, 03, 82, 108, N'虹桥镇'),
	(33, 03, 82, 111, N'淡溪镇'),
	(33, 03, 82, 114, N'柳市镇'),
	(33, 03, 82, 115, N'北白象镇');

/* 浙江省，嘉兴市，南湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 04, 02, 007, N'建设街道'),
	(33, 04, 02, 008, N'解放街道'),
	(33, 04, 02, 009, N'新嘉街道'),
	(33, 04, 02, 010, N'南湖街道'),
	(33, 04, 02, 011, N'新兴街道'),
	(33, 04, 02, 012, N'城南街道'),
	(33, 04, 02, 013, N'东栅街道'),
	(33, 04, 02, 014, N'长水街道'),
	(33, 04, 02, 015, N'七星街道'),
	(33, 04, 02, 100, N'凤桥镇'),
	(33, 04, 02, 101, N'余新镇'),
	(33, 04, 02, 103, N'新丰镇'),
	(33, 04, 02, 105, N'大桥镇');

/* 浙江省，嘉兴市，秀洲区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 04, 11, 002, N'新城街道'),
	(33, 04, 11, 003, N'嘉北街道'),
	(33, 04, 11, 004, N'塘汇街道'),
	(33, 04, 11, 005, N'高照街道'),
	(33, 04, 11, 101, N'王江泾镇'),
	(33, 04, 11, 103, N'油车港镇'),
	(33, 04, 11, 104, N'新塍镇'),
	(33, 04, 11, 105, N'王店镇'),
	(33, 04, 11, 106, N'洪合镇');

/* 浙江省，嘉兴市，嘉善县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 04, 21, 001, N'魏塘街道'),
	(33, 04, 21, 002, N'罗星街道'),
	(33, 04, 21, 003, N'惠民街道'),
	(33, 04, 21, 102, N'大云镇'),
	(33, 04, 21, 103, N'西塘镇'),
	(33, 04, 21, 105, N'干窑镇'),
	(33, 04, 21, 107, N'陶庄镇'),
	(33, 04, 21, 111, N'姚庄镇'),
	(33, 04, 21, 112, N'天凝镇');

/* 浙江省，嘉兴市，海盐县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 04, 24, 001, N'武原街道'),
	(33, 04, 24, 002, N'西塘桥街道'),
	(33, 04, 24, 003, N'元通街道'),
	(33, 04, 24, 004, N'秦山街道'),
	(33, 04, 24, 101, N'沈荡镇'),
	(33, 04, 24, 102, N'百步镇'),
	(33, 04, 24, 103, N'于城镇'),
	(33, 04, 24, 105, N'澉浦镇'),
	(33, 04, 24, 106, N'通元镇');

/* 浙江省，嘉兴市，海宁市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 04, 81, 001, N'硖石街道'),
	(33, 04, 81, 002, N'海洲街道'),
	(33, 04, 81, 003, N'海昌街道'),
	(33, 04, 81, 004, N'马桥街道'),
	(33, 04, 81, 101, N'许村镇'),
	(33, 04, 81, 103, N'长安镇'),
	(33, 04, 81, 105, N'周王庙镇'),
	(33, 04, 81, 106, N'丁桥镇'),
	(33, 04, 81, 107, N'斜桥镇'),
	(33, 04, 81, 108, N'黄湾镇'),
	(33, 04, 81, 110, N'盐官镇'),
	(33, 04, 81, 112, N'袁花镇');

/* 浙江省，嘉兴市，平湖市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 04, 82, 001, N'当湖街道'),
	(33, 04, 82, 002, N'钟埭街道'),
	(33, 04, 82, 003, N'曹桥街道'),
	(33, 04, 82, 101, N'乍浦镇'),
	(33, 04, 82, 102, N'新埭镇'),
	(33, 04, 82, 103, N'新仓镇'),
	(33, 04, 82, 106, N'广陈镇'),
	(33, 04, 82, 107, N'林埭镇'),
	(33, 04, 82, 108, N'独山港镇');

/* 浙江省，嘉兴市，桐乡市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 04, 83, 001, N'梧桐街道'),
	(33, 04, 83, 002, N'龙翔街道'),
	(33, 04, 83, 003, N'凤鸣街道'),
	(33, 04, 83, 100, N'乌镇镇'),
	(33, 04, 83, 101, N'濮院镇'),
	(33, 04, 83, 102, N'屠甸镇'),
	(33, 04, 83, 103, N'石门镇'),
	(33, 04, 83, 104, N'河山镇'),
	(33, 04, 83, 105, N'洲泉镇'),
	(33, 04, 83, 106, N'大麻镇'),
	(33, 04, 83, 107, N'崇福镇'),
	(33, 04, 83, 108, N'高桥镇');


/* 浙江省，湖州市，吴兴区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 05, 02, 001, N'月河街道'),
	(33, 05, 02, 002, N'朝阳街道'),
	(33, 05, 02, 003, N'爱山街道'),
	(33, 05, 02, 004, N'飞英街道'),
	(33, 05, 02, 005, N'龙泉街道'),
	(33, 05, 02, 006, N'凤凰街道'),
	(33, 05, 02, 007, N'康山街道'),
	(33, 05, 02, 008, N'仁皇山街道'),
	(33, 05, 02, 009, N'滨湖街道'),
	(33, 05, 02, 010, N'龙溪街道'),
	(33, 05, 02, 011, N'杨家埠街道'),
	(33, 05, 02, 012, N'环渚街道'),
	(33, 05, 02, 100, N'织里镇'),
	(33, 05, 02, 101, N'八里店镇'),
	(33, 05, 02, 102, N'妙西镇'),
	(33, 05, 02, 104, N'埭溪镇'),
	(33, 05, 02, 105, N'东林镇'),
	(33, 05, 02, 200, N'道场乡');

/* 浙江省，湖州市，南浔区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 05, 03, 100, N'南浔镇'),
	(33, 05, 03, 101, N'双林镇'),
	(33, 05, 03, 102, N'练市镇'),
	(33, 05, 03, 103, N'善琏镇'),
	(33, 05, 03, 104, N'旧馆镇'),
	(33, 05, 03, 105, N'菱湖镇'),
	(33, 05, 03, 106, N'和孚镇'),
	(33, 05, 03, 107, N'千金镇'),
	(33, 05, 03, 108, N'石淙镇');

/* 浙江省，湖州市，德清县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 05, 21, 100, N'武康镇'),
	(33, 05, 21, 101, N'乾元镇'),
	(33, 05, 21, 102, N'新市镇'),
	(33, 05, 21, 103, N'洛舍镇'),
	(33, 05, 21, 104, N'钟管镇'),
	(33, 05, 21, 105, N'莫干山镇'),
	(33, 05, 21, 110, N'雷甸镇'),
	(33, 05, 21, 113, N'禹越镇'),
	(33, 05, 21, 114, N'新安镇'),
	(33, 05, 21, 201, N'筏头乡'),
	(33, 05, 21, 202, N'三合乡');

/* 浙江省，湖州市，长兴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 05, 22, 001, N'雉城街道'),
	(33, 05, 22, 002, N'画溪街道'),
	(33, 05, 22, 003, N'太湖街道'),
	(33, 05, 22, 004, N'龙山街道'),
	(33, 05, 22, 101, N'洪桥镇'),
	(33, 05, 22, 102, N'李家巷镇'),
	(33, 05, 22, 103, N'夹浦镇'),
	(33, 05, 22, 104, N'林城镇'),
	(33, 05, 22, 106, N'虹星桥镇'),
	(33, 05, 22, 108, N'小浦镇'),
	(33, 05, 22, 110, N'和平镇'),
	(33, 05, 22, 111, N'泗安镇'),
	(33, 05, 22, 112, N'煤山镇'),
	(33, 05, 22, 200, N'水口乡'),
	(33, 05, 22, 202, N'吕山乡');

/* 浙江省，湖州市，安吉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 05, 23, 001, N'递铺街道'),
	(33, 05, 23, 002, N'昌硕街道'),
	(33, 05, 23, 003, N'灵峰街道'),
	(33, 05, 23, 004, N'孝源街道'),
	(33, 05, 23, 103, N'鄣吴镇'),
	(33, 05, 23, 104, N'杭垓镇'),
	(33, 05, 23, 105, N'孝丰镇'),
	(33, 05, 23, 106, N'报福镇'),
	(33, 05, 23, 107, N'章村镇'),
	(33, 05, 23, 108, N'天荒坪镇'),
	(33, 05, 23, 110, N'梅溪镇'),
	(33, 05, 23, 111, N'天子湖镇'),
	(33, 05, 23, 201, N'溪龙乡'),
	(33, 05, 23, 205, N'上墅乡'),
	(33, 05, 23, 206, N'山川乡');

/* 浙江省，绍兴市，越城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 06, 02, 001, N'塔山街道'),
	(33, 06, 02, 002, N'府山街道'),
	(33, 06, 02, 003, N'蕺山街道'),
	(33, 06, 02, 004, N'北海街道'),
	(33, 06, 02, 005, N'城南街道'),
	(33, 06, 02, 006, N'稽山街道'),
	(33, 06, 02, 007, N'迪荡街道'),
	(33, 06, 02, 100, N'东湖镇'),
	(33, 06, 02, 101, N'灵芝镇'),
	(33, 06, 02, 102, N'东浦镇'),
	(33, 06, 02, 103, N'鉴湖镇'),
	(33, 06, 02, 104, N'皋埠镇'),
	(33, 06, 02, 105, N'马山镇'),
	(33, 06, 02, 106, N'斗门镇'),
	(33, 06, 02, 107, N'孙端镇'),
	(33, 06, 02, 108, N'富盛镇'),
	(33, 06, 02, 109, N'陶堰镇');

/* 浙江省，绍兴市，柯桥区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 06, 03, 001, N'柯桥街道'),
	(33, 06, 03, 002, N'柯岩街道'),
	(33, 06, 03, 003, N'华舍街道'),
	(33, 06, 03, 004, N'湖塘街道'),
	(33, 06, 03, 100, N'齐贤镇'),
	(33, 06, 03, 101, N'钱清镇'),
	(33, 06, 03, 103, N'福全镇'),
	(33, 06, 03, 104, N'马鞍镇'),
	(33, 06, 03, 105, N'平水镇'),
	(33, 06, 03, 106, N'安昌镇'),
	(33, 06, 03, 107, N'王坛镇'),
	(33, 06, 03, 108, N'兰亭镇'),
	(33, 06, 03, 109, N'稽东镇'),
	(33, 06, 03, 110, N'杨汛桥镇'),
	(33, 06, 03, 111, N'漓渚镇'),
	(33, 06, 03, 114, N'夏履镇');

/* 浙江省，绍兴市，上虞区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 06, 04, 001, N'百官街道'),
	(33, 06, 04, 002, N'曹娥街道'),
	(33, 06, 04, 003, N'东关街道'),
	(33, 06, 04, 100, N'道墟镇'),
	(33, 06, 04, 101, N'长塘镇'),
	(33, 06, 04, 102, N'上浦镇'),
	(33, 06, 04, 103, N'汤浦镇'),
	(33, 06, 04, 104, N'章镇镇'),
	(33, 06, 04, 105, N'下管镇'),
	(33, 06, 04, 106, N'丰惠镇'),
	(33, 06, 04, 107, N'永和镇'),
	(33, 06, 04, 108, N'梁湖镇'),
	(33, 06, 04, 109, N'驿亭镇'),
	(33, 06, 04, 110, N'小越镇'),
	(33, 06, 04, 111, N'谢塘镇'),
	(33, 06, 04, 112, N'盖北镇'),
	(33, 06, 04, 113, N'崧厦镇'),
	(33, 06, 04, 114, N'沥海镇'),
	(33, 06, 04, 200, N'岭南乡'),
	(33, 06, 04, 201, N'陈溪乡'),
	(33, 06, 04, 202, N'丁宅乡');

/* 浙江省，绍兴市，新昌县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 06, 24, 001, N'羽林街道'),
	(33, 06, 24, 002, N'南明街道'),
	(33, 06, 24, 003, N'七星街道'),
	(33, 06, 24, 101, N'澄潭镇'),
	(33, 06, 24, 102, N'梅渚镇'),
	(33, 06, 24, 104, N'回山镇'),
	(33, 06, 24, 106, N'大市聚镇'),
	(33, 06, 24, 107, N'小将镇'),
	(33, 06, 24, 108, N'沙溪镇'),
	(33, 06, 24, 109, N'镜岭镇'),
	(33, 06, 24, 110, N'儒岙镇'),
	(33, 06, 24, 200, N'城南乡'),
	(33, 06, 24, 201, N'东茗乡'),
	(33, 06, 24, 203, N'双彩乡'),
	(33, 06, 24, 205, N'新林乡'),
	(33, 06, 24, 206, N'巧英乡');

/* 浙江省，绍兴市，诸暨市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 06, 81, 001, N'暨阳街道'),
	(33, 06, 81, 002, N'浣东街道'),
	(33, 06, 81, 003, N'陶朱街道'),
	(33, 06, 81, 101, N'大唐镇'),
	(33, 06, 81, 102, N'应店街镇'),
	(33, 06, 81, 103, N'次坞镇'),
	(33, 06, 81, 104, N'店口镇'),
	(33, 06, 81, 105, N'阮市镇'),
	(33, 06, 81, 106, N'直埠镇'),
	(33, 06, 81, 107, N'江藻镇'),
	(33, 06, 81, 108, N'山下湖镇'),
	(33, 06, 81, 109, N'枫桥镇'),
	(33, 06, 81, 110, N'赵家镇'),
	(33, 06, 81, 111, N'马剑镇'),
	(33, 06, 81, 112, N'五泄镇'),
	(33, 06, 81, 113, N'草塔镇'),
	(33, 06, 81, 114, N'王家井镇'),
	(33, 06, 81, 115, N'牌头镇'),
	(33, 06, 81, 116, N'同山镇'),
	(33, 06, 81, 117, N'安华镇'),
	(33, 06, 81, 118, N'街亭镇'),
	(33, 06, 81, 119, N'璜山镇'),
	(33, 06, 81, 120, N'陈宅镇'),
	(33, 06, 81, 121, N'岭北镇'),
	(33, 06, 81, 122, N'浬浦镇'),
	(33, 06, 81, 124, N'东白湖镇'),
	(33, 06, 81, 201, N'东和乡');

/* 浙江省，绍兴市，嵊州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 06, 83, 001, N'剡湖街道'),
	(33, 06, 83, 002, N'三江街道'),
	(33, 06, 83, 003, N'鹿山街道'),
	(33, 06, 83, 004, N'浦口街道'),
	(33, 06, 83, 100, N'甘霖镇'),
	(33, 06, 83, 101, N'长乐镇'),
	(33, 06, 83, 102, N'崇仁镇'),
	(33, 06, 83, 103, N'黄泽镇'),
	(33, 06, 83, 104, N'三界镇'),
	(33, 06, 83, 105, N'石璜镇'),
	(33, 06, 83, 106, N'谷来镇'),
	(33, 06, 83, 107, N'仙岩镇'),
	(33, 06, 83, 108, N'金庭镇'),
	(33, 06, 83, 109, N'北漳镇'),
	(33, 06, 83, 110, N'下王镇'),
	(33, 06, 83, 200, N'贵门乡'),
	(33, 06, 83, 201, N'里南乡'),
	(33, 06, 83, 202, N'竹溪乡'),
	(33, 06, 83, 203, N'雅璜乡'),
	(33, 06, 83, 204, N'王院乡'),
	(33, 06, 83, 205, N'通源乡');

/* 浙江省，金华市，婺城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 07, 02, 001, N'城东街道'),
	(33, 07, 02, 002, N'城中街道'),
	(33, 07, 02, 003, N'城西街道'),
	(33, 07, 02, 004, N'城北街道'),
	(33, 07, 02, 005, N'江南街道'),
	(33, 07, 02, 006, N'三江街道'),
	(33, 07, 02, 007, N'西关街道'),
	(33, 07, 02, 008, N'秋滨街道'),
	(33, 07, 02, 009, N'新狮街道'),
	(33, 07, 02, 100, N'罗店镇'),
	(33, 07, 02, 101, N'雅畈镇'),
	(33, 07, 02, 102, N'安地镇'),
	(33, 07, 02, 103, N'白龙桥镇'),
	(33, 07, 02, 104, N'琅琊镇'),
	(33, 07, 02, 105, N'蒋堂镇'),
	(33, 07, 02, 106, N'汤溪镇'),
	(33, 07, 02, 107, N'罗埠镇'),
	(33, 07, 02, 108, N'洋埠镇'),
	(33, 07, 02, 201, N'乾西乡'),
	(33, 07, 02, 202, N'竹马乡'),
	(33, 07, 02, 203, N'长山乡'),
	(33, 07, 02, 204, N'箬阳乡'),
	(33, 07, 02, 205, N'沙畈乡'),
	(33, 07, 02, 206, N'塔石乡'),
	(33, 07, 02, 207, N'岭上乡'),
	(33, 07, 02, 208, N'莘畈乡'),
	(33, 07, 02, 209, N'苏孟乡');

/* 浙江省，金华市，金东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 07, 03, 001, N'多湖街道'),
	(33, 07, 03, 002, N'东孝街道'),
	(33, 07, 03, 101, N'孝顺镇'),
	(33, 07, 03, 102, N'傅村镇'),
	(33, 07, 03, 103, N'曹宅镇'),
	(33, 07, 03, 104, N'澧浦镇'),
	(33, 07, 03, 105, N'岭下镇'),
	(33, 07, 03, 106, N'江东镇'),
	(33, 07, 03, 107, N'塘雅镇'),
	(33, 07, 03, 108, N'赤松镇'),
	(33, 07, 03, 200, N'源东乡');

/* 浙江省，金华市，武义县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 07, 23, 001, N'白洋街道'),
	(33, 07, 23, 002, N'壶山街道'),
	(33, 07, 23, 003, N'熟溪街道'),
	(33, 07, 23, 100, N'柳城畲族镇'),
	(33, 07, 23, 101, N'履坦镇'),
	(33, 07, 23, 102, N'桐琴镇'),
	(33, 07, 23, 103, N'泉溪镇'),
	(33, 07, 23, 104, N'新宅镇'),
	(33, 07, 23, 105, N'王宅镇'),
	(33, 07, 23, 106, N'桃溪镇'),
	(33, 07, 23, 107, N'茭道镇'),
	(33, 07, 23, 200, N'大田乡'),
	(33, 07, 23, 201, N'白姆乡'),
	(33, 07, 23, 202, N'俞源乡'),
	(33, 07, 23, 203, N'坦洪乡'),
	(33, 07, 23, 204, N'西联乡'),
	(33, 07, 23, 205, N'三港乡'),
	(33, 07, 23, 206, N'大溪口乡');

/* 浙江省，金华市，浦江县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 07, 26, 001, N'浦南街道'),
	(33, 07, 26, 002, N'仙华街道'),
	(33, 07, 26, 003, N'浦阳街道'),
	(33, 07, 26, 101, N'黄宅镇'),
	(33, 07, 26, 102, N'白马镇'),
	(33, 07, 26, 103, N'郑家坞镇'),
	(33, 07, 26, 104, N'郑宅镇'),
	(33, 07, 26, 105, N'岩头镇'),
	(33, 07, 26, 106, N'檀溪镇'),
	(33, 07, 26, 107, N'杭坪镇'),
	(33, 07, 26, 200, N'大畈乡'),
	(33, 07, 26, 201, N'中余乡'),
	(33, 07, 26, 202, N'前吴乡'),
	(33, 07, 26, 203, N'花桥乡'),
	(33, 07, 26, 204, N'虞宅乡');

/* 浙江省，金华市，磐安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 07, 27, 100, N'安文镇'),
	(33, 07, 27, 101, N'新渥镇'),
	(33, 07, 27, 102, N'尖山镇'),
	(33, 07, 27, 103, N'仁川镇'),
	(33, 07, 27, 104, N'大盘镇'),
	(33, 07, 27, 105, N'方前镇'),
	(33, 07, 27, 106, N'玉山镇'),
	(33, 07, 27, 107, N'尚湖镇'),
	(33, 07, 27, 108, N'冷水镇'),
	(33, 07, 27, 200, N'深泽乡'),
	(33, 07, 27, 201, N'双峰乡'),
	(33, 07, 27, 203, N'双溪乡'),
	(33, 07, 27, 205, N'窈川乡'),
	(33, 07, 27, 206, N'盘峰乡'),
	(33, 07, 27, 207, N'高二乡'),
	(33, 07, 27, 208, N'维新乡'),
	(33, 07, 27, 209, N'胡宅乡'),
	(33, 07, 27, 210, N'万苍乡'),
	(33, 07, 27, 211, N'九和乡');

/* 浙江省，金华市，兰溪市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 07, 81, 001, N'兰江街道'),
	(33, 07, 81, 002, N'云山街道'),
	(33, 07, 81, 004, N'永昌街道'),
	(33, 07, 81, 005, N'赤溪街道'),
	(33, 07, 81, 006, N'女埠街道'),
	(33, 07, 81, 007, N'上华街道'),
	(33, 07, 81, 102, N'游埠镇'),
	(33, 07, 81, 104, N'诸葛镇'),
	(33, 07, 81, 106, N'黄店镇'),
	(33, 07, 81, 108, N'香溪镇'),
	(33, 07, 81, 109, N'马涧镇'),
	(33, 07, 81, 111, N'梅江镇'),
	(33, 07, 81, 112, N'横溪镇'),
	(33, 07, 81, 200, N'灵洞乡'),
	(33, 07, 81, 203, N'水亭畲族乡'),
	(33, 07, 81, 209, N'柏社乡');

/* 浙江省，金华市，义乌市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 07, 82, 001, N'稠城街道'),
	(33, 07, 82, 002, N'江东街道'),
	(33, 07, 82, 003, N'稠江街道'),
	(33, 07, 82, 004, N'北苑街道'),
	(33, 07, 82, 005, N'后宅街道'),
	(33, 07, 82, 006, N'城西街道'),
	(33, 07, 82, 007, N'廿三里街道'),
	(33, 07, 82, 008, N'福田街道'),
	(33, 07, 82, 100, N'佛堂镇'),
	(33, 07, 82, 101, N'赤岸镇'),
	(33, 07, 82, 102, N'义亭镇'),
	(33, 07, 82, 104, N'上溪镇'),
	(33, 07, 82, 105, N'苏溪镇'),
	(33, 07, 82, 106, N'大陈镇');

/* 浙江省，金华市，东阳市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 07, 83, 001, N'吴宁街道'),
	(33, 07, 83, 003, N'南市街道'),
	(33, 07, 83, 004, N'白云街道'),
	(33, 07, 83, 005, N'江北街道'),
	(33, 07, 83, 006, N'城东街道'),
	(33, 07, 83, 007, N'六石街道'),
	(33, 07, 83, 106, N'巍山镇'),
	(33, 07, 83, 107, N'虎鹿镇'),
	(33, 07, 83, 108, N'歌山镇'),
	(33, 07, 83, 109, N'佐村镇'),
	(33, 07, 83, 110, N'东阳江镇'),
	(33, 07, 83, 112, N'湖溪镇'),
	(33, 07, 83, 114, N'马宅镇'),
	(33, 07, 83, 116, N'千祥镇'),
	(33, 07, 83, 118, N'南马镇'),
	(33, 07, 83, 122, N'画水镇'),
	(33, 07, 83, 123, N'横店镇'),
	(33, 07, 83, 201, N'三单乡');

/* 浙江省，金华市，永康市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 07, 84, 001, N'东城街道'),
	(33, 07, 84, 002, N'西城街道'),
	(33, 07, 84, 003, N'江南街道'),
	(33, 07, 84, 105, N'石柱镇'),
	(33, 07, 84, 106, N'前仓镇'),
	(33, 07, 84, 107, N'舟山镇'),
	(33, 07, 84, 108, N'古山镇'),
	(33, 07, 84, 109, N'方岩镇'),
	(33, 07, 84, 110, N'龙山镇'),
	(33, 07, 84, 111, N'西溪镇'),
	(33, 07, 84, 112, N'象珠镇'),
	(33, 07, 84, 113, N'唐先镇'),
	(33, 07, 84, 114, N'花街镇'),
	(33, 07, 84, 115, N'芝英镇');

/* 浙江省，衢州市，柯城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 08, 02, 005, N'新新街道'),
	(33, 08, 02, 006, N'府山街道'),
	(33, 08, 02, 007, N'荷花街道'),
	(33, 08, 02, 008, N'信安街道'),
	(33, 08, 02, 009, N'白云街道'),
	(33, 08, 02, 010, N'双港街道'),
	(33, 08, 02, 011, N'花园街道'),
	(33, 08, 02, 100, N'石梁镇'),
	(33, 08, 02, 101, N'航埠镇'),
	(33, 08, 02, 205, N'黄家乡'),
	(33, 08, 02, 209, N'七里乡'),
	(33, 08, 02, 210, N'九华乡'),
	(33, 08, 02, 211, N'沟溪乡'),
	(33, 08, 02, 212, N'华墅乡'),
	(33, 08, 02, 213, N'姜家山乡'),
	(33, 08, 02, 214, N'万田乡'),
	(33, 08, 02, 215, N'石室乡');

/* 浙江省，衢州市，衢江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 08, 03, 001, N'樟潭街道'),
	(33, 08, 03, 002, N'浮石街道'),
	(33, 08, 03, 100, N'上方镇'),
	(33, 08, 03, 101, N'峡川镇'),
	(33, 08, 03, 103, N'莲花镇'),
	(33, 08, 03, 109, N'全旺镇'),
	(33, 08, 03, 110, N'大洲镇'),
	(33, 08, 03, 111, N'后溪镇'),
	(33, 08, 03, 112, N'廿里镇'),
	(33, 08, 03, 113, N'湖南镇'),
	(33, 08, 03, 114, N'高家镇'),
	(33, 08, 03, 115, N'杜泽镇'),
	(33, 08, 03, 200, N'灰坪乡'),
	(33, 08, 03, 202, N'太真乡'),
	(33, 08, 03, 203, N'双桥乡'),
	(33, 08, 03, 206, N'周家乡'),
	(33, 08, 03, 207, N'云溪乡'),
	(33, 08, 03, 213, N'举村乡'),
	(33, 08, 03, 218, N'岭洋乡'),
	(33, 08, 03, 219, N'黄坛口乡');

/* 浙江省，衢州市，常山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 08, 22, 001, N'天马街道'),
	(33, 08, 22, 002, N'紫港街道'),
	(33, 08, 22, 003, N'金川街道'),
	(33, 08, 22, 104, N'白石镇'),
	(33, 08, 22, 108, N'招贤镇'),
	(33, 08, 22, 109, N'青石镇'),
	(33, 08, 22, 111, N'球川镇'),
	(33, 08, 22, 115, N'辉埠镇'),
	(33, 08, 22, 116, N'芳村镇'),
	(33, 08, 22, 200, N'何家乡'),
	(33, 08, 22, 211, N'同弓乡'),
	(33, 08, 22, 213, N'大桥头乡'),
	(33, 08, 22, 219, N'新昌乡'),
	(33, 08, 22, 221, N'东案乡');

/* 浙江省，衢州市，开化县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 08, 24, 106, N'桐村镇'),
	(33, 08, 24, 107, N'杨林镇'),
	(33, 08, 24, 108, N'苏庄镇'),
	(33, 08, 24, 109, N'齐溪镇'),
	(33, 08, 24, 113, N'村头镇'),
	(33, 08, 24, 115, N'华埠镇'),
	(33, 08, 24, 116, N'马金镇'),
	(33, 08, 24, 117, N'池淮镇'),
	(33, 08, 24, 202, N'中村乡'),
	(33, 08, 24, 205, N'长虹乡'),
	(33, 08, 24, 208, N'何田乡'),
	(33, 08, 24, 216, N'林山乡'),
	(33, 08, 24, 217, N'音坑乡'),
	(33, 08, 24, 218, N'大溪边乡');

/* 浙江省，衢州市，龙游县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 08, 25, 001, N'龙洲街道'),
	(33, 08, 25, 002, N'东华街道'),
	(33, 08, 25, 101, N'湖镇镇'),
	(33, 08, 25, 102, N'小南海镇'),
	(33, 08, 25, 106, N'詹家镇'),
	(33, 08, 25, 109, N'溪口镇'),
	(33, 08, 25, 110, N'横山镇'),
	(33, 08, 25, 111, N'塔石镇'),
	(33, 08, 25, 201, N'罗家乡'),
	(33, 08, 25, 203, N'庙下乡'),
	(33, 08, 25, 207, N'石佛乡'),
	(33, 08, 25, 209, N'社阳乡'),
	(33, 08, 25, 211, N'大街乡'),
	(33, 08, 25, 212, N'沐尘畲族乡'),
	(33, 08, 25, 213, N'模环乡');

/* 浙江省，衢州市，江山市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 08, 81, 001, N'双塔街道'),
	(33, 08, 81, 002, N'虎山街道'),
	(33, 08, 81, 102, N'四都镇'),
	(33, 08, 81, 104, N'清湖镇'),
	(33, 08, 81, 105, N'坛石镇'),
	(33, 08, 81, 106, N'大桥镇'),
	(33, 08, 81, 109, N'新塘边镇'),
	(33, 08, 81, 112, N'廿八都镇'),
	(33, 08, 81, 113, N'长台镇'),
	(33, 08, 81, 116, N'上余镇'),
	(33, 08, 81, 118, N'凤林镇'),
	(33, 08, 81, 119, N'峡口镇'),
	(33, 08, 81, 120, N'石门镇'),
	(33, 08, 81, 121, N'贺村镇'),
	(33, 08, 81, 201, N'大陈乡'),
	(33, 08, 81, 203, N'碗窑乡'),
	(33, 08, 81, 207, N'保安乡'),
	(33, 08, 81, 213, N'塘源口乡'),
	(33, 08, 81, 214, N'张村乡');

/* 浙江省，舟山市，定海区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 09, 02, 002, N'昌国街道'),
	(33, 09, 02, 003, N'环南街道'),
	(33, 09, 02, 004, N'城东街道'),
	(33, 09, 02, 005, N'盐仓街道'),
	(33, 09, 02, 006, N'临城街道'),
	(33, 09, 02, 007, N'岑港街道'),
	(33, 09, 02, 008, N'马岙街道'),
	(33, 09, 02, 009, N'双桥街道'),
	(33, 09, 02, 010, N'小沙街道'),
	(33, 09, 02, 100, N'金塘镇'),
	(33, 09, 02, 104, N'白泉镇'),
	(33, 09, 02, 105, N'干览镇');

/* 浙江省，舟山市，普陀区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 09, 03, 001, N'沈家门街道'),
	(33, 09, 03, 003, N'东港街道'),
	(33, 09, 03, 004, N'朱家尖街道'),
	(33, 09, 03, 005, N'展茅街道'),
	(33, 09, 03, 100, N'六横镇'),
	(33, 09, 03, 102, N'虾峙镇'),
	(33, 09, 03, 104, N'桃花镇'),
	(33, 09, 03, 105, N'东极镇'),
	(33, 09, 03, 106, N'普陀山镇');

/* 浙江省，舟山市，岱山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 09, 21, 100, N'高亭镇'),
	(33, 09, 21, 101, N'东沙镇'),
	(33, 09, 21, 102, N'岱东镇'),
	(33, 09, 21, 103, N'岱西镇'),
	(33, 09, 21, 105, N'长涂镇'),
	(33, 09, 21, 106, N'衢山镇'),
	(33, 09, 21, 200, N'秀山乡');

/* 浙江省，舟山市，嵊泗县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 09, 22, 100, N'菜园镇'),
	(33, 09, 22, 101, N'嵊山镇'),
	(33, 09, 22, 102, N'洋山镇'),
	(33, 09, 22, 200, N'五龙乡'),
	(33, 09, 22, 201, N'黄龙乡'),
	(33, 09, 22, 202, N'枸杞乡'),
	(33, 09, 22, 203, N'花鸟乡');


/* 浙江省，台州市，椒江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 10, 02, 001, N'海门街道'),
	(33, 10, 02, 002, N'白云街道'),
	(33, 10, 02, 003, N'葭沚街道'),
	(33, 10, 02, 004, N'洪家街道'),
	(33, 10, 02, 005, N'三甲街道'),
	(33, 10, 02, 006, N'下陈街道'),
	(33, 10, 02, 007, N'前所街道'),
	(33, 10, 02, 008, N'章安街道'),
	(33, 10, 02, 101, N'大陈镇'),
	(33, 10, 02, 200, N'椒江农场'),
	(33, 10, 02, 201, N'滨海工业区'),
	(33, 10, 02, 202, N'月湖新城');

/* 浙江省，台州市，黄岩区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 10, 03, 001, N'东城街道'),
	(33, 10, 03, 002, N'南城街道'),
	(33, 10, 03, 003, N'西城街道'),
	(33, 10, 03, 004, N'北城街道'),
	(33, 10, 03, 005, N'新前街道'),
	(33, 10, 03, 006, N'澄江街道'),
	(33, 10, 03, 007, N'江口街道'),
	(33, 10, 03, 008, N'高桥街道'),
	(33, 10, 03, 101, N'宁溪镇'),
	(33, 10, 03, 102, N'北洋镇'),
	(33, 10, 03, 103, N'头陀镇'),
	(33, 10, 03, 107, N'院桥镇'),
	(33, 10, 03, 108, N'沙埠镇'),
	(33, 10, 03, 200, N'屿头乡'),
	(33, 10, 03, 201, N'上郑乡'),
	(33, 10, 03, 202, N'富山乡'),
	(33, 10, 03, 203, N'茅畲乡'),
	(33, 10, 03, 204, N'上垟乡'),
	(33, 10, 03, 205, N'平田乡');

/* 浙江省，台州市，路桥区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 10, 04, 001, N'路南街道'),
	(33, 10, 04, 002, N'路桥街道'),
	(33, 10, 04, 003, N'路北街道'),
	(33, 10, 04, 004, N'螺洋街道'),
	(33, 10, 04, 005, N'桐屿街道'),
	(33, 10, 04, 006, N'峰江街道'),
	(33, 10, 04, 103, N'新桥镇'),
	(33, 10, 04, 104, N'横街镇'),
	(33, 10, 04, 106, N'金清镇'),
	(33, 10, 04, 107, N'蓬街镇'),
	(33, 10, 04, 200, N'滨海工业城'),
	(33, 10, 04, 201, N'滨海新区');

/* 浙江省，台州市，玉环县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 10, 21, 001, N'玉城街道'),
	(33, 10, 21, 002, N'坎门街道'),
	(33, 10, 21, 003, N'大麦屿街道'),
	(33, 10, 21, 101, N'清港镇'),
	(33, 10, 21, 102, N'楚门镇'),
	(33, 10, 21, 103, N'干江镇'),
	(33, 10, 21, 105, N'沙门镇'),
	(33, 10, 21, 106, N'芦浦镇'),
	(33, 10, 21, 107, N'龙溪镇'),
	(33, 10, 21, 201, N'鸡山乡'),
	(33, 10, 21, 202, N'海山乡'),
	(33, 10, 21, 203, N'玉环经济开发区');

/* 浙江省，台州市，三门县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 10, 22, 001, N'海游街道'),
	(33, 10, 22, 002, N'海润街道'),
	(33, 10, 22, 003, N'沙柳街道'),
	(33, 10, 22, 102, N'珠岙镇'),
	(33, 10, 22, 103, N'亭旁镇'),
	(33, 10, 22, 105, N'健跳镇'),
	(33, 10, 22, 106, N'横渡镇'),
	(33, 10, 22, 107, N'浦坝港镇'),
	(33, 10, 22, 108, N'花桥镇'),
	(33, 10, 22, 205, N'蛇蟠乡');

/* 浙江省，台州市，天台县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 10, 23, 001, N'赤城街道'),
	(33, 10, 23, 002, N'始丰街道'),
	(33, 10, 23, 003, N'福溪街道'),
	(33, 10, 23, 101, N'白鹤镇'),
	(33, 10, 23, 102, N'石梁镇'),
	(33, 10, 23, 104, N'街头镇'),
	(33, 10, 23, 105, N'平桥镇'),
	(33, 10, 23, 106, N'坦头镇'),
	(33, 10, 23, 107, N'三合镇'),
	(33, 10, 23, 108, N'洪畴镇'),
	(33, 10, 23, 200, N'三州乡'),
	(33, 10, 23, 203, N'龙溪乡'),
	(33, 10, 23, 204, N'雷峰乡'),
	(33, 10, 23, 207, N'南屏乡'),
	(33, 10, 23, 209, N'泳溪乡');

/* 浙江省，台州市，仙居县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 10, 24, 001, N'安洲街道'),
	(33, 10, 24, 002, N'南峰街道'),
	(33, 10, 24, 003, N'福应街道'),
	(33, 10, 24, 101, N'横溪镇'),
	(33, 10, 24, 102, N'埠头镇'),
	(33, 10, 24, 103, N'白塔镇'),
	(33, 10, 24, 104, N'田市镇'),
	(33, 10, 24, 105, N'官路镇'),
	(33, 10, 24, 106, N'下各镇'),
	(33, 10, 24, 107, N'朱溪镇'),
	(33, 10, 24, 200, N'安岭乡'),
	(33, 10, 24, 201, N'溪港乡'),
	(33, 10, 24, 202, N'湫山乡'),
	(33, 10, 24, 203, N'淡竹乡'),
	(33, 10, 24, 204, N'皤滩乡'),
	(33, 10, 24, 205, N'上张乡'),
	(33, 10, 24, 206, N'步路乡'),
	(33, 10, 24, 207, N'广度乡'),
	(33, 10, 24, 209, N'大战乡'),
	(33, 10, 24, 210, N'双庙乡');

/* 浙江省，台州市，温岭市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 10, 81, 001, N'太平街道'),
	(33, 10, 81, 002, N'城东街道'),
	(33, 10, 81, 003, N'城西街道'),
	(33, 10, 81, 004, N'城北街道'),
	(33, 10, 81, 005, N'横峰街道'),
	(33, 10, 81, 100, N'泽国镇'),
	(33, 10, 81, 101, N'大溪镇'),
	(33, 10, 81, 102, N'松门镇'),
	(33, 10, 81, 103, N'箬横镇'),
	(33, 10, 81, 104, N'新河镇'),
	(33, 10, 81, 105, N'石塘镇'),
	(33, 10, 81, 106, N'滨海镇'),
	(33, 10, 81, 107, N'温峤镇'),
	(33, 10, 81, 108, N'城南镇'),
	(33, 10, 81, 109, N'石桥头镇'),
	(33, 10, 81, 110, N'坞根镇'),
	(33, 10, 81, 200, N'东部新区');

/* 浙江省，台州市，临海市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 10, 82, 001, N'古城街道'),
	(33, 10, 82, 002, N'大洋街道'),
	(33, 10, 82, 003, N'江南街道'),
	(33, 10, 82, 004, N'大田街道'),
	(33, 10, 82, 005, N'邵家渡街道'),
	(33, 10, 82, 100, N'汛桥镇'),
	(33, 10, 82, 101, N'东塍镇'),
	(33, 10, 82, 103, N'汇溪镇'),
	(33, 10, 82, 104, N'小芝镇'),
	(33, 10, 82, 105, N'河头镇'),
	(33, 10, 82, 106, N'白水洋镇'),
	(33, 10, 82, 107, N'括苍镇'),
	(33, 10, 82, 108, N'永丰镇'),
	(33, 10, 82, 109, N'尤溪镇'),
	(33, 10, 82, 110, N'涌泉镇'),
	(33, 10, 82, 111, N'沿江镇'),
	(33, 10, 82, 112, N'杜桥镇'),
	(33, 10, 82, 113, N'上盘镇'),
	(33, 10, 82, 114, N'桃渚镇');

/* 浙江省，丽水市，莲都区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 11, 02, 001, N'紫金街道办事处'),
	(33, 11, 02, 002, N'岩泉街道办事处'),
	(33, 11, 02, 003, N'万象街道办事处'),
	(33, 11, 02, 004, N'白云街道办事处'),
	(33, 11, 02, 007, N'联城街道办事处'),
	(33, 11, 02, 008, N'南明山街道办事处'),
	(33, 11, 02, 100, N'碧湖镇'),
	(33, 11, 02, 102, N'大港头镇'),
	(33, 11, 02, 103, N'老竹畲族镇'),
	(33, 11, 02, 104, N'雅溪镇'),
	(33, 11, 02, 200, N'太平乡'),
	(33, 11, 02, 201, N'仙渡乡'),
	(33, 11, 02, 202, N'峰源乡'),
	(33, 11, 02, 204, N'丽新畲族乡'),
	(33, 11, 02, 206, N'黄村乡');

/* 浙江省，丽水市，青田县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 11, 21, 001, N'鹤城街道'),
	(33, 11, 21, 002, N'瓯南街道'),
	(33, 11, 21, 003, N'油竹街道'),
	(33, 11, 21, 101, N'温溪镇'),
	(33, 11, 21, 102, N'东源镇'),
	(33, 11, 21, 103, N'高湖镇'),
	(33, 11, 21, 104, N'船寮镇'),
	(33, 11, 21, 105, N'海口镇'),
	(33, 11, 21, 106, N'腊口镇'),
	(33, 11, 21, 107, N'北山镇'),
	(33, 11, 21, 108, N'山口镇'),
	(33, 11, 21, 109, N'仁庄镇'),
	(33, 11, 21, 200, N'万山乡'),
	(33, 11, 21, 201, N'黄垟乡'),
	(33, 11, 21, 202, N'季宅乡'),
	(33, 11, 21, 203, N'高市乡'),
	(33, 11, 21, 204, N'海溪乡'),
	(33, 11, 21, 205, N'章村乡'),
	(33, 11, 21, 206, N'祯旺乡'),
	(33, 11, 21, 207, N'祯埠乡'),
	(33, 11, 21, 208, N'舒桥乡'),
	(33, 11, 21, 209, N'巨浦乡'),
	(33, 11, 21, 211, N'万阜乡'),
	(33, 11, 21, 212, N'方山乡'),
	(33, 11, 21, 213, N'汤垟乡'),
	(33, 11, 21, 214, N'贵岙乡'),
	(33, 11, 21, 215, N'小舟山乡'),
	(33, 11, 21, 216, N'吴坑乡'),
	(33, 11, 21, 217, N'仁宫乡'),
	(33, 11, 21, 218, N'章旦乡'),
	(33, 11, 21, 219, N'阜山乡'),
	(33, 11, 21, 220, N'石溪乡');

/* 浙江省，丽水市，缙云县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 11, 22, 001, N'五云街道办事处'),
	(33, 11, 22, 002, N'新碧街道办事处'),
	(33, 11, 22, 003, N'仙都街道办事处'),
	(33, 11, 22, 101, N'壶镇镇'),
	(33, 11, 22, 102, N'新建镇'),
	(33, 11, 22, 103, N'舒洪镇'),
	(33, 11, 22, 105, N'大洋镇'),
	(33, 11, 22, 106, N'东渡镇'),
	(33, 11, 22, 107, N'东方镇'),
	(33, 11, 22, 108, N'大源镇'),
	(33, 11, 22, 203, N'七里乡'),
	(33, 11, 22, 206, N'前路乡'),
	(33, 11, 22, 207, N'三溪乡'),
	(33, 11, 22, 208, N'溶江乡'),
	(33, 11, 22, 209, N'双溪口乡'),
	(33, 11, 22, 210, N'胡源乡'),
	(33, 11, 22, 211, N'方溪乡'),
	(33, 11, 22, 212, N'石笕乡');

/* 浙江省，丽水市，遂昌县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 11, 23, 001, N'妙高街道'),
	(33, 11, 23, 002, N'云峰街道'),
	(33, 11, 23, 102, N'新路湾镇'),
	(33, 11, 23, 103, N'北界镇'),
	(33, 11, 23, 104, N'金竹镇'),
	(33, 11, 23, 105, N'大柘镇'),
	(33, 11, 23, 106, N'石练镇'),
	(33, 11, 23, 107, N'王村口镇'),
	(33, 11, 23, 108, N'黄沙腰镇'),
	(33, 11, 23, 200, N'三仁畲族乡'),
	(33, 11, 23, 201, N'濂竹乡'),
	(33, 11, 23, 202, N'应村乡'),
	(33, 11, 23, 203, N'高坪乡'),
	(33, 11, 23, 204, N'湖山乡'),
	(33, 11, 23, 205, N'蔡源乡'),
	(33, 11, 23, 206, N'焦滩乡'),
	(33, 11, 23, 207, N'龙洋乡'),
	(33, 11, 23, 208, N'柘岱口乡'),
	(33, 11, 23, 209, N'西畈乡'),
	(33, 11, 23, 210, N'垵口乡');

/* 浙江省，丽水市，松阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 11, 24, 001, N'西屏街道办事处'),
	(33, 11, 24, 002, N'水南街道办事处'),
	(33, 11, 24, 003, N'望松街道办事处'),
	(33, 11, 24, 101, N'古市镇'),
	(33, 11, 24, 102, N'玉岩镇'),
	(33, 11, 24, 103, N'象溪镇'),
	(33, 11, 24, 104, N'大东坝镇'),
	(33, 11, 24, 105, N'新兴镇'),
	(33, 11, 24, 201, N'叶村乡'),
	(33, 11, 24, 202, N'斋坛乡'),
	(33, 11, 24, 203, N'三都乡'),
	(33, 11, 24, 204, N'竹源乡'),
	(33, 11, 24, 205, N'四都乡'),
	(33, 11, 24, 206, N'赤寿乡'),
	(33, 11, 24, 208, N'樟溪乡'),
	(33, 11, 24, 211, N'枫坪乡'),
	(33, 11, 24, 212, N'板桥畲族乡'),
	(33, 11, 24, 213, N'裕溪乡'),
	(33, 11, 24, 214, N'安民乡');

/* 浙江省，丽水市，云和县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 11, 25, 001, N'浮云街道'),
	(33, 11, 25, 002, N'元和街道'),
	(33, 11, 25, 003, N'白龙山街道'),
	(33, 11, 25, 004, N'凤凰山街道'),
	(33, 11, 25, 105, N'崇头镇'),
	(33, 11, 25, 106, N'石塘镇'),
	(33, 11, 25, 107, N'紧水滩镇'),
	(33, 11, 25, 201, N'雾溪畲族乡'),
	(33, 11, 25, 202, N'安溪畲族乡'),
	(33, 11, 25, 206, N'赤石乡');

/* 浙江省，丽水市，庆元县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 11, 26, 001, N'松源街道'),
	(33, 11, 26, 002, N'濛洲街道'),
	(33, 11, 26, 003, N'屏都街道'),
	(33, 11, 26, 101, N'黄田镇'),
	(33, 11, 26, 102, N'竹口镇'),
	(33, 11, 26, 104, N'荷地镇'),
	(33, 11, 26, 105, N'左溪镇'),
	(33, 11, 26, 106, N'贤良镇'),
	(33, 11, 26, 107, N'百山祖镇'),
	(33, 11, 26, 200, N'岭头乡'),
	(33, 11, 26, 201, N'五大堡乡'),
	(33, 11, 26, 202, N'淤上乡'),
	(33, 11, 26, 203, N'安南乡'),
	(33, 11, 26, 204, N'张村乡'),
	(33, 11, 26, 205, N'隆宫乡'),
	(33, 11, 26, 206, N'举水乡'),
	(33, 11, 26, 207, N'江根乡'),
	(33, 11, 26, 209, N'龙溪乡'),
	(33, 11, 26, 211, N'官塘乡');

/* 浙江省，丽水市，景宁畲族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 11, 27, 001, N'红星街道办事处'),
	(33, 11, 27, 002, N'鹤溪街道办事处'),
	(33, 11, 27, 101, N'渤海镇'),
	(33, 11, 27, 102, N'东坑镇'),
	(33, 11, 27, 103, N'英川镇'),
	(33, 11, 27, 104, N'沙湾镇'),
	(33, 11, 27, 201, N'大均乡'),
	(33, 11, 27, 202, N'澄照乡'),
	(33, 11, 27, 203, N'梅岐乡'),
	(33, 11, 27, 205, N'郑坑乡'),
	(33, 11, 27, 208, N'大漈乡'),
	(33, 11, 27, 209, N'景南乡'),
	(33, 11, 27, 210, N'雁溪乡'),
	(33, 11, 27, 212, N'鸬鹚乡'),
	(33, 11, 27, 213, N'梧桐乡'),
	(33, 11, 27, 214, N'标溪乡'),
	(33, 11, 27, 215, N'毛垟乡'),
	(33, 11, 27, 216, N'秋炉乡'),
	(33, 11, 27, 217, N'大地乡'),
	(33, 11, 27, 218, N'家地乡'),
	(33, 11, 27, 219, N'九龙乡');

/* 浙江省，丽水市，龙泉市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(33, 11, 81, 001, N'龙渊街道'),
	(33, 11, 81, 002, N'西街街道'),
	(33, 11, 81, 003, N'剑池街道'),
	(33, 11, 81, 004, N'石达石街道'),
	(33, 11, 81, 100, N'八都镇'),
	(33, 11, 81, 101, N'上垟镇'),
	(33, 11, 81, 102, N'小梅镇'),
	(33, 11, 81, 103, N'查田镇'),
	(33, 11, 81, 104, N'安仁镇'),
	(33, 11, 81, 105, N'锦溪镇'),
	(33, 11, 81, 106, N'住龙镇'),
	(33, 11, 81, 107, N'屏南镇'),
	(33, 11, 81, 200, N'兰巨乡'),
	(33, 11, 81, 202, N'宝溪乡'),
	(33, 11, 81, 203, N'竹垟畲族乡'),
	(33, 11, 81, 204, N'道太乡'),
	(33, 11, 81, 205, N'岩樟乡'),
	(33, 11, 81, 206, N'城北乡'),
	(33, 11, 81, 207, N'龙南乡');


/* 安徽省，合肥市，瑶海区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 01, 02, 001, N'明光路街道'),
	(34, 01, 02, 002, N'车站街道'),
	(34, 01, 02, 003, N'胜利路街道'),
	(34, 01, 02, 004, N'三里街街道'),
	(34, 01, 02, 005, N'铜陵路街道'),
	(34, 01, 02, 006, N'七里站街道'),
	(34, 01, 02, 007, N'红光街道'),
	(34, 01, 02, 008, N'和平路街道'),
	(34, 01, 02, 009, N'大通路街道'),
	(34, 01, 02, 010, N'城东街道'),
	(34, 01, 02, 011, N'长淮街道办事处'),
	(34, 01, 02, 012, N'方庙街道办事处'),
	(34, 01, 02, 100, N'大兴镇');

/* 安徽省，合肥市，庐阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 01, 03, 001, N'亳州路街道'),
	(34, 01, 03, 002, N'双岗街道'),
	(34, 01, 03, 003, N'杏林街道'),
	(34, 01, 03, 004, N'海棠街道'),
	(34, 01, 03, 005, N'杏花村街道'),
	(34, 01, 03, 006, N'逍遥津街道'),
	(34, 01, 03, 009, N'三孝口街道'),
	(34, 01, 03, 012, N'四里河街道'),
	(34, 01, 03, 100, N'大杨镇'),
	(34, 01, 03, 200, N'三十岗乡');

/* 安徽省，合肥市，蜀山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 01, 04, 001, N'三里庵街道'),
	(34, 01, 04, 002, N'稻香村街道'),
	(34, 01, 04, 003, N'琥珀街道'),
	(34, 01, 04, 004, N'南七街道'),
	(34, 01, 04, 005, N'西园街道'),
	(34, 01, 04, 006, N'五里墩街道'),
	(34, 01, 04, 007, N'荷叶地街道'),
	(34, 01, 04, 008, N'笔架山街道'),
	(34, 01, 04, 100, N'井岗镇'),
	(34, 01, 04, 101, N'南岗镇'),
	(34, 01, 04, 102, N'小庙镇');

/* 安徽省，合肥市，包河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 01, 11, 001, N'骆岗街道'),
	(34, 01, 11, 002, N'常青街道'),
	(34, 01, 11, 003, N'芜湖路街道'),
	(34, 01, 11, 004, N'包公街道'),
	(34, 01, 11, 005, N'望湖街道'),
	(34, 01, 11, 006, N'义城街道'),
	(34, 01, 11, 007, N'烟墩街道'),
	(34, 01, 11, 008, N'滨湖世纪社区'),
	(34, 01, 11, 009, N'方兴社区'),
	(34, 01, 11, 100, N'淝河镇'),
	(34, 01, 11, 102, N'大圩镇');

/* 安徽省，合肥市，长丰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 01, 21, 100, N'水湖镇'),
	(34, 01, 21, 101, N'庄墓镇'),
	(34, 01, 21, 102, N'杨庙镇'),
	(34, 01, 21, 103, N'吴山镇'),
	(34, 01, 21, 104, N'岗集镇'),
	(34, 01, 21, 105, N'双墩镇'),
	(34, 01, 21, 106, N'下塘镇'),
	(34, 01, 21, 107, N'朱巷镇'),
	(34, 01, 21, 200, N'罗塘乡'),
	(34, 01, 21, 201, N'义井乡'),
	(34, 01, 21, 202, N'陶楼乡'),
	(34, 01, 21, 203, N'造甲乡'),
	(34, 01, 21, 204, N'左店乡'),
	(34, 01, 21, 205, N'杜集乡');

/* 安徽省，合肥市，肥东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 01, 22, 100, N'店埠镇'),
	(34, 01, 22, 101, N'撮镇镇'),
	(34, 01, 22, 102, N'梁园镇'),
	(34, 01, 22, 103, N'桥头集镇'),
	(34, 01, 22, 104, N'长临河镇'),
	(34, 01, 22, 105, N'石塘镇'),
	(34, 01, 22, 106, N'古城镇'),
	(34, 01, 22, 107, N'八斗镇'),
	(34, 01, 22, 108, N'元疃镇'),
	(34, 01, 22, 109, N'白龙镇'),
	(34, 01, 22, 110, N'包公镇'),
	(34, 01, 22, 111, N'陈集镇'),
	(34, 01, 22, 200, N'众兴乡'),
	(34, 01, 22, 201, N'张集乡'),
	(34, 01, 22, 202, N'马湖乡'),
	(34, 01, 22, 204, N'响导乡'),
	(34, 01, 22, 205, N'杨店乡'),
	(34, 01, 22, 206, N'牌坊回族满族乡');

/* 安徽省，合肥市，肥西县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 01, 23, 100, N'上派镇'),
	(34, 01, 23, 101, N'三河镇'),
	(34, 01, 23, 103, N'官亭镇'),
	(34, 01, 23, 105, N'山南镇'),
	(34, 01, 23, 106, N'花岗镇'),
	(34, 01, 23, 107, N'紫蓬镇'),
	(34, 01, 23, 108, N'桃花镇'),
	(34, 01, 23, 109, N'丰乐镇'),
	(34, 01, 23, 200, N'高店乡'),
	(34, 01, 23, 201, N'铭传乡'),
	(34, 01, 23, 202, N'柿树岗乡'),
	(34, 01, 23, 203, N'严店乡');

/* 安徽省，合肥市，庐江县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 01, 24, 100, N'庐城镇'),
	(34, 01, 24, 101, N'冶父山镇'),
	(34, 01, 24, 102, N'万山镇'),
	(34, 01, 24, 103, N'汤池镇'),
	(34, 01, 24, 104, N'郭河镇'),
	(34, 01, 24, 105, N'金牛镇'),
	(34, 01, 24, 106, N'石头镇'),
	(34, 01, 24, 107, N'同大镇'),
	(34, 01, 24, 108, N'白山镇'),
	(34, 01, 24, 109, N'盛桥镇'),
	(34, 01, 24, 110, N'白湖镇'),
	(34, 01, 24, 111, N'龙桥镇'),
	(34, 01, 24, 112, N'矾山镇'),
	(34, 01, 24, 113, N'罗河镇'),
	(34, 01, 24, 114, N'泥河镇'),
	(34, 01, 24, 115, N'乐桥镇'),
	(34, 01, 24, 116, N'柯坦镇');

/* 安徽省，合肥市，巢湖市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 01, 81, 001, N'中庙街道办事处'),
	(34, 01, 81, 002, N'亚父街道办事处'),
	(34, 01, 81, 003, N'卧牛山街道办事处'),
	(34, 01, 81, 004, N'凤凰山街道办事处'),
	(34, 01, 81, 005, N'天河街道办事处'),
	(34, 01, 81, 006, N'半汤街道办事处'),
	(34, 01, 81, 100, N'栏杆集镇'),
	(34, 01, 81, 101, N'苏湾镇'),
	(34, 01, 81, 102, N'柘皋镇'),
	(34, 01, 81, 103, N'银屏镇'),
	(34, 01, 81, 104, N'夏阁镇'),
	(34, 01, 81, 105, N'中垾镇'),
	(34, 01, 81, 106, N'散兵镇'),
	(34, 01, 81, 107, N'烔炀镇'),
	(34, 01, 81, 108, N'黄麓镇'),
	(34, 01, 81, 109, N'槐林镇'),
	(34, 01, 81, 110, N'坝镇镇'),
	(34, 01, 81, 200, N'庙岗乡');

/* 安徽省，芜湖市，镜湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 02, 02, 012, N'方村街道');

/* 安徽省，芜湖市，弋江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 02, 03, 001, N'弋江桥街道'),
	(34, 02, 03, 002, N'中山南路街道'),
	(34, 02, 03, 003, N'利民路街道'),
	(34, 02, 03, 004, N'马塘街道'),
	(34, 02, 03, 005, N'瀂港街道'),
	(34, 02, 03, 006, N'火龙街道'),
	(34, 02, 03, 007, N'白马街道'),
	(34, 02, 03, 098, N'南瑞社区公共服务委员会');

/* 安徽省，芜湖市，鸠江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 02, 07, 001, N'四褐山街道'),
	(34, 02, 07, 002, N'裕溪口街道'),
	(34, 02, 07, 003, N'官陡街道'),
	(34, 02, 07, 004, N'湾里街道'),
	(34, 02, 07, 005, N'清水街道'),
	(34, 02, 07, 101, N'沈巷镇'),
	(34, 02, 07, 102, N'二坝镇'),
	(34, 02, 07, 103, N'汤沟镇'),
	(34, 02, 07, 104, N'白茆镇');

/* 安徽省，芜湖市，三山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 02, 08, 001, N'三山街道'),
	(34, 02, 08, 002, N'保定街道'),
	(34, 02, 08, 003, N'龙湖街道'),
	(34, 02, 08, 100, N'峨桥镇');

/* 安徽省，芜湖市，芜湖县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 02, 21, 100, N'湾沚镇'),
	(34, 02, 21, 101, N'六郎镇'),
	(34, 02, 21, 102, N'陶辛镇'),
	(34, 02, 21, 104, N'红杨镇'),
	(34, 02, 21, 105, N'花桥镇');

/* 安徽省，芜湖市，繁昌县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 02, 22, 100, N'繁阳镇'),
	(34, 02, 22, 101, N'荻港镇'),
	(34, 02, 22, 102, N'孙村镇'),
	(34, 02, 22, 103, N'平铺镇'),
	(34, 02, 22, 104, N'新港镇'),
	(34, 02, 22, 105, N'峨山镇');

/* 安徽省，芜湖市，南陵县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 02, 23, 100, N'籍山镇'),
	(34, 02, 23, 101, N'许镇镇'),
	(34, 02, 23, 102, N'弋江镇'),
	(34, 02, 23, 103, N'三里镇'),
	(34, 02, 23, 104, N'何湾镇'),
	(34, 02, 23, 105, N'工山镇'),
	(34, 02, 23, 106, N'烟墩镇'),
	(34, 02, 23, 107, N'家发镇');

/* 安徽省，芜湖市，无为县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 02, 25, 100, N'无城镇'),
	(34, 02, 25, 101, N'襄安镇'),
	(34, 02, 25, 104, N'陡沟镇'),
	(34, 02, 25, 105, N'石涧镇'),
	(34, 02, 25, 106, N'严桥镇'),
	(34, 02, 25, 107, N'开城镇'),
	(34, 02, 25, 108, N'蜀山镇'),
	(34, 02, 25, 109, N'牛埠镇'),
	(34, 02, 25, 110, N'刘渡镇'),
	(34, 02, 25, 111, N'姚沟镇'),
	(34, 02, 25, 112, N'泥汊镇'),
	(34, 02, 25, 114, N'福渡镇'),
	(34, 02, 25, 115, N'泉塘镇'),
	(34, 02, 25, 116, N'赫店镇'),
	(34, 02, 25, 117, N'红庙镇'),
	(34, 02, 25, 118, N'高沟镇'),
	(34, 02, 25, 200, N'鹤毛乡'),
	(34, 02, 25, 201, N'十里墩乡'),
	(34, 02, 25, 202, N'昆山乡'),
	(34, 02, 25, 203, N'洪巷乡');

/* 安徽省，蚌埠市，龙子湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 03, 02, 001, N'东风街道'),
	(34, 03, 02, 002, N'延安街道'),
	(34, 03, 02, 003, N'治淮街道'),
	(34, 03, 02, 004, N'东升街道'),
	(34, 03, 02, 005, N'解放街道'),
	(34, 03, 02, 006, N'曹山街道'),
	(34, 03, 02, 100, N'长淮卫镇'),
	(34, 03, 02, 200, N'李楼乡');

/* 安徽省，蚌埠市，蚌山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 03, 03, 001, N'天桥街道'),
	(34, 03, 03, 002, N'青年街道'),
	(34, 03, 03, 003, N'纬二路街道'),
	(34, 03, 03, 004, N'黄庄街道'),
	(34, 03, 03, 005, N'宏业村街道'),
	(34, 03, 03, 200, N'燕山乡'),
	(34, 03, 03, 201, N'雪华乡');

/* 安徽省，蚌埠市，禹会区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 03, 04, 100, N'秦集镇'),
	(34, 03, 04, 101, N'马城镇'),
	(34, 03, 04, 198, N'禹会虚镇'),
	(34, 03, 04, 200, N'长青乡');

/* 安徽省，蚌埠市，淮上区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 03, 11, 001, N'淮滨社区'),
	(34, 03, 11, 002, N'明珠社区'),
	(34, 03, 11, 100, N'小蚌埠镇'),
	(34, 03, 11, 101, N'吴小街镇'),
	(34, 03, 11, 102, N'曹老集镇'),
	(34, 03, 11, 103, N'梅桥镇'),
	(34, 03, 11, 104, N'沫河口镇');

/* 安徽省，蚌埠市，怀远县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 03, 21, 100, N'城关镇'),
	(34, 03, 21, 101, N'包集镇'),
	(34, 03, 21, 102, N'龙亢镇'),
	(34, 03, 21, 103, N'河溜镇'),
	(34, 03, 21, 104, N'常坟镇'),
	(34, 03, 21, 106, N'双桥集镇'),
	(34, 03, 21, 107, N'魏庄镇'),
	(34, 03, 21, 108, N'万福镇'),
	(34, 03, 21, 109, N'唐集镇'),
	(34, 03, 21, 110, N'白莲坡镇'),
	(34, 03, 21, 111, N'褚集镇'),
	(34, 03, 21, 112, N'古城镇'),
	(34, 03, 21, 200, N'淝南乡'),
	(34, 03, 21, 201, N'淝河乡'),
	(34, 03, 21, 203, N'陈集乡'),
	(34, 03, 21, 205, N'徐圩乡'),
	(34, 03, 21, 206, N'兰桥乡'),
	(34, 03, 21, 207, N'荆芡乡');

/* 安徽省，蚌埠市，五河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 03, 22, 100, N'城关镇'),
	(34, 03, 22, 101, N'新集镇'),
	(34, 03, 22, 103, N'小溪镇'),
	(34, 03, 22, 104, N'双忠庙镇'),
	(34, 03, 22, 105, N'小圩镇'),
	(34, 03, 22, 106, N'东刘集镇'),
	(34, 03, 22, 107, N'头铺镇'),
	(34, 03, 22, 108, N'大新镇'),
	(34, 03, 22, 109, N'武桥镇'),
	(34, 03, 22, 110, N'朱顶镇'),
	(34, 03, 22, 111, N'浍南镇'),
	(34, 03, 22, 112, N'申集镇'),
	(34, 03, 22, 200, N'沱湖乡'),
	(34, 03, 22, 201, N'临北回族乡');

/* 安徽省，蚌埠市，固镇县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 03, 23, 100, N'城关镇'),
	(34, 03, 23, 101, N'王庄镇'),
	(34, 03, 23, 102, N'新马桥镇'),
	(34, 03, 23, 103, N'连城镇'),
	(34, 03, 23, 104, N'刘集镇'),
	(34, 03, 23, 105, N'任桥镇'),
	(34, 03, 23, 106, N'湖沟镇'),
	(34, 03, 23, 107, N'濠城镇'),
	(34, 03, 23, 200, N'石湖乡'),
	(34, 03, 23, 201, N'杨庙乡'),
	(34, 03, 23, 202, N'仲兴乡');

/* 安徽省，淮南市，大通区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 04, 02, 001, N'大通街道'),
	(34, 04, 02, 100, N'上窑镇'),
	(34, 04, 02, 101, N'洛河镇'),
	(34, 04, 02, 102, N'九龙岗镇'),
	(34, 04, 02, 200, N'孔店乡');

/* 安徽省，淮南市，田家庵区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 04, 03, 001, N'田东街道'),
	(34, 04, 03, 002, N'新淮街道'),
	(34, 04, 03, 003, N'国庆街道'),
	(34, 04, 03, 004, N'淮滨街道'),
	(34, 04, 03, 005, N'朝阳街道'),
	(34, 04, 03, 006, N'公园街道'),
	(34, 04, 03, 007, N'洞山街道'),
	(34, 04, 03, 008, N'龙泉街道'),
	(34, 04, 03, 009, N'泉山街道'),
	(34, 04, 03, 100, N'舜耕镇'),
	(34, 04, 03, 101, N'安成镇'),
	(34, 04, 03, 102, N'曹庵镇'),
	(34, 04, 03, 103, N'三和镇'),
	(34, 04, 03, 201, N'史院乡');

/* 安徽省，淮南市，谢家集区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 04, 04, 001, N'谢家集街道'),
	(34, 04, 04, 002, N'蔡家岗街道'),
	(34, 04, 04, 003, N'立新街道'),
	(34, 04, 04, 004, N'谢三村街道'),
	(34, 04, 04, 005, N'平山街道'),
	(34, 04, 04, 100, N'望峰岗镇'),
	(34, 04, 04, 101, N'李郢孜镇'),
	(34, 04, 04, 102, N'唐山镇'),
	(34, 04, 04, 103, N'杨公镇'),
	(34, 04, 04, 200, N'孙庙乡'),
	(34, 04, 04, 201, N'孤堆回族乡');

/* 安徽省，淮南市，八公山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 04, 05, 001, N'新庄孜街道'),
	(34, 04, 05, 002, N'土坝孜街道'),
	(34, 04, 05, 003, N'毕家岗街道'),
	(34, 04, 05, 100, N'八公山镇'),
	(34, 04, 05, 121, N'山王镇'),
	(34, 04, 05, 200, N'李冲回族乡');

/* 安徽省，淮南市，潘集区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 04, 06, 001, N'田集街道'),
	(34, 04, 06, 100, N'高皇镇'),
	(34, 04, 06, 101, N'平圩镇'),
	(34, 04, 06, 102, N'泥河镇'),
	(34, 04, 06, 103, N'潘集镇'),
	(34, 04, 06, 104, N'芦集镇'),
	(34, 04, 06, 105, N'架河镇'),
	(34, 04, 06, 106, N'夹沟镇'),
	(34, 04, 06, 107, N'祁集镇'),
	(34, 04, 06, 108, N'贺疃镇'),
	(34, 04, 06, 202, N'古沟回族乡');

/* 安徽省，淮南市，凤台县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 04, 21, 100, N'城关镇'),
	(34, 04, 21, 102, N'新集镇'),
	(34, 04, 21, 103, N'朱马店镇'),
	(34, 04, 21, 104, N'岳张集镇'),
	(34, 04, 21, 105, N'顾桥镇'),
	(34, 04, 21, 106, N'毛集镇'),
	(34, 04, 21, 107, N'夏集镇'),
	(34, 04, 21, 108, N'桂集镇'),
	(34, 04, 21, 109, N'焦岗湖镇'),
	(34, 04, 21, 110, N'凤凰镇'),
	(34, 04, 21, 111, N'杨村镇'),
	(34, 04, 21, 112, N'丁集镇'),
	(34, 04, 21, 202, N'刘集乡'),
	(34, 04, 21, 204, N'古店乡'),
	(34, 04, 21, 205, N'钱庙乡'),
	(34, 04, 21, 207, N'尚塘乡'),
	(34, 04, 21, 209, N'关店乡'),
	(34, 04, 21, 210, N'大兴集乡');

/* 安徽省，马鞍山市，花山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 05, 03, 001, N'沙塘路街道'),
	(34, 05, 03, 002, N'解放路街道'),
	(34, 05, 03, 003, N'湖东路街道'),
	(34, 05, 03, 004, N'桃源路街道'),
	(34, 05, 03, 005, N'霍里街道'),
	(34, 05, 03, 006, N'金家庄街道'),
	(34, 05, 03, 007, N'塘西街道'),
	(34, 05, 03, 008, N'慈湖街道'),
	(34, 05, 03, 009, N'江东街道'),
	(34, 05, 03, 200, N'慈湖乡');

/* 安徽省，马鞍山市，雨山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 05, 04, 001, N'平湖街道'),
	(34, 05, 04, 002, N'雨山街道'),
	(34, 05, 04, 003, N'安民街道'),
	(34, 05, 04, 004, N'采石街道'),
	(34, 05, 04, 100, N'向山镇'),
	(34, 05, 04, 101, N'银塘镇'),
	(34, 05, 04, 200, N'佳山乡');

/* 安徽省，马鞍山市，博望县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 05, 06, 100, N'博望镇'),
	(34, 05, 06, 101, N'丹阳镇'),
	(34, 05, 06, 102, N'新市镇');

/* 安徽省，马鞍山市，当涂县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 05, 21, 100, N'姑孰镇'),
	(34, 05, 21, 101, N'黄池镇'),
	(34, 05, 21, 102, N'乌溪镇'),
	(34, 05, 21, 103, N'石桥镇'),
	(34, 05, 21, 104, N'塘南镇'),
	(34, 05, 21, 105, N'护河镇'),
	(34, 05, 21, 106, N'太白镇'),
	(34, 05, 21, 110, N'年陡镇'),
	(34, 05, 21, 111, N'湖阳镇'),
	(34, 05, 21, 200, N'大陇乡'),
	(34, 05, 21, 202, N'江心乡');

/* 安徽省，马鞍山市，含山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 05, 22, 100, N'环峰镇'),
	(34, 05, 22, 101, N'运漕镇'),
	(34, 05, 22, 102, N'铜闸镇'),
	(34, 05, 22, 103, N'陶厂镇'),
	(34, 05, 22, 104, N'林头镇'),
	(34, 05, 22, 105, N'清溪镇'),
	(34, 05, 22, 106, N'仙踪镇'),
	(34, 05, 22, 107, N'昭关镇');

/* 安徽省，马鞍山市，和县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 05, 23, 100, N'历阳镇'),
	(34, 05, 23, 102, N'白桥镇'),
	(34, 05, 23, 103, N'姥桥镇'),
	(34, 05, 23, 104, N'功桥镇'),
	(34, 05, 23, 105, N'西埠镇'),
	(34, 05, 23, 106, N'香泉镇'),
	(34, 05, 23, 107, N'乌江镇'),
	(34, 05, 23, 108, N'善厚镇'),
	(34, 05, 23, 109, N'石杨镇');

/* 安徽省，淮北市，杜集区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 06, 02, 001, N'高岳街道办事处'),
	(34, 06, 02, 002, N'矿山集街道办事处'),
	(34, 06, 02, 100, N'朔里镇'),
	(34, 06, 02, 101, N'石台镇'),
	(34, 06, 02, 102, N'段圆镇');

/* 安徽省，淮北市，相山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 06, 03, 001, N'相南街道'),
	(34, 06, 03, 002, N'东街道'),
	(34, 06, 03, 003, N'西街道'),
	(34, 06, 03, 004, N'三堤口街道'),
	(34, 06, 03, 005, N'东山街道'),
	(34, 06, 03, 006, N'人民路街道'),
	(34, 06, 03, 007, N'刘桥街道'),
	(34, 06, 03, 008, N'任圩街道办事处'),
	(34, 06, 03, 009, N'南黎办事处'),
	(34, 06, 03, 010, N'曲阳办事处'),
	(34, 06, 03, 100, N'渠沟镇');

/* 安徽省，淮北市，烈山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 06, 04, 001, N'杨庄街道'),
	(34, 06, 04, 002, N'临海童街道'),
	(34, 06, 04, 003, N'百善街道'),
	(34, 06, 04, 004, N'任楼街道'),
	(34, 06, 04, 100, N'烈山镇'),
	(34, 06, 04, 101, N'宋町镇'),
	(34, 06, 04, 102, N'古饶镇');

/* 安徽省，淮北市，濉溪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 06, 21, 100, N'濉溪镇'),
	(34, 06, 21, 101, N'韩村镇'),
	(34, 06, 21, 102, N'刘桥镇'),
	(34, 06, 21, 103, N'五沟镇'),
	(34, 06, 21, 104, N'临涣镇'),
	(34, 06, 21, 105, N'双堆集镇'),
	(34, 06, 21, 106, N'铁佛镇'),
	(34, 06, 21, 107, N'南坪镇'),
	(34, 06, 21, 108, N'百善镇'),
	(34, 06, 21, 109, N'孙町镇'),
	(34, 06, 21, 110, N'四铺镇');

/* 安徽省，铜陵市，铜官山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 07, 02, 198, N'铜官山区虚镇');

/* 安徽省，铜陵市，狮子山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 07, 03, 005, N'东郊办事处'),
	(34, 07, 03, 100, N'西湖镇'),
	(34, 07, 03, 198, N'狮子山区虚镇');

/* 安徽省，铜陵市，郊区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 07, 11, 001, N'桥南办事处'),
	(34, 07, 11, 002, N'安矿办事处'),
	(34, 07, 11, 100, N'铜山镇'),
	(34, 07, 11, 101, N'大通镇'),
	(34, 07, 11, 198, N'郊区虚镇'),
	(34, 07, 11, 200, N'灰河乡');

/* 安徽省，铜陵市，铜陵县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 07, 21, 100, N'五松镇'),
	(34, 07, 21, 101, N'顺安镇'),
	(34, 07, 21, 102, N'钟鸣镇'),
	(34, 07, 21, 103, N'天门镇'),
	(34, 07, 21, 200, N'老洲乡'),
	(34, 07, 21, 201, N'东联乡'),
	(34, 07, 21, 202, N'西联乡'),
	(34, 07, 21, 203, N'胥坝乡');

/* 安徽省，安庆市，迎江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 08, 02, 001, N'宜城路街道'),
	(34, 08, 02, 002, N'新河路街道'),
	(34, 08, 02, 003, N'华中路街道'),
	(34, 08, 02, 004, N'人民路街道'),
	(34, 08, 02, 005, N'孝肃路街道'),
	(34, 08, 02, 006, N'滨江街道'),
	(34, 08, 02, 200, N'龙狮桥乡'),
	(34, 08, 02, 201, N'长风乡'),
	(34, 08, 02, 202, N'新洲乡');

/* 安徽省，安庆市，大观区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 08, 03, 001, N'德宽路街道办事处'),
	(34, 08, 03, 002, N'玉琳路街道办事处'),
	(34, 08, 03, 003, N'龙山路街道办事处'),
	(34, 08, 03, 004, N'菱湖街道办事处'),
	(34, 08, 03, 005, N'集贤路街道办事处'),
	(34, 08, 03, 006, N'石化路街道办事处'),
	(34, 08, 03, 007, N'花亭路街道办事处'),
	(34, 08, 03, 100, N'海口镇'),
	(34, 08, 03, 200, N'十里铺乡'),
	(34, 08, 03, 201, N'山口乡');

/* 安徽省，安庆市，宜秀区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 08, 11, 001, N'大桥街道办事处'),
	(34, 08, 11, 100, N'大龙山镇'),
	(34, 08, 11, 101, N'杨桥镇'),
	(34, 08, 11, 102, N'罗岭镇'),
	(34, 08, 11, 200, N'白泽湖乡'),
	(34, 08, 11, 201, N'五横乡');

/* 安徽省，安庆市，怀宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 08, 22, 100, N'高河镇'),
	(34, 08, 22, 101, N'石牌镇'),
	(34, 08, 22, 102, N'月山镇'),
	(34, 08, 22, 103, N'马庙镇'),
	(34, 08, 22, 104, N'金拱镇'),
	(34, 08, 22, 105, N'茶岭镇'),
	(34, 08, 22, 106, N'公岭镇'),
	(34, 08, 22, 107, N'黄墩镇'),
	(34, 08, 22, 108, N'三桥镇'),
	(34, 08, 22, 109, N'小市镇'),
	(34, 08, 22, 110, N'黄龙镇'),
	(34, 08, 22, 111, N'平山镇'),
	(34, 08, 22, 112, N'腊树镇'),
	(34, 08, 22, 113, N'洪铺镇'),
	(34, 08, 22, 114, N'江镇镇'),
	(34, 08, 22, 200, N'凉亭乡'),
	(34, 08, 22, 201, N'石镜乡'),
	(34, 08, 22, 202, N'秀山乡'),
	(34, 08, 22, 203, N'清河乡'),
	(34, 08, 22, 204, N'雷埠乡');

/* 安徽省，安庆市，枞阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 08, 23, 100, N'枞阳镇'),
	(34, 08, 23, 101, N'欧山镇'),
	(34, 08, 23, 102, N'汤沟镇'),
	(34, 08, 23, 103, N'老洲镇'),
	(34, 08, 23, 104, N'陈瑶湖镇'),
	(34, 08, 23, 105, N'周潭镇'),
	(34, 08, 23, 106, N'横埠镇'),
	(34, 08, 23, 107, N'项铺镇'),
	(34, 08, 23, 108, N'钱桥镇'),
	(34, 08, 23, 109, N'麒麟镇'),
	(34, 08, 23, 110, N'义津镇'),
	(34, 08, 23, 111, N'浮山镇'),
	(34, 08, 23, 112, N'会宫镇'),
	(34, 08, 23, 113, N'官埠桥镇'),
	(34, 08, 23, 200, N'铁铜乡'),
	(34, 08, 23, 201, N'凤仪乡'),
	(34, 08, 23, 202, N'长沙乡'),
	(34, 08, 23, 203, N'钱铺乡'),
	(34, 08, 23, 204, N'金社乡'),
	(34, 08, 23, 205, N'白梅乡'),
	(34, 08, 23, 206, N'白湖乡'),
	(34, 08, 23, 207, N'雨坛乡');

/* 安徽省，安庆市，潜山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 08, 24, 100, N'梅城镇'),
	(34, 08, 24, 101, N'源潭镇'),
	(34, 08, 24, 102, N'余井镇'),
	(34, 08, 24, 103, N'王河镇'),
	(34, 08, 24, 104, N'黄铺镇'),
	(34, 08, 24, 105, N'槎水镇'),
	(34, 08, 24, 106, N'水吼镇'),
	(34, 08, 24, 107, N'官庄镇'),
	(34, 08, 24, 108, N'黄泥镇'),
	(34, 08, 24, 109, N'黄柏镇'),
	(34, 08, 24, 110, N'天柱山镇'),
	(34, 08, 24, 200, N'塔畈乡'),
	(34, 08, 24, 201, N'油坝乡'),
	(34, 08, 24, 202, N'龙潭乡'),
	(34, 08, 24, 203, N'痘姆乡'),
	(34, 08, 24, 204, N'五庙乡');

/* 安徽省，安庆市，太湖县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 08, 25, 100, N'晋熙镇'),
	(34, 08, 25, 101, N'徐桥镇'),
	(34, 08, 25, 102, N'新仓镇'),
	(34, 08, 25, 103, N'小池镇'),
	(34, 08, 25, 104, N'寺前镇'),
	(34, 08, 25, 105, N'天华镇'),
	(34, 08, 25, 106, N'牛镇镇'),
	(34, 08, 25, 107, N'弥陀镇'),
	(34, 08, 25, 108, N'北中镇'),
	(34, 08, 25, 109, N'百里镇'),
	(34, 08, 25, 200, N'大石乡'),
	(34, 08, 25, 201, N'城西乡'),
	(34, 08, 25, 202, N'江塘乡'),
	(34, 08, 25, 203, N'汤泉乡'),
	(34, 08, 25, 204, N'刘畈乡');

/* 安徽省，安庆市，宿松县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 08, 26, 100, N'孚玉镇'),
	(34, 08, 26, 101, N'复兴镇'),
	(34, 08, 26, 102, N'汇口镇'),
	(34, 08, 26, 103, N'许岭镇'),
	(34, 08, 26, 104, N'下仓镇'),
	(34, 08, 26, 105, N'二郎镇'),
	(34, 08, 26, 106, N'破凉镇'),
	(34, 08, 26, 107, N'凉亭镇'),
	(34, 08, 26, 108, N'长铺镇'),
	(34, 08, 26, 200, N'高岭乡'),
	(34, 08, 26, 201, N'程岭乡'),
	(34, 08, 26, 202, N'九姑乡'),
	(34, 08, 26, 203, N'千岭乡'),
	(34, 08, 26, 204, N'洲头乡'),
	(34, 08, 26, 205, N'佐坝乡'),
	(34, 08, 26, 206, N'北浴乡'),
	(34, 08, 26, 207, N'陈汉乡'),
	(34, 08, 26, 208, N'隘口乡'),
	(34, 08, 26, 209, N'柳坪乡'),
	(34, 08, 26, 210, N'趾凤乡'),
	(34, 08, 26, 211, N'河塌乡'),
	(34, 08, 26, 212, N'五里乡');

/* 安徽省，安庆市，望江县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 08, 27, 100, N'华阳镇'),
	(34, 08, 27, 101, N'杨湾镇'),
	(34, 08, 27, 102, N'漳湖镇'),
	(34, 08, 27, 103, N'赛口镇'),
	(34, 08, 27, 104, N'高士镇'),
	(34, 08, 27, 105, N'鸦滩镇'),
	(34, 08, 27, 106, N'长岭镇'),
	(34, 08, 27, 107, N'太慈镇'),
	(34, 08, 27, 200, N'凉泉乡'),
	(34, 08, 27, 201, N'雷池乡');

/* 安徽省，安庆市，岳西县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 08, 28, 100, N'天堂镇'),
	(34, 08, 28, 101, N'店前镇'),
	(34, 08, 28, 102, N'来榜镇'),
	(34, 08, 28, 103, N'菖蒲镇'),
	(34, 08, 28, 104, N'头陀镇'),
	(34, 08, 28, 105, N'白帽镇'),
	(34, 08, 28, 106, N'温泉镇'),
	(34, 08, 28, 107, N'响肠镇'),
	(34, 08, 28, 108, N'河图镇'),
	(34, 08, 28, 109, N'五河镇'),
	(34, 08, 28, 110, N'主簿镇'),
	(34, 08, 28, 111, N'冶溪镇'),
	(34, 08, 28, 112, N'黄尾镇'),
	(34, 08, 28, 200, N'毛尖山乡'),
	(34, 08, 28, 201, N'莲云乡'),
	(34, 08, 28, 202, N'青天乡'),
	(34, 08, 28, 203, N'包家乡'),
	(34, 08, 28, 204, N'古坊乡'),
	(34, 08, 28, 205, N'田头乡'),
	(34, 08, 28, 206, N'中关乡'),
	(34, 08, 28, 207, N'石关乡'),
	(34, 08, 28, 208, N'姚河乡'),
	(34, 08, 28, 209, N'和平乡'),
	(34, 08, 28, 210, N'巍岭乡');

/* 安徽省，安庆市，桐城市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 08, 81, 001, N'龙腾街道'),
	(34, 08, 81, 002, N'文昌街道'),
	(34, 08, 81, 003, N'龙眠街道'),
	(34, 08, 81, 100, N'孔城镇'),
	(34, 08, 81, 101, N'吕亭镇'),
	(34, 08, 81, 102, N'范岗镇'),
	(34, 08, 81, 103, N'新渡镇'),
	(34, 08, 81, 104, N'双港镇'),
	(34, 08, 81, 105, N'大关镇'),
	(34, 08, 81, 106, N'青草镇'),
	(34, 08, 81, 107, N'金神镇'),
	(34, 08, 81, 108, N'嬉子湖镇'),
	(34, 08, 81, 109, N'唐湾镇'),
	(34, 08, 81, 110, N'黄甲镇'),
	(34, 08, 81, 111, N'鲟鱼镇');

/* 安徽省，黄山市，屯溪区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 10, 02, 001, N'昱东街道办事处'),
	(34, 10, 02, 002, N'昱中街道办事处'),
	(34, 10, 02, 003, N'昱西街道办事处'),
	(34, 10, 02, 004, N'老街街道办事处'),
	(34, 10, 02, 100, N'屯光镇'),
	(34, 10, 02, 101, N'阳湖镇'),
	(34, 10, 02, 102, N'黎阳镇'),
	(34, 10, 02, 103, N'新潭镇'),
	(34, 10, 02, 104, N'奕棋镇');

/* 安徽省，黄山市，黄山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 10, 03, 100, N'甘棠镇'),
	(34, 10, 03, 101, N'仙源镇'),
	(34, 10, 03, 102, N'汤口镇'),
	(34, 10, 03, 103, N'谭家桥镇'),
	(34, 10, 03, 104, N'太平湖镇'),
	(34, 10, 03, 105, N'焦村镇'),
	(34, 10, 03, 106, N'耿城镇'),
	(34, 10, 03, 107, N'三口镇'),
	(34, 10, 03, 108, N'乌石镇'),
	(34, 10, 03, 200, N'新明乡'),
	(34, 10, 03, 201, N'龙门乡'),
	(34, 10, 03, 203, N'新华乡'),
	(34, 10, 03, 204, N'新丰乡'),
	(34, 10, 03, 205, N'永丰乡');

/* 安徽省，黄山市，徽州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 10, 04, 100, N'岩寺镇'),
	(34, 10, 04, 101, N'西溪南镇'),
	(34, 10, 04, 102, N'潜口镇'),
	(34, 10, 04, 103, N'呈坎镇'),
	(34, 10, 04, 198, N'徽州区虚镇'),
	(34, 10, 04, 200, N'洽舍乡'),
	(34, 10, 04, 201, N'杨村乡'),
	(34, 10, 04, 202, N'富溪乡');

/* 安徽省，黄山市，歙县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 10, 21, 100, N'徽城镇'),
	(34, 10, 21, 101, N'深渡镇'),
	(34, 10, 21, 102, N'北岸镇'),
	(34, 10, 21, 103, N'富堨镇'),
	(34, 10, 21, 104, N'郑村镇'),
	(34, 10, 21, 105, N'桂林镇'),
	(34, 10, 21, 106, N'许村镇'),
	(34, 10, 21, 107, N'溪头镇'),
	(34, 10, 21, 108, N'杞梓里镇'),
	(34, 10, 21, 109, N'霞坑镇'),
	(34, 10, 21, 110, N'岔口镇'),
	(34, 10, 21, 111, N'街口镇'),
	(34, 10, 21, 112, N'王村镇'),
	(34, 10, 21, 200, N'坑口乡'),
	(34, 10, 21, 201, N'雄村乡'),
	(34, 10, 21, 202, N'上丰乡'),
	(34, 10, 21, 203, N'昌溪乡'),
	(34, 10, 21, 204, N'武阳乡'),
	(34, 10, 21, 205, N'三阳乡'),
	(34, 10, 21, 206, N'金川乡'),
	(34, 10, 21, 207, N'小川乡'),
	(34, 10, 21, 208, N'新溪口乡'),
	(34, 10, 21, 209, N'璜田乡'),
	(34, 10, 21, 210, N'长陔乡'),
	(34, 10, 21, 211, N'森村乡'),
	(34, 10, 21, 212, N'绍濂乡'),
	(34, 10, 21, 213, N'石门乡'),
	(34, 10, 21, 214, N'狮石乡');

/* 安徽省，黄山市，休宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 10, 22, 100, N'海阳镇'),
	(34, 10, 22, 101, N'齐云山镇'),
	(34, 10, 22, 102, N'万安镇'),
	(34, 10, 22, 103, N'五城镇'),
	(34, 10, 22, 104, N'东临溪镇'),
	(34, 10, 22, 105, N'蓝田镇'),
	(34, 10, 22, 106, N'溪口镇'),
	(34, 10, 22, 107, N'流口镇'),
	(34, 10, 22, 108, N'汪村镇'),
	(34, 10, 22, 109, N'商山镇'),
	(34, 10, 22, 201, N'山斗乡'),
	(34, 10, 22, 202, N'岭南乡'),
	(34, 10, 22, 203, N'渭桥乡'),
	(34, 10, 22, 204, N'板桥乡'),
	(34, 10, 22, 205, N'陈霞乡'),
	(34, 10, 22, 206, N'鹤城乡'),
	(34, 10, 22, 207, N'源芳乡'),
	(34, 10, 22, 208, N'榆村乡'),
	(34, 10, 22, 209, N'龙田乡'),
	(34, 10, 22, 210, N'璜尖乡'),
	(34, 10, 22, 211, N'白际乡');

/* 安徽省，黄山市，黟县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 10, 23, 100, N'碧阳镇'),
	(34, 10, 23, 101, N'宏村镇'),
	(34, 10, 23, 102, N'渔亭镇'),
	(34, 10, 23, 103, N'西递镇'),
	(34, 10, 23, 104, N'柯村镇'),
	(34, 10, 23, 201, N'美溪乡'),
	(34, 10, 23, 202, N'宏潭乡'),
	(34, 10, 23, 203, N'洪星乡');

/* 安徽省，黄山市，祁门县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 10, 24, 100, N'祁山镇'),
	(34, 10, 24, 101, N'小路口镇'),
	(34, 10, 24, 102, N'金字牌镇'),
	(34, 10, 24, 103, N'平里镇'),
	(34, 10, 24, 104, N'历口镇'),
	(34, 10, 24, 105, N'闪里镇'),
	(34, 10, 24, 106, N'安凌镇'),
	(34, 10, 24, 107, N'凫峰镇'),
	(34, 10, 24, 108, N'塔坊镇'),
	(34, 10, 24, 109, N'新安镇'),
	(34, 10, 24, 200, N'大坦乡'),
	(34, 10, 24, 202, N'柏溪乡'),
	(34, 10, 24, 204, N'祁红乡'),
	(34, 10, 24, 205, N'溶口乡'),
	(34, 10, 24, 206, N'芦溪乡'),
	(34, 10, 24, 207, N'渚口乡'),
	(34, 10, 24, 208, N'古溪乡'),
	(34, 10, 24, 210, N'箬坑乡');

/* 安徽省，滁州市，琅琊区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 11, 02, 001, N'琅琊街道办事处'),
	(34, 11, 02, 002, N'东门街道办事处'),
	(34, 11, 02, 003, N'西门街道办事处'),
	(34, 11, 02, 004, N'南门街道办事处'),
	(34, 11, 02, 005, N'北门街道办事处'),
	(34, 11, 02, 006, N'清流街道办事处'),
	(34, 11, 02, 007, N'扬子街道办事处'),
	(34, 11, 02, 010, N'西涧街道办事处');

/* 安徽省，滁州市，南谯区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 11, 03, 003, N'龙蟠街道办事处'),
	(34, 11, 03, 100, N'乌衣镇'),
	(34, 11, 03, 101, N'沙河镇'),
	(34, 11, 03, 102, N'章广镇'),
	(34, 11, 03, 103, N'黄泥岗镇'),
	(34, 11, 03, 104, N'珠龙镇'),
	(34, 11, 03, 105, N'大柳镇'),
	(34, 11, 03, 106, N'腰铺镇'),
	(34, 11, 03, 107, N'施集镇');

/* 安徽省，滁州市，来安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 11, 22, 100, N'新安镇'),
	(34, 11, 22, 101, N'半塔镇'),
	(34, 11, 22, 102, N'水口镇'),
	(34, 11, 22, 103, N'汊河镇'),
	(34, 11, 22, 104, N'大英镇'),
	(34, 11, 22, 105, N'雷官镇'),
	(34, 11, 22, 106, N'施官镇'),
	(34, 11, 22, 107, N'舜山镇'),
	(34, 11, 22, 200, N'三城乡'),
	(34, 11, 22, 201, N'独山乡'),
	(34, 11, 22, 202, N'张山乡'),
	(34, 11, 22, 203, N'杨郢乡');

/* 安徽省，滁州市，全椒县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 11, 24, 100, N'襄河镇'),
	(34, 11, 24, 101, N'古河镇'),
	(34, 11, 24, 102, N'大墅镇'),
	(34, 11, 24, 103, N'二郎口镇'),
	(34, 11, 24, 104, N'武岗镇'),
	(34, 11, 24, 105, N'马厂镇'),
	(34, 11, 24, 106, N'石沛镇'),
	(34, 11, 24, 107, N'十字镇'),
	(34, 11, 24, 108, N'西王镇'),
	(34, 11, 24, 109, N'六镇镇');

/* 安徽省，滁州市，定远县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 11, 25, 100, N'定城镇'),
	(34, 11, 25, 101, N'炉桥镇'),
	(34, 11, 25, 102, N'永康镇'),
	(34, 11, 25, 103, N'吴圩镇'),
	(34, 11, 25, 104, N'朱湾镇'),
	(34, 11, 25, 105, N'张桥镇'),
	(34, 11, 25, 106, N'藕塘镇'),
	(34, 11, 25, 107, N'池河镇'),
	(34, 11, 25, 108, N'连江镇'),
	(34, 11, 25, 109, N'界牌集镇'),
	(34, 11, 25, 110, N'仓镇'),
	(34, 11, 25, 111, N'三和集镇'),
	(34, 11, 25, 112, N'西卅店镇'),
	(34, 11, 25, 113, N'桑涧镇'),
	(34, 11, 25, 114, N'蒋集镇'),
	(34, 11, 25, 115, N'大桥镇'),
	(34, 11, 25, 200, N'严桥乡'),
	(34, 11, 25, 201, N'拂晓乡'),
	(34, 11, 25, 202, N'能仁乡'),
	(34, 11, 25, 203, N'七里塘乡'),
	(34, 11, 25, 204, N'二龙回族乡'),
	(34, 11, 25, 205, N'范岗乡');

/* 安徽省，滁州市，凤阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 11, 26, 100, N'府城镇'),
	(34, 11, 26, 101, N'临淮镇'),
	(34, 11, 26, 102, N'武店镇'),
	(34, 11, 26, 103, N'西泉镇'),
	(34, 11, 26, 104, N'官塘镇'),
	(34, 11, 26, 105, N'刘府镇'),
	(34, 11, 26, 106, N'大庙镇'),
	(34, 11, 26, 107, N'殷涧镇'),
	(34, 11, 26, 108, N'总铺镇'),
	(34, 11, 26, 109, N'红心镇'),
	(34, 11, 26, 110, N'板桥镇'),
	(34, 11, 26, 111, N'大溪河镇'),
	(34, 11, 26, 112, N'小溪河镇'),
	(34, 11, 26, 113, N'枣巷镇'),
	(34, 11, 26, 201, N'黄湾乡');

/* 安徽省，滁州市，天长市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 11, 81, 001, N'天长街道办事处'),
	(34, 11, 81, 100, N'铜城镇'),
	(34, 11, 81, 101, N'汊涧镇'),
	(34, 11, 81, 102, N'秦栏镇'),
	(34, 11, 81, 103, N'大通镇'),
	(34, 11, 81, 104, N'杨村镇'),
	(34, 11, 81, 105, N'石梁镇'),
	(34, 11, 81, 106, N'金集镇'),
	(34, 11, 81, 107, N'永丰镇'),
	(34, 11, 81, 108, N'仁和集镇'),
	(34, 11, 81, 109, N'冶山镇'),
	(34, 11, 81, 110, N'郑集镇'),
	(34, 11, 81, 111, N'张铺镇'),
	(34, 11, 81, 112, N'新街镇'),
	(34, 11, 81, 113, N'万寿镇');

/* 安徽省，滁州市，明光市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 11, 82, 001, N'明光街道办事处'),
	(34, 11, 82, 002, N'明东街道办事处'),
	(34, 11, 82, 003, N'明南街道办事处'),
	(34, 11, 82, 004, N'明西街道办事处'),
	(34, 11, 82, 100, N'张八岭镇'),
	(34, 11, 82, 101, N'三界镇'),
	(34, 11, 82, 102, N'管店镇'),
	(34, 11, 82, 103, N'自来桥镇'),
	(34, 11, 82, 104, N'涧溪镇'),
	(34, 11, 82, 105, N'石坝镇'),
	(34, 11, 82, 106, N'苏巷镇'),
	(34, 11, 82, 107, N'桥头镇'),
	(34, 11, 82, 108, N'女山湖镇'),
	(34, 11, 82, 109, N'古沛镇'),
	(34, 11, 82, 110, N'潘村镇'),
	(34, 11, 82, 111, N'柳巷镇'),
	(34, 11, 82, 200, N'泊岗乡');

/* 安徽省，阜阳市，颍州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 12, 02, 001, N'鼓楼街道办事处'),
	(34, 12, 02, 002, N'文峰街道办事处'),
	(34, 12, 02, 003, N'清河街道办事处'),
	(34, 12, 02, 004, N'颍西街道办事处'),
	(34, 12, 02, 005, N'西湖景区街道办事处'),
	(34, 12, 02, 100, N'王店镇'),
	(34, 12, 02, 101, N'程集镇'),
	(34, 12, 02, 102, N'三合镇'),
	(34, 12, 02, 103, N'西湖镇'),
	(34, 12, 02, 104, N'九龙镇'),
	(34, 12, 02, 105, N'三十里铺镇'),
	(34, 12, 02, 106, N'三塔集镇'),
	(34, 12, 02, 200, N'马寨乡');

/* 安徽省，阜阳市，颍东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 12, 03, 001, N'河东办事处'),
	(34, 12, 03, 002, N'新华街道办事处'),
	(34, 12, 03, 003, N'向阳街道办事处'),
	(34, 12, 03, 100, N'口孜镇'),
	(34, 12, 03, 101, N'插花镇'),
	(34, 12, 03, 102, N'袁寨镇'),
	(34, 12, 03, 103, N'枣庄镇'),
	(34, 12, 03, 104, N'老庙镇'),
	(34, 12, 03, 105, N'正午镇'),
	(34, 12, 03, 106, N'杨楼孜镇'),
	(34, 12, 03, 107, N'新乌江镇'),
	(34, 12, 03, 200, N'冉庙乡');

/* 安徽省，阜阳市，颍泉区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 12, 04, 001, N'中市街道办事处'),
	(34, 12, 04, 002, N'周棚街道办事处'),
	(34, 12, 04, 100, N'伍明镇'),
	(34, 12, 04, 101, N'宁老庄镇'),
	(34, 12, 04, 102, N'闻集镇'),
	(34, 12, 04, 103, N'行流镇');

/* 安徽省，阜阳市，临泉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 12, 21, 001, N'城关街道办事处'),
	(34, 12, 21, 002, N'邢塘街道办事处'),
	(34, 12, 21, 003, N'田桥街道办事处'),
	(34, 12, 21, 101, N'杨桥镇'),
	(34, 12, 21, 102, N'同城镇'),
	(34, 12, 21, 103, N'谭棚镇'),
	(34, 12, 21, 104, N'老集镇'),
	(34, 12, 21, 105, N'滑集镇'),
	(34, 12, 21, 106, N'吕寨镇'),
	(34, 12, 21, 107, N'单桥镇'),
	(34, 12, 21, 108, N'长官镇'),
	(34, 12, 21, 109, N'宋集镇'),
	(34, 12, 21, 110, N'张新镇'),
	(34, 12, 21, 111, N'艾亭镇'),
	(34, 12, 21, 112, N'陈集镇'),
	(34, 12, 21, 113, N'韦寨镇'),
	(34, 12, 21, 114, N'迎仙镇'),
	(34, 12, 21, 115, N'瓦店镇'),
	(34, 12, 21, 116, N'姜寨镇'),
	(34, 12, 21, 117, N'庙岔镇'),
	(34, 12, 21, 118, N'黄岭镇'),
	(34, 12, 21, 119, N'白庙镇'),
	(34, 12, 21, 120, N'关庙镇'),
	(34, 12, 21, 121, N'杨小街镇'),
	(34, 12, 21, 200, N'牛庄乡'),
	(34, 12, 21, 201, N'高塘乡'),
	(34, 12, 21, 202, N'范兴集乡'),
	(34, 12, 21, 203, N'土陂乡'),
	(34, 12, 21, 204, N'谢集乡'),
	(34, 12, 21, 206, N'陶老乡'),
	(34, 12, 21, 208, N'张营乡'),
	(34, 12, 21, 209, N'庞营乡');

/* 安徽省，阜阳市，太和县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 12, 22, 100, N'城关镇'),
	(34, 12, 22, 101, N'旧县镇'),
	(34, 12, 22, 102, N'税镇镇'),
	(34, 12, 22, 103, N'皮条孙镇'),
	(34, 12, 22, 104, N'原墙镇'),
	(34, 12, 22, 105, N'倪邱镇'),
	(34, 12, 22, 106, N'李兴镇'),
	(34, 12, 22, 107, N'大新镇'),
	(34, 12, 22, 108, N'肖口镇'),
	(34, 12, 22, 109, N'关集镇'),
	(34, 12, 22, 110, N'三塔镇'),
	(34, 12, 22, 111, N'双浮镇'),
	(34, 12, 22, 112, N'蔡庙镇'),
	(34, 12, 22, 113, N'三堂镇'),
	(34, 12, 22, 114, N'苗老集镇'),
	(34, 12, 22, 115, N'赵庙镇'),
	(34, 12, 22, 116, N'宫集镇'),
	(34, 12, 22, 117, N'坟台镇'),
	(34, 12, 22, 118, N'洪山镇'),
	(34, 12, 22, 119, N'清浅镇'),
	(34, 12, 22, 120, N'五星镇'),
	(34, 12, 22, 121, N'高庙镇'),
	(34, 12, 22, 122, N'桑营镇'),
	(34, 12, 22, 123, N'大庙集镇'),
	(34, 12, 22, 124, N'阮桥镇'),
	(34, 12, 22, 125, N'双庙镇'),
	(34, 12, 22, 126, N'胡总镇'),
	(34, 12, 22, 201, N'赵集乡'),
	(34, 12, 22, 202, N'郭庙乡'),
	(34, 12, 22, 203, N'马集乡'),
	(34, 12, 22, 204, N'二郎乡');

/* 安徽省，阜阳市，阜南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 12, 25, 101, N'方集镇'),
	(34, 12, 25, 102, N'中岗镇'),
	(34, 12, 25, 103, N'柴集镇'),
	(34, 12, 25, 104, N'新村镇'),
	(34, 12, 25, 106, N'朱寨镇'),
	(34, 12, 25, 107, N'柳沟镇'),
	(34, 12, 25, 108, N'赵集镇'),
	(34, 12, 25, 109, N'田集镇'),
	(34, 12, 25, 110, N'苗集镇'),
	(34, 12, 25, 111, N'黄岗镇'),
	(34, 12, 25, 112, N'焦陂镇'),
	(34, 12, 25, 113, N'张寨镇'),
	(34, 12, 25, 114, N'王堰镇'),
	(34, 12, 25, 115, N'地城镇'),
	(34, 12, 25, 116, N'洪河桥镇'),
	(34, 12, 25, 117, N'王家坝镇'),
	(34, 12, 25, 118, N'王化镇'),
	(34, 12, 25, 119, N'曹集镇'),
	(34, 12, 25, 120, N'鹿城镇'),
	(34, 12, 25, 121, N'会龙镇'),
	(34, 12, 25, 200, N'王店孜乡'),
	(34, 12, 25, 201, N'许堂乡'),
	(34, 12, 25, 204, N'段郢乡'),
	(34, 12, 25, 205, N'公桥乡'),
	(34, 12, 25, 206, N'龙王乡'),
	(34, 12, 25, 207, N'于集乡'),
	(34, 12, 25, 208, N'老观乡'),
	(34, 12, 25, 209, N'郜台乡');

/* 安徽省，阜阳市，颍上县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 12, 26, 100, N'慎城镇'),
	(34, 12, 26, 101, N'谢桥镇'),
	(34, 12, 26, 102, N'南照镇'),
	(34, 12, 26, 103, N'杨湖镇'),
	(34, 12, 26, 104, N'江口镇'),
	(34, 12, 26, 105, N'润河镇'),
	(34, 12, 26, 106, N'新集镇'),
	(34, 12, 26, 107, N'六十铺镇'),
	(34, 12, 26, 108, N'耿棚镇'),
	(34, 12, 26, 109, N'半岗镇'),
	(34, 12, 26, 110, N'王岗镇'),
	(34, 12, 26, 111, N'夏桥镇'),
	(34, 12, 26, 112, N'江店孜镇'),
	(34, 12, 26, 113, N'陈桥镇'),
	(34, 12, 26, 114, N'黄桥镇'),
	(34, 12, 26, 115, N'八里河镇'),
	(34, 12, 26, 116, N'迪沟镇'),
	(34, 12, 26, 117, N'西三十铺镇'),
	(34, 12, 26, 118, N'红星镇'),
	(34, 12, 26, 119, N'十八里铺镇'),
	(34, 12, 26, 120, N'鲁口镇'),
	(34, 12, 26, 121, N'古城镇'),
	(34, 12, 26, 200, N'建颍乡'),
	(34, 12, 26, 201, N'五十铺乡'),
	(34, 12, 26, 202, N'盛堂乡'),
	(34, 12, 26, 203, N'关屯乡'),
	(34, 12, 26, 204, N'垂岗乡'),
	(34, 12, 26, 205, N'赛涧回族乡'),
	(34, 12, 26, 206, N'刘集乡'),
	(34, 12, 26, 207, N'黄坝乡');

/* 安徽省，阜阳市，界首市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 12, 82, 001, N'东城办事处'),
	(34, 12, 82, 002, N'西城办事处'),
	(34, 12, 82, 003, N'颍南办事处'),
	(34, 12, 82, 100, N'光武镇'),
	(34, 12, 82, 101, N'泉阳镇'),
	(34, 12, 82, 102, N'芦村镇'),
	(34, 12, 82, 103, N'新马集镇'),
	(34, 12, 82, 104, N'大黄镇'),
	(34, 12, 82, 105, N'田营镇'),
	(34, 12, 82, 106, N'陶庙镇'),
	(34, 12, 82, 107, N'王集镇'),
	(34, 12, 82, 108, N'砖集镇'),
	(34, 12, 82, 109, N'顾集镇'),
	(34, 12, 82, 110, N'代桥镇'),
	(34, 12, 82, 111, N'舒庄镇'),
	(34, 12, 82, 200, N'邴集乡'),
	(34, 12, 82, 201, N'靳寨乡'),
	(34, 12, 82, 202, N'任寨乡');

/* 安徽省，宿州市，埇桥区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 13, 02, 001, N'埇桥街道'),
	(34, 13, 02, 002, N'沱河街道'),
	(34, 13, 02, 003, N'道东街道'),
	(34, 13, 02, 004, N'东关街道'),
	(34, 13, 02, 005, N'三里湾街道'),
	(34, 13, 02, 006, N'南关街道'),
	(34, 13, 02, 007, N'西关街道'),
	(34, 13, 02, 008, N'北关街道'),
	(34, 13, 02, 009, N'汴河街道'),
	(34, 13, 02, 010, N'三八街道'),
	(34, 13, 02, 011, N'城东街道'),
	(34, 13, 02, 100, N'符离镇'),
	(34, 13, 02, 101, N'芦岭镇'),
	(34, 13, 02, 102, N'朱仙庄镇'),
	(34, 13, 02, 103, N'褚兰镇'),
	(34, 13, 02, 104, N'曹村镇'),
	(34, 13, 02, 105, N'夹沟镇'),
	(34, 13, 02, 106, N'栏杆镇'),
	(34, 13, 02, 107, N'时村镇'),
	(34, 13, 02, 108, N'永安镇'),
	(34, 13, 02, 109, N'灰古镇'),
	(34, 13, 02, 110, N'大店镇'),
	(34, 13, 02, 111, N'大泽乡镇'),
	(34, 13, 02, 112, N'桃园镇'),
	(34, 13, 02, 113, N'蕲县镇'),
	(34, 13, 02, 114, N'大营镇'),
	(34, 13, 02, 200, N'杨庄乡'),
	(34, 13, 02, 201, N'支河乡'),
	(34, 13, 02, 202, N'解集乡'),
	(34, 13, 02, 203, N'桃沟乡'),
	(34, 13, 02, 204, N'顺河乡'),
	(34, 13, 02, 207, N'永镇乡'),
	(34, 13, 02, 208, N'西二铺乡'),
	(34, 13, 02, 209, N'北杨寨乡');

/* 安徽省，宿州市，砀山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 13, 21, 100, N'砀城镇'),
	(34, 13, 21, 101, N'赵屯镇'),
	(34, 13, 21, 102, N'李庄镇'),
	(34, 13, 21, 103, N'唐寨镇'),
	(34, 13, 21, 104, N'葛集镇'),
	(34, 13, 21, 105, N'周寨镇'),
	(34, 13, 21, 106, N'玄庙镇'),
	(34, 13, 21, 107, N'官庄坝镇'),
	(34, 13, 21, 108, N'曹庄镇'),
	(34, 13, 21, 109, N'关帝庙镇'),
	(34, 13, 21, 110, N'朱楼镇'),
	(34, 13, 21, 111, N'良梨镇'),
	(34, 13, 21, 112, N'程庄镇');

/* 安徽省，宿州市，萧县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 13, 22, 100, N'龙城镇'),
	(34, 13, 22, 101, N'黄口镇'),
	(34, 13, 22, 102, N'杨楼镇'),
	(34, 13, 22, 103, N'闫集镇'),
	(34, 13, 22, 104, N'新庄镇'),
	(34, 13, 22, 105, N'刘套镇'),
	(34, 13, 22, 106, N'马井镇'),
	(34, 13, 22, 107, N'大屯镇'),
	(34, 13, 22, 108, N'赵庄镇'),
	(34, 13, 22, 109, N'杜楼镇'),
	(34, 13, 22, 110, N'丁里镇'),
	(34, 13, 22, 111, N'王寨镇'),
	(34, 13, 22, 112, N'祖楼镇'),
	(34, 13, 22, 113, N'青龙集镇'),
	(34, 13, 22, 114, N'张庄寨镇'),
	(34, 13, 22, 115, N'永堌镇'),
	(34, 13, 22, 116, N'白土镇'),
	(34, 13, 22, 117, N'官桥镇'),
	(34, 13, 22, 200, N'圣泉乡'),
	(34, 13, 22, 201, N'酒店乡'),
	(34, 13, 22, 202, N'孙圩子乡'),
	(34, 13, 22, 203, N'庄里乡'),
	(34, 13, 22, 204, N'石林乡');

/* 安徽省，宿州市，灵璧县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 13, 23, 100, N'灵城镇'),
	(34, 13, 23, 101, N'韦集镇'),
	(34, 13, 23, 102, N'黄湾镇'),
	(34, 13, 23, 103, N'娄庄镇'),
	(34, 13, 23, 104, N'杨疃镇'),
	(34, 13, 23, 105, N'尹集镇'),
	(34, 13, 23, 106, N'浍沟镇'),
	(34, 13, 23, 107, N'尤集镇'),
	(34, 13, 23, 108, N'下楼镇'),
	(34, 13, 23, 109, N'朝阳镇'),
	(34, 13, 23, 110, N'渔沟镇'),
	(34, 13, 23, 111, N'高楼镇'),
	(34, 13, 23, 112, N'冯庙镇'),
	(34, 13, 23, 200, N'向阳乡'),
	(34, 13, 23, 201, N'朱集乡'),
	(34, 13, 23, 202, N'大路乡'),
	(34, 13, 23, 203, N'大庙乡'),
	(34, 13, 23, 204, N'禅堂乡'),
	(34, 13, 23, 205, N'虞姬乡');

/* 安徽省，宿州市，泗县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 13, 24, 100, N'泗城镇'),
	(34, 13, 24, 101, N'墩集镇'),
	(34, 13, 24, 102, N'丁湖镇'),
	(34, 13, 24, 103, N'草沟镇'),
	(34, 13, 24, 104, N'长沟镇'),
	(34, 13, 24, 105, N'黄圩镇'),
	(34, 13, 24, 106, N'大庄镇'),
	(34, 13, 24, 107, N'山头镇'),
	(34, 13, 24, 108, N'刘圩镇'),
	(34, 13, 24, 109, N'黑塔镇'),
	(34, 13, 24, 110, N'草庙镇'),
	(34, 13, 24, 111, N'屏山镇'),
	(34, 13, 24, 200, N'大路口乡'),
	(34, 13, 24, 201, N'大杨乡'),
	(34, 13, 24, 202, N'瓦坊乡');

/* 安徽省，六安市，金安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 15, 02, 001, N'中市街道'),
	(34, 15, 02, 002, N'东市街道'),
	(34, 15, 02, 003, N'三里桥街道'),
	(34, 15, 02, 004, N'望城街道'),
	(34, 15, 02, 005, N'清水河街道'),
	(34, 15, 02, 100, N'木厂镇'),
	(34, 15, 02, 101, N'马头镇'),
	(34, 15, 02, 102, N'东桥镇'),
	(34, 15, 02, 103, N'张店镇'),
	(34, 15, 02, 104, N'毛坦厂镇'),
	(34, 15, 02, 105, N'东河口镇'),
	(34, 15, 02, 106, N'双河镇'),
	(34, 15, 02, 107, N'施桥镇'),
	(34, 15, 02, 108, N'孙岗镇'),
	(34, 15, 02, 109, N'三十铺镇'),
	(34, 15, 02, 110, N'椿树镇'),
	(34, 15, 02, 200, N'城北乡'),
	(34, 15, 02, 201, N'翁墩乡'),
	(34, 15, 02, 202, N'淠东乡'),
	(34, 15, 02, 203, N'中店乡'),
	(34, 15, 02, 204, N'横塘岗乡'),
	(34, 15, 02, 205, N'先生店乡');

/* 安徽省，六安市，裕安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 15, 03, 001, N'鼓楼街道'),
	(34, 15, 03, 002, N'西市街道'),
	(34, 15, 03, 003, N'小华山街道'),
	(34, 15, 03, 100, N'苏埠镇'),
	(34, 15, 03, 101, N'韩摆渡镇'),
	(34, 15, 03, 102, N'新安镇'),
	(34, 15, 03, 103, N'顺河镇'),
	(34, 15, 03, 104, N'独山镇'),
	(34, 15, 03, 105, N'石婆店镇'),
	(34, 15, 03, 106, N'城南镇'),
	(34, 15, 03, 107, N'丁集镇'),
	(34, 15, 03, 108, N'固镇镇'),
	(34, 15, 03, 109, N'徐集镇'),
	(34, 15, 03, 110, N'分路口镇'),
	(34, 15, 03, 111, N'江家店镇'),
	(34, 15, 03, 200, N'单王乡'),
	(34, 15, 03, 201, N'青山乡'),
	(34, 15, 03, 202, N'石板冲乡'),
	(34, 15, 03, 203, N'西河口乡'),
	(34, 15, 03, 204, N'平桥乡'),
	(34, 15, 03, 205, N'罗集乡'),
	(34, 15, 03, 206, N'狮子岗乡');

/* 安徽省，六安市，寿县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 15, 21, 100, N'寿春镇'),
	(34, 15, 21, 101, N'双桥镇'),
	(34, 15, 21, 102, N'涧沟镇'),
	(34, 15, 21, 103, N'丰庄镇'),
	(34, 15, 21, 104, N'正阳关镇'),
	(34, 15, 21, 105, N'迎河镇'),
	(34, 15, 21, 106, N'板桥镇'),
	(34, 15, 21, 107, N'安丰塘镇'),
	(34, 15, 21, 108, N'堰口镇'),
	(34, 15, 21, 109, N'保义镇'),
	(34, 15, 21, 110, N'隐贤镇'),
	(34, 15, 21, 111, N'安丰镇'),
	(34, 15, 21, 112, N'众兴镇'),
	(34, 15, 21, 113, N'茶庵镇'),
	(34, 15, 21, 114, N'三觉镇'),
	(34, 15, 21, 115, N'炎刘镇'),
	(34, 15, 21, 116, N'刘岗镇'),
	(34, 15, 21, 117, N'双庙集镇'),
	(34, 15, 21, 118, N'小甸镇'),
	(34, 15, 21, 119, N'瓦埠镇'),
	(34, 15, 21, 120, N'大顺镇'),
	(34, 15, 21, 121, N'窑口镇'),
	(34, 15, 21, 200, N'八公山乡'),
	(34, 15, 21, 201, N'张李乡'),
	(34, 15, 21, 203, N'陶店回族乡');

/* 安徽省，六安市，霍邱县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 15, 22, 100, N'城关镇'),
	(34, 15, 22, 101, N'河口镇'),
	(34, 15, 22, 102, N'周集镇'),
	(34, 15, 22, 103, N'临水镇'),
	(34, 15, 22, 104, N'新店镇'),
	(34, 15, 22, 105, N'石店镇'),
	(34, 15, 22, 106, N'马店镇'),
	(34, 15, 22, 107, N'孟集镇'),
	(34, 15, 22, 108, N'花园镇'),
	(34, 15, 22, 109, N'扈胡镇'),
	(34, 15, 22, 110, N'长集镇'),
	(34, 15, 22, 111, N'洪集镇'),
	(34, 15, 22, 112, N'姚李镇'),
	(34, 15, 22, 113, N'乌龙镇'),
	(34, 15, 22, 114, N'高塘镇'),
	(34, 15, 22, 115, N'龙潭镇'),
	(34, 15, 22, 116, N'岔路镇'),
	(34, 15, 22, 117, N'冯井镇'),
	(34, 15, 22, 118, N'众兴集镇'),
	(34, 15, 22, 119, N'夏店镇'),
	(34, 15, 22, 120, N'曹庙镇'),
	(34, 15, 22, 121, N'叶集区镇区办事处'),
	(34, 15, 22, 122, N'叶集区镇平岗办事处'),
	(34, 15, 22, 123, N'范桥镇'),
	(34, 15, 22, 124, N'潘集镇'),
	(34, 15, 22, 125, N'三元镇'),
	(34, 15, 22, 200, N'彭塔乡'),
	(34, 15, 22, 201, N'王截流乡'),
	(34, 15, 22, 203, N'临淮岗乡'),
	(34, 15, 22, 204, N'城西湖乡'),
	(34, 15, 22, 205, N'宋店乡'),
	(34, 15, 22, 206, N'三流乡'),
	(34, 15, 22, 207, N'邵岗乡'),
	(34, 15, 22, 208, N'白莲乡'),
	(34, 15, 22, 210, N'冯瓴乡'),
	(34, 15, 22, 211, N'孙岗乡');

/* 安徽省，六安市，舒城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 15, 23, 100, N'城关镇'),
	(34, 15, 23, 101, N'晓天镇'),
	(34, 15, 23, 102, N'桃溪镇'),
	(34, 15, 23, 103, N'万佛湖镇'),
	(34, 15, 23, 104, N'千人桥镇'),
	(34, 15, 23, 105, N'百神庙镇'),
	(34, 15, 23, 106, N'杭埠镇'),
	(34, 15, 23, 107, N'舒茶镇'),
	(34, 15, 23, 108, N'南港镇'),
	(34, 15, 23, 109, N'干汊河镇'),
	(34, 15, 23, 110, N'张母桥镇'),
	(34, 15, 23, 111, N'五显镇'),
	(34, 15, 23, 112, N'山七镇'),
	(34, 15, 23, 113, N'河棚镇'),
	(34, 15, 23, 114, N'汤池镇'),
	(34, 15, 23, 200, N'春秋乡'),
	(34, 15, 23, 201, N'柏林乡'),
	(34, 15, 23, 202, N'棠树乡'),
	(34, 15, 23, 203, N'阙店乡'),
	(34, 15, 23, 204, N'高峰乡'),
	(34, 15, 23, 205, N'庐镇乡');

/* 安徽省，六安市，金寨县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 15, 24, 100, N'梅山镇'),
	(34, 15, 24, 101, N'麻埠镇'),
	(34, 15, 24, 102, N'青山镇'),
	(34, 15, 24, 103, N'燕子河镇'),
	(34, 15, 24, 104, N'天堂寨镇'),
	(34, 15, 24, 105, N'古碑镇'),
	(34, 15, 24, 106, N'吴家店镇'),
	(34, 15, 24, 107, N'斑竹园镇'),
	(34, 15, 24, 108, N'汤家汇镇'),
	(34, 15, 24, 109, N'南溪镇'),
	(34, 15, 24, 110, N'双河镇'),
	(34, 15, 24, 111, N'白塔畈镇'),
	(34, 15, 24, 201, N'张冲乡'),
	(34, 15, 24, 202, N'油坊店乡'),
	(34, 15, 24, 203, N'长岭乡'),
	(34, 15, 24, 204, N'槐树湾乡'),
	(34, 15, 24, 205, N'花石乡'),
	(34, 15, 24, 206, N'沙河乡'),
	(34, 15, 24, 207, N'桃岭乡'),
	(34, 15, 24, 208, N'果子园乡'),
	(34, 15, 24, 209, N'关庙乡'),
	(34, 15, 24, 211, N'全军乡'),
	(34, 15, 24, 214, N'铁冲乡');

/* 安徽省，六安市，霍山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 15, 25, 100, N'衡山镇'),
	(34, 15, 25, 101, N'佛子岭镇'),
	(34, 15, 25, 102, N'下符桥镇'),
	(34, 15, 25, 103, N'但家庙镇'),
	(34, 15, 25, 104, N'与儿街镇'),
	(34, 15, 25, 105, N'黑石渡镇'),
	(34, 15, 25, 106, N'诸佛庵镇'),
	(34, 15, 25, 107, N'落儿岭镇'),
	(34, 15, 25, 108, N'磨子潭镇'),
	(34, 15, 25, 109, N'大化坪镇'),
	(34, 15, 25, 110, N'漫水河镇'),
	(34, 15, 25, 111, N'上土市镇'),
	(34, 15, 25, 112, N'单龙寺镇'),
	(34, 15, 25, 201, N'东西溪乡'),
	(34, 15, 25, 202, N'太平畈乡'),
	(34, 15, 25, 203, N'太阳乡');

/* 安徽省，亳州市，谯城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 16, 02, 001, N'花戏楼办事处'),
	(34, 16, 02, 002, N'薛阁办事处'),
	(34, 16, 02, 003, N'汤陵办事处'),
	(34, 16, 02, 100, N'古井镇'),
	(34, 16, 02, 101, N'芦庙镇'),
	(34, 16, 02, 102, N'华佗镇'),
	(34, 16, 02, 103, N'魏岗镇'),
	(34, 16, 02, 104, N'牛集镇'),
	(34, 16, 02, 105, N'颜集镇'),
	(34, 16, 02, 106, N'五马镇'),
	(34, 16, 02, 107, N'十八里镇'),
	(34, 16, 02, 108, N'谯东镇'),
	(34, 16, 02, 109, N'十九里镇'),
	(34, 16, 02, 110, N'沙土镇'),
	(34, 16, 02, 111, N'观堂镇'),
	(34, 16, 02, 112, N'大杨镇'),
	(34, 16, 02, 113, N'城父镇'),
	(34, 16, 02, 114, N'十河镇'),
	(34, 16, 02, 115, N'双沟镇'),
	(34, 16, 02, 116, N'淝河镇'),
	(34, 16, 02, 117, N'古城镇'),
	(34, 16, 02, 118, N'龙杨镇'),
	(34, 16, 02, 119, N'立德镇'),
	(34, 16, 02, 200, N'张店乡'),
	(34, 16, 02, 201, N'赵桥乡');

/* 安徽省，亳州市，涡阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 16, 21, 001, N'城关街道办事处'),
	(34, 16, 21, 002, N'城西街道办事处'),
	(34, 16, 21, 003, N'城东街道办事处'),
	(34, 16, 21, 004, N'涡北街道办事处'),
	(34, 16, 21, 103, N'西阳镇'),
	(34, 16, 21, 104, N'涡南镇'),
	(34, 16, 21, 105, N'楚店镇'),
	(34, 16, 21, 106, N'高公镇'),
	(34, 16, 21, 108, N'高炉镇'),
	(34, 16, 21, 109, N'曹市镇'),
	(34, 16, 21, 110, N'青町镇'),
	(34, 16, 21, 111, N'石弓镇'),
	(34, 16, 21, 112, N'龙山镇'),
	(34, 16, 21, 113, N'义门镇'),
	(34, 16, 21, 114, N'新兴镇'),
	(34, 16, 21, 115, N'临湖镇'),
	(34, 16, 21, 116, N'丹城镇'),
	(34, 16, 21, 117, N'马店集镇'),
	(34, 16, 21, 118, N'花沟镇'),
	(34, 16, 21, 119, N'店集镇'),
	(34, 16, 21, 120, N'陈大镇'),
	(34, 16, 21, 121, N'牌坊镇'),
	(34, 16, 21, 122, N'公吉寺镇'),
	(34, 16, 21, 123, N'标里镇');

/* 安徽省，亳州市，蒙城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 16, 22, 001, N'漆园办事处（镇级单位）'),
	(34, 16, 22, 002, N'庄周办事处（乡级单位）'),
	(34, 16, 22, 100, N'城关镇'),
	(34, 16, 22, 101, N'双涧镇'),
	(34, 16, 22, 102, N'小涧镇'),
	(34, 16, 22, 104, N'坛城镇'),
	(34, 16, 22, 105, N'范集工业园区（镇级单位）'),
	(34, 16, 22, 106, N'许疃镇'),
	(34, 16, 22, 107, N'板桥集镇'),
	(34, 16, 22, 108, N'马集镇'),
	(34, 16, 22, 109, N'岳坊镇'),
	(34, 16, 22, 110, N'立仓镇'),
	(34, 16, 22, 111, N'楚村镇'),
	(34, 16, 22, 112, N'乐土镇'),
	(34, 16, 22, 113, N'三义镇'),
	(34, 16, 22, 114, N'篱笆镇'),
	(34, 16, 22, 198, N'蒙城县农业委员会（镇级单位）直辖村级单位'),
	(34, 16, 22, 201, N'王集乡'),
	(34, 16, 22, 202, N'小辛集乡');

/* 安徽省，亳州市，利辛县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 16, 23, 100, N'城关镇'),
	(34, 16, 23, 101, N'阚疃镇'),
	(34, 16, 23, 102, N'张村镇'),
	(34, 16, 23, 103, N'江集镇'),
	(34, 16, 23, 104, N'旧城镇'),
	(34, 16, 23, 105, N'西潘楼镇'),
	(34, 16, 23, 106, N'孙集镇'),
	(34, 16, 23, 107, N'汝集镇'),
	(34, 16, 23, 108, N'巩店镇'),
	(34, 16, 23, 109, N'王人镇'),
	(34, 16, 23, 110, N'王市镇'),
	(34, 16, 23, 111, N'永兴镇'),
	(34, 16, 23, 112, N'马店孜镇'),
	(34, 16, 23, 113, N'大李集镇'),
	(34, 16, 23, 114, N'胡集镇'),
	(34, 16, 23, 115, N'展沟镇'),
	(34, 16, 23, 116, N'程家集镇'),
	(34, 16, 23, 117, N'中疃镇'),
	(34, 16, 23, 118, N'望疃镇'),
	(34, 16, 23, 119, N'城北镇'),
	(34, 16, 23, 203, N'纪王场乡'),
	(34, 16, 23, 204, N'孙庙乡'),
	(34, 16, 23, 205, N'新张集乡');

/* 安徽省，池州市，贵池区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 17, 02, 001, N'池阳街道办事处'),
	(34, 17, 02, 002, N'秋浦街道办事处'),
	(34, 17, 02, 003, N'里山街道办事处'),
	(34, 17, 02, 004, N'江口街道办事处'),
	(34, 17, 02, 005, N'马衙街道办事处'),
	(34, 17, 02, 006, N'墩上街道办事处'),
	(34, 17, 02, 007, N'梅龙街道办事处'),
	(34, 17, 02, 008, N'秋江街道办事处'),
	(34, 17, 02, 009, N'杏花村街道办事处'),
	(34, 17, 02, 010, N'清风街道办事处'),
	(34, 17, 02, 011, N'清溪街道办事处'),
	(34, 17, 02, 100, N'殷汇镇'),
	(34, 17, 02, 101, N'牛头山镇'),
	(34, 17, 02, 102, N'涓桥镇'),
	(34, 17, 02, 103, N'梅街镇'),
	(34, 17, 02, 104, N'梅村镇'),
	(34, 17, 02, 105, N'唐田镇'),
	(34, 17, 02, 106, N'牌楼镇'),
	(34, 17, 02, 107, N'乌沙镇'),
	(34, 17, 02, 108, N'棠溪镇');

/* 安徽省，池州市，东至县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 17, 21, 100, N'尧渡镇'),
	(34, 17, 21, 101, N'东流镇'),
	(34, 17, 21, 102, N'大渡口镇'),
	(34, 17, 21, 103, N'胜利镇'),
	(34, 17, 21, 104, N'张溪镇'),
	(34, 17, 21, 105, N'洋湖镇'),
	(34, 17, 21, 106, N'葛公镇'),
	(34, 17, 21, 107, N'香隅镇'),
	(34, 17, 21, 108, N'官港镇'),
	(34, 17, 21, 109, N'昭潭镇'),
	(34, 17, 21, 110, N'龙泉镇'),
	(34, 17, 21, 111, N'泥溪镇'),
	(34, 17, 21, 200, N'花园乡'),
	(34, 17, 21, 201, N'木塔乡'),
	(34, 17, 21, 202, N'青山乡');

/* 安徽省，池州市，石台县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 17, 22, 100, N'仁里镇'),
	(34, 17, 22, 101, N'七都镇'),
	(34, 17, 22, 102, N'仙寓镇'),
	(34, 17, 22, 103, N'丁香镇'),
	(34, 17, 22, 104, N'小河镇'),
	(34, 17, 22, 105, N'横渡镇'),
	(34, 17, 22, 200, N'大演乡'),
	(34, 17, 22, 201, N'矶滩乡');

/* 安徽省，池州市，青阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 17, 23, 100, N'蓉城镇'),
	(34, 17, 23, 101, N'木镇镇'),
	(34, 17, 23, 102, N'庙前镇'),
	(34, 17, 23, 103, N'陵阳镇'),
	(34, 17, 23, 104, N'新河镇'),
	(34, 17, 23, 105, N'丁桥镇'),
	(34, 17, 23, 106, N'朱备镇'),
	(34, 17, 23, 107, N'杨田镇'),
	(34, 17, 23, 108, N'九华镇'),
	(34, 17, 23, 109, N'酉华镇'),
	(34, 17, 23, 200, N'乔木乡'),
	(34, 17, 23, 202, N'杜村乡'),
	(34, 17, 23, 203, N'九华乡');

/* 安徽省，宣城市，宣州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 18, 02, 001, N'西林街道办事处'),
	(34, 18, 02, 002, N'澄江街道办事处'),
	(34, 18, 02, 003, N'鳌峰街道办事处'),
	(34, 18, 02, 004, N'济川街道办事处'),
	(34, 18, 02, 005, N'敬亭山街道办事处'),
	(34, 18, 02, 006, N'双桥街道办事处'),
	(34, 18, 02, 009, N'向阳街道'),
	(34, 18, 02, 100, N'水阳镇'),
	(34, 18, 02, 101, N'狸桥镇'),
	(34, 18, 02, 102, N'沈村镇'),
	(34, 18, 02, 103, N'古泉镇'),
	(34, 18, 02, 104, N'洪林镇'),
	(34, 18, 02, 105, N'寒亭镇'),
	(34, 18, 02, 106, N'文昌镇'),
	(34, 18, 02, 107, N'孙埠镇'),
	(34, 18, 02, 109, N'杨柳镇'),
	(34, 18, 02, 110, N'水东镇'),
	(34, 18, 02, 111, N'新田镇'),
	(34, 18, 02, 112, N'周王镇'),
	(34, 18, 02, 113, N'溪口镇'),
	(34, 18, 02, 200, N'朱桥乡'),
	(34, 18, 02, 201, N'养贤乡'),
	(34, 18, 02, 202, N'五星乡'),
	(34, 18, 02, 204, N'黄渡乡');

/* 安徽省，宣城市，郎溪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 18, 21, 100, N'建平镇'),
	(34, 18, 21, 101, N'十字镇'),
	(34, 18, 21, 102, N'新发镇'),
	(34, 18, 21, 103, N'涛城镇'),
	(34, 18, 21, 105, N'梅渚镇'),
	(34, 18, 21, 107, N'毕桥镇'),
	(34, 18, 21, 108, N'飞鲤镇'),
	(34, 18, 21, 200, N'凌笪乡'),
	(34, 18, 21, 202, N'姚村乡');

/* 安徽省，宣城市，广德县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 18, 22, 100, N'桃州镇'),
	(34, 18, 22, 101, N'柏垫镇'),
	(34, 18, 22, 102, N'誓节镇'),
	(34, 18, 22, 103, N'邱村镇'),
	(34, 18, 22, 104, N'新杭镇'),
	(34, 18, 22, 105, N'杨滩镇'),
	(34, 18, 22, 200, N'卢村乡'),
	(34, 18, 22, 201, N'东亭乡'),
	(34, 18, 22, 203, N'四合乡');

/* 安徽省，宣城市，泾县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 18, 23, 100, N'泾川镇'),
	(34, 18, 23, 101, N'茂林镇'),
	(34, 18, 23, 102, N'榔桥镇'),
	(34, 18, 23, 103, N'桃花潭镇'),
	(34, 18, 23, 104, N'琴溪镇'),
	(34, 18, 23, 105, N'蔡村镇'),
	(34, 18, 23, 106, N'云岭镇'),
	(34, 18, 23, 107, N'黄村镇'),
	(34, 18, 23, 108, N'丁家桥镇'),
	(34, 18, 23, 200, N'汀溪乡'),
	(34, 18, 23, 201, N'昌桥乡');

/* 安徽省，宣城市，绩溪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 18, 24, 100, N'华阳镇'),
	(34, 18, 24, 101, N'临溪镇'),
	(34, 18, 24, 102, N'长安镇'),
	(34, 18, 24, 103, N'上庄镇'),
	(34, 18, 24, 104, N'扬溪镇'),
	(34, 18, 24, 105, N'伏岭镇'),
	(34, 18, 24, 106, N'金沙镇'),
	(34, 18, 24, 107, N'瀛洲镇'),
	(34, 18, 24, 201, N'板桥头乡'),
	(34, 18, 24, 202, N'家朋乡'),
	(34, 18, 24, 203, N'荆州乡');

/* 安徽省，宣城市，旌德县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 18, 25, 100, N'旌阳镇'),
	(34, 18, 25, 101, N'蔡家桥镇'),
	(34, 18, 25, 102, N'三溪镇'),
	(34, 18, 25, 103, N'庙首镇'),
	(34, 18, 25, 104, N'白地镇'),
	(34, 18, 25, 105, N'俞村镇'),
	(34, 18, 25, 106, N'兴隆镇'),
	(34, 18, 25, 107, N'孙村镇'),
	(34, 18, 25, 200, N'版书乡'),
	(34, 18, 25, 202, N'云乐乡');

/* 安徽省，宣城市，宁国市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(34, 18, 81, 001, N'西津街道'),
	(34, 18, 81, 002, N'南山街道'),
	(34, 18, 81, 003, N'河沥街道'),
	(34, 18, 81, 004, N'汪溪街道'),
	(34, 18, 81, 005, N'竹峰街道'),
	(34, 18, 81, 100, N'港口镇'),
	(34, 18, 81, 101, N'梅林镇'),
	(34, 18, 81, 102, N'中溪镇'),
	(34, 18, 81, 103, N'宁墩镇'),
	(34, 18, 81, 104, N'仙霞镇'),
	(34, 18, 81, 105, N'甲路镇'),
	(34, 18, 81, 106, N'胡乐镇'),
	(34, 18, 81, 107, N'霞西镇'),
	(34, 18, 81, 200, N'云梯畲族乡'),
	(34, 18, 81, 201, N'南极乡'),
	(34, 18, 81, 202, N'万家乡'),
	(34, 18, 81, 203, N'青龙乡'),
	(34, 18, 81, 204, N'方塘乡');
