SET NOCOUNT ON;
SET XACT_ABORT ON;

/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

/*
 * 《2015年统计用区划代码和城乡划分代码（截止2015年09月30日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2015/index.html）
 * 数据范围：河南省(41)、湖北省(42)、湖南省(43)。
 */

/* 河南省 郑州市 中原区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 02, 001, N'林山寨街道办事处'),
	(41, 01, 02, 002, N'建设路街道办事处'),
	(41, 01, 02, 003, N'棉纺路街道办事处'),
	(41, 01, 02, 004, N'秦岭路街道办事处'),
	(41, 01, 02, 005, N'桐柏路街道办事处'),
	(41, 01, 02, 006, N'三官庙街道办事处'),
	(41, 01, 02, 007, N'绿东村街道办事处'),
	(41, 01, 02, 008, N'汝河路街道办事处'),
	(41, 01, 02, 009, N'航海西路街道办事处'),
	(41, 01, 02, 010, N'中原西路街道办事处'),
	(41, 01, 02, 011, N'西流湖街道办事处'),
	(41, 01, 02, 012, N'须水街道办事处');

/* 河南省 郑州市 二七区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 03, 001, N'淮河路街道办事处'),
	(41, 01, 03, 002, N'解放路街道办事处'),
	(41, 01, 03, 003, N'铭功路街道办事处'),
	(41, 01, 03, 004, N'一马路街道办事处'),
	(41, 01, 03, 005, N'蜜蜂张街道办事处'),
	(41, 01, 03, 006, N'五里堡街道办事处'),
	(41, 01, 03, 007, N'大学路街道办事处'),
	(41, 01, 03, 008, N'建中街街道办事处'),
	(41, 01, 03, 009, N'福华街街道办事处'),
	(41, 01, 03, 010, N'德化街街道办事处'),
	(41, 01, 03, 011, N'嵩山路街道办事处'),
	(41, 01, 03, 012, N'京广路街道办事处'),
	(41, 01, 03, 013, N'长江路街道办事处'),
	(41, 01, 03, 015, N'人和路街道办事处'),
	(41, 01, 03, 100, N'马寨镇'),
	(41, 01, 03, 201, N'侯寨乡');

/* 河南省 郑州市 管城回族区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 04, 001, N'北下街街道办事处'),
	(41, 01, 04, 002, N'西大街街道办事处'),
	(41, 01, 04, 003, N'南关街道办事处'),
	(41, 01, 04, 004, N'城东路街道办事处'),
	(41, 01, 04, 005, N'东大街街道办事处'),
	(41, 01, 04, 006, N'二里岗街道办事处'),
	(41, 01, 04, 007, N'陇海马路街道办事处'),
	(41, 01, 04, 008, N'紫荆山南路街道办事处'),
	(41, 01, 04, 009, N'航海东路街道办事处'),
	(41, 01, 04, 100, N'十八里河镇'),
	(41, 01, 04, 201, N'南曹乡'),
	(41, 01, 04, 202, N'圃田乡');

/* 河南省 郑州市 金水区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 05, 001, N'经八路街道办事处'),
	(41, 01, 05, 002, N'花园路街道办事处'),
	(41, 01, 05, 003, N'人民路街道办事处'),
	(41, 01, 05, 004, N'杜岭街道办事处'),
	(41, 01, 05, 005, N'大石桥街道办事处'),
	(41, 01, 05, 006, N'南阳路街道办事处'),
	(41, 01, 05, 007, N'南阳新村街道办事处'),
	(41, 01, 05, 008, N'文化路街道办事处'),
	(41, 01, 05, 009, N'丰产路街道办事处'),
	(41, 01, 05, 010, N'东风路街道办事处'),
	(41, 01, 05, 011, N'北林路街道办事处'),
	(41, 01, 05, 012, N'未来路街道办事处'),
	(41, 01, 05, 013, N'凤凰台街道办事处'),
	(41, 01, 05, 014, N'龙子湖街道办事处'),
	(41, 01, 05, 015, N'祭城路街道办事处'),
	(41, 01, 05, 016, N'兴达路街道办事处'),
	(41, 01, 05, 017, N'国基路街道办事处'),
	(41, 01, 05, 018, N'杨金路街道办事处'),
	(41, 01, 05, 019, N'丰庆路街道办事处');

/* 河南省 郑州市 上街区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 06, 001, N'济源路街道办事处'),
	(41, 01, 06, 002, N'中心路街道办事处'),
	(41, 01, 06, 003, N'新安路街道办事处'),
	(41, 01, 06, 004, N'工业路街道办事处'),
	(41, 01, 06, 005, N'矿山街道办事处'),
	(41, 01, 06, 100, N'峡窝镇');

/* 河南省 郑州市 惠济区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 08, 001, N'新城街道办事处'),
	(41, 01, 08, 002, N'刘寨街道办事处'),
	(41, 01, 08, 003, N'老鸦陈街道办事处'),
	(41, 01, 08, 004, N'长兴路街道办事处'),
	(41, 01, 08, 005, N'迎宾路街道办事处'),
	(41, 01, 08, 006, N'大河路街道办事处'),
	(41, 01, 08, 100, N'花园口镇'),
	(41, 01, 08, 101, N'古荥镇');

/* 河南省 郑州市 中牟县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 22, 001, N'青年路街道办事处'),
	(41, 01, 22, 002, N'东风路街道办事处'),
	(41, 01, 22, 003, N'广惠街街道办事处'),
	(41, 01, 22, 101, N'韩寺镇'),
	(41, 01, 22, 102, N'官渡镇'),
	(41, 01, 22, 103, N'狼城岗镇'),
	(41, 01, 22, 104, N'万滩镇'),
	(41, 01, 22, 105, N'白沙镇'),
	(41, 01, 22, 106, N'郑庵镇'),
	(41, 01, 22, 109, N'黄店镇'),
	(41, 01, 22, 110, N'大孟镇'),
	(41, 01, 22, 112, N'刘集镇'),
	(41, 01, 22, 114, N'雁鸣湖镇'),
	(41, 01, 22, 115, N'姚家镇'),
	(41, 01, 22, 208, N'刁家乡');

/* 河南省 郑州市 巩义市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 81, 001, N'新华路街道办事处'),
	(41, 01, 81, 002, N'杜甫路街道办事处'),
	(41, 01, 81, 003, N'永安路街道办事处'),
	(41, 01, 81, 004, N'孝义街道办事处'),
	(41, 01, 81, 005, N'紫荆路街道办事处'),
	(41, 01, 81, 100, N'米河镇'),
	(41, 01, 81, 101, N'新中镇'),
	(41, 01, 81, 102, N'小关镇'),
	(41, 01, 81, 103, N'竹林镇'),
	(41, 01, 81, 104, N'大峪沟镇'),
	(41, 01, 81, 105, N'河洛镇'),
	(41, 01, 81, 106, N'站街镇'),
	(41, 01, 81, 108, N'康店镇'),
	(41, 01, 81, 110, N'北山口镇'),
	(41, 01, 81, 111, N'西村镇'),
	(41, 01, 81, 112, N'芝田镇'),
	(41, 01, 81, 113, N'回郭镇'),
	(41, 01, 81, 114, N'鲁庄镇'),
	(41, 01, 81, 115, N'夹津口镇'),
	(41, 01, 81, 116, N'涉村镇');

/* 河南省 郑州市 荥阳市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 82, 001, N'索河街道办事处'),
	(41, 01, 82, 002, N'京城路街道办事处'),
	(41, 01, 82, 101, N'乔楼镇'),
	(41, 01, 82, 102, N'豫龙镇'),
	(41, 01, 82, 103, N'广武镇'),
	(41, 01, 82, 104, N'王村镇'),
	(41, 01, 82, 105, N'汜水镇'),
	(41, 01, 82, 106, N'高山镇'),
	(41, 01, 82, 108, N'刘河镇'),
	(41, 01, 82, 109, N'崔庙镇'),
	(41, 01, 82, 110, N'贾峪镇'),
	(41, 01, 82, 200, N'城关乡'),
	(41, 01, 82, 201, N'高村乡'),
	(41, 01, 82, 204, N'金寨回族乡');

/* 河南省 郑州市 新密市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 83, 001, N'青屏街街道办事处'),
	(41, 01, 83, 002, N'新华路街道办事处'),
	(41, 01, 83, 003, N'西大街街道办事处'),
	(41, 01, 83, 100, N'城关镇'),
	(41, 01, 83, 101, N'米村镇'),
	(41, 01, 83, 102, N'牛店镇'),
	(41, 01, 83, 103, N'平陌镇'),
	(41, 01, 83, 104, N'超化镇'),
	(41, 01, 83, 105, N'苟堂镇'),
	(41, 01, 83, 106, N'大隗镇'),
	(41, 01, 83, 107, N'刘寨镇'),
	(41, 01, 83, 108, N'白寨镇'),
	(41, 01, 83, 109, N'岳村镇'),
	(41, 01, 83, 110, N'来集镇'),
	(41, 01, 83, 113, N'曲梁镇'),
	(41, 01, 83, 200, N'袁庄乡');

/* 河南省 郑州市 新郑市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 84, 001, N'新建路街道办事处'),
	(41, 01, 84, 002, N'新华路街道办事处'),
	(41, 01, 84, 003, N'新烟街道办事处'),
	(41, 01, 84, 101, N'新村镇'),
	(41, 01, 84, 102, N'辛店镇'),
	(41, 01, 84, 103, N'观音寺镇'),
	(41, 01, 84, 104, N'梨河镇'),
	(41, 01, 84, 105, N'和庄镇'),
	(41, 01, 84, 106, N'薛店镇'),
	(41, 01, 84, 107, N'孟庄镇'),
	(41, 01, 84, 108, N'郭店镇'),
	(41, 01, 84, 109, N'龙湖镇'),
	(41, 01, 84, 200, N'城关乡'),
	(41, 01, 84, 202, N'八千乡');

/* 河南省 郑州市 登封市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 01, 85, 001, N'嵩阳街道办事处'),
	(41, 01, 85, 002, N'少林街道办事处'),
	(41, 01, 85, 003, N'中岳街道办事处'),
	(41, 01, 85, 100, N'大金店镇'),
	(41, 01, 85, 101, N'颖阳镇'),
	(41, 01, 85, 102, N'卢店镇'),
	(41, 01, 85, 103, N'告成镇'),
	(41, 01, 85, 104, N'阳城区镇'),
	(41, 01, 85, 105, N'大冶镇'),
	(41, 01, 85, 106, N'宣化镇'),
	(41, 01, 85, 107, N'徐庄镇'),
	(41, 01, 85, 108, N'东华镇'),
	(41, 01, 85, 202, N'白坪乡'),
	(41, 01, 85, 203, N'君召乡'),
	(41, 01, 85, 204, N'石道乡'),
	(41, 01, 85, 205, N'唐庄乡');

/* 河南省 开封市 龙亭区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 02, 02, 001, N'北书店街道办事处'),
	(41, 02, 02, 002, N'午朝门街道办事处'),
	(41, 02, 02, 003, N'大兴街道办事处'),
	(41, 02, 02, 005, N'北道门街道办事处'),
	(41, 02, 02, 201, N'北郊乡'),
	(41, 02, 02, 202, N'柳园口乡');

/* 河南省 开封市 顺河回族区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 02, 03, 001, N'清平街道'),
	(41, 02, 03, 002, N'铁塔街道'),
	(41, 02, 03, 003, N'曹门街道'),
	(41, 02, 03, 004, N'宋门街道'),
	(41, 02, 03, 005, N'工业街道'),
	(41, 02, 03, 006, N'苹果园街道'),
	(41, 02, 03, 200, N'东郊乡'),
	(41, 02, 03, 201, N'土柏岗乡');

/* 河南省 开封市 鼓楼区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 02, 04, 001, N'相国寺街道'),
	(41, 02, 04, 002, N'新华街道'),
	(41, 02, 04, 003, N'卧龙街道'),
	(41, 02, 04, 004, N'州桥街道'),
	(41, 02, 04, 005, N'西司门街道'),
	(41, 02, 04, 006, N'南苑街道'),
	(41, 02, 04, 007, N'五一街道'),
	(41, 02, 04, 008, N'仙人庄街道');

/* 河南省 开封市 禹王台区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 02, 05, 001, N'三里堡街道'),
	(41, 02, 05, 002, N'新门关街道'),
	(41, 02, 05, 003, N'繁塔街道'),
	(41, 02, 05, 004, N'官坊街道'),
	(41, 02, 05, 005, N'菜市街道'),
	(41, 02, 05, 200, N'南郊乡'),
	(41, 02, 05, 201, N'汪屯乡');

/* 河南省 开封市 金明区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 02, 11, 001, N'城西街道'),
	(41, 02, 11, 002, N'梁苑街道'),
	(41, 02, 11, 100, N'杏花营镇'),
	(41, 02, 11, 201, N'西郊乡'),
	(41, 02, 11, 207, N'水稻乡');

/* 河南省 开封市 祥符区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 02, 12, 100, N'城关镇'),
	(41, 02, 12, 101, N'陈留镇'),
	(41, 02, 12, 102, N'仇楼镇'),
	(41, 02, 12, 103, N'八里湾镇'),
	(41, 02, 12, 104, N'曲兴镇'),
	(41, 02, 12, 106, N'朱仙镇'),
	(41, 02, 12, 200, N'半坡店乡'),
	(41, 02, 12, 202, N'罗王乡'),
	(41, 02, 12, 203, N'刘店乡'),
	(41, 02, 12, 204, N'袁坊乡'),
	(41, 02, 12, 205, N'杜良乡'),
	(41, 02, 12, 206, N'兴隆乡'),
	(41, 02, 12, 208, N'西姜寨乡'),
	(41, 02, 12, 210, N'万隆乡'),
	(41, 02, 12, 211, N'范村乡');

/* 河南省 开封市 杞县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 02, 21, 100, N'城关镇'),
	(41, 02, 21, 101, N'五里河镇'),
	(41, 02, 21, 102, N'傅集镇'),
	(41, 02, 21, 103, N'圉镇镇'),
	(41, 02, 21, 104, N'高阳镇'),
	(41, 02, 21, 105, N'葛岗镇'),
	(41, 02, 21, 106, N'阳堌镇'),
	(41, 02, 21, 107, N'邢口镇'),
	(41, 02, 21, 200, N'裴村店乡'),
	(41, 02, 21, 202, N'宗店乡'),
	(41, 02, 21, 203, N'板木乡'),
	(41, 02, 21, 204, N'竹林乡'),
	(41, 02, 21, 205, N'官庄乡'),
	(41, 02, 21, 206, N'湖岗乡'),
	(41, 02, 21, 207, N'苏木乡'),
	(41, 02, 21, 208, N'沙沃乡'),
	(41, 02, 21, 209, N'平城乡'),
	(41, 02, 21, 210, N'泥沟乡'),
	(41, 02, 21, 211, N'柿园乡'),
	(41, 02, 21, 212, N'西寨乡'),
	(41, 02, 21, 213, N'城郊乡');

/* 河南省 开封市 通许县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 02, 22, 100, N'城关镇'),
	(41, 02, 22, 101, N'竖岗镇'),
	(41, 02, 22, 102, N'玉皇庙镇'),
	(41, 02, 22, 103, N'四所楼镇'),
	(41, 02, 22, 104, N'朱砂镇'),
	(41, 02, 22, 105, N'长智镇'),
	(41, 02, 22, 200, N'冯庄乡'),
	(41, 02, 22, 201, N'孙营乡'),
	(41, 02, 22, 202, N'大岗李乡'),
	(41, 02, 22, 203, N'邸阁乡'),
	(41, 02, 22, 204, N'练城乡'),
	(41, 02, 22, 205, N'厉庄乡');

/* 河南省 开封市 尉氏县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 02, 23, 100, N'城关镇'),
	(41, 02, 23, 101, N'洧川镇'),
	(41, 02, 23, 102, N'朱曲镇'),
	(41, 02, 23, 103, N'蔡庄镇'),
	(41, 02, 23, 104, N'永兴镇'),
	(41, 02, 23, 105, N'张市镇'),
	(41, 02, 23, 106, N'十八里镇'),
	(41, 02, 23, 107, N'水坡镇'),
	(41, 02, 23, 108, N'大营镇'),
	(41, 02, 23, 109, N'庄头镇'),
	(41, 02, 23, 200, N'邢庄乡'),
	(41, 02, 23, 203, N'大马乡'),
	(41, 02, 23, 204, N'岗李乡'),
	(41, 02, 23, 205, N'门楼任乡'),
	(41, 02, 23, 206, N'大桥乡'),
	(41, 02, 23, 207, N'南曹乡'),
	(41, 02, 23, 208, N'小陈乡');

/* 河南省 开封市 兰考县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 02, 25, 001, N'兰阳街道办事处'),
	(41, 02, 25, 002, N'桐乡街道办事处'),
	(41, 02, 25, 003, N'惠安街道办事处'),
	(41, 02, 25, 101, N'堌阳镇'),
	(41, 02, 25, 102, N'南彰镇'),
	(41, 02, 25, 103, N'考城镇'),
	(41, 02, 25, 104, N'红庙镇'),
	(41, 02, 25, 201, N'三义寨乡'),
	(41, 02, 25, 202, N'东坝头乡'),
	(41, 02, 25, 203, N'爪营乡'),
	(41, 02, 25, 204, N'谷营乡'),
	(41, 02, 25, 205, N'小宋乡'),
	(41, 02, 25, 206, N'孟寨乡'),
	(41, 02, 25, 207, N'许河乡'),
	(41, 02, 25, 208, N'葡萄架乡'),
	(41, 02, 25, 209, N'阎楼乡'),
	(41, 02, 25, 210, N'仪封乡');

/* 河南省 洛阳市 老城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 02, 001, N'西关街道办事处'),
	(41, 03, 02, 002, N'西南隅街道办事处'),
	(41, 03, 02, 003, N'西北隅街道办事处'),
	(41, 03, 02, 004, N'东南隅街道办事处'),
	(41, 03, 02, 005, N'东北隅街道办事处'),
	(41, 03, 02, 006, N'南关街道办事处'),
	(41, 03, 02, 007, N'洛浦街道办事处'),
	(41, 03, 02, 008, N'邙山街道办事处'),
	(41, 03, 02, 009, N'道北路街道办事处');

/* 河南省 洛阳市 西工区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 03, 001, N'王城路街道办事处'),
	(41, 03, 03, 002, N'金谷园街道办事处'),
	(41, 03, 03, 003, N'西工街道办事处'),
	(41, 03, 03, 004, N'邙岭路街道办事处'),
	(41, 03, 03, 006, N'唐宫路街道办事处'),
	(41, 03, 03, 007, N'汉屯路街道办事处'),
	(41, 03, 03, 008, N'凯旋东路街道办事处'),
	(41, 03, 03, 009, N'洛北街道办事处'),
	(41, 03, 03, 010, N'红山街道办事处');

/* 河南省 洛阳市 瀍河回族区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 04, 001, N'东关街道办事处'),
	(41, 03, 04, 002, N'瀍西街道办事处'),
	(41, 03, 04, 003, N'五股路街道办事处'),
	(41, 03, 04, 004, N'北窑街道办事处'),
	(41, 03, 04, 005, N'塔湾街道办事处'),
	(41, 03, 04, 006, N'杨文街道办事处'),
	(41, 03, 04, 007, N'华林街道办事处'),
	(41, 03, 04, 200, N'瀍河回族乡');

/* 河南省 洛阳市 涧西区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 05, 001, N'湖北路街道办事处'),
	(41, 03, 05, 002, N'天津路街道办事处'),
	(41, 03, 05, 003, N'长春路街道办事处'),
	(41, 03, 05, 004, N'南昌路街道办事处'),
	(41, 03, 05, 005, N'长安路街道办事处'),
	(41, 03, 05, 006, N'重庆路街道办事处'),
	(41, 03, 05, 007, N'郑州路街道办事处'),
	(41, 03, 05, 008, N'武汉路街道办事处'),
	(41, 03, 05, 009, N'徐家营街道办事处'),
	(41, 03, 05, 010, N'珠江路街道办事处'),
	(41, 03, 05, 011, N'周山路街道办事处'),
	(41, 03, 05, 012, N'工农街道办事处');

/* 河南省 洛阳市 吉利区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 06, 001, N'大庆路街道办事处'),
	(41, 03, 06, 200, N'吉利乡');

/* 河南省 洛阳市 洛龙区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 11, 001, N'安乐街道办事处'),
	(41, 03, 11, 002, N'开元路街道办事处'),
	(41, 03, 11, 003, N'龙门石窟街道办事处'),
	(41, 03, 11, 004, N'关林街道办事处'),
	(41, 03, 11, 005, N'太康东路街道办事处'),
	(41, 03, 11, 006, N'古城街道办事处'),
	(41, 03, 11, 007, N'科技园街道办事处'),
	(41, 03, 11, 008, N'翠云路街道办事处'),
	(41, 03, 11, 101, N'龙门镇'),
	(41, 03, 11, 102, N'安乐镇'),
	(41, 03, 11, 103, N'白马寺镇'),
	(41, 03, 11, 107, N'李楼镇'),
	(41, 03, 11, 108, N'丰李镇'),
	(41, 03, 11, 195, N'诸葛镇'),
	(41, 03, 11, 196, N'李村镇'),
	(41, 03, 11, 197, N'庞村镇'),
	(41, 03, 11, 198, N'寇店镇'),
	(41, 03, 11, 199, N'佃庄镇');

/* 河南省 洛阳市 孟津县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 22, 100, N'城关镇'),
	(41, 03, 22, 101, N'会盟镇'),
	(41, 03, 22, 102, N'平乐镇'),
	(41, 03, 22, 103, N'送庄镇'),
	(41, 03, 22, 104, N'白鹤镇'),
	(41, 03, 22, 105, N'朝阳镇'),
	(41, 03, 22, 106, N'小浪底镇'),
	(41, 03, 22, 107, N'麻屯镇'),
	(41, 03, 22, 108, N'横水镇'),
	(41, 03, 22, 109, N'常袋镇');

/* 河南省 洛阳市 新安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 23, 100, N'城关镇'),
	(41, 03, 23, 101, N'石寺镇'),
	(41, 03, 23, 102, N'五头镇'),
	(41, 03, 23, 103, N'磁涧镇'),
	(41, 03, 23, 104, N'铁门镇'),
	(41, 03, 23, 105, N'南李村镇'),
	(41, 03, 23, 106, N'北冶镇'),
	(41, 03, 23, 107, N'仓头镇'),
	(41, 03, 23, 108, N'正村镇'),
	(41, 03, 23, 109, N'石井镇'),
	(41, 03, 23, 205, N'曹村乡');

/* 河南省 洛阳市 栾川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 24, 100, N'城关镇'),
	(41, 03, 24, 101, N'赤土店镇'),
	(41, 03, 24, 102, N'合峪镇'),
	(41, 03, 24, 103, N'潭头镇'),
	(41, 03, 24, 104, N'三川镇'),
	(41, 03, 24, 105, N'冷水镇'),
	(41, 03, 24, 106, N'陶湾镇'),
	(41, 03, 24, 107, N'石庙镇'),
	(41, 03, 24, 108, N'庙子镇'),
	(41, 03, 24, 109, N'狮子庙镇'),
	(41, 03, 24, 110, N'白土镇'),
	(41, 03, 24, 111, N'叫河镇'),
	(41, 03, 24, 200, N'栾川乡'),
	(41, 03, 24, 203, N'秋扒乡');

/* 河南省 洛阳市 嵩县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 25, 100, N'城关镇'),
	(41, 03, 25, 101, N'田湖镇'),
	(41, 03, 25, 102, N'旧县镇'),
	(41, 03, 25, 103, N'车村镇'),
	(41, 03, 25, 104, N'闫庄镇'),
	(41, 03, 25, 105, N'德亭镇'),
	(41, 03, 25, 106, N'大章镇'),
	(41, 03, 25, 107, N'白河镇'),
	(41, 03, 25, 108, N'纸房镇'),
	(41, 03, 25, 109, N'饭坡镇'),
	(41, 03, 25, 201, N'大坪乡'),
	(41, 03, 25, 202, N'库区乡'),
	(41, 03, 25, 203, N'何村乡'),
	(41, 03, 25, 208, N'九店乡'),
	(41, 03, 25, 209, N'黄庄乡'),
	(41, 03, 25, 210, N'木植街乡');

/* 河南省 洛阳市 汝阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 26, 100, N'城关镇'),
	(41, 03, 26, 101, N'上店镇'),
	(41, 03, 26, 102, N'付店镇'),
	(41, 03, 26, 103, N'小店镇'),
	(41, 03, 26, 104, N'三屯镇'),
	(41, 03, 26, 105, N'刘店镇'),
	(41, 03, 26, 106, N'内埠镇'),
	(41, 03, 26, 107, N'陶营镇'),
	(41, 03, 26, 200, N'柏树乡'),
	(41, 03, 26, 202, N'十八盘乡'),
	(41, 03, 26, 203, N'靳村乡'),
	(41, 03, 26, 204, N'王坪乡'),
	(41, 03, 26, 209, N'蔡店乡');

/* 河南省 洛阳市 宜阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 27, 100, N'城关镇'),
	(41, 03, 27, 102, N'柳泉镇'),
	(41, 03, 27, 103, N'韩城镇'),
	(41, 03, 27, 104, N'白杨镇'),
	(41, 03, 27, 105, N'香鹿山镇'),
	(41, 03, 27, 106, N'锦屏镇'),
	(41, 03, 27, 107, N'三乡镇'),
	(41, 03, 27, 108, N'张坞镇'),
	(41, 03, 27, 109, N'莲庄镇'),
	(41, 03, 27, 110, N'赵保镇'),
	(41, 03, 27, 111, N'樊村镇'),
	(41, 03, 27, 203, N'盐镇乡'),
	(41, 03, 27, 204, N'高村乡'),
	(41, 03, 27, 208, N'花果山乡'),
	(41, 03, 27, 209, N'上观乡'),
	(41, 03, 27, 212, N'董王庄乡');

/* 河南省 洛阳市 洛宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 28, 100, N'城关镇'),
	(41, 03, 28, 101, N'王范回族镇'),
	(41, 03, 28, 102, N'上戈镇'),
	(41, 03, 28, 103, N'下峪镇'),
	(41, 03, 28, 104, N'河底镇'),
	(41, 03, 28, 105, N'兴华镇'),
	(41, 03, 28, 106, N'东宋镇'),
	(41, 03, 28, 107, N'马店镇'),
	(41, 03, 28, 108, N'故县镇'),
	(41, 03, 28, 109, N'赵村镇'),
	(41, 03, 28, 200, N'城郊乡'),
	(41, 03, 28, 205, N'小界乡'),
	(41, 03, 28, 208, N'长水乡'),
	(41, 03, 28, 209, N'罗岭乡'),
	(41, 03, 28, 213, N'底张乡'),
	(41, 03, 28, 214, N'西山底乡'),
	(41, 03, 28, 216, N'陈吴乡'),
	(41, 03, 28, 217, N'涧口乡');

/* 河南省 洛阳市 伊川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 29, 100, N'城关镇'),
	(41, 03, 29, 101, N'鸣皋镇'),
	(41, 03, 29, 102, N'水寨镇'),
	(41, 03, 29, 103, N'彭婆镇'),
	(41, 03, 29, 104, N'白沙镇'),
	(41, 03, 29, 105, N'江左镇'),
	(41, 03, 29, 106, N'高山镇'),
	(41, 03, 29, 107, N'吕店镇'),
	(41, 03, 29, 108, N'半坡镇'),
	(41, 03, 29, 109, N'酒后镇'),
	(41, 03, 29, 110, N'白元镇'),
	(41, 03, 29, 200, N'鸦岭乡'),
	(41, 03, 29, 203, N'平等乡'),
	(41, 03, 29, 205, N'葛寨乡');

/* 河南省 洛阳市 偃师市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 03, 81, 001, N'商城街道办事处'),
	(41, 03, 81, 002, N'槐新街道办事处'),
	(41, 03, 81, 003, N'首阳山街道办事处'),
	(41, 03, 81, 004, N'伊洛街道办事处'),
	(41, 03, 81, 103, N'翟镇'),
	(41, 03, 81, 104, N'岳滩镇'),
	(41, 03, 81, 105, N'顾县镇'),
	(41, 03, 81, 106, N'缑氏镇'),
	(41, 03, 81, 107, N'府店镇'),
	(41, 03, 81, 108, N'高龙镇'),
	(41, 03, 81, 113, N'山化镇'),
	(41, 03, 81, 114, N'邙岭镇'),
	(41, 03, 81, 115, N'大口镇');

/* 河南省 平顶山市 新华区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 04, 02, 001, N'曙光街街道办事处'),
	(41, 04, 02, 002, N'光明路街道办事处'),
	(41, 04, 02, 003, N'中兴路街道办事处'),
	(41, 04, 02, 004, N'矿工路街道办事处'),
	(41, 04, 02, 005, N'西市场街道办事处'),
	(41, 04, 02, 006, N'新新街街道办事处'),
	(41, 04, 02, 007, N'青石山街道办事处'),
	(41, 04, 02, 008, N'湛河北路街道办事处'),
	(41, 04, 02, 010, N'西高皇街道办事处'),
	(41, 04, 02, 100, N'焦店镇');

/* 河南省 平顶山市 卫东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 04, 03, 001, N'东安路街道办事处'),
	(41, 04, 03, 002, N'优越路街道办事处'),
	(41, 04, 03, 003, N'五一路街道办事处'),
	(41, 04, 03, 004, N'建设路街道办事处'),
	(41, 04, 03, 005, N'东环路街道办事处'),
	(41, 04, 03, 006, N'东工人镇街道办事处'),
	(41, 04, 03, 007, N'光华路街道办事处'),
	(41, 04, 03, 008, N'鸿鹰街道办事处'),
	(41, 04, 03, 009, N'申楼街道办事处'),
	(41, 04, 03, 010, N'北环路街道办事处'),
	(41, 04, 03, 011, N'东高皇街道办事处'),
	(41, 04, 03, 012, N'蒲城街道办事处');

/* 河南省 平顶山市 石龙区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 04, 04, 001, N'高庄街道办事处'),
	(41, 04, 04, 002, N'龙兴街道办事处'),
	(41, 04, 04, 003, N'人民路街道办事处'),
	(41, 04, 04, 004, N'龙河街道办事处');

/* 河南省 平顶山市 湛河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 04, 11, 001, N'马庄街道'),
	(41, 04, 11, 002, N'南环路街道'),
	(41, 04, 11, 003, N'姚孟街道'),
	(41, 04, 11, 004, N'九里山街道'),
	(41, 04, 11, 005, N'轻工路街道'),
	(41, 04, 11, 006, N'高阳路街道'),
	(41, 04, 11, 007, N'北渡街道办事处'),
	(41, 04, 11, 008, N'荆山办事处'),
	(41, 04, 11, 009, N'河滨街道办事处'),
	(41, 04, 11, 200, N'曹镇乡');

/* 河南省 平顶山市 宝丰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 04, 21, 001, N'铁路街道办事处'),
	(41, 04, 21, 100, N'城关镇'),
	(41, 04, 21, 101, N'周庄镇'),
	(41, 04, 21, 102, N'闹店镇'),
	(41, 04, 21, 103, N'石桥镇'),
	(41, 04, 21, 104, N'商酒务镇'),
	(41, 04, 21, 105, N'大营镇'),
	(41, 04, 21, 106, N'张八桥镇'),
	(41, 04, 21, 107, N'杨庄镇'),
	(41, 04, 21, 108, N'赵庄镇'),
	(41, 04, 21, 200, N'肖旗乡'),
	(41, 04, 21, 202, N'前营乡'),
	(41, 04, 21, 203, N'李庄乡');

/* 河南省 平顶山市 叶县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 04, 22, 001, N'九龙街道办事处'),
	(41, 04, 22, 002, N'昆阳街道办事处'),
	(41, 04, 22, 003, N'盐都街道办事处'),
	(41, 04, 22, 101, N'任店镇'),
	(41, 04, 22, 102, N'保安镇'),
	(41, 04, 22, 103, N'仙台镇'),
	(41, 04, 22, 105, N'叶邑镇'),
	(41, 04, 22, 106, N'廉村镇'),
	(41, 04, 22, 107, N'常村镇'),
	(41, 04, 22, 108, N'辛店镇'),
	(41, 04, 22, 201, N'夏李乡'),
	(41, 04, 22, 203, N'马庄回族乡'),
	(41, 04, 22, 204, N'田庄乡'),
	(41, 04, 22, 205, N'龚店乡'),
	(41, 04, 22, 207, N'龙泉乡'),
	(41, 04, 22, 208, N'水寨乡'),
	(41, 04, 22, 209, N'洪庄杨乡'),
	(41, 04, 22, 210, N'邓李乡');

/* 河南省 平顶山市 鲁山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 04, 23, 001, N'露峰街道办事处'),
	(41, 04, 23, 002, N'琴台街道办事处'),
	(41, 04, 23, 003, N'鲁阳街道办事处'),
	(41, 04, 23, 004, N'汇源街道办事处'),
	(41, 04, 23, 101, N'下汤镇'),
	(41, 04, 23, 102, N'梁洼镇'),
	(41, 04, 23, 103, N'张官营镇'),
	(41, 04, 23, 104, N'张良镇'),
	(41, 04, 23, 105, N'尧山镇'),
	(41, 04, 23, 106, N'瓦屋镇'),
	(41, 04, 23, 107, N'赵村镇'),
	(41, 04, 23, 201, N'四棵树乡'),
	(41, 04, 23, 202, N'团城乡'),
	(41, 04, 23, 203, N'熊背乡'),
	(41, 04, 23, 204, N'让河乡'),
	(41, 04, 23, 206, N'观音寺乡'),
	(41, 04, 23, 207, N'昭平台库区乡'),
	(41, 04, 23, 208, N'背孜乡'),
	(41, 04, 23, 209, N'仓头乡'),
	(41, 04, 23, 210, N'董周乡'),
	(41, 04, 23, 211, N'张店乡'),
	(41, 04, 23, 212, N'辛集乡'),
	(41, 04, 23, 213, N'滚子营乡'),
	(41, 04, 23, 214, N'马楼乡');

/* 河南省 平顶山市 郏县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 04, 25, 001, N'龙山街道办事处'),
	(41, 04, 25, 002, N'东城街道办事处'),
	(41, 04, 25, 101, N'冢头镇'),
	(41, 04, 25, 102, N'安良镇'),
	(41, 04, 25, 103, N'堂街镇'),
	(41, 04, 25, 104, N'薛店镇'),
	(41, 04, 25, 105, N'长桥镇'),
	(41, 04, 25, 106, N'茨芭镇'),
	(41, 04, 25, 107, N'黄道镇'),
	(41, 04, 25, 108, N'李口镇'),
	(41, 04, 25, 200, N'王集乡'),
	(41, 04, 25, 202, N'姚庄回族乡'),
	(41, 04, 25, 203, N'白庙乡'),
	(41, 04, 25, 204, N'广阔天地乡'),
	(41, 04, 25, 205, N'渣元乡');

/* 河南省 平顶山市 舞钢市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 04, 81, 001, N'垭口街道办事处'),
	(41, 04, 81, 002, N'寺坡街道办事处'),
	(41, 04, 81, 003, N'朱兰街道办事处'),
	(41, 04, 81, 004, N'院岭街道办事处'),
	(41, 04, 81, 005, N'矿建街道办事处'),
	(41, 04, 81, 100, N'尚店镇'),
	(41, 04, 81, 101, N'八台镇'),
	(41, 04, 81, 102, N'尹集镇'),
	(41, 04, 81, 103, N'枣林镇'),
	(41, 04, 81, 202, N'庙街乡'),
	(41, 04, 81, 203, N'铁山乡'),
	(41, 04, 81, 204, N'武功乡'),
	(41, 04, 81, 205, N'杨庄乡');

/* 河南省 平顶山市 汝州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 04, 82, 001, N'煤山街道办事处'),
	(41, 04, 82, 002, N'风穴路街道办事处'),
	(41, 04, 82, 003, N'钟楼街道办事处'),
	(41, 04, 82, 004, N'洗耳河街道办事处'),
	(41, 04, 82, 005, N'汝南街道办事处'),
	(41, 04, 82, 101, N'寄料镇'),
	(41, 04, 82, 102, N'温泉镇'),
	(41, 04, 82, 103, N'临汝镇'),
	(41, 04, 82, 104, N'小屯镇'),
	(41, 04, 82, 105, N'杨楼镇'),
	(41, 04, 82, 106, N'蟒川镇'),
	(41, 04, 82, 107, N'庙下镇'),
	(41, 04, 82, 108, N'米庙镇'),
	(41, 04, 82, 109, N'陵头镇'),
	(41, 04, 82, 110, N'纸坊镇'),
	(41, 04, 82, 111, N'大峪镇'),
	(41, 04, 82, 202, N'王寨乡'),
	(41, 04, 82, 207, N'骑岭乡'),
	(41, 04, 82, 209, N'夏店乡'),
	(41, 04, 82, 210, N'焦村乡');

/* 河南省 安阳市 文峰区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 05, 02, 001, N'东大街街道办事处'),
	(41, 05, 02, 002, N'头二三街道办事处'),
	(41, 05, 02, 003, N'甜水井街道办事处'),
	(41, 05, 02, 004, N'东关街道办事处'),
	(41, 05, 02, 005, N'南关街道办事处'),
	(41, 05, 02, 006, N'西大街街道办事处'),
	(41, 05, 02, 008, N'北大街街道办事处'),
	(41, 05, 02, 011, N'西关街道办事处'),
	(41, 05, 02, 012, N'紫薇大道街道办事处'),
	(41, 05, 02, 013, N'光华路街道办事处'),
	(41, 05, 02, 014, N'永明路街道办事处'),
	(41, 05, 02, 015, N'中华路街道办事处'),
	(41, 05, 02, 101, N'宝莲寺镇'),
	(41, 05, 02, 102, N'高庄镇');

/* 河南省 安阳市 北关区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 05, 03, 001, N'红旗路街道办事处'),
	(41, 05, 03, 003, N'解放路街道办事处'),
	(41, 05, 03, 004, N'灯塔路街道办事处'),
	(41, 05, 03, 005, N'豆腐营街道办事处'),
	(41, 05, 03, 006, N'洹北街道办事处'),
	(41, 05, 03, 008, N'彰东街道办事处'),
	(41, 05, 03, 009, N'彰北街道办事处'),
	(41, 05, 03, 010, N'民航路街道办事处'),
	(41, 05, 03, 011, N'曙光路街道办事处');

/* 河南省 安阳市 殷都区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 05, 05, 001, N'梅园庄街道办事处'),
	(41, 05, 05, 002, N'李珍街道办事处'),
	(41, 05, 05, 003, N'电厂路街道办事处'),
	(41, 05, 05, 004, N'纱厂路街道办事处'),
	(41, 05, 05, 005, N'铁西路街道办事处'),
	(41, 05, 05, 006, N'水冶街道办事处'),
	(41, 05, 05, 007, N'清风街街道办事处'),
	(41, 05, 05, 008, N'北蒙街道办事处'),
	(41, 05, 05, 009, N'相台街道办事处'),
	(41, 05, 05, 200, N'西郊乡');

/* 河南省 安阳市 龙安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 05, 06, 001, N'田村街道办事处'),
	(41, 05, 06, 002, N'彰武街道办事处'),
	(41, 05, 06, 003, N'文昌大道街道办事处'),
	(41, 05, 06, 004, N'文明大道街道办事处'),
	(41, 05, 06, 005, N'太行小区街道办事处'),
	(41, 05, 06, 006, N'中州路街道办事处'),
	(41, 05, 06, 100, N'龙泉镇'),
	(41, 05, 06, 101, N'马投涧镇'),
	(41, 05, 06, 201, N'东风乡');

/* 河南省 安阳市 安阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 05, 22, 101, N'水冶镇'),
	(41, 05, 22, 102, N'铜冶镇'),
	(41, 05, 22, 103, N'善应镇'),
	(41, 05, 22, 105, N'柏庄镇'),
	(41, 05, 22, 106, N'白璧镇'),
	(41, 05, 22, 107, N'曲沟镇'),
	(41, 05, 22, 108, N'吕村镇'),
	(41, 05, 22, 109, N'伦掌镇'),
	(41, 05, 22, 111, N'崔家桥镇'),
	(41, 05, 22, 112, N'辛村镇'),
	(41, 05, 22, 113, N'韩陵镇'),
	(41, 05, 22, 114, N'永和镇'),
	(41, 05, 22, 115, N'都里镇'),
	(41, 05, 22, 203, N'磊口乡'),
	(41, 05, 22, 204, N'许家沟乡'),
	(41, 05, 22, 205, N'马家乡'),
	(41, 05, 22, 210, N'安丰乡'),
	(41, 05, 22, 211, N'洪河屯乡'),
	(41, 05, 22, 214, N'瓦店乡'),
	(41, 05, 22, 216, N'北郭乡');

/* 河南省 安阳市 汤阴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 05, 23, 100, N'城关镇'),
	(41, 05, 23, 101, N'菜园镇'),
	(41, 05, 23, 102, N'任固镇'),
	(41, 05, 23, 103, N'五陵镇'),
	(41, 05, 23, 104, N'宜沟镇'),
	(41, 05, 23, 105, N'白营镇'),
	(41, 05, 23, 106, N'伏道镇'),
	(41, 05, 23, 107, N'韩庄镇'),
	(41, 05, 23, 108, N'古贤镇'),
	(41, 05, 23, 203, N'瓦岗乡');

/* 河南省 安阳市 滑县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 05, 26, 100, N'道口镇'),
	(41, 05, 26, 101, N'城关镇'),
	(41, 05, 26, 102, N'白道口镇'),
	(41, 05, 26, 103, N'留固镇'),
	(41, 05, 26, 104, N'上官镇'),
	(41, 05, 26, 105, N'牛屯镇'),
	(41, 05, 26, 106, N'万古镇'),
	(41, 05, 26, 107, N'高平镇'),
	(41, 05, 26, 108, N'王庄镇'),
	(41, 05, 26, 109, N'老店镇'),
	(41, 05, 26, 110, N'慈周寨镇'),
	(41, 05, 26, 111, N'焦虎镇'),
	(41, 05, 26, 200, N'枣村乡'),
	(41, 05, 26, 201, N'四间房乡'),
	(41, 05, 26, 202, N'八里营乡'),
	(41, 05, 26, 203, N'赵营乡'),
	(41, 05, 26, 204, N'大寨乡'),
	(41, 05, 26, 205, N'桑村乡'),
	(41, 05, 26, 206, N'老爷庙乡'),
	(41, 05, 26, 209, N'瓦岗寨乡'),
	(41, 05, 26, 211, N'半坡店乡'),
	(41, 05, 26, 212, N'小铺乡');

/* 河南省 安阳市 内黄县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 05, 27, 100, N'城关镇'),
	(41, 05, 27, 101, N'东庄镇'),
	(41, 05, 27, 102, N'井店镇'),
	(41, 05, 27, 103, N'梁庄镇'),
	(41, 05, 27, 104, N'后河镇'),
	(41, 05, 27, 105, N'楚旺镇'),
	(41, 05, 27, 106, N'田氏镇'),
	(41, 05, 27, 107, N'二安镇'),
	(41, 05, 27, 200, N'张龙乡'),
	(41, 05, 27, 201, N'马上乡'),
	(41, 05, 27, 202, N'高堤乡'),
	(41, 05, 27, 203, N'亳城乡'),
	(41, 05, 27, 205, N'六村乡'),
	(41, 05, 27, 206, N'中召乡'),
	(41, 05, 27, 207, N'宋村乡'),
	(41, 05, 27, 209, N'石盘屯乡'),
	(41, 05, 27, 210, N'豆公乡');

/* 河南省 安阳市 林州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 05, 81, 001, N'开元街道办事处'),
	(41, 05, 81, 002, N'振林街道办事处'),
	(41, 05, 81, 003, N'龙山街道办事处'),
	(41, 05, 81, 004, N'桂园街道办事处'),
	(41, 05, 81, 101, N'合涧镇'),
	(41, 05, 81, 102, N'临淇镇'),
	(41, 05, 81, 103, N'东姚镇'),
	(41, 05, 81, 104, N'横水镇'),
	(41, 05, 81, 105, N'河顺镇'),
	(41, 05, 81, 106, N'任村镇'),
	(41, 05, 81, 107, N'姚村镇'),
	(41, 05, 81, 108, N'陵阳镇'),
	(41, 05, 81, 109, N'原康镇'),
	(41, 05, 81, 110, N'五龙镇'),
	(41, 05, 81, 111, N'采桑镇'),
	(41, 05, 81, 112, N'东岗镇'),
	(41, 05, 81, 113, N'桂林镇'),
	(41, 05, 81, 114, N'茶店镇'),
	(41, 05, 81, 115, N'石板岩镇'),
	(41, 05, 81, 200, N'城郊乡');

/* 河南省 鹤壁市 鹤山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 06, 02, 001, N'中北街道'),
	(41, 06, 02, 002, N'中山路街道'),
	(41, 06, 02, 003, N'新华街街道'),
	(41, 06, 02, 004, N'鹤山街街道'),
	(41, 06, 02, 005, N'九矿广场街道'),
	(41, 06, 02, 100, N'鹤壁集镇'),
	(41, 06, 02, 201, N'姬家山乡');

/* 河南省 鹤壁市 山城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 06, 03, 001, N'红旗街道'),
	(41, 06, 03, 002, N'长风中路街道'),
	(41, 06, 03, 003, N'山城路街道'),
	(41, 06, 03, 004, N'汤河街街道'),
	(41, 06, 03, 005, N'鹿楼街道'),
	(41, 06, 03, 006, N'宝山街道办事处'),
	(41, 06, 03, 007, N'大胡街道办事处'),
	(41, 06, 03, 100, N'石林镇');

/* 河南省 鹤壁市 淇滨区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 06, 11, 001, N'金山办事处'),
	(41, 06, 11, 002, N'九州路街道'),
	(41, 06, 11, 003, N'黎阳路街道'),
	(41, 06, 11, 100, N'大赉店镇'),
	(41, 06, 11, 101, N'钜桥镇'),
	(41, 06, 11, 200, N'上峪乡'),
	(41, 06, 11, 201, N'大河涧乡');

/* 河南省 鹤壁市 浚县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 06, 21, 001, N'卫溪街道办事处'),
	(41, 06, 21, 002, N'浚州街道办事处'),
	(41, 06, 21, 003, N'黎阳街道办事处'),
	(41, 06, 21, 004, N'伾山街道办事处'),
	(41, 06, 21, 101, N'善堂镇'),
	(41, 06, 21, 102, N'屯子镇'),
	(41, 06, 21, 104, N'新镇镇'),
	(41, 06, 21, 105, N'小河镇'),
	(41, 06, 21, 107, N'卫贤镇'),
	(41, 06, 21, 108, N'王庄镇'),
	(41, 06, 21, 201, N'白寺乡');

/* 河南省 鹤壁市 淇县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 06, 22, 001, N'朝歌街道办事处'),
	(41, 06, 22, 002, N'桥盟街道办事处'),
	(41, 06, 22, 003, N'卫都街道办事处'),
	(41, 06, 22, 004, N'灵山街道办事处'),
	(41, 06, 22, 101, N'高村镇'),
	(41, 06, 22, 102, N'北阳镇'),
	(41, 06, 22, 103, N'西岗镇'),
	(41, 06, 22, 104, N'庙口镇'),
	(41, 06, 22, 202, N'黄洞乡');

/* 河南省 新乡市 红旗区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 02, 001, N'西街街道办事处'),
	(41, 07, 02, 002, N'东街街道办事处'),
	(41, 07, 02, 003, N'渠东街道办事处'),
	(41, 07, 02, 007, N'文化街街道办事处'),
	(41, 07, 02, 009, N'向阳小区街道办事处'),
	(41, 07, 02, 100, N'洪门镇'),
	(41, 07, 02, 101, N'小店镇');

/* 河南省 新乡市 卫滨区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 03, 001, N'胜利路街道办事处'),
	(41, 07, 03, 002, N'解放路街道办事处'),
	(41, 07, 03, 003, N'中同街街道办事处'),
	(41, 07, 03, 004, N'健康路街道办事处'),
	(41, 07, 03, 007, N'自由路街道办事处'),
	(41, 07, 03, 008, N'南桥街道办事处'),
	(41, 07, 03, 009, N'铁西街道办事处'),
	(41, 07, 03, 100, N'平原镇');

/* 河南省 新乡市 凤泉区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 04, 001, N'宝西街道办事处'),
	(41, 07, 04, 002, N'宝东街道办事处'),
	(41, 07, 04, 100, N'大块镇'),
	(41, 07, 04, 101, N'耿黄镇'),
	(41, 07, 04, 200, N'潞王坟乡');

/* 河南省 新乡市 牧野区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 11, 001, N'东干道街道办事处'),
	(41, 07, 11, 002, N'荣校路街道办事处'),
	(41, 07, 11, 003, N'北干道街道办事处'),
	(41, 07, 11, 004, N'花园街道办事处'),
	(41, 07, 11, 005, N'卫北街道办事处'),
	(41, 07, 11, 006, N'新辉路街道办事处'),
	(41, 07, 11, 007, N'和平路街道办事处'),
	(41, 07, 11, 100, N'王村镇'),
	(41, 07, 11, 101, N'牧野镇');

/* 河南省 新乡市 新乡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 21, 101, N'翟坡镇'),
	(41, 07, 21, 102, N'小冀镇'),
	(41, 07, 21, 103, N'七里营镇'),
	(41, 07, 21, 104, N'朗公庙镇'),
	(41, 07, 21, 105, N'古固寨镇'),
	(41, 07, 21, 107, N'大召营镇'),
	(41, 07, 21, 200, N'合河乡');

/* 河南省 新乡市 获嘉县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 24, 100, N'城关镇'),
	(41, 07, 24, 101, N'照镜镇'),
	(41, 07, 24, 102, N'黄堤镇'),
	(41, 07, 24, 103, N'中和镇'),
	(41, 07, 24, 104, N'徐营镇'),
	(41, 07, 24, 105, N'冯庄镇'),
	(41, 07, 24, 106, N'亢村镇'),
	(41, 07, 24, 107, N'史庄镇'),
	(41, 07, 24, 200, N'位庄乡'),
	(41, 07, 24, 203, N'大新庄乡'),
	(41, 07, 24, 204, N'太山乡');

/* 河南省 新乡市 原阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 25, 002, N'阳和街道办事处'),
	(41, 07, 25, 003, N'原兴街道办事处'),
	(41, 07, 25, 103, N'齐街镇'),
	(41, 07, 25, 104, N'太平镇'),
	(41, 07, 25, 105, N'福宁集镇'),
	(41, 07, 25, 106, N'韩董庄镇'),
	(41, 07, 25, 200, N'葛埠口乡'),
	(41, 07, 25, 206, N'蒋庄乡'),
	(41, 07, 25, 207, N'官厂乡'),
	(41, 07, 25, 209, N'大宾乡'),
	(41, 07, 25, 211, N'陡门乡'),
	(41, 07, 25, 215, N'路寨乡'),
	(41, 07, 25, 216, N'阳阿乡'),
	(41, 07, 25, 218, N'靳堂乡');

/* 河南省 新乡市 延津县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 26, 100, N'城关镇'),
	(41, 07, 26, 101, N'东屯镇'),
	(41, 07, 26, 102, N'丰庄镇'),
	(41, 07, 26, 103, N'石婆固镇'),
	(41, 07, 26, 104, N'王楼镇'),
	(41, 07, 26, 200, N'僧固乡'),
	(41, 07, 26, 202, N'位邱乡'),
	(41, 07, 26, 203, N'司寨乡'),
	(41, 07, 26, 205, N'马庄乡'),
	(41, 07, 26, 206, N'胙城乡'),
	(41, 07, 26, 207, N'榆林乡'),
	(41, 07, 26, 208, N'小潭乡');

/* 河南省 新乡市 封丘县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 27, 100, N'城关镇'),
	(41, 07, 27, 101, N'黄陵镇'),
	(41, 07, 27, 102, N'黄德镇'),
	(41, 07, 27, 103, N'应举镇'),
	(41, 07, 27, 104, N'陈桥镇'),
	(41, 07, 27, 105, N'赵岗镇'),
	(41, 07, 27, 106, N'留光镇'),
	(41, 07, 27, 107, N'潘店镇'),
	(41, 07, 27, 108, N'李庄镇'),
	(41, 07, 27, 109, N'陈固镇'),
	(41, 07, 27, 110, N'居厢镇'),
	(41, 07, 27, 111, N'鲁岗镇'),
	(41, 07, 27, 200, N'城关乡'),
	(41, 07, 27, 201, N'回族乡'),
	(41, 07, 27, 202, N'王村乡'),
	(41, 07, 27, 206, N'荆宫乡'),
	(41, 07, 27, 208, N'曹岗乡'),
	(41, 07, 27, 211, N'尹岗乡'),
	(41, 07, 27, 212, N'冯村乡');

/* 河南省 新乡市 长垣县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 28, 001, N'蒲西街道办事处'),
	(41, 07, 28, 002, N'蒲东街道办事处'),
	(41, 07, 28, 003, N'南蒲街道办事处'),
	(41, 07, 28, 004, N'蒲北街道办事处'),
	(41, 07, 28, 005, N'魏庄街道办事处'),
	(41, 07, 28, 101, N'丁栾镇'),
	(41, 07, 28, 102, N'樊相镇'),
	(41, 07, 28, 104, N'恼里镇'),
	(41, 07, 28, 105, N'常村镇'),
	(41, 07, 28, 106, N'赵堤镇'),
	(41, 07, 28, 107, N'孟岗镇'),
	(41, 07, 28, 108, N'满村镇'),
	(41, 07, 28, 109, N'苗寨镇'),
	(41, 07, 28, 110, N'张三寨镇'),
	(41, 07, 28, 111, N'方里镇'),
	(41, 07, 28, 112, N'佘家镇'),
	(41, 07, 28, 202, N'芦岗乡'),
	(41, 07, 28, 206, N'武邱乡');

/* 河南省 新乡市 卫辉市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 81, 100, N'汲水镇'),
	(41, 07, 81, 101, N'太公镇'),
	(41, 07, 81, 102, N'孙杏村镇'),
	(41, 07, 81, 103, N'后河镇'),
	(41, 07, 81, 104, N'李源屯镇'),
	(41, 07, 81, 105, N'唐庄镇'),
	(41, 07, 81, 106, N'上乐村镇'),
	(41, 07, 81, 201, N'狮豹头乡'),
	(41, 07, 81, 203, N'安都乡'),
	(41, 07, 81, 204, N'顿坊店乡'),
	(41, 07, 81, 205, N'柳庄乡'),
	(41, 07, 81, 206, N'庞寨乡'),
	(41, 07, 81, 208, N'城郊乡');

/* 河南省 新乡市 辉县市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 07, 82, 001, N'城关街道办事处'),
	(41, 07, 82, 002, N'胡桥街道办事处'),
	(41, 07, 82, 101, N'薄壁镇'),
	(41, 07, 82, 102, N'峪河镇'),
	(41, 07, 82, 103, N'百泉镇'),
	(41, 07, 82, 104, N'孟庄镇'),
	(41, 07, 82, 105, N'常村镇'),
	(41, 07, 82, 106, N'吴村镇'),
	(41, 07, 82, 107, N'南村镇'),
	(41, 07, 82, 108, N'南寨镇'),
	(41, 07, 82, 109, N'上八里镇'),
	(41, 07, 82, 110, N'北云门镇'),
	(41, 07, 82, 111, N'占城镇'),
	(41, 07, 82, 112, N'冀屯镇'),
	(41, 07, 82, 200, N'黄水乡'),
	(41, 07, 82, 201, N'拍石头乡'),
	(41, 07, 82, 202, N'高庄乡'),
	(41, 07, 82, 203, N'张村乡'),
	(41, 07, 82, 205, N'赵固乡'),
	(41, 07, 82, 206, N'西平罗乡'),
	(41, 07, 82, 207, N'洪洲乡'),
	(41, 07, 82, 208, N'沙窑乡');

/* 河南省 焦作市 解放区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 08, 02, 001, N'民生街道办事处'),
	(41, 08, 02, 002, N'民主街道办事处'),
	(41, 08, 02, 003, N'新华街道办事处'),
	(41, 08, 02, 004, N'焦西街道办事处'),
	(41, 08, 02, 005, N'焦南街道办事处'),
	(41, 08, 02, 006, N'焦北街道办事处'),
	(41, 08, 02, 007, N'七百间街道办事处'),
	(41, 08, 02, 008, N'上白作街道办事处'),
	(41, 08, 02, 009, N'王褚街道办事处');

/* 河南省 焦作市 中站区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 08, 03, 001, N'李封街道办事处'),
	(41, 08, 03, 002, N'王封街道办事处'),
	(41, 08, 03, 003, N'朱村街道办事处'),
	(41, 08, 03, 004, N'冯封街道办事处'),
	(41, 08, 03, 005, N'龙洞街道办事处'),
	(41, 08, 03, 006, N'月山街道办事处'),
	(41, 08, 03, 007, N'丹河街道办事处'),
	(41, 08, 03, 008, N'许衡街道办事处'),
	(41, 08, 03, 009, N'府城街道办事处'),
	(41, 08, 03, 010, N'龙翔街道办事处');

/* 河南省 焦作市 马村区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 08, 04, 001, N'马村街道办事处'),
	(41, 08, 04, 002, N'北山街道办事处'),
	(41, 08, 04, 003, N'冯营街道办事处'),
	(41, 08, 04, 004, N'九里山街道办事处'),
	(41, 08, 04, 005, N'待王街道办事处'),
	(41, 08, 04, 006, N'安阳城街道办事处'),
	(41, 08, 04, 007, N'演马街道办事处');

/* 河南省 焦作市 山阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 08, 11, 001, N'东方红街道办事处'),
	(41, 08, 11, 002, N'焦东街道办事处'),
	(41, 08, 11, 003, N'百间房街道办事处'),
	(41, 08, 11, 004, N'太行街道办事处'),
	(41, 08, 11, 005, N'艺新街道办事处'),
	(41, 08, 11, 006, N'光亚街道办事处'),
	(41, 08, 11, 007, N'定和街道办事处'),
	(41, 08, 11, 008, N'中星街道办事处'),
	(41, 08, 11, 009, N'新城街道办事处');

/* 河南省 焦作市 修武县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 08, 21, 100, N'城关镇'),
	(41, 08, 21, 101, N'七贤镇'),
	(41, 08, 21, 102, N'郇封镇'),
	(41, 08, 21, 103, N'周庄镇'),
	(41, 08, 21, 104, N'云台山镇'),
	(41, 08, 21, 202, N'王屯乡'),
	(41, 08, 21, 204, N'五里源乡'),
	(41, 08, 21, 206, N'西村乡');

/* 河南省 焦作市 博爱县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 08, 22, 001, N'博爱县清化镇办事处'),
	(41, 08, 22, 002, N'博爱县鸿昌办事处'),
	(41, 08, 22, 101, N'博爱县柏山镇'),
	(41, 08, 22, 102, N'博爱县月山镇'),
	(41, 08, 22, 103, N'博爱县许良镇'),
	(41, 08, 22, 105, N'博爱县磨头镇'),
	(41, 08, 22, 106, N'博爱县孝敬镇'),
	(41, 08, 22, 200, N'博爱县寨豁乡'),
	(41, 08, 22, 203, N'博爱县金城乡');

/* 河南省 焦作市 武陟县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 08, 23, 001, N'木城街道办事处'),
	(41, 08, 23, 002, N'龙源街道办事处'),
	(41, 08, 23, 003, N'龙泉街道办事处'),
	(41, 08, 23, 004, N'木栾街道办事处'),
	(41, 08, 23, 101, N'詹店镇'),
	(41, 08, 23, 102, N'西陶镇'),
	(41, 08, 23, 103, N'谢旗营镇'),
	(41, 08, 23, 104, N'大封镇'),
	(41, 08, 23, 200, N'嘉应观乡'),
	(41, 08, 23, 201, N'乔庙乡'),
	(41, 08, 23, 202, N'圪当店乡'),
	(41, 08, 23, 203, N'三阳乡'),
	(41, 08, 23, 204, N'小董乡'),
	(41, 08, 23, 205, N'大虹桥乡'),
	(41, 08, 23, 206, N'北郭乡');

/* 河南省 焦作市 温县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 08, 25, 100, N'温泉镇'),
	(41, 08, 25, 101, N'祥云镇'),
	(41, 08, 25, 102, N'番田镇'),
	(41, 08, 25, 104, N'黄庄镇'),
	(41, 08, 25, 105, N'武德镇'),
	(41, 08, 25, 106, N'赵堡镇'),
	(41, 08, 25, 107, N'南张羌镇'),
	(41, 08, 25, 200, N'岳村乡'),
	(41, 08, 25, 201, N'招贤乡'),
	(41, 08, 25, 203, N'北冷乡');

/* 河南省 焦作市 沁阳市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 08, 82, 001, N'覃怀街道'),
	(41, 08, 82, 002, N'怀庆街道'),
	(41, 08, 82, 003, N'太行街道'),
	(41, 08, 82, 004, N'沁园街道'),
	(41, 08, 82, 100, N'崇义镇'),
	(41, 08, 82, 101, N'西向镇'),
	(41, 08, 82, 102, N'西万镇'),
	(41, 08, 82, 103, N'柏香镇'),
	(41, 08, 82, 104, N'山王庄镇'),
	(41, 08, 82, 105, N'紫陵镇'),
	(41, 08, 82, 200, N'常平乡'),
	(41, 08, 82, 201, N'王召乡'),
	(41, 08, 82, 202, N'王曲乡');

/* 河南省 焦作市 孟州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 08, 83, 001, N'大定街道'),
	(41, 08, 83, 002, N'会昌街道'),
	(41, 08, 83, 003, N'河雍街道'),
	(41, 08, 83, 004, N'河阳街道'),
	(41, 08, 83, 100, N'化工镇'),
	(41, 08, 83, 101, N'南庄镇'),
	(41, 08, 83, 102, N'城伯镇'),
	(41, 08, 83, 103, N'谷旦镇'),
	(41, 08, 83, 104, N'赵和镇'),
	(41, 08, 83, 105, N'西虢镇'),
	(41, 08, 83, 201, N'槐树乡');

/* 河南省 濮阳市 华龙区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 09, 02, 001, N'中原路街道办事处'),
	(41, 09, 02, 002, N'胜利路街道办事处'),
	(41, 09, 02, 003, N'建设路街道办事处'),
	(41, 09, 02, 004, N'人民路街道办事处'),
	(41, 09, 02, 005, N'大庆路街道办事处'),
	(41, 09, 02, 006, N'黄河路街道办事处'),
	(41, 09, 02, 007, N'任丘路街道办事处'),
	(41, 09, 02, 008, N'长庆路街道办事处'),
	(41, 09, 02, 009, N'濮东街道办事处'),
	(41, 09, 02, 101, N'岳村镇'),
	(41, 09, 02, 203, N'孟轲乡');

/* 河南省 濮阳市 清丰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 09, 22, 100, N'城关镇'),
	(41, 09, 22, 101, N'马庄桥镇'),
	(41, 09, 22, 102, N'瓦屋头镇'),
	(41, 09, 22, 103, N'仙庄镇'),
	(41, 09, 22, 104, N'柳格镇'),
	(41, 09, 22, 200, N'六塔乡'),
	(41, 09, 22, 202, N'巩营乡'),
	(41, 09, 22, 203, N'马村乡'),
	(41, 09, 22, 204, N'高堡乡'),
	(41, 09, 22, 205, N'古城乡'),
	(41, 09, 22, 206, N'大流乡'),
	(41, 09, 22, 207, N'韩村乡'),
	(41, 09, 22, 208, N'大屯乡'),
	(41, 09, 22, 209, N'固城乡'),
	(41, 09, 22, 212, N'双庙乡'),
	(41, 09, 22, 213, N'纸房乡'),
	(41, 09, 22, 214, N'阳邵乡');

/* 河南省 濮阳市 南乐县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 09, 23, 100, N'城关镇'),
	(41, 09, 23, 101, N'韩张镇'),
	(41, 09, 23, 102, N'元村镇'),
	(41, 09, 23, 103, N'福坎镇'),
	(41, 09, 23, 104, N'张果屯镇'),
	(41, 09, 23, 105, N'千口镇'),
	(41, 09, 23, 200, N'杨村乡'),
	(41, 09, 23, 204, N'谷金楼乡'),
	(41, 09, 23, 205, N'西邵乡'),
	(41, 09, 23, 206, N'寺庄乡'),
	(41, 09, 23, 207, N'梁村乡'),
	(41, 09, 23, 208, N'近德固乡');

/* 河南省 濮阳市 范县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 09, 26, 100, N'城关镇'),
	(41, 09, 26, 101, N'濮城镇'),
	(41, 09, 26, 102, N'龙王庄镇'),
	(41, 09, 26, 103, N'高码头镇'),
	(41, 09, 26, 104, N'王楼镇'),
	(41, 09, 26, 105, N'辛庄镇'),
	(41, 09, 26, 106, N'陈庄镇'),
	(41, 09, 26, 201, N'杨集乡'),
	(41, 09, 26, 203, N'白衣阁乡'),
	(41, 09, 26, 205, N'颜村铺乡'),
	(41, 09, 26, 208, N'陆集乡'),
	(41, 09, 26, 209, N'张庄乡');

/* 河南省 濮阳市 台前县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 09, 27, 100, N'城关镇'),
	(41, 09, 27, 101, N'侯庙镇'),
	(41, 09, 27, 102, N'孙口镇'),
	(41, 09, 27, 103, N'打渔陈镇'),
	(41, 09, 27, 104, N'马楼镇'),
	(41, 09, 27, 105, N'吴坝镇'),
	(41, 09, 27, 200, N'后方乡'),
	(41, 09, 27, 201, N'清水河乡'),
	(41, 09, 27, 205, N'夹河乡');

/* 河南省 濮阳市 濮阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 09, 28, 100, N'城关镇'),
	(41, 09, 28, 101, N'濮阳县柳屯镇'),
	(41, 09, 28, 102, N'濮阳县文留镇'),
	(41, 09, 28, 103, N'濮阳县庆祖镇'),
	(41, 09, 28, 104, N'濮阳县八公桥镇'),
	(41, 09, 28, 106, N'濮阳县徐镇镇'),
	(41, 09, 28, 107, N'濮阳县户部寨镇'),
	(41, 09, 28, 108, N'濮阳县鲁河镇'),
	(41, 09, 28, 109, N'濮阳县子岸镇'),
	(41, 09, 28, 110, N'濮阳县胡状镇'),
	(41, 09, 28, 111, N'濮阳县王称固镇'),
	(41, 09, 28, 202, N'濮阳县清河头乡'),
	(41, 09, 28, 204, N'濮阳县梁庄乡'),
	(41, 09, 28, 206, N'濮阳县白罡乡'),
	(41, 09, 28, 207, N'濮阳县梨园乡'),
	(41, 09, 28, 208, N'濮阳县五星乡'),
	(41, 09, 28, 211, N'濮阳县郎中乡'),
	(41, 09, 28, 212, N'濮阳县海通乡'),
	(41, 09, 28, 213, N'濮阳县渠村乡'),
	(41, 09, 28, 214, N'濮阳县习城乡');

/* 河南省 许昌市 魏都区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 10, 02, 001, N'西大街道办事处'),
	(41, 10, 02, 002, N'东大街道办事处'),
	(41, 10, 02, 003, N'西关街道办事处'),
	(41, 10, 02, 004, N'南关街道办事处'),
	(41, 10, 02, 005, N'北大街道办事处'),
	(41, 10, 02, 006, N'五一路街道办事处'),
	(41, 10, 02, 007, N'高桥营街道办事处'),
	(41, 10, 02, 008, N'丁庄街道办事处'),
	(41, 10, 02, 009, N'七里店街道办事处'),
	(41, 10, 02, 010, N'文峰街道办事处'),
	(41, 10, 02, 011, N'新兴街道办事处'),
	(41, 10, 02, 012, N'半截河街道办事处');

/* 河南省 许昌市 许昌县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 10, 23, 001, N'许由办事处'),
	(41, 10, 23, 002, N'新元办事处'),
	(41, 10, 23, 100, N'将官池镇'),
	(41, 10, 23, 101, N'五女店镇'),
	(41, 10, 23, 102, N'尚集镇'),
	(41, 10, 23, 103, N'苏桥镇'),
	(41, 10, 23, 104, N'蒋李集镇'),
	(41, 10, 23, 105, N'张潘镇'),
	(41, 10, 23, 106, N'灵井镇'),
	(41, 10, 23, 200, N'陈曹乡'),
	(41, 10, 23, 201, N'邓庄乡'),
	(41, 10, 23, 202, N'小召乡'),
	(41, 10, 23, 203, N'河街乡'),
	(41, 10, 23, 204, N'桂村乡'),
	(41, 10, 23, 205, N'椹涧乡'),
	(41, 10, 23, 206, N'榆林乡'),
	(41, 10, 23, 208, N'艾庄回族乡');

/* 河南省 许昌市 鄢陵县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 10, 24, 100, N'安陵镇'),
	(41, 10, 24, 101, N'马栏镇'),
	(41, 10, 24, 102, N'柏梁镇'),
	(41, 10, 24, 103, N'陈化店镇'),
	(41, 10, 24, 104, N'望田镇'),
	(41, 10, 24, 105, N'大马镇'),
	(41, 10, 24, 106, N'陶城镇'),
	(41, 10, 24, 107, N'张桥镇'),
	(41, 10, 24, 108, N'彭店镇'),
	(41, 10, 24, 109, N'只乐镇'),
	(41, 10, 24, 201, N'南坞乡'),
	(41, 10, 24, 206, N'马坊乡');

/* 河南省 许昌市 襄城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 10, 25, 100, N'城关镇'),
	(41, 10, 25, 101, N'颍桥回族镇'),
	(41, 10, 25, 102, N'麦岭镇'),
	(41, 10, 25, 103, N'颍阳镇'),
	(41, 10, 25, 104, N'王洛镇'),
	(41, 10, 25, 105, N'紫云镇'),
	(41, 10, 25, 106, N'库庄镇'),
	(41, 10, 25, 107, N'十里铺镇'),
	(41, 10, 25, 108, N'山头店镇'),
	(41, 10, 25, 200, N'湛北乡'),
	(41, 10, 25, 202, N'茨沟乡'),
	(41, 10, 25, 203, N'丁营乡'),
	(41, 10, 25, 204, N'姜庄乡'),
	(41, 10, 25, 205, N'范湖乡'),
	(41, 10, 25, 206, N'双庙乡'),
	(41, 10, 25, 207, N'汾陈乡');

/* 河南省 许昌市 禹州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 10, 81, 001, N'颍川街道办事处'),
	(41, 10, 81, 002, N'夏都街道办事处'),
	(41, 10, 81, 003, N'韩城街道办事处'),
	(41, 10, 81, 004, N'钧台街道办事处'),
	(41, 10, 81, 100, N'火龙镇'),
	(41, 10, 81, 101, N'顺店镇'),
	(41, 10, 81, 102, N'方山镇'),
	(41, 10, 81, 103, N'神垕镇'),
	(41, 10, 81, 104, N'鸿畅镇'),
	(41, 10, 81, 105, N'梁北镇'),
	(41, 10, 81, 106, N'古城镇'),
	(41, 10, 81, 107, N'无梁镇'),
	(41, 10, 81, 108, N'文殊镇'),
	(41, 10, 81, 109, N'鸠山镇'),
	(41, 10, 81, 110, N'褚河镇'),
	(41, 10, 81, 111, N'范坡镇'),
	(41, 10, 81, 112, N'郭连镇'),
	(41, 10, 81, 113, N'朱阁镇'),
	(41, 10, 81, 114, N'浅井镇'),
	(41, 10, 81, 115, N'方岗镇'),
	(41, 10, 81, 116, N'花石镇'),
	(41, 10, 81, 117, N'张得镇'),
	(41, 10, 81, 201, N'苌庄乡'),
	(41, 10, 81, 204, N'磨街乡'),
	(41, 10, 81, 206, N'小吕乡'),
	(41, 10, 81, 210, N'山货回族乡');

/* 河南省 许昌市 长葛市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 10, 82, 001, N'建设路街道办事处'),
	(41, 10, 82, 002, N'长兴路街道办事处'),
	(41, 10, 82, 003, N'长社路街道办事处'),
	(41, 10, 82, 004, N'金桥路街道办事处'),
	(41, 10, 82, 100, N'和尚桥镇'),
	(41, 10, 82, 101, N'坡胡镇'),
	(41, 10, 82, 102, N'后河镇'),
	(41, 10, 82, 103, N'石固镇'),
	(41, 10, 82, 104, N'老城镇'),
	(41, 10, 82, 105, N'南席镇'),
	(41, 10, 82, 106, N'大周镇'),
	(41, 10, 82, 107, N'董村镇'),
	(41, 10, 82, 108, N'石象镇'),
	(41, 10, 82, 109, N'古桥镇'),
	(41, 10, 82, 200, N'增福庙乡'),
	(41, 10, 82, 201, N'官亭乡');

/* 河南省 漯河市 源汇区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 11, 02, 001, N'老街街道'),
	(41, 11, 02, 002, N'马路街街道'),
	(41, 11, 02, 003, N'顺河街街道'),
	(41, 11, 02, 004, N'干河陈街道'),
	(41, 11, 02, 100, N'大刘镇'),
	(41, 11, 02, 101, N'阴阳赵镇'),
	(41, 11, 02, 102, N'空冢郭镇'),
	(41, 11, 02, 202, N'问十乡');

/* 河南省 漯河市 郾城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 11, 03, 001, N'沙北街道办事处'),
	(41, 11, 03, 100, N'城关镇'),
	(41, 11, 03, 101, N'孟庙镇'),
	(41, 11, 03, 102, N'商桥镇'),
	(41, 11, 03, 103, N'裴城镇'),
	(41, 11, 03, 104, N'新店镇'),
	(41, 11, 03, 105, N'龙城镇'),
	(41, 11, 03, 106, N'李集镇'),
	(41, 11, 03, 107, N'黑龙潭镇');

/* 河南省 漯河市 召陵区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 11, 04, 001, N'天桥街街道'),
	(41, 11, 04, 002, N'翟庄办事处'),
	(41, 11, 04, 100, N'召陵镇'),
	(41, 11, 04, 101, N'邓襄镇'),
	(41, 11, 04, 102, N'万金镇'),
	(41, 11, 04, 103, N'老窝镇'),
	(41, 11, 04, 104, N'姬石镇'),
	(41, 11, 04, 105, N'青年镇');

/* 河南省 漯河市 舞阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 11, 21, 100, N'舞泉镇'),
	(41, 11, 21, 101, N'吴城镇'),
	(41, 11, 21, 102, N'北舞渡镇'),
	(41, 11, 21, 103, N'莲花镇'),
	(41, 11, 21, 104, N'辛安镇'),
	(41, 11, 21, 105, N'孟寨镇'),
	(41, 11, 21, 106, N'太尉镇'),
	(41, 11, 21, 107, N'侯集镇'),
	(41, 11, 21, 108, N'九街镇'),
	(41, 11, 21, 200, N'文峰乡'),
	(41, 11, 21, 201, N'保和乡'),
	(41, 11, 21, 202, N'马村乡'),
	(41, 11, 21, 204, N'姜店乡'),
	(41, 11, 21, 206, N'章化乡');

/* 河南省 漯河市 临颍县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 11, 22, 100, N'城关镇'),
	(41, 11, 22, 101, N'繁城镇'),
	(41, 11, 22, 102, N'杜曲镇'),
	(41, 11, 22, 103, N'王岗镇'),
	(41, 11, 22, 104, N'台陈镇'),
	(41, 11, 22, 105, N'巨陵镇'),
	(41, 11, 22, 106, N'瓦店镇'),
	(41, 11, 22, 107, N'三家店镇'),
	(41, 11, 22, 108, N'窝城镇'),
	(41, 11, 22, 109, N'王孟镇'),
	(41, 11, 22, 200, N'大郭乡'),
	(41, 11, 22, 201, N'皇帝庙乡'),
	(41, 11, 22, 202, N'固厢乡'),
	(41, 11, 22, 203, N'石桥乡'),
	(41, 11, 22, 204, N'陈庄乡');

/* 河南省 三门峡市 湖滨区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 12, 02, 001, N'湖滨街道'),
	(41, 12, 02, 002, N'前进街道'),
	(41, 12, 02, 003, N'车站街道'),
	(41, 12, 02, 004, N'涧河街道'),
	(41, 12, 02, 005, N'大安街道'),
	(41, 12, 02, 006, N'会兴街道'),
	(41, 12, 02, 007, N'崖底街道'),
	(41, 12, 02, 201, N'交口乡'),
	(41, 12, 02, 202, N'磁钟乡'),
	(41, 12, 02, 203, N'高庙乡');

/* 河南省 三门峡市 渑池县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 12, 21, 100, N'城关镇'),
	(41, 12, 21, 101, N'英豪镇'),
	(41, 12, 21, 102, N'张村镇'),
	(41, 12, 21, 103, N'洪阳镇'),
	(41, 12, 21, 104, N'天池镇'),
	(41, 12, 21, 105, N'仰韶镇'),
	(41, 12, 21, 203, N'仁村乡'),
	(41, 12, 21, 206, N'果园乡'),
	(41, 12, 21, 207, N'陈村乡'),
	(41, 12, 21, 208, N'坡头乡'),
	(41, 12, 21, 209, N'段村乡'),
	(41, 12, 21, 210, N'南村乡');

/* 河南省 三门峡市 陕县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 12, 22, 100, N'大营镇'),
	(41, 12, 22, 101, N'原店镇'),
	(41, 12, 22, 102, N'西张村镇'),
	(41, 12, 22, 103, N'观音堂镇'),
	(41, 12, 22, 200, N'张汴乡'),
	(41, 12, 22, 201, N'张湾乡'),
	(41, 12, 22, 203, N'菜园乡'),
	(41, 12, 22, 205, N'张茅乡'),
	(41, 12, 22, 206, N'王家后乡'),
	(41, 12, 22, 207, N'硖石乡'),
	(41, 12, 22, 210, N'西李村乡'),
	(41, 12, 22, 211, N'宫前乡'),
	(41, 12, 22, 212, N'店子乡');

/* 河南省 三门峡市 卢氏县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 12, 24, 100, N'城关镇'),
	(41, 12, 24, 101, N'杜关镇'),
	(41, 12, 24, 102, N'五里川镇'),
	(41, 12, 24, 103, N'官道口镇'),
	(41, 12, 24, 104, N'朱阳关镇'),
	(41, 12, 24, 105, N'官坡镇'),
	(41, 12, 24, 106, N'范里镇'),
	(41, 12, 24, 107, N'东明镇'),
	(41, 12, 24, 108, N'双龙湾镇'),
	(41, 12, 24, 200, N'文峪乡'),
	(41, 12, 24, 201, N'横涧乡'),
	(41, 12, 24, 203, N'双槐树乡'),
	(41, 12, 24, 204, N'汤河乡'),
	(41, 12, 24, 205, N'瓦窑沟乡'),
	(41, 12, 24, 206, N'狮子坪乡'),
	(41, 12, 24, 207, N'沙河乡'),
	(41, 12, 24, 208, N'徐家湾乡'),
	(41, 12, 24, 209, N'潘河乡'),
	(41, 12, 24, 210, N'木桐乡');

/* 河南省 三门峡市 义马市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 12, 81, 001, N'千秋路街道'),
	(41, 12, 81, 002, N'朝阳路街道'),
	(41, 12, 81, 003, N'新义街街道'),
	(41, 12, 81, 004, N'常村路街道'),
	(41, 12, 81, 005, N'泰山路街道'),
	(41, 12, 81, 006, N'新区街道'),
	(41, 12, 81, 007, N'东区街道');

/* 河南省 三门峡市 灵宝市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 12, 82, 100, N'城关镇'),
	(41, 12, 82, 101, N'尹庄镇'),
	(41, 12, 82, 102, N'朱阳镇'),
	(41, 12, 82, 103, N'阳平镇'),
	(41, 12, 82, 104, N'故县镇'),
	(41, 12, 82, 105, N'豫灵镇'),
	(41, 12, 82, 106, N'大王镇'),
	(41, 12, 82, 107, N'阳店镇'),
	(41, 12, 82, 108, N'函谷关镇'),
	(41, 12, 82, 109, N'焦村镇'),
	(41, 12, 82, 200, N'川口乡'),
	(41, 12, 82, 201, N'寺河乡'),
	(41, 12, 82, 202, N'苏村乡'),
	(41, 12, 82, 203, N'五亩乡'),
	(41, 12, 82, 204, N'西阎乡');

/* 河南省 南阳市 宛城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 02, 001, N'东关街道办事处'),
	(41, 13, 02, 002, N'新华街道办事处'),
	(41, 13, 02, 003, N'汉冶街道办事处'),
	(41, 13, 02, 004, N'仲景街道办事处'),
	(41, 13, 02, 007, N'赤虎街道办事处'),
	(41, 13, 02, 008, N'五里堡街道办事处'),
	(41, 13, 02, 102, N'官庄镇'),
	(41, 13, 02, 103, N'瓦店镇'),
	(41, 13, 02, 104, N'红泥湾镇'),
	(41, 13, 02, 105, N'黄台岗镇'),
	(41, 13, 02, 106, N'金华镇'),
	(41, 13, 02, 201, N'溧河乡'),
	(41, 13, 02, 202, N'汉冢乡'),
	(41, 13, 02, 204, N'茶庵乡'),
	(41, 13, 02, 205, N'高庙乡');

/* 河南省 南阳市 卧龙区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 03, 002, N'七一街道办事处'),
	(41, 13, 03, 003, N'卧龙岗街道办事处'),
	(41, 13, 03, 004, N'武侯街道办事处'),
	(41, 13, 03, 005, N'梅溪街道办事处'),
	(41, 13, 03, 006, N'车站街道办事处'),
	(41, 13, 03, 007, N'光武街道办事处'),
	(41, 13, 03, 008, N'靳岗街道办事处'),
	(41, 13, 03, 101, N'石桥镇'),
	(41, 13, 03, 102, N'潦河镇'),
	(41, 13, 03, 103, N'安皋镇'),
	(41, 13, 03, 104, N'蒲山镇'),
	(41, 13, 03, 105, N'陆营镇'),
	(41, 13, 03, 106, N'青华镇'),
	(41, 13, 03, 107, N'英庄镇'),
	(41, 13, 03, 108, N'潦河坡镇'),
	(41, 13, 03, 200, N'七里园乡'),
	(41, 13, 03, 205, N'谢庄乡'),
	(41, 13, 03, 206, N'王村乡');

/* 河南省 南阳市 南召县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 21, 100, N'城关镇'),
	(41, 13, 21, 101, N'留山镇'),
	(41, 13, 21, 102, N'云阳镇'),
	(41, 13, 21, 103, N'皇路店镇'),
	(41, 13, 21, 104, N'南河店镇'),
	(41, 13, 21, 105, N'板山坪镇'),
	(41, 13, 21, 106, N'乔端镇'),
	(41, 13, 21, 107, N'白土岗镇'),
	(41, 13, 21, 200, N'城郊乡'),
	(41, 13, 21, 201, N'小店乡'),
	(41, 13, 21, 202, N'皇后乡'),
	(41, 13, 21, 203, N'太山庙乡'),
	(41, 13, 21, 204, N'石门乡'),
	(41, 13, 21, 205, N'四棵树乡'),
	(41, 13, 21, 208, N'马市坪乡'),
	(41, 13, 21, 210, N'崔庄乡');

/* 河南省 南阳市 方城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 22, 001, N'凤瑞街道办事处'),
	(41, 13, 22, 002, N'释之街道办事处'),
	(41, 13, 22, 101, N'独树镇'),
	(41, 13, 22, 102, N'博望镇'),
	(41, 13, 22, 103, N'拐河镇'),
	(41, 13, 22, 104, N'小史店镇'),
	(41, 13, 22, 105, N'赵河镇'),
	(41, 13, 22, 106, N'广阳镇'),
	(41, 13, 22, 107, N'二郎庙镇'),
	(41, 13, 22, 108, N'杨楼镇'),
	(41, 13, 22, 200, N'券桥乡'),
	(41, 13, 22, 201, N'杨集乡'),
	(41, 13, 22, 203, N'古庄店乡'),
	(41, 13, 22, 206, N'清河乡'),
	(41, 13, 22, 209, N'柳河乡'),
	(41, 13, 22, 210, N'四里店乡'),
	(41, 13, 22, 211, N'袁店回族乡');

/* 河南省 南阳市 西峡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 23, 001, N'白羽街道办事处'),
	(41, 13, 23, 002, N'紫金街道办事处'),
	(41, 13, 23, 003, N'莲花街道办事处'),
	(41, 13, 23, 101, N'丹水镇'),
	(41, 13, 23, 102, N'西坪镇'),
	(41, 13, 23, 103, N'双龙镇'),
	(41, 13, 23, 104, N'回车镇'),
	(41, 13, 23, 105, N'丁河镇'),
	(41, 13, 23, 106, N'桑坪镇'),
	(41, 13, 23, 107, N'米坪镇'),
	(41, 13, 23, 108, N'五里桥镇'),
	(41, 13, 23, 109, N'重阳镇'),
	(41, 13, 23, 110, N'太平镇'),
	(41, 13, 23, 111, N'阳城镇'),
	(41, 13, 23, 112, N'二郎坪镇'),
	(41, 13, 23, 113, N'石界河镇'),
	(41, 13, 23, 114, N'军马河镇'),
	(41, 13, 23, 200, N'田关乡'),
	(41, 13, 23, 207, N'寨根乡');

/* 河南省 南阳市 镇平县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 24, 001, N'涅阳街道办事处'),
	(41, 13, 24, 002, N'雪枫街道办事处'),
	(41, 13, 24, 003, N'玉都街道办事处'),
	(41, 13, 24, 101, N'石佛寺镇'),
	(41, 13, 24, 102, N'晁陂镇'),
	(41, 13, 24, 103, N'贾宋镇'),
	(41, 13, 24, 104, N'侯集镇'),
	(41, 13, 24, 105, N'老庄镇'),
	(41, 13, 24, 106, N'卢医镇'),
	(41, 13, 24, 107, N'遮山镇'),
	(41, 13, 24, 108, N'高丘镇'),
	(41, 13, 24, 109, N'曲屯镇'),
	(41, 13, 24, 110, N'枣园镇'),
	(41, 13, 24, 111, N'杨营镇'),
	(41, 13, 24, 112, N'安字营镇'),
	(41, 13, 24, 113, N'张林镇'),
	(41, 13, 24, 114, N'柳泉铺镇'),
	(41, 13, 24, 115, N'彭营镇'),
	(41, 13, 24, 203, N'二龙乡'),
	(41, 13, 24, 206, N'王岗乡'),
	(41, 13, 24, 209, N'马庄乡'),
	(41, 13, 24, 215, N'郭庄回族乡');

/* 河南省 南阳市 内乡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 25, 100, N'城关镇'),
	(41, 13, 25, 101, N'夏馆镇'),
	(41, 13, 25, 102, N'师岗镇'),
	(41, 13, 25, 103, N'马山口镇'),
	(41, 13, 25, 104, N'湍东镇'),
	(41, 13, 25, 105, N'赤眉镇'),
	(41, 13, 25, 106, N'瓦亭镇'),
	(41, 13, 25, 107, N'王店镇'),
	(41, 13, 25, 108, N'灌涨镇'),
	(41, 13, 25, 109, N'桃溪镇'),
	(41, 13, 25, 110, N'岞岖镇'),
	(41, 13, 25, 200, N'板场乡'),
	(41, 13, 25, 201, N'大桥乡'),
	(41, 13, 25, 202, N'赵店乡'),
	(41, 13, 25, 206, N'七里坪乡'),
	(41, 13, 25, 207, N'余关乡');

/* 河南省 南阳市 淅川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 26, 001, N'龙城街道办事处'),
	(41, 13, 26, 002, N'商圣街道办事处'),
	(41, 13, 26, 101, N'荆紫关镇'),
	(41, 13, 26, 102, N'老城镇'),
	(41, 13, 26, 103, N'香花镇'),
	(41, 13, 26, 104, N'厚坡镇'),
	(41, 13, 26, 105, N'丹阳镇'),
	(41, 13, 26, 106, N'盛湾镇'),
	(41, 13, 26, 107, N'金河镇'),
	(41, 13, 26, 108, N'寺湾镇'),
	(41, 13, 26, 109, N'仓房镇'),
	(41, 13, 26, 110, N'上集镇'),
	(41, 13, 26, 111, N'马蹬镇'),
	(41, 13, 26, 201, N'西簧乡'),
	(41, 13, 26, 202, N'毛堂乡'),
	(41, 13, 26, 203, N'大石桥乡'),
	(41, 13, 26, 204, N'滔河乡');

/* 河南省 南阳市 社旗县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 27, 001, N'赵河街道办事处'),
	(41, 13, 27, 002, N'潘河街道办事处'),
	(41, 13, 27, 100, N'赊店镇'),
	(41, 13, 27, 101, N'桥头镇'),
	(41, 13, 27, 103, N'饶良镇'),
	(41, 13, 27, 104, N'兴隆镇'),
	(41, 13, 27, 105, N'晋庄镇'),
	(41, 13, 27, 106, N'李店镇'),
	(41, 13, 27, 107, N'苗店镇'),
	(41, 13, 27, 108, N'郝寨镇'),
	(41, 13, 27, 109, N'朱集镇'),
	(41, 13, 27, 110, N'下洼镇'),
	(41, 13, 27, 111, N'太和镇'),
	(41, 13, 27, 112, N'大冯营镇'),
	(41, 13, 27, 113, N'陌陂镇'),
	(41, 13, 27, 213, N'唐庄乡');

/* 河南省 南阳市 唐河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 28, 001, N'滨河街道办事处'),
	(41, 13, 28, 002, N'文峰街道办事处'),
	(41, 13, 28, 003, N'东兴街道办事处'),
	(41, 13, 28, 004, N'兴唐街道办事处'),
	(41, 13, 28, 101, N'源潭镇'),
	(41, 13, 28, 102, N'张店镇'),
	(41, 13, 28, 103, N'郭滩镇'),
	(41, 13, 28, 104, N'湖阳镇'),
	(41, 13, 28, 105, N'黑龙镇'),
	(41, 13, 28, 106, N'大河屯镇'),
	(41, 13, 28, 107, N'龙潭镇'),
	(41, 13, 28, 108, N'桐寨铺镇'),
	(41, 13, 28, 109, N'苍台镇'),
	(41, 13, 28, 110, N'上屯镇'),
	(41, 13, 28, 111, N'毕店镇'),
	(41, 13, 28, 112, N'少拜寺镇'),
	(41, 13, 28, 200, N'城郊乡'),
	(41, 13, 28, 201, N'桐河乡'),
	(41, 13, 28, 206, N'昝岗乡'),
	(41, 13, 28, 207, N'祁仪乡'),
	(41, 13, 28, 208, N'马振抚乡'),
	(41, 13, 28, 209, N'古城乡'),
	(41, 13, 28, 211, N'东王集乡');

/* 河南省 南阳市 新野县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 29, 001, N'汉城街道办事处'),
	(41, 13, 29, 002, N'汉华街道办事处'),
	(41, 13, 29, 101, N'王庄镇'),
	(41, 13, 29, 102, N'沙堰镇'),
	(41, 13, 29, 103, N'新甸铺镇'),
	(41, 13, 29, 104, N'施庵镇'),
	(41, 13, 29, 105, N'歪子镇'),
	(41, 13, 29, 106, N'五星镇'),
	(41, 13, 29, 107, N'溧河铺镇'),
	(41, 13, 29, 108, N'王集镇'),
	(41, 13, 29, 200, N'城郊乡'),
	(41, 13, 29, 203, N'前高庙乡'),
	(41, 13, 29, 205, N'樊集乡'),
	(41, 13, 29, 207, N'上庄乡'),
	(41, 13, 29, 209, N'上港乡');

/* 河南省 南阳市 桐柏县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 30, 100, N'城关镇'),
	(41, 13, 30, 101, N'月河镇'),
	(41, 13, 30, 102, N'吴城镇'),
	(41, 13, 30, 103, N'固县镇'),
	(41, 13, 30, 104, N'毛集镇'),
	(41, 13, 30, 105, N'大河镇'),
	(41, 13, 30, 106, N'埠江镇'),
	(41, 13, 30, 107, N'平氏镇'),
	(41, 13, 30, 108, N'淮源镇'),
	(41, 13, 30, 109, N'黄岗镇'),
	(41, 13, 30, 110, N'安棚镇'),
	(41, 13, 30, 111, N'朱庄镇'),
	(41, 13, 30, 112, N'程湾镇'),
	(41, 13, 30, 200, N'城郊乡'),
	(41, 13, 30, 201, N'回龙乡'),
	(41, 13, 30, 206, N'新集乡');

/* 河南省 南阳市 邓州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 13, 81, 001, N'古城街道办事处'),
	(41, 13, 81, 002, N'花洲街道办事处'),
	(41, 13, 81, 003, N'湍河街道办事处'),
	(41, 13, 81, 102, N'罗庄镇'),
	(41, 13, 81, 103, N'汲滩镇'),
	(41, 13, 81, 104, N'穰东镇'),
	(41, 13, 81, 105, N'孟楼镇'),
	(41, 13, 81, 106, N'林扒镇'),
	(41, 13, 81, 107, N'构林镇'),
	(41, 13, 81, 108, N'十林镇'),
	(41, 13, 81, 109, N'张村镇'),
	(41, 13, 81, 110, N'都司镇'),
	(41, 13, 81, 111, N'赵集镇'),
	(41, 13, 81, 112, N'刘集镇'),
	(41, 13, 81, 113, N'桑庄镇'),
	(41, 13, 81, 114, N'彭桥镇'),
	(41, 13, 81, 115, N'白牛镇'),
	(41, 13, 81, 116, N'腰店镇'),
	(41, 13, 81, 117, N'九龙镇'),
	(41, 13, 81, 118, N'文渠镇'),
	(41, 13, 81, 119, N'高集镇'),
	(41, 13, 81, 201, N'张楼乡'),
	(41, 13, 81, 204, N'夏集乡'),
	(41, 13, 81, 205, N'裴营乡'),
	(41, 13, 81, 213, N'陶营乡'),
	(41, 13, 81, 216, N'小杨营乡'),
	(41, 13, 81, 219, N'龙堰乡');

/* 河南省 商丘市 梁园区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 14, 02, 001, N'平原街道'),
	(41, 14, 02, 002, N'长征街道'),
	(41, 14, 02, 003, N'前进街道'),
	(41, 14, 02, 004, N'白云街道'),
	(41, 14, 02, 005, N'东风街道'),
	(41, 14, 02, 006, N'八八街道'),
	(41, 14, 02, 007, N'建设街道'),
	(41, 14, 02, 011, N'解放街道办事处'),
	(41, 14, 02, 100, N'谢集镇'),
	(41, 14, 02, 101, N'双八镇'),
	(41, 14, 02, 200, N'刘口乡'),
	(41, 14, 02, 201, N'水池铺乡'),
	(41, 14, 02, 202, N'观堂乡'),
	(41, 14, 02, 203, N'王楼乡'),
	(41, 14, 02, 204, N'李庄乡'),
	(41, 14, 02, 205, N'孙福集乡');

/* 河南省 商丘市 睢阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 14, 03, 001, N'古城街道办事处'),
	(41, 14, 03, 002, N'文化街道办事处'),
	(41, 14, 03, 003, N'东方街道办事处'),
	(41, 14, 03, 004, N'新城街道办事处'),
	(41, 14, 03, 006, N'宋城街道办事处'),
	(41, 14, 03, 007, N'古宋街道办事处'),
	(41, 14, 03, 100, N'宋集镇'),
	(41, 14, 03, 101, N'郭村镇'),
	(41, 14, 03, 102, N'李口镇'),
	(41, 14, 03, 103, N'高辛镇'),
	(41, 14, 03, 104, N'坞墙镇'),
	(41, 14, 03, 105, N'冯桥镇'),
	(41, 14, 03, 106, N'路河镇'),
	(41, 14, 03, 107, N'闫集镇'),
	(41, 14, 03, 108, N'毛固堆镇'),
	(41, 14, 03, 204, N'包公庙乡'),
	(41, 14, 03, 205, N'娄店乡'),
	(41, 14, 03, 208, N'勒马乡'),
	(41, 14, 03, 209, N'临河店乡');

/* 河南省 商丘市 民权县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 14, 21, 001, N'绿洲街道办事处'),
	(41, 14, 21, 002, N'南华街道办事处'),
	(41, 14, 21, 101, N'人和镇'),
	(41, 14, 21, 102, N'龙塘镇'),
	(41, 14, 21, 103, N'北关镇'),
	(41, 14, 21, 104, N'程庄镇'),
	(41, 14, 21, 105, N'王庄寨镇'),
	(41, 14, 21, 106, N'孙六镇'),
	(41, 14, 21, 107, N'白云寺镇'),
	(41, 14, 21, 108, N'王桥镇'),
	(41, 14, 21, 109, N'庄子镇'),
	(41, 14, 21, 200, N'伯党乡'),
	(41, 14, 21, 201, N'花园乡'),
	(41, 14, 21, 204, N'野岗乡'),
	(41, 14, 21, 205, N'双塔乡'),
	(41, 14, 21, 206, N'林七乡'),
	(41, 14, 21, 207, N'胡集乡'),
	(41, 14, 21, 208, N'禇庙乡'),
	(41, 14, 21, 210, N'老颜集乡');

/* 河南省 商丘市 睢县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 14, 22, 100, N'长岗镇'),
	(41, 14, 22, 101, N'平岗镇'),
	(41, 14, 22, 102, N'周堂镇'),
	(41, 14, 22, 103, N'蓼堤镇'),
	(41, 14, 22, 104, N'西陵寺镇'),
	(41, 14, 22, 105, N'城关镇'),
	(41, 14, 22, 106, N'潮庄镇'),
	(41, 14, 22, 107, N'尚屯镇'),
	(41, 14, 22, 200, N'后台乡'),
	(41, 14, 22, 202, N'河集乡'),
	(41, 14, 22, 203, N'孙聚寨乡'),
	(41, 14, 22, 204, N'白楼乡'),
	(41, 14, 22, 205, N'河堤乡'),
	(41, 14, 22, 206, N'白庙乡'),
	(41, 14, 22, 207, N'胡堂乡'),
	(41, 14, 22, 208, N'尤吉屯乡'),
	(41, 14, 22, 210, N'董店乡'),
	(41, 14, 22, 211, N'涧岗乡'),
	(41, 14, 22, 213, N'匡城乡'),
	(41, 14, 22, 214, N'城郊乡');

/* 河南省 商丘市 宁陵县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 14, 23, 100, N'城关镇'),
	(41, 14, 23, 101, N'张弓镇'),
	(41, 14, 23, 102, N'柳河镇'),
	(41, 14, 23, 103, N'逻岗镇'),
	(41, 14, 23, 104, N'石桥镇'),
	(41, 14, 23, 105, N'黄岗镇'),
	(41, 14, 23, 106, N'华堡镇'),
	(41, 14, 23, 203, N'刘楼乡'),
	(41, 14, 23, 204, N'程楼乡'),
	(41, 14, 23, 205, N'乔楼乡'),
	(41, 14, 23, 206, N'城郊乡'),
	(41, 14, 23, 207, N'阳驿乡'),
	(41, 14, 23, 209, N'孔集乡'),
	(41, 14, 23, 210, N'赵村乡');

/* 河南省 商丘市 柘城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 14, 24, 001, N'长江新城街道办事处'),
	(41, 14, 24, 002, N'浦东街道办事处'),
	(41, 14, 24, 100, N'柘城县城关镇'),
	(41, 14, 24, 101, N'陈青集镇'),
	(41, 14, 24, 102, N'起台镇'),
	(41, 14, 24, 103, N'胡襄镇'),
	(41, 14, 24, 104, N'慈圣镇'),
	(41, 14, 24, 105, N'安平镇'),
	(41, 14, 24, 106, N'远襄镇'),
	(41, 14, 24, 107, N'岗王镇'),
	(41, 14, 24, 108, N'伯岗镇'),
	(41, 14, 24, 200, N'邵元乡'),
	(41, 14, 24, 201, N'张桥乡'),
	(41, 14, 24, 203, N'洪恩乡'),
	(41, 14, 24, 204, N'老王集乡'),
	(41, 14, 24, 205, N'大仵乡'),
	(41, 14, 24, 206, N'马集乡'),
	(41, 14, 24, 207, N'牛城乡'),
	(41, 14, 24, 208, N'惠济乡'),
	(41, 14, 24, 212, N'申桥乡'),
	(41, 14, 24, 213, N'李原乡'),
	(41, 14, 24, 214, N'皇集乡');

/* 河南省 商丘市 虞城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 14, 25, 100, N'城关镇'),
	(41, 14, 25, 101, N'界沟镇'),
	(41, 14, 25, 102, N'木兰镇'),
	(41, 14, 25, 103, N'杜集镇'),
	(41, 14, 25, 104, N'谷熟镇'),
	(41, 14, 25, 105, N'大杨集镇'),
	(41, 14, 25, 107, N'利民镇'),
	(41, 14, 25, 108, N'张集镇'),
	(41, 14, 25, 109, N'站集镇'),
	(41, 14, 25, 110, N'稍岗镇'),
	(41, 14, 25, 200, N'黄冢乡'),
	(41, 14, 25, 201, N'沙集乡'),
	(41, 14, 25, 202, N'店集乡'),
	(41, 14, 25, 204, N'闻集乡'),
	(41, 14, 25, 205, N'芒种桥乡'),
	(41, 14, 25, 207, N'刘店乡'),
	(41, 14, 25, 208, N'大候乡'),
	(41, 14, 25, 210, N'城郊乡'),
	(41, 14, 25, 211, N'郑集乡'),
	(41, 14, 25, 212, N'李老家乡'),
	(41, 14, 25, 214, N'镇里固乡'),
	(41, 14, 25, 215, N'古王集乡'),
	(41, 14, 25, 219, N'刘集乡'),
	(41, 14, 25, 220, N'乔集乡'),
	(41, 14, 25, 221, N'田庙乡');

/* 河南省 商丘市 夏邑县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 14, 26, 100, N'城关镇'),
	(41, 14, 26, 101, N'会亭镇'),
	(41, 14, 26, 102, N'马头镇'),
	(41, 14, 26, 103, N'济阳镇'),
	(41, 14, 26, 104, N'李集镇'),
	(41, 14, 26, 105, N'车站镇'),
	(41, 14, 26, 106, N'杨集镇'),
	(41, 14, 26, 107, N'韩道口镇'),
	(41, 14, 26, 108, N'太平镇'),
	(41, 14, 26, 109, N'罗庄镇'),
	(41, 14, 26, 110, N'火店镇'),
	(41, 14, 26, 111, N'北岭镇'),
	(41, 14, 26, 200, N'曹集乡'),
	(41, 14, 26, 201, N'胡桥乡'),
	(41, 14, 26, 202, N'歧河乡'),
	(41, 14, 26, 203, N'郭店乡'),
	(41, 14, 26, 204, N'业庙乡'),
	(41, 14, 26, 205, N'中峰乡'),
	(41, 14, 26, 207, N'桑固乡'),
	(41, 14, 26, 208, N'何营乡'),
	(41, 14, 26, 210, N'王集乡'),
	(41, 14, 26, 211, N'刘店集乡'),
	(41, 14, 26, 212, N'骆集乡'),
	(41, 14, 26, 214, N'孔庄乡');

/* 河南省 商丘市 永城市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 14, 81, 100, N'演集镇'),
	(41, 14, 81, 101, N'城关镇'),
	(41, 14, 81, 102, N'芒山镇'),
	(41, 14, 81, 103, N'高庄镇'),
	(41, 14, 81, 104, N'酇城镇'),
	(41, 14, 81, 105, N'裴桥镇'),
	(41, 14, 81, 106, N'马桥镇'),
	(41, 14, 81, 107, N'薛湖镇'),
	(41, 14, 81, 108, N'蒋口镇'),
	(41, 14, 81, 109, N'陈集镇'),
	(41, 14, 81, 110, N'十八里镇'),
	(41, 14, 81, 111, N'太邱镇'),
	(41, 14, 81, 112, N'李寨镇'),
	(41, 14, 81, 113, N'苗桥镇'),
	(41, 14, 81, 114, N'顺和镇'),
	(41, 14, 81, 115, N'茴村镇'),
	(41, 14, 81, 116, N'酇阳镇'),
	(41, 14, 81, 117, N'龙岗镇'),
	(41, 14, 81, 118, N'马牧镇'),
	(41, 14, 81, 119, N'王集镇'),
	(41, 14, 81, 120, N'刘河镇'),
	(41, 14, 81, 121, N'双桥镇'),
	(41, 14, 81, 122, N'卧龙镇'),
	(41, 14, 81, 200, N'城厢乡'),
	(41, 14, 81, 201, N'候岭乡'),
	(41, 14, 81, 202, N'黄口乡'),
	(41, 14, 81, 203, N'新桥乡'),
	(41, 14, 81, 217, N'条河乡'),
	(41, 14, 81, 219, N'陈官庄乡');

/* 河南省 信阳市 浉河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 15, 02, 001, N'老城街道办事处'),
	(41, 15, 02, 002, N'民权街道办事处'),
	(41, 15, 02, 003, N'车站街道办事处'),
	(41, 15, 02, 004, N'五里墩街道办事处'),
	(41, 15, 02, 005, N'五星街道办事处'),
	(41, 15, 02, 006, N'湖东街道办事处'),
	(41, 15, 02, 007, N'南湾街道办事处'),
	(41, 15, 02, 008, N'金牛山街道办事处'),
	(41, 15, 02, 009, N'双井街道办事处'),
	(41, 15, 02, 100, N'李家寨镇'),
	(41, 15, 02, 101, N'吴家店镇'),
	(41, 15, 02, 102, N'东双河镇'),
	(41, 15, 02, 103, N'董家河镇'),
	(41, 15, 02, 104, N'浉河港镇'),
	(41, 15, 02, 203, N'游河乡'),
	(41, 15, 02, 206, N'谭家河乡'),
	(41, 15, 02, 207, N'柳林乡'),
	(41, 15, 02, 208, N'十三里桥乡');

/* 河南省 信阳市 平桥区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 15, 03, 001, N'羊山街道办事处'),
	(41, 15, 03, 002, N'前进街道办事处'),
	(41, 15, 03, 003, N'南京路办事处'),
	(41, 15, 03, 004, N'平桥街道办事处'),
	(41, 15, 03, 005, N'甘岸街道办事处'),
	(41, 15, 03, 006, N'五里店街道办事处'),
	(41, 15, 03, 007, N'平西街道办事处'),
	(41, 15, 03, 008, N'平东街道办事处'),
	(41, 15, 03, 009, N'震雷山街道办事处'),
	(41, 15, 03, 101, N'明港镇'),
	(41, 15, 03, 102, N'五里镇'),
	(41, 15, 03, 103, N'邢集镇'),
	(41, 15, 03, 105, N'平昌镇'),
	(41, 15, 03, 106, N'洋河镇'),
	(41, 15, 03, 107, N'肖王镇'),
	(41, 15, 03, 202, N'龙井乡'),
	(41, 15, 03, 203, N'胡店乡'),
	(41, 15, 03, 205, N'彭家湾乡'),
	(41, 15, 03, 206, N'长台乡'),
	(41, 15, 03, 207, N'肖店乡'),
	(41, 15, 03, 209, N'王岗乡'),
	(41, 15, 03, 210, N'高粱店乡'),
	(41, 15, 03, 211, N'查山乡');

/* 河南省 信阳市 罗山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 15, 21, 100, N'城关镇'),
	(41, 15, 21, 101, N'周党镇'),
	(41, 15, 21, 102, N'竹竿镇'),
	(41, 15, 21, 103, N'灵山镇'),
	(41, 15, 21, 104, N'子路镇'),
	(41, 15, 21, 105, N'楠杆镇'),
	(41, 15, 21, 106, N'青山镇'),
	(41, 15, 21, 107, N'潘新镇'),
	(41, 15, 21, 108, N'彭新镇'),
	(41, 15, 21, 109, N'莽张镇'),
	(41, 15, 21, 110, N'东卜镇'),
	(41, 15, 21, 111, N'铁铺镇'),
	(41, 15, 21, 200, N'龙山乡'),
	(41, 15, 21, 202, N'庙仙乡'),
	(41, 15, 21, 204, N'定远乡'),
	(41, 15, 21, 205, N'山店乡'),
	(41, 15, 21, 207, N'朱堂乡'),
	(41, 15, 21, 208, N'尤店乡'),
	(41, 15, 21, 209, N'高店乡');

/* 河南省 信阳市 光山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 15, 22, 001, N'弦山街道办事处'),
	(41, 15, 22, 002, N'紫水街道办事处'),
	(41, 15, 22, 101, N'十里镇'),
	(41, 15, 22, 102, N'寨河镇'),
	(41, 15, 22, 103, N'孙铁铺镇'),
	(41, 15, 22, 104, N'马畈镇'),
	(41, 15, 22, 105, N'泼陂河镇'),
	(41, 15, 22, 106, N'白雀园镇'),
	(41, 15, 22, 107, N'砖桥镇'),
	(41, 15, 22, 201, N'仙居乡'),
	(41, 15, 22, 203, N'北向店乡'),
	(41, 15, 22, 204, N'罗陈乡'),
	(41, 15, 22, 206, N'殷棚乡'),
	(41, 15, 22, 207, N'南向店乡'),
	(41, 15, 22, 208, N'晏河乡'),
	(41, 15, 22, 210, N'凉亭乡'),
	(41, 15, 22, 212, N'斛山乡'),
	(41, 15, 22, 213, N'槐店乡'),
	(41, 15, 22, 215, N'文殊乡');

/* 河南省 信阳市 新县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 15, 23, 001, N'金兰山街道办事处'),
	(41, 15, 23, 100, N'新集镇'),
	(41, 15, 23, 101, N'沙窝镇'),
	(41, 15, 23, 103, N'吴陈河镇'),
	(41, 15, 23, 104, N'苏河镇'),
	(41, 15, 23, 105, N'八里畈镇'),
	(41, 15, 23, 201, N'周河乡'),
	(41, 15, 23, 202, N'陡山河乡'),
	(41, 15, 23, 203, N'浒湾乡'),
	(41, 15, 23, 204, N'千斤乡'),
	(41, 15, 23, 205, N'卡房乡'),
	(41, 15, 23, 206, N'郭家河乡'),
	(41, 15, 23, 207, N'陈店乡'),
	(41, 15, 23, 208, N'箭厂河乡'),
	(41, 15, 23, 209, N'泗店乡'),
	(41, 15, 23, 210, N'田铺乡');

/* 河南省 信阳市 商城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 15, 24, 001, N'赤城街道办事处'),
	(41, 15, 24, 002, N'鲇鱼山街道办事处'),
	(41, 15, 24, 101, N'上石桥镇'),
	(41, 15, 24, 102, N'鄢岗镇'),
	(41, 15, 24, 103, N'双椿铺镇'),
	(41, 15, 24, 104, N'汪桥镇'),
	(41, 15, 24, 105, N'余集镇'),
	(41, 15, 24, 106, N'达权店镇'),
	(41, 15, 24, 107, N'丰集镇'),
	(41, 15, 24, 108, N'汪岗镇'),
	(41, 15, 24, 109, N'观庙镇'),
	(41, 15, 24, 110, N'金刚台镇'),
	(41, 15, 24, 203, N'河风桥乡'),
	(41, 15, 24, 204, N'李集乡'),
	(41, 15, 24, 207, N'苏仙石乡'),
	(41, 15, 24, 209, N'伏山乡'),
	(41, 15, 24, 212, N'吴河乡'),
	(41, 15, 24, 213, N'冯店乡'),
	(41, 15, 24, 215, N'长竹园乡');

/* 河南省 信阳市 固始县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 15, 25, 001, N'蓼城办事处'),
	(41, 15, 25, 002, N'番城办事处'),
	(41, 15, 25, 003, N'秀水办事处'),
	(41, 15, 25, 101, N'陈淋子镇'),
	(41, 15, 25, 102, N'黎集镇'),
	(41, 15, 25, 103, N'蒋集镇'),
	(41, 15, 25, 104, N'往流镇'),
	(41, 15, 25, 105, N'郭陆滩镇'),
	(41, 15, 25, 106, N'胡族铺镇'),
	(41, 15, 25, 107, N'方集镇'),
	(41, 15, 25, 108, N'三河尖镇'),
	(41, 15, 25, 109, N'段集镇'),
	(41, 15, 25, 110, N'汪棚镇'),
	(41, 15, 25, 111, N'张广庙镇'),
	(41, 15, 25, 112, N'陈集镇'),
	(41, 15, 25, 113, N'武庙集镇'),
	(41, 15, 25, 114, N'分水亭镇'),
	(41, 15, 25, 115, N'石佛店镇'),
	(41, 15, 25, 116, N'泉河铺镇'),
	(41, 15, 25, 117, N'祖师庙镇'),
	(41, 15, 25, 201, N'洪埠乡'),
	(41, 15, 25, 202, N'杨集乡'),
	(41, 15, 25, 203, N'马堽集乡'),
	(41, 15, 25, 204, N'草庙集乡'),
	(41, 15, 25, 206, N'南大桥乡'),
	(41, 15, 25, 208, N'赵岗乡'),
	(41, 15, 25, 211, N'张老埠乡'),
	(41, 15, 25, 216, N'沙河铺乡'),
	(41, 15, 25, 218, N'徐集乡'),
	(41, 15, 25, 221, N'李店乡'),
	(41, 15, 25, 222, N'丰港乡'),
	(41, 15, 25, 223, N'柳树店乡'),
	(41, 15, 25, 224, N'观堂乡');

/* 河南省 信阳市 潢川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 15, 26, 001, N'春申街道办事处'),
	(41, 15, 26, 002, N'定城街道办事处'),
	(41, 15, 26, 003, N'弋阳街道办事处'),
	(41, 15, 26, 004, N'老城街道办事处'),
	(41, 15, 26, 101, N'双柳树镇'),
	(41, 15, 26, 102, N'伞陂镇'),
	(41, 15, 26, 103, N'卜塔集镇'),
	(41, 15, 26, 105, N'仁和镇'),
	(41, 15, 26, 106, N'付店镇'),
	(41, 15, 26, 107, N'踅孜镇'),
	(41, 15, 26, 108, N'桃林铺镇'),
	(41, 15, 26, 109, N'黄寺岗镇'),
	(41, 15, 26, 110, N'江家集镇'),
	(41, 15, 26, 201, N'传流店乡'),
	(41, 15, 26, 202, N'魏岗乡'),
	(41, 15, 26, 203, N'张集乡'),
	(41, 15, 26, 204, N'来龙乡'),
	(41, 15, 26, 205, N'隆古乡'),
	(41, 15, 26, 206, N'谈店乡'),
	(41, 15, 26, 207, N'上油岗乡'),
	(41, 15, 26, 209, N'白店乡');

/* 河南省 信阳市 淮滨县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 15, 27, 001, N'顺河街道办事处'),
	(41, 15, 27, 002, N'滨湖街道办事处'),
	(41, 15, 27, 003, N'栏杆街道办事处'),
	(41, 15, 27, 004, N'桂花街道办事处'),
	(41, 15, 27, 101, N'马集镇'),
	(41, 15, 27, 103, N'防胡镇'),
	(41, 15, 27, 104, N'新里镇'),
	(41, 15, 27, 105, N'期思镇'),
	(41, 15, 27, 106, N'赵集镇'),
	(41, 15, 27, 200, N'淮滨县台头乡'),
	(41, 15, 27, 201, N'王家岗乡'),
	(41, 15, 27, 202, N'固城乡'),
	(41, 15, 27, 203, N'三空桥乡'),
	(41, 15, 27, 204, N'张里乡'),
	(41, 15, 27, 206, N'邓湾乡'),
	(41, 15, 27, 207, N'张庄乡'),
	(41, 15, 27, 208, N'王店乡'),
	(41, 15, 27, 209, N'淮滨县谷堆乡'),
	(41, 15, 27, 212, N'芦集乡');

/* 河南省 信阳市 息县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 15, 28, 001, N'谯楼街道办事处'),
	(41, 15, 28, 002, N'龙湖街道办事处'),
	(41, 15, 28, 003, N'淮河街道办事处'),
	(41, 15, 28, 101, N'包信镇'),
	(41, 15, 28, 102, N'夏庄镇'),
	(41, 15, 28, 103, N'东岳镇'),
	(41, 15, 28, 104, N'项店镇'),
	(41, 15, 28, 105, N'小茴店镇'),
	(41, 15, 28, 106, N'曹黄林镇'),
	(41, 15, 28, 201, N'孙庙乡'),
	(41, 15, 28, 202, N'路口乡'),
	(41, 15, 28, 203, N'彭店乡'),
	(41, 15, 28, 204, N'杨店乡'),
	(41, 15, 28, 205, N'张陶乡'),
	(41, 15, 28, 206, N'白土店乡'),
	(41, 15, 28, 207, N'岗李店乡'),
	(41, 15, 28, 208, N'长陵乡'),
	(41, 15, 28, 209, N'陈棚乡'),
	(41, 15, 28, 210, N'临河乡'),
	(41, 15, 28, 211, N'关店乡'),
	(41, 15, 28, 214, N'八里岔乡');

/* 河南省 周口市 川汇区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 16, 02, 001, N'陈州回族街道办事处'),
	(41, 16, 02, 002, N'七一路街道办事处'),
	(41, 16, 02, 003, N'荷花街道办事处'),
	(41, 16, 02, 004, N'人和街道办事处'),
	(41, 16, 02, 005, N'小桥街道办事处'),
	(41, 16, 02, 006, N'城南办事处'),
	(41, 16, 02, 007, N'城北办事处'),
	(41, 16, 02, 008, N'文昌办事处'),
	(41, 16, 02, 009, N'搬口办事处'),
	(41, 16, 02, 010, N'金海路办事处'),
	(41, 16, 02, 200, N'李埠口乡'),
	(41, 16, 02, 201, N'许湾乡');

/* 河南省 周口市 扶沟县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 16, 21, 002, N'扶亭街道办事处'),
	(41, 16, 21, 100, N'城关镇'),
	(41, 16, 21, 101, N'崔桥镇'),
	(41, 16, 21, 102, N'江村镇'),
	(41, 16, 21, 103, N'白潭镇'),
	(41, 16, 21, 104, N'韭园镇'),
	(41, 16, 21, 105, N'练寺镇'),
	(41, 16, 21, 106, N'大新镇'),
	(41, 16, 21, 107, N'包屯镇'),
	(41, 16, 21, 108, N'汴岗镇'),
	(41, 16, 21, 200, N'曹里乡'),
	(41, 16, 21, 201, N'柴岗乡'),
	(41, 16, 21, 202, N'固城乡'),
	(41, 16, 21, 203, N'吕潭乡'),
	(41, 16, 21, 204, N'大李庄乡'),
	(41, 16, 21, 205, N'城郊乡');

/* 河南省 周口市 西华县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 16, 22, 001, N'娲城街道办事处'),
	(41, 16, 22, 002, N'箕子台街道办事处'),
	(41, 16, 22, 003, N'昆山街道办事处'),
	(41, 16, 22, 101, N'西夏亭镇'),
	(41, 16, 22, 102, N'逍遥镇'),
	(41, 16, 22, 103, N'奉母镇'),
	(41, 16, 22, 104, N'红花集镇'),
	(41, 16, 22, 105, N'聂堆镇'),
	(41, 16, 22, 106, N'东夏亭镇'),
	(41, 16, 22, 107, N'西华营镇'),
	(41, 16, 22, 108, N'址坊镇'),
	(41, 16, 22, 200, N'田口乡'),
	(41, 16, 22, 201, N'清河驿乡'),
	(41, 16, 22, 202, N'皮营乡'),
	(41, 16, 22, 203, N'东王营乡'),
	(41, 16, 22, 204, N'大王庄乡'),
	(41, 16, 22, 205, N'李大庄乡'),
	(41, 16, 22, 206, N'叶埠口乡'),
	(41, 16, 22, 207, N'迟营乡'),
	(41, 16, 22, 208, N'黄土桥乡'),
	(41, 16, 22, 209, N'艾岗乡');

/* 河南省 周口市 商水县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 16, 23, 001, N'新城街道办事处'),
	(41, 16, 23, 002, N'东城街道办事处'),
	(41, 16, 23, 003, N'老城街道办事处'),
	(41, 16, 23, 101, N'黄寨镇'),
	(41, 16, 23, 102, N'练集镇'),
	(41, 16, 23, 103, N'魏集镇'),
	(41, 16, 23, 104, N'固墙镇'),
	(41, 16, 23, 105, N'白寺镇'),
	(41, 16, 23, 106, N'巴村镇'),
	(41, 16, 23, 107, N'谭庄镇'),
	(41, 16, 23, 108, N'邓城镇'),
	(41, 16, 23, 109, N'胡吉镇'),
	(41, 16, 23, 200, N'城关乡'),
	(41, 16, 23, 202, N'平店乡'),
	(41, 16, 23, 203, N'袁老乡'),
	(41, 16, 23, 204, N'化河乡'),
	(41, 16, 23, 205, N'姚集乡'),
	(41, 16, 23, 206, N'舒庄乡'),
	(41, 16, 23, 207, N'大武乡'),
	(41, 16, 23, 208, N'张明乡'),
	(41, 16, 23, 209, N'郝岗乡'),
	(41, 16, 23, 210, N'张庄乡'),
	(41, 16, 23, 211, N'汤庄乡');

/* 河南省 周口市 沈丘县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 16, 24, 001, N'东城办事处'),
	(41, 16, 24, 002, N'北城办事处'),
	(41, 16, 24, 100, N'槐店回族镇'),
	(41, 16, 24, 101, N'刘庄店镇'),
	(41, 16, 24, 102, N'留福集镇'),
	(41, 16, 24, 103, N'老城镇'),
	(41, 16, 24, 104, N'赵德营镇'),
	(41, 16, 24, 105, N'付井镇'),
	(41, 16, 24, 106, N'纸店镇'),
	(41, 16, 24, 107, N'新安集镇'),
	(41, 16, 24, 108, N'白集镇'),
	(41, 16, 24, 109, N'刘湾镇'),
	(41, 16, 24, 110, N'莲池镇'),
	(41, 16, 24, 111, N'洪山镇'),
	(41, 16, 24, 201, N'石槽集乡'),
	(41, 16, 24, 202, N'范营乡'),
	(41, 16, 24, 203, N'李老庄乡'),
	(41, 16, 24, 204, N'大邢庄乡'),
	(41, 16, 24, 205, N'冯营乡'),
	(41, 16, 24, 206, N'周营乡'),
	(41, 16, 24, 208, N'北杨集乡'),
	(41, 16, 24, 209, N'卞路口乡');

/* 河南省 周口市 郸城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 16, 25, 001, N'洺南办事处'),
	(41, 16, 25, 002, N'洺北办事处'),
	(41, 16, 25, 003, N'新城办事处'),
	(41, 16, 25, 101, N'吴台镇'),
	(41, 16, 25, 102, N'南丰镇'),
	(41, 16, 25, 103, N'白马镇'),
	(41, 16, 25, 104, N'宁平镇'),
	(41, 16, 25, 105, N'宜路镇'),
	(41, 16, 25, 106, N'钱店镇'),
	(41, 16, 25, 107, N'汲冢镇'),
	(41, 16, 25, 108, N'石槽镇'),
	(41, 16, 25, 200, N'城郊乡'),
	(41, 16, 25, 201, N'虎头岗乡'),
	(41, 16, 25, 202, N'汲水乡'),
	(41, 16, 25, 203, N'张完集乡'),
	(41, 16, 25, 204, N'丁村乡'),
	(41, 16, 25, 205, N'双楼乡'),
	(41, 16, 25, 206, N'秋渠乡'),
	(41, 16, 25, 207, N'东风乡'),
	(41, 16, 25, 208, N'巴集乡'),
	(41, 16, 25, 209, N'李楼乡'),
	(41, 16, 25, 210, N'胡集乡');

/* 河南省 周口市 淮阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 16, 26, 100, N'城关回族镇'),
	(41, 16, 26, 101, N'新站镇'),
	(41, 16, 26, 102, N'鲁台镇'),
	(41, 16, 26, 103, N'四通镇'),
	(41, 16, 26, 104, N'临蔡镇'),
	(41, 16, 26, 105, N'安岭镇'),
	(41, 16, 26, 106, N'白楼镇'),
	(41, 16, 26, 200, N'朱集乡'),
	(41, 16, 26, 201, N'豆门乡'),
	(41, 16, 26, 202, N'冯塘乡'),
	(41, 16, 26, 203, N'刘振屯乡'),
	(41, 16, 26, 204, N'王店乡'),
	(41, 16, 26, 205, N'大连乡'),
	(41, 16, 26, 206, N'葛店乡'),
	(41, 16, 26, 207, N'黄集乡'),
	(41, 16, 26, 209, N'齐老乡'),
	(41, 16, 26, 210, N'郑集乡'),
	(41, 16, 26, 211, N'曹河乡');

/* 河南省 周口市 太康县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 16, 27, 100, N'城关回族镇'),
	(41, 16, 27, 101, N'常营镇'),
	(41, 16, 27, 102, N'逊母口镇'),
	(41, 16, 27, 103, N'老冢镇'),
	(41, 16, 27, 104, N'朱口镇'),
	(41, 16, 27, 105, N'马头镇'),
	(41, 16, 27, 106, N'龙曲镇'),
	(41, 16, 27, 107, N'板桥镇'),
	(41, 16, 27, 108, N'符草楼镇'),
	(41, 16, 27, 109, N'马厂镇'),
	(41, 16, 27, 110, N'毛庄镇'),
	(41, 16, 27, 111, N'张集镇'),
	(41, 16, 27, 112, N'清集镇'),
	(41, 16, 27, 200, N'城郊乡'),
	(41, 16, 27, 201, N'杨庙乡'),
	(41, 16, 27, 202, N'王集乡'),
	(41, 16, 27, 203, N'高贤乡'),
	(41, 16, 27, 204, N'芝麻洼乡'),
	(41, 16, 27, 206, N'独塘乡'),
	(41, 16, 27, 207, N'大许寨乡'),
	(41, 16, 27, 208, N'五里口乡'),
	(41, 16, 27, 210, N'高朗乡'),
	(41, 16, 27, 211, N'转楼乡');

/* 河南省 周口市 鹿邑县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 16, 28, 001, N'真源办事处'),
	(41, 16, 28, 002, N'谷阳办事处'),
	(41, 16, 28, 003, N'卫真办事处'),
	(41, 16, 28, 004, N'鸣鹿办事处'),
	(41, 16, 28, 100, N'涡北镇'),
	(41, 16, 28, 101, N'玄武镇'),
	(41, 16, 28, 102, N'宋河镇'),
	(41, 16, 28, 103, N'太清宫镇'),
	(41, 16, 28, 104, N'王皮溜镇'),
	(41, 16, 28, 105, N'试量镇'),
	(41, 16, 28, 106, N'辛集镇'),
	(41, 16, 28, 107, N'马铺镇'),
	(41, 16, 28, 108, N'贾滩镇'),
	(41, 16, 28, 109, N'杨湖口镇'),
	(41, 16, 28, 110, N'张店镇'),
	(41, 16, 28, 111, N'观堂镇'),
	(41, 16, 28, 112, N'生铁冢镇'),
	(41, 16, 28, 200, N'郑家集乡'),
	(41, 16, 28, 204, N'赵村乡'),
	(41, 16, 28, 205, N'任集乡'),
	(41, 16, 28, 206, N'唐集乡'),
	(41, 16, 28, 207, N'高集乡'),
	(41, 16, 28, 208, N'邱集乡'),
	(41, 16, 28, 209, N'穆店乡');

/* 河南省 周口市 项城市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 16, 81, 001, N'花园办事处'),
	(41, 16, 81, 002, N'水寨办事处'),
	(41, 16, 81, 003, N'东方办事处'),
	(41, 16, 81, 004, N'莲花办事处'),
	(41, 16, 81, 005, N'千佛阁办事处'),
	(41, 16, 81, 006, N'光武办事处'),
	(41, 16, 81, 100, N'南顿镇'),
	(41, 16, 81, 101, N'孙店镇'),
	(41, 16, 81, 102, N'李寨镇'),
	(41, 16, 81, 103, N'贾岭镇'),
	(41, 16, 81, 104, N'高寺镇'),
	(41, 16, 81, 105, N'新桥镇'),
	(41, 16, 81, 106, N'付集镇'),
	(41, 16, 81, 107, N'官会镇'),
	(41, 16, 81, 108, N'丁集镇'),
	(41, 16, 81, 109, N'郑郭镇'),
	(41, 16, 81, 110, N'秣陵镇'),
	(41, 16, 81, 111, N'王明口镇'),
	(41, 16, 81, 112, N'范集镇'),
	(41, 16, 81, 113, N'三店镇'),
	(41, 16, 81, 114, N'永丰镇');

/* 河南省 驻马店市 驿城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 17, 02, 001, N'人民街道办事处'),
	(41, 17, 02, 002, N'东风街道办事处'),
	(41, 17, 02, 003, N'西园街道办事处'),
	(41, 17, 02, 004, N'新华街道办事处'),
	(41, 17, 02, 005, N'南海街道办事处'),
	(41, 17, 02, 006, N'老街街道办事处'),
	(41, 17, 02, 007, N'橡林街道办事处'),
	(41, 17, 02, 008, N'雪松街道办事处'),
	(41, 17, 02, 009, N'顺河街道办事处'),
	(41, 17, 02, 010, N'刘阁街道办事处'),
	(41, 17, 02, 011, N'香山街道办事处'),
	(41, 17, 02, 100, N'水屯镇'),
	(41, 17, 02, 101, N'沙河店镇'),
	(41, 17, 02, 102, N'板桥镇'),
	(41, 17, 02, 103, N'诸市镇'),
	(41, 17, 02, 104, N'蚁蜂镇'),
	(41, 17, 02, 201, N'老河乡'),
	(41, 17, 02, 204, N'朱古洞乡'),
	(41, 17, 02, 205, N'胡庙乡'),
	(41, 17, 02, 206, N'古城乡');

/* 河南省 驻马店市 西平县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 17, 21, 001, N'柏城街道办事处'),
	(41, 17, 21, 002, N'柏亭街道办事处'),
	(41, 17, 21, 003, N'柏苑街道办事处'),
	(41, 17, 21, 101, N'五沟营镇'),
	(41, 17, 21, 102, N'权寨镇'),
	(41, 17, 21, 103, N'师灵镇'),
	(41, 17, 21, 104, N'出山镇'),
	(41, 17, 21, 105, N'盆尧镇'),
	(41, 17, 21, 201, N'重渠乡'),
	(41, 17, 21, 203, N'人和乡'),
	(41, 17, 21, 204, N'宋集乡'),
	(41, 17, 21, 205, N'谭店乡'),
	(41, 17, 21, 206, N'吕店乡'),
	(41, 17, 21, 208, N'芦庙乡'),
	(41, 17, 21, 209, N'杨庄乡'),
	(41, 17, 21, 210, N'专探乡'),
	(41, 17, 21, 211, N'二郎乡'),
	(41, 17, 21, 212, N'蔡寨回族乡'),
	(41, 17, 21, 213, N'焦庄乡');

/* 河南省 驻马店市 上蔡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 17, 22, 001, N'蔡都街道办事处'),
	(41, 17, 22, 002, N'芦岗街道办事处'),
	(41, 17, 22, 003, N'重阳街道办事处'),
	(41, 17, 22, 004, N'卧龙街道办事处'),
	(41, 17, 22, 101, N'黄埠镇'),
	(41, 17, 22, 102, N'杨集镇'),
	(41, 17, 22, 103, N'洙湖镇'),
	(41, 17, 22, 104, N'党店镇'),
	(41, 17, 22, 105, N'朱里镇'),
	(41, 17, 22, 106, N'华陂镇'),
	(41, 17, 22, 107, N'塔桥镇'),
	(41, 17, 22, 108, N'东洪镇'),
	(41, 17, 22, 109, N'邵店镇'),
	(41, 17, 22, 110, N'五龙镇'),
	(41, 17, 22, 111, N'和店镇'),
	(41, 17, 22, 201, N'大路李乡'),
	(41, 17, 22, 202, N'无量寺乡'),
	(41, 17, 22, 205, N'杨屯乡'),
	(41, 17, 22, 207, N'蔡沟乡'),
	(41, 17, 22, 209, N'齐海乡'),
	(41, 17, 22, 210, N'崇礼乡'),
	(41, 17, 22, 211, N'韩寨乡'),
	(41, 17, 22, 212, N'东岸乡'),
	(41, 17, 22, 215, N'小岳寺乡'),
	(41, 17, 22, 216, N'西洪乡'),
	(41, 17, 22, 217, N'百尺乡');

/* 河南省 驻马店市 平舆县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 17, 23, 001, N'古槐街道办事处'),
	(41, 17, 23, 002, N'清河街道办事处'),
	(41, 17, 23, 003, N'东皇街道办事处'),
	(41, 17, 23, 101, N'杨埠镇'),
	(41, 17, 23, 102, N'东和店镇'),
	(41, 17, 23, 103, N'庙湾镇'),
	(41, 17, 23, 104, N'射桥镇'),
	(41, 17, 23, 105, N'西洋店镇'),
	(41, 17, 23, 106, N'阳城镇'),
	(41, 17, 23, 107, N'郭楼镇'),
	(41, 17, 23, 108, N'李屯镇'),
	(41, 17, 23, 109, N'万金店镇'),
	(41, 17, 23, 110, N'高杨店镇'),
	(41, 17, 23, 111, N'万冢镇'),
	(41, 17, 23, 202, N'十字路乡'),
	(41, 17, 23, 205, N'玉皇庙乡'),
	(41, 17, 23, 208, N'老王岗乡'),
	(41, 17, 23, 209, N'辛店乡'),
	(41, 17, 23, 211, N'双庙乡');

/* 河南省 驻马店市 正阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 17, 24, 100, N'真阳镇'),
	(41, 17, 24, 101, N'寒冻镇'),
	(41, 17, 24, 102, N'汝南埠镇'),
	(41, 17, 24, 103, N'铜钟镇'),
	(41, 17, 24, 104, N'陡沟镇'),
	(41, 17, 24, 105, N'熊寨镇'),
	(41, 17, 24, 106, N'大林镇'),
	(41, 17, 24, 107, N'永兴镇'),
	(41, 17, 24, 200, N'慎水乡'),
	(41, 17, 24, 201, N'傅寨乡'),
	(41, 17, 24, 202, N'袁寨乡'),
	(41, 17, 24, 203, N'新阮店乡'),
	(41, 17, 24, 204, N'油坊店乡'),
	(41, 17, 24, 207, N'雷寨乡'),
	(41, 17, 24, 208, N'王勿桥乡'),
	(41, 17, 24, 210, N'吕河乡'),
	(41, 17, 24, 212, N'皮店乡'),
	(41, 17, 24, 213, N'彭桥乡'),
	(41, 17, 24, 214, N'兰青乡');

/* 河南省 驻马店市 确山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 17, 25, 001, N'盘龙街道办事处'),
	(41, 17, 25, 002, N'三里河街道办事处'),
	(41, 17, 25, 003, N'朗陵街道办事处'),
	(41, 17, 25, 101, N'竹沟镇'),
	(41, 17, 25, 102, N'任店镇'),
	(41, 17, 25, 103, N'新安店镇'),
	(41, 17, 25, 104, N'留庄镇'),
	(41, 17, 25, 105, N'刘店镇'),
	(41, 17, 25, 107, N'瓦岗镇'),
	(41, 17, 25, 108, N'双河镇'),
	(41, 17, 25, 109, N'石滚河镇'),
	(41, 17, 25, 110, N'李新店镇'),
	(41, 17, 25, 209, N'普会寺乡');

/* 河南省 驻马店市 泌阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 17, 26, 001, N'花园街道办事处'),
	(41, 17, 26, 002, N'泌水街道办事处'),
	(41, 17, 26, 003, N'古城街道办事处'),
	(41, 17, 26, 102, N'羊册镇'),
	(41, 17, 26, 103, N'马谷田镇'),
	(41, 17, 26, 105, N'春水镇'),
	(41, 17, 26, 106, N'官庄镇'),
	(41, 17, 26, 107, N'赊湾镇'),
	(41, 17, 26, 108, N'郭集镇'),
	(41, 17, 26, 109, N'泰山庙镇'),
	(41, 17, 26, 110, N'王店镇'),
	(41, 17, 26, 200, N'高店乡'),
	(41, 17, 26, 201, N'盘古乡'),
	(41, 17, 26, 202, N'高邑乡'),
	(41, 17, 26, 204, N'铜山乡'),
	(41, 17, 26, 206, N'下碑寺乡'),
	(41, 17, 26, 207, N'象河乡'),
	(41, 17, 26, 208, N'付庄乡'),
	(41, 17, 26, 209, N'贾楼乡'),
	(41, 17, 26, 210, N'黄山口乡'),
	(41, 17, 26, 214, N'杨家集乡'),
	(41, 17, 26, 215, N'双庙街乡');

/* 河南省 驻马店市 汝南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 17, 27, 001, N'汝宁街道办事处'),
	(41, 17, 27, 002, N'三门闸街道办事处'),
	(41, 17, 27, 003, N'古塔街道办事处'),
	(41, 17, 27, 101, N'王岗镇'),
	(41, 17, 27, 102, N'梁祝镇'),
	(41, 17, 27, 103, N'和孝镇'),
	(41, 17, 27, 104, N'老君庙镇'),
	(41, 17, 27, 105, N'留盆镇'),
	(41, 17, 27, 106, N'金铺镇'),
	(41, 17, 27, 107, N'东官庄镇'),
	(41, 17, 27, 108, N'常兴镇'),
	(41, 17, 27, 109, N'罗店镇'),
	(41, 17, 27, 110, N'韩庄镇'),
	(41, 17, 27, 111, N'三桥镇'),
	(41, 17, 27, 112, N'张楼镇'),
	(41, 17, 27, 204, N'南余店乡'),
	(41, 17, 27, 212, N'板店乡');

/* 河南省 驻马店市 遂平县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 17, 28, 001, N'瞿阳街道办事处'),
	(41, 17, 28, 002, N'车站街道办事处'),
	(41, 17, 28, 003, N'莲花湖街道办事处'),
	(41, 17, 28, 102, N'玉山镇'),
	(41, 17, 28, 103, N'查岈山镇'),
	(41, 17, 28, 104, N'石寨铺镇'),
	(41, 17, 28, 105, N'和兴镇'),
	(41, 17, 28, 106, N'沈寨镇'),
	(41, 17, 28, 107, N'阳丰镇'),
	(41, 17, 28, 108, N'常庄镇'),
	(41, 17, 28, 109, N'花庄镇'),
	(41, 17, 28, 204, N'槐树乡'),
	(41, 17, 28, 209, N'文城乡'),
	(41, 17, 28, 211, N'褚堂乡');

/* 河南省 驻马店市 新蔡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 17, 29, 001, N'古吕街道办事处'),
	(41, 17, 29, 002, N'今是街道办事处'),
	(41, 17, 29, 003, N'月亮湾街道办事处'),
	(41, 17, 29, 101, N'砖店镇'),
	(41, 17, 29, 102, N'陈店镇'),
	(41, 17, 29, 103, N'佛阁寺镇'),
	(41, 17, 29, 104, N'练村镇'),
	(41, 17, 29, 105, N'棠村镇'),
	(41, 17, 29, 106, N'韩集镇'),
	(41, 17, 29, 107, N'龙口镇'),
	(41, 17, 29, 108, N'李桥回族镇'),
	(41, 17, 29, 109, N'黄楼镇'),
	(41, 17, 29, 110, N'孙召镇'),
	(41, 17, 29, 111, N'余店镇'),
	(41, 17, 29, 204, N'河坞乡'),
	(41, 17, 29, 205, N'关津乡'),
	(41, 17, 29, 206, N'宋岗乡'),
	(41, 17, 29, 207, N'顿岗乡'),
	(41, 17, 29, 208, N'涧头乡'),
	(41, 17, 29, 209, N'杨庄户乡'),
	(41, 17, 29, 210, N'化庄乡'),
	(41, 17, 29, 211, N'栎城乡'),
	(41, 17, 29, 213, N'弥陀寺乡');

/* 河南省 省直辖县级行政区划 济源市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(41, 90, 01, 001, N'济源市沁园街道办事处'),
	(41, 90, 01, 002, N'济源市济水街道办事处'),
	(41, 90, 01, 003, N'济源市北海街道办事处'),
	(41, 90, 01, 004, N'济源市天坛街道办事处'),
	(41, 90, 01, 005, N'济源市玉泉街道办事处'),
	(41, 90, 01, 100, N'济源市克井镇'),
	(41, 90, 01, 101, N'济源市五龙口镇'),
	(41, 90, 01, 102, N'济源市轵城镇'),
	(41, 90, 01, 103, N'济源市承留镇'),
	(41, 90, 01, 104, N'济源市邵原镇'),
	(41, 90, 01, 105, N'济源市坡头镇'),
	(41, 90, 01, 106, N'济源市梨林镇'),
	(41, 90, 01, 107, N'济源市大峪镇'),
	(41, 90, 01, 108, N'济源市思礼镇'),
	(41, 90, 01, 109, N'济源市王屋镇'),
	(41, 90, 01, 110, N'济源市下冶镇');


/* 湖北省 武汉市 江岸区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 02, 002, N'大智街办事处'),
	(42, 01, 02, 003, N'一元街办事处'),
	(42, 01, 02, 004, N'车站街办事处'),
	(42, 01, 02, 005, N'四唯街办事处'),
	(42, 01, 02, 006, N'永清街办事处'),
	(42, 01, 02, 007, N'西马街办事处'),
	(42, 01, 02, 008, N'球场街办事处'),
	(42, 01, 02, 009, N'劳动街办事处'),
	(42, 01, 02, 010, N'二七街办事处'),
	(42, 01, 02, 011, N'新村街办事处'),
	(42, 01, 02, 012, N'丹水池街办事处'),
	(42, 01, 02, 014, N'台北街办事处'),
	(42, 01, 02, 015, N'花桥街办事处'),
	(42, 01, 02, 016, N'谌家矶街办事处'),
	(42, 01, 02, 017, N'后湖街办事处'),
	(42, 01, 02, 018, N'塔子湖街办事处');

/* 湖北省 武汉市 江汉区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 03, 001, N'民族街办事处'),
	(42, 01, 03, 002, N'花楼街办事处'),
	(42, 01, 03, 003, N'水塔街办事处'),
	(42, 01, 03, 004, N'民权街办事处'),
	(42, 01, 03, 005, N'满春街办事处'),
	(42, 01, 03, 006, N'民意街办事处'),
	(42, 01, 03, 007, N'新华街办事处'),
	(42, 01, 03, 008, N'万松街办事处'),
	(42, 01, 03, 009, N'唐家墩街办事处'),
	(42, 01, 03, 010, N'北湖街办事处'),
	(42, 01, 03, 011, N'前进街办事处'),
	(42, 01, 03, 012, N'常青街办事处'),
	(42, 01, 03, 013, N'汉兴街办事处');

/* 湖北省 武汉市 硚口区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 04, 001, N'古田街道办事处'),
	(42, 01, 04, 002, N'韩家墩街道办事处'),
	(42, 01, 04, 003, N'宗关街道办事处'),
	(42, 01, 04, 004, N'汉水桥街道办事处'),
	(42, 01, 04, 005, N'宝丰街道办事处'),
	(42, 01, 04, 006, N'荣华街道办事处'),
	(42, 01, 04, 008, N'汉中街道办事处'),
	(42, 01, 04, 009, N'汉正街道办事处'),
	(42, 01, 04, 010, N'六角亭街道办事处'),
	(42, 01, 04, 011, N'长丰街道办事处'),
	(42, 01, 04, 012, N'易家街道办事处');

/* 湖北省 武汉市 汉阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 05, 001, N'翠微街办事处'),
	(42, 01, 05, 002, N'建桥街办事处'),
	(42, 01, 05, 003, N'月湖街办事处'),
	(42, 01, 05, 004, N'晴川街办事处'),
	(42, 01, 05, 005, N'鹦鹉街办事处'),
	(42, 01, 05, 006, N'洲头街办事处'),
	(42, 01, 05, 007, N'五里墩街办事处'),
	(42, 01, 05, 008, N'琴断口街办事处'),
	(42, 01, 05, 009, N'江汉二桥街道办事处'),
	(42, 01, 05, 010, N'永丰街办事处'),
	(42, 01, 05, 011, N'江堤街办事处'),
	(42, 01, 05, 012, N'四新地区管委会');

/* 湖北省 武汉市 武昌区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 06, 001, N'积玉桥街办事处'),
	(42, 01, 06, 002, N'杨园街办事处'),
	(42, 01, 06, 003, N'徐家棚街办事处'),
	(42, 01, 06, 005, N'粮道街办事处'),
	(42, 01, 06, 006, N'中华路街办事处'),
	(42, 01, 06, 007, N'黄鹤楼街办事处'),
	(42, 01, 06, 008, N'紫阳街办事处'),
	(42, 01, 06, 009, N'白沙洲街办事处'),
	(42, 01, 06, 010, N'首义路街办事处'),
	(42, 01, 06, 011, N'中南路街办事处'),
	(42, 01, 06, 012, N'水果湖街办事处'),
	(42, 01, 06, 013, N'珞珈山街办事处'),
	(42, 01, 06, 014, N'石洞街办事处'),
	(42, 01, 06, 015, N'南湖街办事处');

/* 湖北省 武汉市 青山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 07, 001, N'红卫路街道办事处'),
	(42, 01, 07, 002, N'冶金街道办事处'),
	(42, 01, 07, 003, N'新沟桥街道办事处'),
	(42, 01, 07, 004, N'红钢城街道办事处'),
	(42, 01, 07, 005, N'工人村街道办事处'),
	(42, 01, 07, 006, N'青山镇街道办事处'),
	(42, 01, 07, 007, N'厂前街道办事处'),
	(42, 01, 07, 008, N'武东街道办事处'),
	(42, 01, 07, 009, N'白玉山街道办事处'),
	(42, 01, 07, 010, N'钢花村街道办事处');

/* 湖北省 武汉市 洪山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 11, 001, N'珞南街道'),
	(42, 01, 11, 002, N'关山街道'),
	(42, 01, 11, 003, N'狮子山街道'),
	(42, 01, 11, 004, N'张家湾街道'),
	(42, 01, 11, 005, N'梨园街道'),
	(42, 01, 11, 006, N'卓刀泉街道'),
	(42, 01, 11, 007, N'洪山街道办事处'),
	(42, 01, 11, 008, N'和平街道办事处'),
	(42, 01, 11, 009, N'青菱街道'),
	(42, 01, 11, 061, N'八吉府街办事处'),
	(42, 01, 11, 080, N'关东街道办事处'),
	(42, 01, 11, 081, N'花山街道办事处'),
	(42, 01, 11, 082, N'左岭街道办事处'),
	(42, 01, 11, 083, N'九峰街道办事处'),
	(42, 01, 11, 205, N'天兴乡');

/* 湖北省 武汉市 东西湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 12, 001, N'吴家山街道办事处'),
	(42, 01, 12, 002, N'柏泉办事处街道'),
	(42, 01, 12, 004, N'将军路街道办事处'),
	(42, 01, 12, 005, N'慈惠街道办事处'),
	(42, 01, 12, 006, N'走马岭街道办事处'),
	(42, 01, 12, 007, N'径河街道办事处'),
	(42, 01, 12, 008, N'长青街道办事处'),
	(42, 01, 12, 011, N'辛安渡办事处街道'),
	(42, 01, 12, 012, N'东山办事处街道'),
	(42, 01, 12, 013, N'常青花园新区街道管理委员会'),
	(42, 01, 12, 014, N'新沟镇街道办事处'),
	(42, 01, 12, 015, N'金银湖街道办事处');

/* 湖北省 武汉市 汉南区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 13, 001, N'纱帽街道办事处'),
	(42, 01, 13, 002, N'邓南街道办事处'),
	(42, 01, 13, 003, N'东荆街道办事处'),
	(42, 01, 13, 004, N'湘口街道办事处');

/* 湖北省 武汉市 蔡甸区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 14, 001, N'蔡甸街道办事处'),
	(42, 01, 14, 002, N'奓山街道办事处'),
	(42, 01, 14, 003, N'永安街道办事处'),
	(42, 01, 14, 004, N'侏儒山街道办事处'),
	(42, 01, 14, 005, N'大集街道办事处'),
	(42, 01, 14, 006, N'张湾街道办事处'),
	(42, 01, 14, 070, N'沌口街办事处'),
	(42, 01, 14, 071, N'军山街道'),
	(42, 01, 14, 072, N'沌阳街道办事处'),
	(42, 01, 14, 100, N'索河镇'),
	(42, 01, 14, 101, N'玉贤镇'),
	(42, 01, 14, 200, N'消泗乡');

/* 湖北省 武汉市 江夏区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 15, 001, N'纸坊街道'),
	(42, 01, 15, 002, N'金口街道'),
	(42, 01, 15, 003, N'乌龙泉街道'),
	(42, 01, 15, 005, N'郑店街道'),
	(42, 01, 15, 007, N'五里界街道'),
	(42, 01, 15, 008, N'金水办事处'),
	(42, 01, 15, 009, N'安山街道办事处'),
	(42, 01, 15, 010, N'山坡街道办事处'),
	(42, 01, 15, 014, N'法泗街道'),
	(42, 01, 15, 015, N'湖泗街道'),
	(42, 01, 15, 016, N'舒安街道办事处'),
	(42, 01, 15, 086, N'佛祖岭街道办事处'),
	(42, 01, 15, 087, N'豹澥街道办事处'),
	(42, 01, 15, 088, N'流芳街道'),
	(42, 01, 15, 089, N'滨湖街道办事处');

/* 湖北省 武汉市 黄陂区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 16, 001, N'前川街道'),
	(42, 01, 16, 002, N'祁家湾街道'),
	(42, 01, 16, 003, N'横店街道'),
	(42, 01, 16, 004, N'罗汉寺街道'),
	(42, 01, 16, 005, N'滠口街道'),
	(42, 01, 16, 006, N'六指街道'),
	(42, 01, 16, 007, N'天河街道'),
	(42, 01, 16, 008, N'王家河街道'),
	(42, 01, 16, 009, N'长轩岭街道'),
	(42, 01, 16, 010, N'李集街道'),
	(42, 01, 16, 011, N'姚集街道'),
	(42, 01, 16, 012, N'蔡榨街道'),
	(42, 01, 16, 013, N'武湖街道'),
	(42, 01, 16, 014, N'三里桥街道办事处'),
	(42, 01, 16, 015, N'蔡店街道办事处'),
	(42, 01, 16, 201, N'木兰乡');

/* 湖北省 武汉市 新洲区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 01, 17, 001, N'邾城街道办事处'),
	(42, 01, 17, 002, N'阳逻街道办事处'),
	(42, 01, 17, 003, N'仓埠街道办事处'),
	(42, 01, 17, 004, N'汪集街道办事处'),
	(42, 01, 17, 005, N'李集街道办事处'),
	(42, 01, 17, 006, N'三店街道办事处'),
	(42, 01, 17, 007, N'潘塘街道办事处'),
	(42, 01, 17, 008, N'旧街街道办事处'),
	(42, 01, 17, 009, N'双柳街道办事处'),
	(42, 01, 17, 010, N'涨渡湖街道办事处'),
	(42, 01, 17, 011, N'辛冲街道办事处'),
	(42, 01, 17, 012, N'徐古街道办事处'),
	(42, 01, 17, 102, N'凤凰镇');

/* 湖北省 黄石市 黄石港区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 02, 02, 070, N'花湖街道办事处');

/* 湖北省 黄石市 西塞山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 02, 03, 007, N'章山街道办事处');

/* 湖北省 黄石市 下陆区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 02, 04, 070, N'团城山街道办事处');

/* 湖北省 黄石市 铁山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 02, 05, 198, N'区直辖村模拟镇');

/* 湖北省 黄石市 阳新县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 02, 22, 100, N'兴国镇'),
	(42, 02, 22, 101, N'富池镇'),
	(42, 02, 22, 102, N'黄颡口镇'),
	(42, 02, 22, 103, N'韦源口镇'),
	(42, 02, 22, 104, N'太子镇'),
	(42, 02, 22, 105, N'大王镇'),
	(42, 02, 22, 106, N'陶港镇'),
	(42, 02, 22, 107, N'白沙镇'),
	(42, 02, 22, 108, N'浮屠镇'),
	(42, 02, 22, 109, N'三溪镇'),
	(42, 02, 22, 110, N'龙港镇'),
	(42, 02, 22, 111, N'洋港镇'),
	(42, 02, 22, 112, N'排市镇'),
	(42, 02, 22, 113, N'木港镇'),
	(42, 02, 22, 114, N'枫林镇'),
	(42, 02, 22, 115, N'王英镇');

/* 湖北省 黄石市 大冶市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 02, 81, 001, N'东岳路街道办事处'),
	(42, 02, 81, 002, N'东风路街道办事处'),
	(42, 02, 81, 003, N'金湖街道办事处'),
	(42, 02, 81, 004, N'罗家桥街道办事处'),
	(42, 02, 81, 070, N'金山街道办事处'),
	(42, 02, 81, 100, N'金牛镇'),
	(42, 02, 81, 101, N'保安镇'),
	(42, 02, 81, 102, N'灵乡镇'),
	(42, 02, 81, 103, N'金山店镇'),
	(42, 02, 81, 104, N'还地桥镇'),
	(42, 02, 81, 105, N'殷祖镇'),
	(42, 02, 81, 107, N'刘仁八镇'),
	(42, 02, 81, 108, N'陈贵镇'),
	(42, 02, 81, 109, N'大箕铺镇'),
	(42, 02, 81, 170, N'汪仁镇'),
	(42, 02, 81, 200, N'茗山乡');

/* 湖北省 十堰市 茅箭区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 03, 02, 001, N'武当路街道办事处'),
	(42, 03, 02, 002, N'二堰街道办事处'),
	(42, 03, 02, 003, N'五堰街道办事处'),
	(42, 03, 02, 004, N'白浪开发区白浪街道办事处'),
	(42, 03, 02, 100, N'大川镇人民政府'),
	(42, 03, 02, 200, N'小川乡'),
	(42, 03, 02, 201, N'茅塔乡'),
	(42, 03, 02, 202, N'鸳鸯乡');

/* 湖北省 十堰市 张湾区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 03, 03, 001, N'花果街道'),
	(42, 03, 03, 002, N'红卫街道'),
	(42, 03, 03, 003, N'车城路街道'),
	(42, 03, 03, 004, N'汉江路街道'),
	(42, 03, 03, 100, N'黄龙镇'),
	(42, 03, 03, 101, N'柏林镇'),
	(42, 03, 03, 200, N'方滩乡'),
	(42, 03, 03, 201, N'西沟乡');

/* 湖北省 十堰市 郧阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 03, 04, 101, N'安阳镇'),
	(42, 03, 04, 102, N'杨溪铺镇'),
	(42, 03, 04, 103, N'青曲镇'),
	(42, 03, 04, 104, N'白桑关镇'),
	(42, 03, 04, 105, N'南化塘镇'),
	(42, 03, 04, 106, N'白浪镇'),
	(42, 03, 04, 107, N'刘洞镇'),
	(42, 03, 04, 108, N'谭山镇'),
	(42, 03, 04, 109, N'梅铺镇'),
	(42, 03, 04, 110, N'青山镇'),
	(42, 03, 04, 111, N'郧县经济开发区（茶店镇）'),
	(42, 03, 04, 112, N'柳陂镇'),
	(42, 03, 04, 113, N'鲍峡镇'),
	(42, 03, 04, 114, N'胡家营镇'),
	(42, 03, 04, 115, N'谭家湾镇'),
	(42, 03, 04, 117, N'郧县城关镇'),
	(42, 03, 04, 200, N'大柳乡'),
	(42, 03, 04, 201, N'五峰乡'),
	(42, 03, 04, 202, N'叶大乡');

/* 湖北省 十堰市 郧西县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 03, 22, 100, N'城关镇'),
	(42, 03, 22, 101, N'土门镇'),
	(42, 03, 22, 102, N'上津镇'),
	(42, 03, 22, 103, N'店子镇'),
	(42, 03, 22, 104, N'夹河镇'),
	(42, 03, 22, 105, N'羊尾镇'),
	(42, 03, 22, 106, N'观音镇'),
	(42, 03, 22, 107, N'马鞍镇'),
	(42, 03, 22, 108, N'河夹镇'),
	(42, 03, 22, 200, N'香口乡'),
	(42, 03, 22, 201, N'关防乡'),
	(42, 03, 22, 202, N'湖北口回族乡'),
	(42, 03, 22, 203, N'景阳乡'),
	(42, 03, 22, 204, N'六郎乡'),
	(42, 03, 22, 205, N'涧池乡'),
	(42, 03, 22, 206, N'安家乡');

/* 湖北省 十堰市 竹山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 03, 23, 100, N'城关镇'),
	(42, 03, 23, 101, N'溢水镇'),
	(42, 03, 23, 102, N'麻家渡镇'),
	(42, 03, 23, 103, N'宝丰镇'),
	(42, 03, 23, 104, N'擂鼓镇'),
	(42, 03, 23, 105, N'秦古镇'),
	(42, 03, 23, 106, N'得胜镇'),
	(42, 03, 23, 107, N'上庸镇'),
	(42, 03, 23, 108, N'官渡镇'),
	(42, 03, 23, 200, N'潘口乡'),
	(42, 03, 23, 201, N'竹坪乡'),
	(42, 03, 23, 202, N'大庙乡'),
	(42, 03, 23, 203, N'双台乡'),
	(42, 03, 23, 204, N'楼台乡'),
	(42, 03, 23, 205, N'文峰乡'),
	(42, 03, 23, 206, N'深河乡'),
	(42, 03, 23, 207, N'柳林乡');

/* 湖北省 十堰市 竹溪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 03, 24, 100, N'城关镇'),
	(42, 03, 24, 101, N'蒋家堰镇'),
	(42, 03, 24, 102, N'中峰镇'),
	(42, 03, 24, 103, N'水坪镇'),
	(42, 03, 24, 104, N'县河镇'),
	(42, 03, 24, 105, N'泉溪镇'),
	(42, 03, 24, 106, N'丰溪镇'),
	(42, 03, 24, 107, N'龙坝镇'),
	(42, 03, 24, 108, N'兵营镇'),
	(42, 03, 24, 109, N'汇湾镇'),
	(42, 03, 24, 110, N'新洲镇'),
	(42, 03, 24, 203, N'鄂坪乡'),
	(42, 03, 24, 205, N'天宝乡'),
	(42, 03, 24, 206, N'桃源乡'),
	(42, 03, 24, 207, N'向坝乡');

/* 湖北省 十堰市 房县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 03, 25, 100, N'城关镇'),
	(42, 03, 25, 101, N'军店镇'),
	(42, 03, 25, 102, N'化龙堰镇'),
	(42, 03, 25, 103, N'土城镇'),
	(42, 03, 25, 104, N'大木厂镇'),
	(42, 03, 25, 105, N'青峰镇'),
	(42, 03, 25, 106, N'门古寺镇'),
	(42, 03, 25, 107, N'白鹤镇'),
	(42, 03, 25, 108, N'野人谷镇'),
	(42, 03, 25, 109, N'红塔镇'),
	(42, 03, 25, 110, N'窑淮镇'),
	(42, 03, 25, 111, N'尹吉甫镇'),
	(42, 03, 25, 203, N'姚坪乡'),
	(42, 03, 25, 205, N'沙河乡'),
	(42, 03, 25, 206, N'万峪河乡'),
	(42, 03, 25, 208, N'上龛乡'),
	(42, 03, 25, 209, N'中坝乡'),
	(42, 03, 25, 210, N'九道乡'),
	(42, 03, 25, 211, N'回龙乡'),
	(42, 03, 25, 212, N'五台乡');

/* 湖北省 十堰市 丹江口市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 03, 81, 001, N'均州路街道办事处'),
	(42, 03, 81, 002, N'大坝路街道办事处'),
	(42, 03, 81, 003, N'丹赵路街道办事处'),
	(42, 03, 81, 005, N'三官殿街道办事处'),
	(42, 03, 81, 100, N'土关垭镇'),
	(42, 03, 81, 101, N'浪河镇'),
	(42, 03, 81, 102, N'丁家营镇'),
	(42, 03, 81, 103, N'六里坪镇'),
	(42, 03, 81, 104, N'盐池河镇'),
	(42, 03, 81, 105, N'均县镇'),
	(42, 03, 81, 106, N'习家店镇'),
	(42, 03, 81, 107, N'蒿坪镇'),
	(42, 03, 81, 108, N'石鼓镇'),
	(42, 03, 81, 109, N'凉水河镇'),
	(42, 03, 81, 110, N'官山镇'),
	(42, 03, 81, 111, N'龙山镇');

/* 湖北省 宜昌市 西陵区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 02, 001, N'西陵街道'),
	(42, 05, 02, 002, N'学院街道'),
	(42, 05, 02, 003, N'云集街道'),
	(42, 05, 02, 004, N'西坝街道'),
	(42, 05, 02, 005, N'葛洲坝街道'),
	(42, 05, 02, 006, N'夜明珠街道'),
	(42, 05, 02, 007, N'东苑街道办事处'),
	(42, 05, 02, 008, N'南苑街道办事处'),
	(42, 05, 02, 009, N'北苑街道办事处'),
	(42, 05, 02, 201, N'窑湾乡');

/* 湖北省 宜昌市 伍家岗区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 03, 001, N'大公桥街道办事处'),
	(42, 05, 03, 002, N'万寿桥街道办事处'),
	(42, 05, 03, 003, N'宝塔河街道办事处'),
	(42, 05, 03, 004, N'伍家岗街道办事处'),
	(42, 05, 03, 201, N'伍家乡');

/* 湖北省 宜昌市 点军区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 04, 001, N'点军街道办事处'),
	(42, 05, 04, 101, N'艾家镇'),
	(42, 05, 04, 102, N'桥边镇'),
	(42, 05, 04, 201, N'联棚乡'),
	(42, 05, 04, 202, N'土城乡');

/* 湖北省 宜昌市 猇亭区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 05, 001, N'古老背街道办事处'),
	(42, 05, 05, 002, N'虎牙街道办事处'),
	(42, 05, 05, 003, N'云池街道办事处');

/* 湖北省 宜昌市 夷陵区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 06, 001, N'小溪塔街道办'),
	(42, 05, 06, 002, N'夷陵经济开发区办事处'),
	(42, 05, 06, 101, N'樟村坪镇'),
	(42, 05, 06, 102, N'雾渡河镇'),
	(42, 05, 06, 103, N'分乡镇'),
	(42, 05, 06, 104, N'太平溪镇'),
	(42, 05, 06, 105, N'三斗坪镇'),
	(42, 05, 06, 106, N'乐天溪镇'),
	(42, 05, 06, 107, N'龙泉镇'),
	(42, 05, 06, 108, N'鸦鹊岭镇'),
	(42, 05, 06, 109, N'黄花镇'),
	(42, 05, 06, 201, N'下堡坪乡'),
	(42, 05, 06, 202, N'邓村乡');

/* 湖北省 宜昌市 远安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 25, 101, N'鸣凤镇'),
	(42, 05, 25, 102, N'花林寺镇'),
	(42, 05, 25, 103, N'旧县镇'),
	(42, 05, 25, 104, N'洋坪镇'),
	(42, 05, 25, 105, N'茅坪场镇'),
	(42, 05, 25, 106, N'荷花镇'),
	(42, 05, 25, 201, N'河口乡');

/* 湖北省 宜昌市 兴山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 26, 101, N'古夫镇'),
	(42, 05, 26, 102, N'昭君镇'),
	(42, 05, 26, 103, N'峡口镇'),
	(42, 05, 26, 104, N'南阳镇'),
	(42, 05, 26, 105, N'黄粮镇'),
	(42, 05, 26, 106, N'水月寺镇'),
	(42, 05, 26, 201, N'高桥乡'),
	(42, 05, 26, 202, N'榛子乡');

/* 湖北省 宜昌市 秭归县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 27, 101, N'茅坪镇'),
	(42, 05, 27, 102, N'归州镇'),
	(42, 05, 27, 103, N'屈原镇'),
	(42, 05, 27, 104, N'沙镇溪镇'),
	(42, 05, 27, 105, N'两河口镇'),
	(42, 05, 27, 106, N'郭家坝镇'),
	(42, 05, 27, 107, N'杨林桥镇'),
	(42, 05, 27, 108, N'九畹溪镇'),
	(42, 05, 27, 201, N'水田坝乡'),
	(42, 05, 27, 202, N'泄滩乡'),
	(42, 05, 27, 203, N'梅家河乡'),
	(42, 05, 27, 204, N'磨坪乡');

/* 湖北省 宜昌市 长阳土家族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 28, 101, N'龙舟坪镇'),
	(42, 05, 28, 102, N'高家堰镇'),
	(42, 05, 28, 103, N'磨市镇'),
	(42, 05, 28, 104, N'都镇湾镇'),
	(42, 05, 28, 105, N'资丘镇'),
	(42, 05, 28, 106, N'渔峡口镇'),
	(42, 05, 28, 107, N'榔坪镇'),
	(42, 05, 28, 108, N'贺家坪镇'),
	(42, 05, 28, 201, N'大堰乡'),
	(42, 05, 28, 202, N'鸭子口乡'),
	(42, 05, 28, 203, N'火烧坪乡');

/* 湖北省 宜昌市 五峰土家族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 29, 101, N'五峰镇'),
	(42, 05, 29, 102, N'长乐坪镇'),
	(42, 05, 29, 103, N'渔洋关镇'),
	(42, 05, 29, 104, N'仁和坪镇'),
	(42, 05, 29, 105, N'湾潭镇'),
	(42, 05, 29, 201, N'付家堰乡'),
	(42, 05, 29, 202, N'牛庄乡'),
	(42, 05, 29, 203, N'采花乡');

/* 湖北省 宜昌市 宜都市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 81, 001, N'陆城街道办事处'),
	(42, 05, 81, 100, N'红花套镇'),
	(42, 05, 81, 101, N'高坝洲镇'),
	(42, 05, 81, 102, N'聂家河镇'),
	(42, 05, 81, 103, N'松木坪镇'),
	(42, 05, 81, 104, N'枝城镇'),
	(42, 05, 81, 105, N'姚家店镇'),
	(42, 05, 81, 106, N'五眼泉镇'),
	(42, 05, 81, 107, N'王家畈镇'),
	(42, 05, 81, 200, N'潘家湾土家族乡');

/* 湖北省 宜昌市 当阳市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 82, 001, N'当阳市玉阳街道办事处'),
	(42, 05, 82, 002, N'当阳市坝陵街道办事处'),
	(42, 05, 82, 003, N'当阳市玉泉街道办事处'),
	(42, 05, 82, 101, N'当阳市两河镇'),
	(42, 05, 82, 102, N'当阳市河溶镇'),
	(42, 05, 82, 103, N'当阳市育溪镇'),
	(42, 05, 82, 104, N'当阳市庙前镇'),
	(42, 05, 82, 105, N'当阳市王店镇'),
	(42, 05, 82, 106, N'当阳市半月镇'),
	(42, 05, 82, 107, N'当阳市草埠湖镇');

/* 湖北省 宜昌市 枝江市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 05, 83, 001, N'马家店街道'),
	(42, 05, 83, 101, N'安福寺镇'),
	(42, 05, 83, 102, N'白洋镇'),
	(42, 05, 83, 103, N'顾家店镇'),
	(42, 05, 83, 104, N'董市镇'),
	(42, 05, 83, 105, N'仙女镇'),
	(42, 05, 83, 106, N'问安镇'),
	(42, 05, 83, 107, N'七星台镇'),
	(42, 05, 83, 108, N'百里洲镇');

/* 湖北省 襄阳市 襄城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 06, 02, 001, N'真武山街道办事处'),
	(42, 06, 02, 002, N'古城街道办事处'),
	(42, 06, 02, 003, N'庞公街道办事处'),
	(42, 06, 02, 004, N'檀溪街道办事处'),
	(42, 06, 02, 005, N'隆中街道办事处'),
	(42, 06, 02, 006, N'余家湖街道办事处'),
	(42, 06, 02, 100, N'欧庙镇'),
	(42, 06, 02, 101, N'卧龙镇'),
	(42, 06, 02, 200, N'尹集乡');

/* 湖北省 襄阳市 樊城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 06, 06, 001, N'汉江街道办事处'),
	(42, 06, 06, 002, N'王寨街道办事处'),
	(42, 06, 06, 003, N'中原街道办事处'),
	(42, 06, 06, 004, N'定中门街道办事处'),
	(42, 06, 06, 005, N'清河口街道办事处'),
	(42, 06, 06, 006, N'屏襄门街道办事处'),
	(42, 06, 06, 007, N'米公街道办事处'),
	(42, 06, 06, 008, N'柿铺街道办事处'),
	(42, 06, 06, 070, N'高新区紫贞街道办事处'),
	(42, 06, 06, 071, N'高新区七里河街道办事处'),
	(42, 06, 06, 072, N'高新区东风办事处'),
	(42, 06, 06, 100, N'牛首镇'),
	(42, 06, 06, 101, N'太平店镇'),
	(42, 06, 06, 170, N'高新区团山镇'),
	(42, 06, 06, 171, N'高新区米庄镇');

/* 湖北省 襄阳市 襄州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 06, 07, 001, N'张湾办事处'),
	(42, 06, 07, 002, N'刘集办事处'),
	(42, 06, 07, 003, N'肖湾办事处'),
	(42, 06, 07, 100, N'龙王镇'),
	(42, 06, 07, 101, N'石桥镇'),
	(42, 06, 07, 102, N'黄集镇'),
	(42, 06, 07, 103, N'伙牌镇'),
	(42, 06, 07, 104, N'古驿镇'),
	(42, 06, 07, 105, N'朱集镇'),
	(42, 06, 07, 106, N'程河镇'),
	(42, 06, 07, 107, N'双沟镇'),
	(42, 06, 07, 108, N'张家集镇'),
	(42, 06, 07, 109, N'黄龙镇'),
	(42, 06, 07, 110, N'峪山镇'),
	(42, 06, 07, 111, N'东津镇');

/* 湖北省 襄阳市 南漳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 06, 24, 100, N'城关镇'),
	(42, 06, 24, 101, N'武安镇'),
	(42, 06, 24, 102, N'九集镇'),
	(42, 06, 24, 103, N'李庙镇'),
	(42, 06, 24, 104, N'长坪镇'),
	(42, 06, 24, 105, N'薛坪镇'),
	(42, 06, 24, 106, N'板桥镇'),
	(42, 06, 24, 107, N'巡检镇'),
	(42, 06, 24, 108, N'东巩镇'),
	(42, 06, 24, 109, N'肖堰镇');

/* 湖北省 襄阳市 谷城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 06, 25, 100, N'城关镇'),
	(42, 06, 25, 101, N'石花镇'),
	(42, 06, 25, 102, N'盛康镇'),
	(42, 06, 25, 103, N'庙滩镇'),
	(42, 06, 25, 104, N'五山镇'),
	(42, 06, 25, 105, N'茨河镇'),
	(42, 06, 25, 106, N'南河镇'),
	(42, 06, 25, 107, N'紫金镇'),
	(42, 06, 25, 108, N'冷集镇'),
	(42, 06, 25, 200, N'赵湾乡');

/* 湖北省 襄阳市 保康县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 06, 26, 100, N'城关镇'),
	(42, 06, 26, 101, N'黄堡镇'),
	(42, 06, 26, 102, N'后坪镇'),
	(42, 06, 26, 103, N'龙坪镇'),
	(42, 06, 26, 104, N'店垭镇'),
	(42, 06, 26, 105, N'马良镇'),
	(42, 06, 26, 106, N'歇马镇'),
	(42, 06, 26, 107, N'马桥镇'),
	(42, 06, 26, 108, N'寺坪镇'),
	(42, 06, 26, 109, N'过渡湾镇'),
	(42, 06, 26, 200, N'两峪乡');

/* 湖北省 襄阳市 老河口市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 06, 82, 001, N'光化街道办事处'),
	(42, 06, 82, 002, N'酂阳街道办事处'),
	(42, 06, 82, 100, N'孟楼镇'),
	(42, 06, 82, 101, N'竹林桥镇'),
	(42, 06, 82, 102, N'薛集镇'),
	(42, 06, 82, 103, N'张集镇'),
	(42, 06, 82, 104, N'仙人渡镇'),
	(42, 06, 82, 105, N'洪山嘴镇'),
	(42, 06, 82, 106, N'李楼镇'),
	(42, 06, 82, 200, N'袁冲乡');

/* 湖北省 襄阳市 枣阳市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 06, 83, 001, N'北城街道办事处'),
	(42, 06, 83, 002, N'南城街道办事处'),
	(42, 06, 83, 003, N'环城街道办事处'),
	(42, 06, 83, 100, N'琚湾镇'),
	(42, 06, 83, 101, N'七方镇'),
	(42, 06, 83, 102, N'杨当镇'),
	(42, 06, 83, 103, N'太平镇'),
	(42, 06, 83, 104, N'新市镇'),
	(42, 06, 83, 105, N'鹿头镇'),
	(42, 06, 83, 106, N'刘升镇'),
	(42, 06, 83, 107, N'兴隆镇'),
	(42, 06, 83, 108, N'王城镇'),
	(42, 06, 83, 109, N'吴店镇'),
	(42, 06, 83, 110, N'熊集镇'),
	(42, 06, 83, 111, N'平林镇');

/* 湖北省 襄阳市 宜城市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 06, 84, 001, N'鄢城街道办事处'),
	(42, 06, 84, 002, N'南营街道办事处'),
	(42, 06, 84, 102, N'郑集镇'),
	(42, 06, 84, 103, N'小河镇'),
	(42, 06, 84, 104, N'刘猴镇'),
	(42, 06, 84, 105, N'孔湾镇'),
	(42, 06, 84, 106, N'流水镇'),
	(42, 06, 84, 107, N'板桥镇'),
	(42, 06, 84, 108, N'王集镇'),
	(42, 06, 84, 109, N'雷河镇');

/* 湖北省 鄂州市 梁子湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 07, 02, 100, N'太和镇'),
	(42, 07, 02, 101, N'东沟镇'),
	(42, 07, 02, 102, N'梁子生态管理区（镇）'),
	(42, 07, 02, 103, N'涂家垴镇'),
	(42, 07, 02, 104, N'沼山镇');

/* 湖北省 鄂州市 华容区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 07, 03, 100, N'华容镇'),
	(42, 07, 03, 101, N'葛店镇'),
	(42, 07, 03, 102, N'庙岭镇'),
	(42, 07, 03, 103, N'段店镇'),
	(42, 07, 03, 200, N'临江乡'),
	(42, 07, 03, 201, N'蒲团乡');

/* 湖北省 鄂州市 鄂城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 07, 04, 001, N'凤凰街道'),
	(42, 07, 04, 002, N'古楼街道'),
	(42, 07, 04, 003, N'西山街道'),
	(42, 07, 04, 100, N'泽林镇'),
	(42, 07, 04, 101, N'杜山镇'),
	(42, 07, 04, 102, N'新庙镇'),
	(42, 07, 04, 103, N'碧石镇'),
	(42, 07, 04, 104, N'汀祖镇'),
	(42, 07, 04, 105, N'燕矶镇'),
	(42, 07, 04, 106, N'杨叶镇'),
	(42, 07, 04, 107, N'花湖镇'),
	(42, 07, 04, 108, N'长港镇'),
	(42, 07, 04, 200, N'沙窝乡');

/* 湖北省 荆门市 东宝区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 08, 02, 001, N'龙泉街道办'),
	(42, 08, 02, 002, N'泉口街道办'),
	(42, 08, 02, 100, N'栗溪镇'),
	(42, 08, 02, 101, N'子陵镇'),
	(42, 08, 02, 102, N'漳河镇'),
	(42, 08, 02, 103, N'马河镇'),
	(42, 08, 02, 104, N'石桥驿镇'),
	(42, 08, 02, 105, N'牌楼镇'),
	(42, 08, 02, 200, N'仙居乡');

/* 湖北省 荆门市 掇刀区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 08, 04, 001, N'掇刀街道办事处'),
	(42, 08, 04, 002, N'白庙街道办事处'),
	(42, 08, 04, 003, N'兴隆街道办事处'),
	(42, 08, 04, 004, N'双喜街道办事处'),
	(42, 08, 04, 100, N'团林铺镇'),
	(42, 08, 04, 101, N'麻城镇');

/* 湖北省 荆门市 京山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 08, 21, 100, N'新市镇'),
	(42, 08, 21, 101, N'永兴镇'),
	(42, 08, 21, 102, N'曹武镇'),
	(42, 08, 21, 103, N'罗店镇'),
	(42, 08, 21, 104, N'宋河镇'),
	(42, 08, 21, 105, N'坪坝镇'),
	(42, 08, 21, 106, N'三阳镇'),
	(42, 08, 21, 107, N'绿林镇'),
	(42, 08, 21, 108, N'杨集镇'),
	(42, 08, 21, 109, N'孙桥镇'),
	(42, 08, 21, 110, N'石龙镇'),
	(42, 08, 21, 111, N'永隆镇'),
	(42, 08, 21, 112, N'雁门口镇'),
	(42, 08, 21, 113, N'钱场镇'),
	(42, 08, 21, 170, N'开发区（镇）');

/* 湖北省 荆门市 沙洋县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 08, 22, 100, N'沙洋镇'),
	(42, 08, 22, 101, N'五里铺镇'),
	(42, 08, 22, 102, N'十里铺镇'),
	(42, 08, 22, 103, N'纪山镇'),
	(42, 08, 22, 104, N'拾回桥镇'),
	(42, 08, 22, 105, N'后港镇'),
	(42, 08, 22, 106, N'毛李镇'),
	(42, 08, 22, 107, N'官当镇'),
	(42, 08, 22, 108, N'李市镇'),
	(42, 08, 22, 109, N'马良镇'),
	(42, 08, 22, 110, N'高阳镇'),
	(42, 08, 22, 111, N'沈集镇'),
	(42, 08, 22, 112, N'曾集镇');

/* 湖北省 荆门市 钟祥市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 08, 81, 001, N'郢中街道办事处'),
	(42, 08, 81, 100, N'洋梓镇'),
	(42, 08, 81, 101, N'长寿镇'),
	(42, 08, 81, 102, N'丰乐镇'),
	(42, 08, 81, 103, N'胡集镇'),
	(42, 08, 81, 104, N'双河镇'),
	(42, 08, 81, 105, N'磷矿镇'),
	(42, 08, 81, 106, N'文集镇'),
	(42, 08, 81, 107, N'冷水镇'),
	(42, 08, 81, 108, N'石牌镇'),
	(42, 08, 81, 109, N'旧口镇'),
	(42, 08, 81, 110, N'柴湖镇'),
	(42, 08, 81, 111, N'长滩镇'),
	(42, 08, 81, 112, N'东桥镇'),
	(42, 08, 81, 113, N'客店镇'),
	(42, 08, 81, 114, N'张集镇'),
	(42, 08, 81, 200, N'九里乡');

/* 湖北省 孝感市 孝南区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 09, 02, 001, N'孝南区书院街办事处'),
	(42, 09, 02, 002, N'孝南区新华街办事处'),
	(42, 09, 02, 003, N'孝南区广场街办事处'),
	(42, 09, 02, 004, N'孝南区车站街道办事处'),
	(42, 09, 02, 100, N'孝南区新铺镇'),
	(42, 09, 02, 101, N'孝南区西河镇'),
	(42, 09, 02, 102, N'孝南区杨店镇'),
	(42, 09, 02, 103, N'孝南区陡岗镇'),
	(42, 09, 02, 104, N'孝南区肖港镇'),
	(42, 09, 02, 105, N'孝南区毛陈镇'),
	(42, 09, 02, 106, N'孝南区三汊镇'),
	(42, 09, 02, 107, N'孝南区祝站镇'),
	(42, 09, 02, 200, N'孝南区朋兴乡'),
	(42, 09, 02, 201, N'孝南区卧龙乡'),
	(42, 09, 02, 202, N'孝南区闵集乡');

/* 湖北省 孝感市 孝昌县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 09, 21, 100, N'花园镇'),
	(42, 09, 21, 101, N'丰山镇'),
	(42, 09, 21, 102, N'周巷镇'),
	(42, 09, 21, 103, N'小河镇'),
	(42, 09, 21, 104, N'王店镇'),
	(42, 09, 21, 105, N'卫店镇'),
	(42, 09, 21, 106, N'白沙镇'),
	(42, 09, 21, 107, N'邹岗镇'),
	(42, 09, 21, 200, N'小悟乡'),
	(42, 09, 21, 201, N'季店乡'),
	(42, 09, 21, 202, N'花西乡'),
	(42, 09, 21, 203, N'陡山乡');

/* 湖北省 孝感市 大悟县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 09, 22, 100, N'城关镇'),
	(42, 09, 22, 101, N'阳平镇'),
	(42, 09, 22, 102, N'芳畈镇'),
	(42, 09, 22, 103, N'新城镇'),
	(42, 09, 22, 104, N'夏店镇'),
	(42, 09, 22, 105, N'刘集镇'),
	(42, 09, 22, 106, N'河口镇'),
	(42, 09, 22, 107, N'四姑镇'),
	(42, 09, 22, 108, N'吕王镇'),
	(42, 09, 22, 109, N'黄站镇'),
	(42, 09, 22, 110, N'宣化店镇'),
	(42, 09, 22, 111, N'丰店镇'),
	(42, 09, 22, 112, N'大新镇'),
	(42, 09, 22, 113, N'三里镇'),
	(42, 09, 22, 200, N'高店乡'),
	(42, 09, 22, 201, N'彭店乡'),
	(42, 09, 22, 202, N'东新乡');

/* 湖北省 孝感市 云梦县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 09, 23, 100, N'城关镇'),
	(42, 09, 23, 101, N'义堂镇'),
	(42, 09, 23, 102, N'曾店镇'),
	(42, 09, 23, 103, N'吴铺镇'),
	(42, 09, 23, 104, N'伍洛镇'),
	(42, 09, 23, 105, N'下辛店镇'),
	(42, 09, 23, 106, N'道桥镇'),
	(42, 09, 23, 107, N'隔蒲潭镇'),
	(42, 09, 23, 108, N'胡金店镇'),
	(42, 09, 23, 200, N'倒店乡'),
	(42, 09, 23, 201, N'沙河乡'),
	(42, 09, 23, 202, N'清明河乡');

/* 湖北省 孝感市 应城市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 09, 81, 001, N'城中街道办事处'),
	(42, 09, 81, 002, N'城北街道办事处'),
	(42, 09, 81, 003, N'四里棚街道办事处'),
	(42, 09, 81, 004, N'东马坊街道办事处'),
	(42, 09, 81, 005, N'长江埠街道办事处'),
	(42, 09, 81, 100, N'田店镇'),
	(42, 09, 81, 101, N'杨河镇'),
	(42, 09, 81, 102, N'三合镇'),
	(42, 09, 81, 103, N'郎君镇'),
	(42, 09, 81, 104, N'黄滩镇'),
	(42, 09, 81, 105, N'天鹅镇'),
	(42, 09, 81, 106, N'义和镇'),
	(42, 09, 81, 107, N'陈河镇'),
	(42, 09, 81, 108, N'杨岭镇'),
	(42, 09, 81, 109, N'汤池镇');

/* 湖北省 孝感市 安陆市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 09, 82, 001, N'府城街道办事处'),
	(42, 09, 82, 002, N'南城街道办事处'),
	(42, 09, 82, 100, N'赵棚镇'),
	(42, 09, 82, 101, N'李店镇'),
	(42, 09, 82, 102, N'巡店镇'),
	(42, 09, 82, 103, N'棠棣镇'),
	(42, 09, 82, 104, N'雷公镇'),
	(42, 09, 82, 105, N'王义贞镇'),
	(42, 09, 82, 106, N'烟店镇'),
	(42, 09, 82, 107, N'孛畈镇'),
	(42, 09, 82, 108, N'伏水镇'),
	(42, 09, 82, 200, N'陈店乡'),
	(42, 09, 82, 201, N'辛榨乡'),
	(42, 09, 82, 202, N'木梓乡'),
	(42, 09, 82, 203, N'接官乡');

/* 湖北省 孝感市 汉川市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 09, 84, 001, N'仙女山街道办事处'),
	(42, 09, 84, 002, N'汈东街道办事处'),
	(42, 09, 84, 100, N'马口镇'),
	(42, 09, 84, 101, N'脉旺镇'),
	(42, 09, 84, 102, N'城隍镇'),
	(42, 09, 84, 103, N'分水镇'),
	(42, 09, 84, 104, N'沉湖镇'),
	(42, 09, 84, 105, N'田二河镇'),
	(42, 09, 84, 106, N'回龙镇'),
	(42, 09, 84, 107, N'新堰镇'),
	(42, 09, 84, 108, N'垌塚镇'),
	(42, 09, 84, 109, N'麻河镇'),
	(42, 09, 84, 110, N'刘家隔镇'),
	(42, 09, 84, 111, N'新河镇'),
	(42, 09, 84, 112, N'庙头镇'),
	(42, 09, 84, 113, N'杨林沟镇'),
	(42, 09, 84, 200, N'西江乡'),
	(42, 09, 84, 201, N'湾潭乡'),
	(42, 09, 84, 202, N'南河乡'),
	(42, 09, 84, 203, N'马鞍乡'),
	(42, 09, 84, 204, N'里潭乡'),
	(42, 09, 84, 205, N'韩集乡');

/* 湖北省 荆州市 沙市区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 10, 02, 001, N'中山街道办事处'),
	(42, 10, 02, 002, N'崇文街道办事处'),
	(42, 10, 02, 003, N'解放街道办事处'),
	(42, 10, 02, 004, N'胜利街道办事处'),
	(42, 10, 02, 005, N'朝阳街道办事处'),
	(42, 10, 02, 100, N'锣场镇'),
	(42, 10, 02, 101, N'岑河镇'),
	(42, 10, 02, 102, N'观音当镇'),
	(42, 10, 02, 103, N'关沮镇'),
	(42, 10, 02, 200, N'立新乡');

/* 湖北省 荆州市 荆州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 10, 03, 001, N'西城街道办事处'),
	(42, 10, 03, 002, N'东城街道办事处'),
	(42, 10, 03, 003, N'城南街道办事处'),
	(42, 10, 03, 100, N'纪南镇'),
	(42, 10, 03, 101, N'川店镇'),
	(42, 10, 03, 102, N'马山镇'),
	(42, 10, 03, 103, N'八岭山镇'),
	(42, 10, 03, 104, N'李埠镇'),
	(42, 10, 03, 105, N'弥市镇'),
	(42, 10, 03, 106, N'郢城镇');

/* 湖北省 荆州市 公安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 10, 22, 100, N'埠河镇'),
	(42, 10, 22, 101, N'斗湖堤镇'),
	(42, 10, 22, 102, N'夹竹园镇'),
	(42, 10, 22, 103, N'闸口镇'),
	(42, 10, 22, 104, N'杨家厂镇'),
	(42, 10, 22, 105, N'麻豪口镇'),
	(42, 10, 22, 106, N'藕池镇'),
	(42, 10, 22, 107, N'黄山头镇'),
	(42, 10, 22, 108, N'孟家溪镇'),
	(42, 10, 22, 109, N'南平镇'),
	(42, 10, 22, 110, N'章庄铺镇'),
	(42, 10, 22, 111, N'狮子口镇'),
	(42, 10, 22, 112, N'斑竹垱镇'),
	(42, 10, 22, 113, N'毛家港镇'),
	(42, 10, 22, 200, N'甘家厂乡'),
	(42, 10, 22, 201, N'章田寺乡');

/* 湖北省 荆州市 监利县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 10, 23, 100, N'容城镇'),
	(42, 10, 23, 101, N'朱河镇'),
	(42, 10, 23, 102, N'新沟镇'),
	(42, 10, 23, 103, N'龚场镇'),
	(42, 10, 23, 104, N'周老嘴镇'),
	(42, 10, 23, 105, N'黄歇口镇'),
	(42, 10, 23, 106, N'汪桥镇'),
	(42, 10, 23, 107, N'程集镇'),
	(42, 10, 23, 108, N'分盐镇'),
	(42, 10, 23, 109, N'毛市镇'),
	(42, 10, 23, 110, N'福田寺镇'),
	(42, 10, 23, 111, N'上车湾镇'),
	(42, 10, 23, 112, N'汴河镇'),
	(42, 10, 23, 113, N'尺八镇'),
	(42, 10, 23, 114, N'白螺镇'),
	(42, 10, 23, 115, N'网市镇'),
	(42, 10, 23, 116, N'三洲镇'),
	(42, 10, 23, 117, N'桥市镇'),
	(42, 10, 23, 200, N'红城乡'),
	(42, 10, 23, 201, N'棋盘乡'),
	(42, 10, 23, 202, N'柘木乡');

/* 湖北省 荆州市 江陵县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 10, 24, 100, N'资市镇'),
	(42, 10, 24, 102, N'熊河镇'),
	(42, 10, 24, 103, N'白马寺镇'),
	(42, 10, 24, 104, N'沙岗镇'),
	(42, 10, 24, 105, N'普济镇'),
	(42, 10, 24, 106, N'郝穴镇'),
	(42, 10, 24, 200, N'马家寨乡'),
	(42, 10, 24, 201, N'秦市乡');

/* 湖北省 荆州市 石首市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 10, 81, 001, N'绣林街道办事处'),
	(42, 10, 81, 002, N'笔架山街道办事处'),
	(42, 10, 81, 100, N'新厂镇'),
	(42, 10, 81, 101, N'横沟市镇'),
	(42, 10, 81, 102, N'大垸镇'),
	(42, 10, 81, 103, N'小河口镇'),
	(42, 10, 81, 104, N'桃花山镇'),
	(42, 10, 81, 105, N'调关镇'),
	(42, 10, 81, 106, N'东升镇'),
	(42, 10, 81, 107, N'高基庙镇'),
	(42, 10, 81, 108, N'南口镇'),
	(42, 10, 81, 109, N'高陵镇'),
	(42, 10, 81, 110, N'团山寺镇'),
	(42, 10, 81, 200, N'久合垸乡');

/* 湖北省 荆州市 洪湖市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 10, 83, 001, N'新堤街道办事处'),
	(42, 10, 83, 002, N'滨湖街道办事处'),
	(42, 10, 83, 100, N'螺山镇'),
	(42, 10, 83, 101, N'乌林镇'),
	(42, 10, 83, 102, N'龙口镇'),
	(42, 10, 83, 103, N'燕窝镇'),
	(42, 10, 83, 104, N'新滩镇'),
	(42, 10, 83, 105, N'峰口镇'),
	(42, 10, 83, 106, N'曹市镇'),
	(42, 10, 83, 107, N'府场镇'),
	(42, 10, 83, 108, N'戴家场镇'),
	(42, 10, 83, 109, N'瞿家湾镇'),
	(42, 10, 83, 110, N'沙口镇'),
	(42, 10, 83, 111, N'万全镇'),
	(42, 10, 83, 112, N'汊河镇'),
	(42, 10, 83, 113, N'黄家口镇'),
	(42, 10, 83, 200, N'老湾乡');

/* 湖北省 荆州市 松滋市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 10, 87, 100, N'新江口镇'),
	(42, 10, 87, 101, N'南海镇'),
	(42, 10, 87, 102, N'八宝镇'),
	(42, 10, 87, 103, N'宛市镇'),
	(42, 10, 87, 104, N'老城镇'),
	(42, 10, 87, 105, N'陈店镇'),
	(42, 10, 87, 106, N'王家桥镇'),
	(42, 10, 87, 107, N'斯家场镇'),
	(42, 10, 87, 108, N'杨林市镇'),
	(42, 10, 87, 109, N'纸厂河镇'),
	(42, 10, 87, 110, N'街河市镇'),
	(42, 10, 87, 111, N'危水镇'),
	(42, 10, 87, 112, N'刘家场镇'),
	(42, 10, 87, 113, N'沙道观镇'),
	(42, 10, 87, 200, N'万家乡'),
	(42, 10, 87, 201, N'卸甲坪土家族乡');

/* 湖北省 黄冈市 黄州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 11, 02, 001, N'赤壁街道办事处'),
	(42, 11, 02, 002, N'东湖街道办事处'),
	(42, 11, 02, 003, N'禹王街道办事处'),
	(42, 11, 02, 004, N'南湖街道办事处'),
	(42, 11, 02, 100, N'路口镇'),
	(42, 11, 02, 101, N'堵城镇'),
	(42, 11, 02, 102, N'陈策楼镇'),
	(42, 11, 02, 200, N'陶店乡');

/* 湖北省 黄冈市 团风县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 11, 21, 100, N'团风镇'),
	(42, 11, 21, 101, N'淋山河镇'),
	(42, 11, 21, 102, N'方高坪镇'),
	(42, 11, 21, 103, N'回龙山镇'),
	(42, 11, 21, 104, N'马曹庙镇'),
	(42, 11, 21, 105, N'上巴河镇'),
	(42, 11, 21, 106, N'总路咀镇'),
	(42, 11, 21, 107, N'但店镇'),
	(42, 11, 21, 200, N'贾庙乡'),
	(42, 11, 21, 201, N'杜皮乡');

/* 湖北省 黄冈市 红安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 11, 22, 100, N'城关镇'),
	(42, 11, 22, 101, N'七里坪镇'),
	(42, 11, 22, 102, N'华河镇'),
	(42, 11, 22, 103, N'二程镇'),
	(42, 11, 22, 104, N'上新集镇'),
	(42, 11, 22, 105, N'高桥镇'),
	(42, 11, 22, 106, N'觅儿镇'),
	(42, 11, 22, 107, N'八里镇'),
	(42, 11, 22, 108, N'太平桥镇'),
	(42, 11, 22, 109, N'永河镇'),
	(42, 11, 22, 200, N'杏花乡');

/* 湖北省 黄冈市 罗田县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 11, 23, 100, N'凤山镇'),
	(42, 11, 23, 101, N'骆驼坳镇'),
	(42, 11, 23, 102, N'大河岸镇'),
	(42, 11, 23, 103, N'九资河镇'),
	(42, 11, 23, 104, N'胜利镇'),
	(42, 11, 23, 105, N'河铺镇'),
	(42, 11, 23, 106, N'三里畈镇'),
	(42, 11, 23, 107, N'匡河镇'),
	(42, 11, 23, 108, N'白庙河镇'),
	(42, 11, 23, 109, N'大崎镇'),
	(42, 11, 23, 200, N'白莲河乡'),
	(42, 11, 23, 203, N'平湖乡');

/* 湖北省 黄冈市 英山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 11, 24, 100, N'温泉镇'),
	(42, 11, 24, 101, N'南河镇'),
	(42, 11, 24, 102, N'红山镇'),
	(42, 11, 24, 103, N'金家铺镇'),
	(42, 11, 24, 104, N'石头咀镇'),
	(42, 11, 24, 105, N'草盘地镇'),
	(42, 11, 24, 106, N'雷家店镇'),
	(42, 11, 24, 107, N'杨柳湾镇'),
	(42, 11, 24, 200, N'方家咀乡'),
	(42, 11, 24, 201, N'孔家坊乡'),
	(42, 11, 24, 202, N'陶家河乡');

/* 湖北省 黄冈市 浠水县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 11, 25, 100, N'清泉镇'),
	(42, 11, 25, 101, N'巴河镇'),
	(42, 11, 25, 102, N'竹瓦镇'),
	(42, 11, 25, 103, N'汪岗镇'),
	(42, 11, 25, 104, N'团陂镇'),
	(42, 11, 25, 105, N'关口镇'),
	(42, 11, 25, 106, N'白莲镇'),
	(42, 11, 25, 107, N'蔡河镇'),
	(42, 11, 25, 108, N'洗马镇'),
	(42, 11, 25, 109, N'丁司垱镇'),
	(42, 11, 25, 110, N'散花镇'),
	(42, 11, 25, 111, N'兰溪镇'),
	(42, 11, 25, 200, N'绿杨乡');

/* 湖北省 黄冈市 蕲春县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 11, 26, 100, N'漕河镇'),
	(42, 11, 26, 101, N'赤东镇'),
	(42, 11, 26, 102, N'蕲州镇'),
	(42, 11, 26, 103, N'管窑镇'),
	(42, 11, 26, 104, N'彭思镇'),
	(42, 11, 26, 105, N'横车镇'),
	(42, 11, 26, 106, N'株林镇'),
	(42, 11, 26, 107, N'刘河镇'),
	(42, 11, 26, 108, N'狮子镇'),
	(42, 11, 26, 109, N'青石镇'),
	(42, 11, 26, 110, N'张榜镇'),
	(42, 11, 26, 111, N'大同镇'),
	(42, 11, 26, 112, N'檀林镇'),
	(42, 11, 26, 200, N'向桥乡');

/* 湖北省 黄冈市 黄梅县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 11, 27, 100, N'黄梅镇'),
	(42, 11, 27, 101, N'孔垄镇'),
	(42, 11, 27, 102, N'小池镇'),
	(42, 11, 27, 103, N'下新镇'),
	(42, 11, 27, 104, N'大河镇'),
	(42, 11, 27, 105, N'停前镇'),
	(42, 11, 27, 106, N'五祖镇'),
	(42, 11, 27, 107, N'濯港镇'),
	(42, 11, 27, 108, N'蔡山镇'),
	(42, 11, 27, 109, N'新开镇'),
	(42, 11, 27, 110, N'独山镇'),
	(42, 11, 27, 111, N'分路镇'),
	(42, 11, 27, 200, N'柳林乡'),
	(42, 11, 27, 201, N'杉木乡'),
	(42, 11, 27, 202, N'苦竹乡'),
	(42, 11, 27, 203, N'刘佐乡');

/* 湖北省 黄冈市 麻城市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 11, 81, 001, N'龙池办事处'),
	(42, 11, 81, 002, N'鼓楼办事处'),
	(42, 11, 81, 003, N'南湖办事处'),
	(42, 11, 81, 100, N'中馆驿镇'),
	(42, 11, 81, 101, N'宋埠镇'),
	(42, 11, 81, 102, N'歧亭镇'),
	(42, 11, 81, 103, N'白果镇'),
	(42, 11, 81, 104, N'夫子河镇'),
	(42, 11, 81, 105, N'阎家河镇'),
	(42, 11, 81, 106, N'龟山镇'),
	(42, 11, 81, 107, N'盐田河镇'),
	(42, 11, 81, 108, N'张家畈镇'),
	(42, 11, 81, 109, N'木子店镇'),
	(42, 11, 81, 110, N'三河口镇'),
	(42, 11, 81, 111, N'黄土岗镇'),
	(42, 11, 81, 112, N'福田河镇'),
	(42, 11, 81, 113, N'乘马岗镇'),
	(42, 11, 81, 114, N'顺河镇'),
	(42, 11, 81, 200, N'铁门岗乡');

/* 湖北省 黄冈市 武穴市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 11, 82, 001, N'武穴街道办事处'),
	(42, 11, 82, 002, N'刊江街道办事处'),
	(42, 11, 82, 003, N'田镇街道办事处'),
	(42, 11, 82, 004, N'万丈湖街道办事处'),
	(42, 11, 82, 100, N'梅川镇'),
	(42, 11, 82, 101, N'余川镇'),
	(42, 11, 82, 102, N'花桥镇'),
	(42, 11, 82, 103, N'大金镇'),
	(42, 11, 82, 104, N'石佛寺镇'),
	(42, 11, 82, 105, N'四望镇'),
	(42, 11, 82, 106, N'大法寺镇'),
	(42, 11, 82, 107, N'龙坪镇');

/* 湖北省 咸宁市 咸安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 12, 02, 001, N'温泉办事处'),
	(42, 12, 02, 002, N'浮山办事处'),
	(42, 12, 02, 003, N'永安办事处'),
	(42, 12, 02, 100, N'汀泗桥镇'),
	(42, 12, 02, 101, N'向阳湖镇'),
	(42, 12, 02, 102, N'官埠桥镇'),
	(42, 12, 02, 103, N'横沟桥镇'),
	(42, 12, 02, 104, N'贺胜桥镇'),
	(42, 12, 02, 105, N'双溪桥镇'),
	(42, 12, 02, 106, N'马桥镇'),
	(42, 12, 02, 107, N'桂花镇'),
	(42, 12, 02, 108, N'高桥镇'),
	(42, 12, 02, 200, N'大幕乡');

/* 湖北省 咸宁市 嘉鱼县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 12, 21, 100, N'陆溪镇'),
	(42, 12, 21, 101, N'高铁岭镇'),
	(42, 12, 21, 102, N'官桥镇'),
	(42, 12, 21, 103, N'鱼岳镇'),
	(42, 12, 21, 104, N'新街镇'),
	(42, 12, 21, 105, N'渡普镇'),
	(42, 12, 21, 106, N'潘家湾镇'),
	(42, 12, 21, 107, N'牌洲湾镇');

/* 湖北省 咸宁市 通城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 12, 22, 100, N'隽水镇'),
	(42, 12, 22, 101, N'麦市镇'),
	(42, 12, 22, 102, N'塘湖镇'),
	(42, 12, 22, 103, N'关刀镇'),
	(42, 12, 22, 104, N'沙堆镇'),
	(42, 12, 22, 105, N'五里镇'),
	(42, 12, 22, 106, N'石南镇'),
	(42, 12, 22, 107, N'北港镇'),
	(42, 12, 22, 108, N'马港镇'),
	(42, 12, 22, 200, N'四庄乡'),
	(42, 12, 22, 201, N'大坪乡');

/* 湖北省 咸宁市 崇阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 12, 23, 100, N'天城镇'),
	(42, 12, 23, 101, N'沙坪镇'),
	(42, 12, 23, 102, N'石城镇'),
	(42, 12, 23, 103, N'桂花泉镇'),
	(42, 12, 23, 104, N'白霓镇'),
	(42, 12, 23, 105, N'路口镇'),
	(42, 12, 23, 106, N'金塘镇'),
	(42, 12, 23, 107, N'青山镇'),
	(42, 12, 23, 200, N'肖岭乡'),
	(42, 12, 23, 201, N'铜钟乡'),
	(42, 12, 23, 202, N'港口乡'),
	(42, 12, 23, 203, N'高枧乡');

/* 湖北省 咸宁市 通山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 12, 24, 100, N'通羊镇'),
	(42, 12, 24, 101, N'南林桥镇'),
	(42, 12, 24, 102, N'黄沙铺镇'),
	(42, 12, 24, 103, N'厦铺镇'),
	(42, 12, 24, 104, N'九宫山镇'),
	(42, 12, 24, 105, N'闯王镇'),
	(42, 12, 24, 106, N'洪港镇'),
	(42, 12, 24, 107, N'大畈镇'),
	(42, 12, 24, 200, N'大路乡'),
	(42, 12, 24, 201, N'杨芳林乡'),
	(42, 12, 24, 202, N'燕厦乡'),
	(42, 12, 24, 203, N'慈口乡');

/* 湖北省 咸宁市 赤壁市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 12, 81, 001, N'蒲圻街道办事处'),
	(42, 12, 81, 002, N'赤马港街道办事处'),
	(42, 12, 81, 003, N'陆水湖街道办事处'),
	(42, 12, 81, 100, N'新店镇'),
	(42, 12, 81, 101, N'赵李桥镇'),
	(42, 12, 81, 102, N'茶庵岭镇'),
	(42, 12, 81, 103, N'车埠镇'),
	(42, 12, 81, 104, N'赤壁镇'),
	(42, 12, 81, 105, N'柳山湖镇'),
	(42, 12, 81, 106, N'神山镇'),
	(42, 12, 81, 107, N'中伙铺镇'),
	(42, 12, 81, 108, N'官塘驿镇'),
	(42, 12, 81, 109, N'黄盖湖镇'),
	(42, 12, 81, 200, N'余家桥乡');

/* 湖北省 随州市 曾都区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 13, 03, 001, N'西城街道（办事处）'),
	(42, 13, 03, 002, N'东城街道（办事处）'),
	(42, 13, 03, 003, N'南郊街道（办事处）'),
	(42, 13, 03, 004, N'北郊街道（办事处）'),
	(42, 13, 03, 005, N'城南新区办事处'),
	(42, 13, 03, 101, N'万店镇'),
	(42, 13, 03, 102, N'何店镇'),
	(42, 13, 03, 103, N'洛阳镇'),
	(42, 13, 03, 104, N'府河镇'),
	(42, 13, 03, 187, N'淅河镇');

/* 湖北省 随州市 随县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 13, 21, 101, N'厉山镇'),
	(42, 13, 21, 102, N'高城镇'),
	(42, 13, 21, 103, N'殷店镇'),
	(42, 13, 21, 104, N'草店镇'),
	(42, 13, 21, 105, N'小林镇'),
	(42, 13, 21, 106, N'淮河镇'),
	(42, 13, 21, 107, N'万和镇'),
	(42, 13, 21, 108, N'尚市镇'),
	(42, 13, 21, 109, N'唐县镇'),
	(42, 13, 21, 110, N'吴山镇'),
	(42, 13, 21, 111, N'新街镇'),
	(42, 13, 21, 112, N'安居镇'),
	(42, 13, 21, 113, N'环潭镇'),
	(42, 13, 21, 114, N'洪山镇'),
	(42, 13, 21, 115, N'长岗镇'),
	(42, 13, 21, 116, N'三里岗镇'),
	(42, 13, 21, 117, N'柳林镇'),
	(42, 13, 21, 118, N'均川镇'),
	(42, 13, 21, 119, N'万福店镇');

/* 湖北省 随州市 广水市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 13, 81, 001, N'应山街道办事处'),
	(42, 13, 81, 002, N'十里街道办事处'),
	(42, 13, 81, 003, N'广水街道办事处'),
	(42, 13, 81, 004, N'城郊街道办事处'),
	(42, 13, 81, 100, N'武胜关镇'),
	(42, 13, 81, 101, N'杨寨镇'),
	(42, 13, 81, 102, N'陈巷镇'),
	(42, 13, 81, 103, N'长岭镇'),
	(42, 13, 81, 104, N'马坪镇'),
	(42, 13, 81, 105, N'关庙镇'),
	(42, 13, 81, 106, N'余店镇'),
	(42, 13, 81, 107, N'吴店镇'),
	(42, 13, 81, 108, N'郝店镇'),
	(42, 13, 81, 109, N'蔡河镇'),
	(42, 13, 81, 110, N'李店镇'),
	(42, 13, 81, 111, N'太平镇'),
	(42, 13, 81, 112, N'骆店镇');

/* 湖北省 恩施土家族苗族自治州 恩施市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 28, 01, 001, N'舞阳坝街道办事处'),
	(42, 28, 01, 002, N'六角亭街道办事处'),
	(42, 28, 01, 003, N'小渡船街道办事处'),
	(42, 28, 01, 100, N'龙凤镇'),
	(42, 28, 01, 101, N'崔坝镇'),
	(42, 28, 01, 102, N'板桥镇'),
	(42, 28, 01, 103, N'白杨坪镇'),
	(42, 28, 01, 200, N'三岔乡'),
	(42, 28, 01, 201, N'新塘乡'),
	(42, 28, 01, 202, N'红土乡'),
	(42, 28, 01, 203, N'沙地乡'),
	(42, 28, 01, 204, N'太阳河乡'),
	(42, 28, 01, 205, N'屯堡乡'),
	(42, 28, 01, 206, N'白果乡'),
	(42, 28, 01, 207, N'芭蕉侗族乡'),
	(42, 28, 01, 208, N'盛家坝乡');

/* 湖北省 恩施土家族苗族自治州 利川市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 28, 02, 001, N'都亭街道办事处'),
	(42, 28, 02, 002, N'东城街道办事处'),
	(42, 28, 02, 100, N'谋道镇'),
	(42, 28, 02, 101, N'柏杨坝镇'),
	(42, 28, 02, 102, N'汪营镇'),
	(42, 28, 02, 103, N'建南镇'),
	(42, 28, 02, 104, N'忠路镇'),
	(42, 28, 02, 105, N'团堡镇'),
	(42, 28, 02, 106, N'毛坝镇'),
	(42, 28, 02, 200, N'凉雾乡'),
	(42, 28, 02, 201, N'元堡乡'),
	(42, 28, 02, 202, N'南坪乡'),
	(42, 28, 02, 203, N'文斗乡'),
	(42, 28, 02, 205, N'沙溪乡');

/* 湖北省 恩施土家族苗族自治州 建始县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 28, 22, 100, N'业州镇'),
	(42, 28, 22, 101, N'高坪镇'),
	(42, 28, 22, 102, N'红岩寺镇'),
	(42, 28, 22, 103, N'景阳镇'),
	(42, 28, 22, 104, N'官店镇'),
	(42, 28, 22, 105, N'花坪镇'),
	(42, 28, 22, 200, N'长梁乡'),
	(42, 28, 22, 201, N'茅田乡'),
	(42, 28, 22, 202, N'龙坪乡'),
	(42, 28, 22, 203, N'三里乡');

/* 湖北省 恩施土家族苗族自治州 巴东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 28, 23, 100, N'信陵镇'),
	(42, 28, 23, 101, N'东瀼口镇'),
	(42, 28, 23, 102, N'沿渡河镇'),
	(42, 28, 23, 103, N'官渡口镇'),
	(42, 28, 23, 104, N'茶店子镇'),
	(42, 28, 23, 105, N'绿葱坡镇'),
	(42, 28, 23, 106, N'大支坪镇'),
	(42, 28, 23, 107, N'野三关镇'),
	(42, 28, 23, 108, N'水布垭镇'),
	(42, 28, 23, 109, N'清太坪镇'),
	(42, 28, 23, 200, N'溪丘湾乡'),
	(42, 28, 23, 201, N'金果坪乡');

/* 湖北省 恩施土家族苗族自治州 宣恩县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 28, 25, 100, N'珠山镇'),
	(42, 28, 25, 101, N'椒园镇'),
	(42, 28, 25, 102, N'沙道沟镇'),
	(42, 28, 25, 103, N'李家河镇'),
	(42, 28, 25, 104, N'高罗镇'),
	(42, 28, 25, 200, N'万寨乡'),
	(42, 28, 25, 201, N'长潭河侗族乡'),
	(42, 28, 25, 203, N'晓关侗族乡'),
	(42, 28, 25, 205, N'椿木营乡');

/* 湖北省 恩施土家族苗族自治州 咸丰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 28, 26, 100, N'高乐山镇'),
	(42, 28, 26, 101, N'忠堡镇'),
	(42, 28, 26, 102, N'坪坝营镇'),
	(42, 28, 26, 103, N'朝阳寺镇'),
	(42, 28, 26, 104, N'清坪镇'),
	(42, 28, 26, 105, N'唐崖镇'),
	(42, 28, 26, 200, N'丁寨乡'),
	(42, 28, 26, 202, N'活龙坪乡'),
	(42, 28, 26, 203, N'小村乡'),
	(42, 28, 26, 204, N'黄金洞乡');

/* 湖北省 恩施土家族苗族自治州 来凤县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 28, 27, 100, N'翔凤镇'),
	(42, 28, 27, 101, N'百福司镇'),
	(42, 28, 27, 102, N'大河镇'),
	(42, 28, 27, 103, N'绿水镇'),
	(42, 28, 27, 104, N'旧司镇'),
	(42, 28, 27, 105, N'革勒车镇'),
	(42, 28, 27, 200, N'漫水乡'),
	(42, 28, 27, 202, N'三胡乡');

/* 湖北省 恩施土家族苗族自治州 鹤峰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 28, 28, 100, N'走马镇'),
	(42, 28, 28, 101, N'容美镇'),
	(42, 28, 28, 102, N'太平镇'),
	(42, 28, 28, 103, N'燕子镇'),
	(42, 28, 28, 104, N'中营镇'),
	(42, 28, 28, 200, N'铁炉乡'),
	(42, 28, 28, 201, N'五里乡'),
	(42, 28, 28, 203, N'下坪乡'),
	(42, 28, 28, 204, N'邬阳乡');

/* 湖北省 省直辖县级行政区划 仙桃市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 90, 04, 001, N'沙嘴街道办事处'),
	(42, 90, 04, 002, N'干河街道办事处'),
	(42, 90, 04, 003, N'龙华山办事处'),
	(42, 90, 04, 100, N'郑场镇'),
	(42, 90, 04, 101, N'毛嘴镇'),
	(42, 90, 04, 102, N'豆河镇'),
	(42, 90, 04, 103, N'三伏潭镇'),
	(42, 90, 04, 104, N'胡场镇'),
	(42, 90, 04, 105, N'长倘口镇'),
	(42, 90, 04, 106, N'西流河镇'),
	(42, 90, 04, 107, N'沙湖镇'),
	(42, 90, 04, 108, N'杨林尾镇'),
	(42, 90, 04, 109, N'彭场镇'),
	(42, 90, 04, 110, N'张沟镇'),
	(42, 90, 04, 111, N'郭河镇'),
	(42, 90, 04, 112, N'沔城回族镇'),
	(42, 90, 04, 113, N'通海口镇'),
	(42, 90, 04, 114, N'陈场镇');

/* 湖北省 省直辖县级行政区划 潜江市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 90, 05, 001, N'园林办事处'),
	(42, 90, 05, 002, N'杨市办事处'),
	(42, 90, 05, 003, N'周矶办事处'),
	(42, 90, 05, 004, N'广华办事处'),
	(42, 90, 05, 005, N'泰丰办事处'),
	(42, 90, 05, 006, N'高场办事处'),
	(42, 90, 05, 100, N'竹根滩镇'),
	(42, 90, 05, 101, N'渔洋镇'),
	(42, 90, 05, 102, N'王场镇'),
	(42, 90, 05, 103, N'高石碑镇'),
	(42, 90, 05, 104, N'熊口镇'),
	(42, 90, 05, 105, N'老新镇'),
	(42, 90, 05, 106, N'浩口镇'),
	(42, 90, 05, 107, N'积玉口镇'),
	(42, 90, 05, 108, N'张金镇'),
	(42, 90, 05, 109, N'龙湾镇');

/* 湖北省 省直辖县级行政区划 天门市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 90, 06, 001, N'竟陵街道办事处'),
	(42, 90, 06, 002, N'侨乡街道开发区'),
	(42, 90, 06, 003, N'杨林街道办事处'),
	(42, 90, 06, 100, N'多宝镇'),
	(42, 90, 06, 101, N'拖市镇'),
	(42, 90, 06, 102, N'张港镇'),
	(42, 90, 06, 103, N'蒋场镇'),
	(42, 90, 06, 104, N'汪场镇'),
	(42, 90, 06, 105, N'渔薪镇'),
	(42, 90, 06, 106, N'黄潭镇'),
	(42, 90, 06, 107, N'岳口镇'),
	(42, 90, 06, 108, N'横林镇'),
	(42, 90, 06, 109, N'彭市镇'),
	(42, 90, 06, 110, N'麻洋镇'),
	(42, 90, 06, 111, N'多祥镇'),
	(42, 90, 06, 112, N'干驿镇'),
	(42, 90, 06, 113, N'马湾镇'),
	(42, 90, 06, 114, N'卢市镇'),
	(42, 90, 06, 115, N'小板镇'),
	(42, 90, 06, 116, N'九真镇'),
	(42, 90, 06, 118, N'皂市镇'),
	(42, 90, 06, 119, N'胡市镇'),
	(42, 90, 06, 120, N'石河镇'),
	(42, 90, 06, 121, N'佛子山镇'),
	(42, 90, 06, 201, N'净潭乡');

/* 湖北省 省直辖县级行政区划 神农架林区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(42, 90, 21, 100, N'松柏镇'),
	(42, 90, 21, 101, N'阳日镇'),
	(42, 90, 21, 102, N'木鱼镇'),
	(42, 90, 21, 103, N'红坪镇'),
	(42, 90, 21, 104, N'新华镇'),
	(42, 90, 21, 105, N'九湖镇'),
	(42, 90, 21, 200, N'宋洛乡'),
	(42, 90, 21, 202, N'下谷坪土家族乡');


/* 湖南省 长沙市 芙蓉区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 01, 02, 001, N'文艺路街道'),
	(43, 01, 02, 002, N'朝阳街街道'),
	(43, 01, 02, 003, N'韭菜园街道'),
	(43, 01, 02, 008, N'五里牌街道'),
	(43, 01, 02, 009, N'火星街道'),
	(43, 01, 02, 010, N'马王堆街道'),
	(43, 01, 02, 011, N'东屯渡街道'),
	(43, 01, 02, 012, N'湘湖街道'),
	(43, 01, 02, 013, N'定王台街道'),
	(43, 01, 02, 014, N'荷花园街道'),
	(43, 01, 02, 015, N'东岸街道'),
	(43, 01, 02, 016, N'马坡岭街道'),
	(43, 01, 02, 017, N'东湖街道');

/* 湖南省 长沙市 天心区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 01, 03, 002, N'坡子街街道'),
	(43, 01, 03, 004, N'城南路街道'),
	(43, 01, 03, 005, N'裕南街街道'),
	(43, 01, 03, 006, N'金盆岭街道'),
	(43, 01, 03, 007, N'新开铺街道'),
	(43, 01, 03, 008, N'青园街道'),
	(43, 01, 03, 009, N'桂花坪街道'),
	(43, 01, 03, 010, N'赤岭路街道'),
	(43, 01, 03, 011, N'文源街道'),
	(43, 01, 03, 012, N'先锋街道'),
	(43, 01, 03, 013, N'黑石铺街道'),
	(43, 01, 03, 014, N'大托铺街道'),
	(43, 01, 03, 015, N'暮云街道'),
	(43, 01, 03, 016, N'南托街道');

/* 湖南省 长沙市 岳麓区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 01, 04, 001, N'望月湖街道'),
	(43, 01, 04, 002, N'岳麓街道'),
	(43, 01, 04, 003, N'桔子洲街道'),
	(43, 01, 04, 004, N'银盆岭街道'),
	(43, 01, 04, 005, N'观沙岭街道'),
	(43, 01, 04, 006, N'望城坡街道'),
	(43, 01, 04, 007, N'西湖街道'),
	(43, 01, 04, 008, N'咸嘉湖街道'),
	(43, 01, 04, 009, N'望岳街道'),
	(43, 01, 04, 010, N'梅溪湖街道'),
	(43, 01, 04, 011, N'麓谷街道'),
	(43, 01, 04, 012, N'坪塘街道'),
	(43, 01, 04, 013, N'含浦街道'),
	(43, 01, 04, 014, N'天顶街道'),
	(43, 01, 04, 015, N'洋湖街道'),
	(43, 01, 04, 016, N'学士街道'),
	(43, 01, 04, 100, N'东方红镇'),
	(43, 01, 04, 102, N'莲花镇'),
	(43, 01, 04, 105, N'雨敞坪镇');

/* 湖南省 长沙市 开福区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 01, 05, 001, N'芙蓉北路街道'),
	(43, 01, 05, 002, N'东风路街道'),
	(43, 01, 05, 003, N'清水塘街道'),
	(43, 01, 05, 004, N'望麓园街道'),
	(43, 01, 05, 005, N'湘雅路街道'),
	(43, 01, 05, 006, N'伍家岭街道'),
	(43, 01, 05, 009, N'新河街道'),
	(43, 01, 05, 010, N'通泰街街道'),
	(43, 01, 05, 012, N'四方坪街道'),
	(43, 01, 05, 013, N'洪山街道'),
	(43, 01, 05, 014, N'浏阳河街道'),
	(43, 01, 05, 015, N'月湖街道'),
	(43, 01, 05, 016, N'秀峰街道'),
	(43, 01, 05, 017, N'新港街道'),
	(43, 01, 05, 019, N'沙坪街道'),
	(43, 01, 05, 020, N'捞刀河街道'),
	(43, 01, 05, 102, N'青竹湖镇');

/* 湖南省 长沙市 雨花区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 01, 11, 001, N'侯家塘街道'),
	(43, 01, 11, 002, N'左家塘街道'),
	(43, 01, 11, 003, N'圭塘街道'),
	(43, 01, 11, 004, N'砂子塘街道'),
	(43, 01, 11, 005, N'东塘街道'),
	(43, 01, 11, 006, N'雨花亭街道'),
	(43, 01, 11, 007, N'高桥街道'),
	(43, 01, 11, 008, N'洞井街道'),
	(43, 01, 11, 009, N'黎托街道'),
	(43, 01, 11, 010, N'井湾子街道'),
	(43, 01, 11, 011, N'同升街道'),
	(43, 01, 11, 012, N'东山街道'),
	(43, 01, 11, 101, N'跳马镇');

/* 湖南省 长沙市 望城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 01, 12, 001, N'高塘岭街道'),
	(43, 01, 12, 002, N'喻家坡街道'),
	(43, 01, 12, 003, N'丁字湾街道'),
	(43, 01, 12, 004, N'书堂山街道'),
	(43, 01, 12, 005, N'大泽湖街道'),
	(43, 01, 12, 006, N'月亮岛街道'),
	(43, 01, 12, 007, N'白沙洲街道'),
	(43, 01, 12, 008, N'金山桥街道'),
	(43, 01, 12, 009, N'黄金园街道'),
	(43, 01, 12, 010, N'廖家坪街道'),
	(43, 01, 12, 101, N'桥驿镇'),
	(43, 01, 12, 103, N'茶亭镇'),
	(43, 01, 12, 104, N'东城镇'),
	(43, 01, 12, 105, N'铜官镇'),
	(43, 01, 12, 106, N'靖港镇'),
	(43, 01, 12, 107, N'乔口镇'),
	(43, 01, 12, 108, N'乌山镇'),
	(43, 01, 12, 110, N'雷锋镇'),
	(43, 01, 12, 115, N'白箬铺镇'),
	(43, 01, 12, 117, N'格塘镇'),
	(43, 01, 12, 201, N'新康乡');

/* 湖南省 长沙市 长沙县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 01, 21, 001, N'星沙街道'),
	(43, 01, 21, 002, N'泉塘街道'),
	(43, 01, 21, 003, N'湘龙街道'),
	(43, 01, 21, 004, N'榔梨街道'),
	(43, 01, 21, 005, N'长龙街道'),
	(43, 01, 21, 102, N'黄兴镇'),
	(43, 01, 21, 104, N'江背镇'),
	(43, 01, 21, 105, N'黄花镇'),
	(43, 01, 21, 106, N'春华镇'),
	(43, 01, 21, 107, N'果园镇'),
	(43, 01, 21, 108, N'路口镇'),
	(43, 01, 21, 109, N'高桥镇'),
	(43, 01, 21, 110, N'金井镇'),
	(43, 01, 21, 111, N'福临镇'),
	(43, 01, 21, 112, N'青山铺镇'),
	(43, 01, 21, 113, N'安沙镇'),
	(43, 01, 21, 114, N'北山镇'),
	(43, 01, 21, 115, N'双江镇'),
	(43, 01, 21, 116, N'开慧镇'),
	(43, 01, 21, 118, N'白沙镇'),
	(43, 01, 21, 119, N'干杉镇');

/* 湖南省 长沙市 宁乡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 01, 24, 001, N'玉潭街道'),
	(43, 01, 24, 002, N'白马桥街道'),
	(43, 01, 24, 003, N'历经铺街道'),
	(43, 01, 24, 004, N'城郊街道'),
	(43, 01, 24, 101, N'道林镇'),
	(43, 01, 24, 102, N'花明楼镇'),
	(43, 01, 24, 103, N'东湖塘镇'),
	(43, 01, 24, 104, N'夏铎铺镇'),
	(43, 01, 24, 105, N'双江口镇'),
	(43, 01, 24, 106, N'煤炭坝镇'),
	(43, 01, 24, 107, N'坝塘镇'),
	(43, 01, 24, 108, N'偕乐桥镇'),
	(43, 01, 24, 109, N'灰汤镇'),
	(43, 01, 24, 110, N'双凫铺镇'),
	(43, 01, 24, 111, N'老粮仓镇'),
	(43, 01, 24, 112, N'流沙河镇'),
	(43, 01, 24, 113, N'巷子口镇'),
	(43, 01, 24, 114, N'龙田镇'),
	(43, 01, 24, 116, N'横市镇'),
	(43, 01, 24, 117, N'回龙铺镇'),
	(43, 01, 24, 118, N'黄材镇'),
	(43, 01, 24, 119, N'大成桥镇'),
	(43, 01, 24, 120, N'青山桥镇'),
	(43, 01, 24, 121, N'金洲镇'),
	(43, 01, 24, 122, N'大屯营镇'),
	(43, 01, 24, 123, N'资福镇'),
	(43, 01, 24, 202, N'朱良桥乡'),
	(43, 01, 24, 203, N'菁华铺乡'),
	(43, 01, 24, 205, N'南田坪乡'),
	(43, 01, 24, 207, N'枫木桥乡'),
	(43, 01, 24, 209, N'喻家坳乡'),
	(43, 01, 24, 213, N'沙田乡'),
	(43, 01, 24, 218, N'沩山乡');

/* 湖南省 长沙市 浏阳市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 01, 81, 001, N'淮川街道'),
	(43, 01, 81, 002, N'集里街道'),
	(43, 01, 81, 003, N'荷花街道'),
	(43, 01, 81, 004, N'关口街道'),
	(43, 01, 81, 102, N'社港镇'),
	(43, 01, 81, 104, N'官渡镇'),
	(43, 01, 81, 105, N'张坊镇'),
	(43, 01, 81, 106, N'达浒镇'),
	(43, 01, 81, 107, N'沿溪镇'),
	(43, 01, 81, 108, N'古港镇'),
	(43, 01, 81, 109, N'永和镇'),
	(43, 01, 81, 110, N'大瑶镇'),
	(43, 01, 81, 111, N'金刚镇'),
	(43, 01, 81, 112, N'文家市镇'),
	(43, 01, 81, 113, N'太平桥镇'),
	(43, 01, 81, 114, N'枨冲镇'),
	(43, 01, 81, 115, N'镇头镇'),
	(43, 01, 81, 116, N'普迹镇'),
	(43, 01, 81, 117, N'永安镇'),
	(43, 01, 81, 118, N'北盛镇'),
	(43, 01, 81, 120, N'龙伏镇'),
	(43, 01, 81, 121, N'澄潭江镇'),
	(43, 01, 81, 122, N'中和镇'),
	(43, 01, 81, 123, N'柏加镇'),
	(43, 01, 81, 124, N'洞阳镇'),
	(43, 01, 81, 125, N'大围山镇'),
	(43, 01, 81, 126, N'沙市镇'),
	(43, 01, 81, 127, N'淳口镇'),
	(43, 01, 81, 128, N'高坪镇'),
	(43, 01, 81, 129, N'三口镇'),
	(43, 01, 81, 130, N'官桥镇'),
	(43, 01, 81, 201, N'小河乡'),
	(43, 01, 81, 202, N'七宝山乡'),
	(43, 01, 81, 205, N'溪江乡'),
	(43, 01, 81, 206, N'杨花乡'),
	(43, 01, 81, 207, N'葛家乡'),
	(43, 01, 81, 211, N'蕉溪乡');

/* 湖南省 株洲市 荷塘区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 02, 02, 001, N'月塘街道'),
	(43, 02, 02, 002, N'茨菇塘街道'),
	(43, 02, 02, 003, N'宋家桥街道'),
	(43, 02, 02, 004, N'桂花街道'),
	(43, 02, 02, 005, N'金山街道'),
	(43, 02, 02, 100, N'仙庾镇'),
	(43, 02, 02, 201, N'明照乡');

/* 湖南省 株洲市 芦淞区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 02, 03, 001, N'贺家土街道'),
	(43, 02, 03, 002, N'建设街道'),
	(43, 02, 03, 003, N'建宁街道'),
	(43, 02, 03, 004, N'董家段街道'),
	(43, 02, 03, 005, N'庆云街道'),
	(43, 02, 03, 006, N'枫溪街道'),
	(43, 02, 03, 007, N'龙泉街道'),
	(43, 02, 03, 100, N'白关镇'),
	(43, 02, 03, 201, N'五里墩乡'),
	(43, 02, 03, 202, N'姚家坝乡');

/* 湖南省 株洲市 石峰区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 02, 04, 001, N'田心街道'),
	(43, 02, 04, 002, N'响石岭街道'),
	(43, 02, 04, 003, N'清水塘街道'),
	(43, 02, 04, 004, N'铜塘湾街道'),
	(43, 02, 04, 005, N'井龙街道');

/* 湖南省 株洲市 天元区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 02, 11, 001, N'嵩山路街道'),
	(43, 02, 11, 002, N'泰山路街道'),
	(43, 02, 11, 003, N'栗雨街道'),
	(43, 02, 11, 100, N'马家河镇'),
	(43, 02, 11, 101, N'群丰镇'),
	(43, 02, 11, 102, N'雷打石镇'),
	(43, 02, 11, 103, N'三门镇');

/* 湖南省 株洲市 株洲县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 02, 21, 100, N'渌口镇'),
	(43, 02, 21, 101, N'朱亭镇'),
	(43, 02, 21, 106, N'古岳峰镇'),
	(43, 02, 21, 107, N'淦田镇'),
	(43, 02, 21, 200, N'龙凤乡'),
	(43, 02, 21, 201, N'龙潭乡'),
	(43, 02, 21, 202, N'砖桥乡'),
	(43, 02, 21, 203, N'平山乡'),
	(43, 02, 21, 207, N'洲坪乡'),
	(43, 02, 21, 208, N'南阳桥乡'),
	(43, 02, 21, 209, N'仙井乡'),
	(43, 02, 21, 212, N'堂市乡'),
	(43, 02, 21, 213, N'王十万乡'),
	(43, 02, 21, 214, N'太湖乡');

/* 湖南省 株洲市 攸县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 02, 23, 001, N'联星街道办事处'),
	(43, 02, 23, 002, N'江桥街道办事处'),
	(43, 02, 23, 003, N'春联街道办事处'),
	(43, 02, 23, 004, N'谭桥街道办事处'),
	(43, 02, 23, 102, N'酒埠江镇'),
	(43, 02, 23, 103, N'桃水镇'),
	(43, 02, 23, 106, N'网岭镇'),
	(43, 02, 23, 109, N'渌田镇'),
	(43, 02, 23, 110, N'柏市镇'),
	(43, 02, 23, 111, N'大同桥镇'),
	(43, 02, 23, 115, N'石羊塘镇'),
	(43, 02, 23, 118, N'黄丰桥镇'),
	(43, 02, 23, 119, N'鸾山镇'),
	(43, 02, 23, 120, N'丫江桥镇'),
	(43, 02, 23, 121, N'上云桥镇'),
	(43, 02, 23, 122, N'皇图岭镇'),
	(43, 02, 23, 123, N'新市镇'),
	(43, 02, 23, 124, N'菜花坪镇'),
	(43, 02, 23, 125, N'莲塘坳镇'),
	(43, 02, 23, 204, N'湖南坳乡'),
	(43, 02, 23, 205, N'坪阳庙乡'),
	(43, 02, 23, 207, N'槚山乡'),
	(43, 02, 23, 212, N'鸭塘铺乡');

/* 湖南省 株洲市 茶陵县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 02, 24, 001, N'城关街道办事处'),
	(43, 02, 24, 002, N'下东街道办事处'),
	(43, 02, 24, 003, N'思聪街道办事处'),
	(43, 02, 24, 004, N'洣江街道办事处'),
	(43, 02, 24, 101, N'界首镇'),
	(43, 02, 24, 103, N'湖口镇'),
	(43, 02, 24, 104, N'浣溪镇'),
	(43, 02, 24, 105, N'马江镇'),
	(43, 02, 24, 106, N'高陇镇'),
	(43, 02, 24, 108, N'潞水镇'),
	(43, 02, 24, 109, N'虎踞镇'),
	(43, 02, 24, 110, N'平水镇'),
	(43, 02, 24, 111, N'枣市镇'),
	(43, 02, 24, 112, N'火田镇'),
	(43, 02, 24, 113, N'严塘镇'),
	(43, 02, 24, 114, N'腰陂镇'),
	(43, 02, 24, 115, N'秩堂镇'),
	(43, 02, 24, 203, N'舲舫乡'),
	(43, 02, 24, 207, N'八团乡'),
	(43, 02, 24, 213, N'桃坑乡');

/* 湖南省 株洲市 炎陵县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 02, 25, 100, N'霞阳镇'),
	(43, 02, 25, 101, N'沔渡镇'),
	(43, 02, 25, 102, N'十都镇'),
	(43, 02, 25, 103, N'水口镇'),
	(43, 02, 25, 104, N'三河镇'),
	(43, 02, 25, 105, N'鹿原镇'),
	(43, 02, 25, 200, N'垄溪乡'),
	(43, 02, 25, 201, N'石洲乡'),
	(43, 02, 25, 202, N'策源乡'),
	(43, 02, 25, 203, N'下村乡'),
	(43, 02, 25, 204, N'中村乡'),
	(43, 02, 25, 205, N'龙渣瑶族乡'),
	(43, 02, 25, 206, N'平乐乡'),
	(43, 02, 25, 207, N'船形乡'),
	(43, 02, 25, 208, N'东风乡');

/* 湖南省 株洲市 醴陵市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 02, 81, 002, N'阳三石街道'),
	(43, 02, 81, 003, N'西山街道'),
	(43, 02, 81, 004, N'黄泥坳街道'),
	(43, 02, 81, 006, N'来龙门街道'),
	(43, 02, 81, 100, N'南桥镇'),
	(43, 02, 81, 101, N'富里镇'),
	(43, 02, 81, 102, N'白兔潭镇'),
	(43, 02, 81, 103, N'浦口镇'),
	(43, 02, 81, 104, N'王坊镇'),
	(43, 02, 81, 105, N'王仙镇'),
	(43, 02, 81, 107, N'泗汾镇'),
	(43, 02, 81, 108, N'沈潭镇'),
	(43, 02, 81, 109, N'船湾镇'),
	(43, 02, 81, 110, N'大障镇'),
	(43, 02, 81, 111, N'贺家桥镇'),
	(43, 02, 81, 118, N'仙霞镇'),
	(43, 02, 81, 119, N'黄獭嘴镇'),
	(43, 02, 81, 120, N'均楚镇'),
	(43, 02, 81, 121, N'东富镇'),
	(43, 02, 81, 122, N'石亭镇'),
	(43, 02, 81, 123, N'栗山坝镇'),
	(43, 02, 81, 124, N'神福港镇'),
	(43, 02, 81, 204, N'孙家湾乡'),
	(43, 02, 81, 205, N'清水江乡'),
	(43, 02, 81, 206, N'嘉树乡'),
	(43, 02, 81, 213, N'新阳乡'),
	(43, 02, 81, 214, N'官庄乡'),
	(43, 02, 81, 215, N'枫林市乡'),
	(43, 02, 81, 216, N'东堡乡'),
	(43, 02, 81, 217, N'板杉乡');

/* 湖南省 湘潭市 雨湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 03, 02, 001, N'雨湖路街道'),
	(43, 03, 02, 002, N'城正街街道'),
	(43, 03, 02, 003, N'平政路街道'),
	(43, 03, 02, 004, N'云塘街道'),
	(43, 03, 02, 005, N'广场街道'),
	(43, 03, 02, 006, N'中山路街道'),
	(43, 03, 02, 007, N'窑湾街道'),
	(43, 03, 02, 008, N'羊牯塘街道'),
	(43, 03, 02, 010, N'昭潭街道'),
	(43, 03, 02, 011, N'万楼街道'),
	(43, 03, 02, 012, N'先锋街道'),
	(43, 03, 02, 100, N'鹤岭镇'),
	(43, 03, 02, 101, N'楠竹山镇'),
	(43, 03, 02, 102, N'姜畲镇'),
	(43, 03, 02, 103, N'响塘镇'),
	(43, 03, 02, 202, N'长城乡');

/* 湖南省 湘潭市 岳塘区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 03, 04, 001, N'岳塘街道'),
	(43, 03, 04, 002, N'东坪街道'),
	(43, 03, 04, 003, N'中洲路街道'),
	(43, 03, 04, 004, N'书院路街道'),
	(43, 03, 04, 005, N'下摄司街道'),
	(43, 03, 04, 006, N'建设路街道'),
	(43, 03, 04, 007, N'滴水埠街道'),
	(43, 03, 04, 008, N'五里堆街道'),
	(43, 03, 04, 009, N'社建村街道'),
	(43, 03, 04, 010, N'宝塔街道'),
	(43, 03, 04, 013, N'红旗街道'),
	(43, 03, 04, 014, N'霞城街道'),
	(43, 03, 04, 202, N'荷塘乡');

/* 湖南省 湘潭市 湘潭县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 03, 21, 100, N'易俗河镇'),
	(43, 03, 21, 101, N'梅林桥镇'),
	(43, 03, 21, 102, N'谭家山镇'),
	(43, 03, 21, 103, N'中路铺镇'),
	(43, 03, 21, 104, N'茶恩寺镇'),
	(43, 03, 21, 105, N'河口镇'),
	(43, 03, 21, 106, N'射埠镇'),
	(43, 03, 21, 107, N'花石镇'),
	(43, 03, 21, 108, N'青山桥镇'),
	(43, 03, 21, 109, N'石鼓镇'),
	(43, 03, 21, 111, N'云湖桥镇'),
	(43, 03, 21, 112, N'石潭镇'),
	(43, 03, 21, 113, N'杨嘉桥镇'),
	(43, 03, 21, 114, N'乌石镇'),
	(43, 03, 21, 115, N'白石镇'),
	(43, 03, 21, 202, N'分水乡'),
	(43, 03, 21, 203, N'排头乡'),
	(43, 03, 21, 204, N'龙口乡'),
	(43, 03, 21, 205, N'锦石乡');

/* 湖南省 湘潭市 湘乡市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 03, 81, 001, N'望春门街道'),
	(43, 03, 81, 002, N'新湘路街道'),
	(43, 03, 81, 003, N'昆仑桥街道'),
	(43, 03, 81, 004, N'东山街道'),
	(43, 03, 81, 100, N'山枣镇'),
	(43, 03, 81, 101, N'栗山镇'),
	(43, 03, 81, 102, N'中沙镇'),
	(43, 03, 81, 103, N'虞塘镇'),
	(43, 03, 81, 104, N'潭市镇'),
	(43, 03, 81, 105, N'棋梓镇'),
	(43, 03, 81, 106, N'壶天镇'),
	(43, 03, 81, 107, N'翻江镇'),
	(43, 03, 81, 108, N'金石镇'),
	(43, 03, 81, 109, N'白田镇'),
	(43, 03, 81, 110, N'月山镇'),
	(43, 03, 81, 111, N'泉塘镇'),
	(43, 03, 81, 112, N'梅桥镇'),
	(43, 03, 81, 113, N'毛田镇'),
	(43, 03, 81, 114, N'龙洞镇'),
	(43, 03, 81, 200, N'东郊乡'),
	(43, 03, 81, 202, N'金薮乡'),
	(43, 03, 81, 203, N'育塅乡');

/* 湖南省 湘潭市 韶山市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 03, 82, 100, N'清溪镇'),
	(43, 03, 82, 101, N'银田镇'),
	(43, 03, 82, 102, N'如意镇'),
	(43, 03, 82, 200, N'韶山乡'),
	(43, 03, 82, 201, N'永义乡'),
	(43, 03, 82, 203, N'杨林乡'),
	(43, 03, 82, 204, N'大坪乡');

/* 湖南省 衡阳市 珠晖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 05, 001, N'广东路街道'),
	(43, 04, 05, 002, N'东风路街道'),
	(43, 04, 05, 003, N'冶金街道'),
	(43, 04, 05, 004, N'苗圃街道'),
	(43, 04, 05, 005, N'粤汉街道'),
	(43, 04, 05, 006, N'新湘街道'),
	(43, 04, 05, 007, N'衡州路街道'),
	(43, 04, 05, 100, N'茶山坳镇'),
	(43, 04, 05, 101, N'东阳渡镇'),
	(43, 04, 05, 200, N'和平乡'),
	(43, 04, 05, 201, N'酃湖乡');

/* 湖南省 衡阳市 雁峰区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 06, 001, N'先锋街道'),
	(43, 04, 06, 002, N'雁峰街道'),
	(43, 04, 06, 003, N'天马山街道'),
	(43, 04, 06, 004, N'黄茶岭街道'),
	(43, 04, 06, 005, N'白沙洲街道'),
	(43, 04, 06, 100, N'岳屏镇'),
	(43, 04, 06, 200, N'湘江乡');

/* 湖南省 衡阳市 石鼓区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 07, 001, N'人民路街道'),
	(43, 04, 07, 002, N'青山街道'),
	(43, 04, 07, 003, N'潇湘街道'),
	(43, 04, 07, 004, N'五一街道'),
	(43, 04, 07, 005, N'合江街道'),
	(43, 04, 07, 006, N'黄沙湾街道'),
	(43, 04, 07, 200, N'松木乡'),
	(43, 04, 07, 201, N'角山乡');

/* 湖南省 衡阳市 蒸湘区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 08, 001, N'蒸湘街道'),
	(43, 04, 08, 002, N'红湘街道'),
	(43, 04, 08, 004, N'联合街道'),
	(43, 04, 08, 100, N'呆鹰岭镇'),
	(43, 04, 08, 200, N'长湖乡'),
	(43, 04, 08, 201, N'雨母山乡');

/* 湖南省 衡阳市 南岳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 12, 001, N'祝融街道'),
	(43, 04, 12, 100, N'南岳镇'),
	(43, 04, 12, 200, N'岳林乡'),
	(43, 04, 12, 201, N'龙凤乡'),
	(43, 04, 12, 202, N'拜殿乡');

/* 湖南省 衡阳市 衡阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 21, 100, N'西渡镇'),
	(43, 04, 21, 101, N'集兵镇'),
	(43, 04, 21, 103, N'杉桥镇'),
	(43, 04, 21, 104, N'井头镇'),
	(43, 04, 21, 105, N'演陂镇'),
	(43, 04, 21, 106, N'金兰镇'),
	(43, 04, 21, 107, N'洪市镇'),
	(43, 04, 21, 108, N'曲兰镇'),
	(43, 04, 21, 109, N'金溪镇'),
	(43, 04, 21, 110, N'界牌镇'),
	(43, 04, 21, 111, N'渣江镇'),
	(43, 04, 21, 112, N'三湖镇'),
	(43, 04, 21, 113, N'台源镇'),
	(43, 04, 21, 114, N'关市镇'),
	(43, 04, 21, 115, N'库宗桥镇'),
	(43, 04, 21, 116, N'岘山镇'),
	(43, 04, 21, 117, N'石市镇'),
	(43, 04, 21, 200, N'樟木乡'),
	(43, 04, 21, 201, N'岣嵝乡'),
	(43, 04, 21, 205, N'栏垅乡'),
	(43, 04, 21, 207, N'大安乡'),
	(43, 04, 21, 208, N'溪江乡'),
	(43, 04, 21, 210, N'长安乡'),
	(43, 04, 21, 211, N'板市乡'),
	(43, 04, 21, 212, N'樟树乡'),
	(43, 04, 21, 213, N'潮江乡');

/* 湖南省 衡阳市 衡南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 22, 100, N'云集镇'),
	(43, 04, 22, 101, N'向阳镇'),
	(43, 04, 22, 102, N'廖田镇'),
	(43, 04, 22, 103, N'茶市镇'),
	(43, 04, 22, 104, N'冠市镇'),
	(43, 04, 22, 105, N'江口镇'),
	(43, 04, 22, 106, N'宝盖镇'),
	(43, 04, 22, 107, N'花桥镇'),
	(43, 04, 22, 108, N'铁丝塘镇'),
	(43, 04, 22, 109, N'泉溪镇'),
	(43, 04, 22, 110, N'洪山镇'),
	(43, 04, 22, 111, N'三塘镇'),
	(43, 04, 22, 112, N'谭子山镇'),
	(43, 04, 22, 113, N'鸡笼镇'),
	(43, 04, 22, 114, N'泉湖镇'),
	(43, 04, 22, 115, N'柞市镇'),
	(43, 04, 22, 116, N'茅市镇'),
	(43, 04, 22, 117, N'硫市镇'),
	(43, 04, 22, 118, N'栗江镇'),
	(43, 04, 22, 119, N'近尾洲镇'),
	(43, 04, 22, 120, N'车江镇'),
	(43, 04, 22, 121, N'咸塘镇'),
	(43, 04, 22, 122, N'松江镇'),
	(43, 04, 22, 200, N'相市乡'),
	(43, 04, 22, 201, N'洲市乡'),
	(43, 04, 22, 202, N'川口乡');

/* 湖南省 衡阳市 衡山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 23, 100, N'开云镇'),
	(43, 04, 23, 101, N'白果镇'),
	(43, 04, 23, 102, N'东湖镇'),
	(43, 04, 23, 103, N'萱洲镇'),
	(43, 04, 23, 104, N'长江镇'),
	(43, 04, 23, 105, N'新桥镇'),
	(43, 04, 23, 106, N'马迹镇'),
	(43, 04, 23, 107, N'店门镇'),
	(43, 04, 23, 200, N'贺家乡'),
	(43, 04, 23, 201, N'永和乡'),
	(43, 04, 23, 202, N'沙泉乡'),
	(43, 04, 23, 203, N'福田乡'),
	(43, 04, 23, 204, N'岭坡乡'),
	(43, 04, 23, 205, N'望峰乡'),
	(43, 04, 23, 206, N'长青乡'),
	(43, 04, 23, 207, N'贯塘乡'),
	(43, 04, 23, 208, N'江东乡');

/* 湖南省 衡阳市 衡东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 24, 100, N'城关镇'),
	(43, 04, 24, 101, N'石湾镇'),
	(43, 04, 24, 102, N'新塘镇'),
	(43, 04, 24, 103, N'大浦镇'),
	(43, 04, 24, 104, N'吴集镇'),
	(43, 04, 24, 105, N'甘溪镇'),
	(43, 04, 24, 106, N'杨林镇'),
	(43, 04, 24, 107, N'草市镇'),
	(43, 04, 24, 108, N'杨桥镇'),
	(43, 04, 24, 109, N'霞流镇'),
	(43, 04, 24, 110, N'荣恒镇'),
	(43, 04, 24, 111, N'高湖镇'),
	(43, 04, 24, 112, N'白莲镇'),
	(43, 04, 24, 113, N'大桥镇'),
	(43, 04, 24, 114, N'蓬源镇'),
	(43, 04, 24, 200, N'莫井乡'),
	(43, 04, 24, 201, N'踏庄乡'),
	(43, 04, 24, 202, N'高塘乡'),
	(43, 04, 24, 204, N'南湾乡'),
	(43, 04, 24, 208, N'三樟乡'),
	(43, 04, 24, 209, N'栗木乡'),
	(43, 04, 24, 210, N'珍珠乡'),
	(43, 04, 24, 211, N'石滩乡'),
	(43, 04, 24, 212, N'德圳乡');

/* 湖南省 衡阳市 祁东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 26, 001, N'洪桥街道'),
	(43, 04, 26, 002, N'玉合街道'),
	(43, 04, 26, 003, N'永昌街道'),
	(43, 04, 26, 004, N'白鹤街道'),
	(43, 04, 26, 102, N'金桥镇'),
	(43, 04, 26, 103, N'鸟江镇'),
	(43, 04, 26, 104, N'粮市镇'),
	(43, 04, 26, 105, N'河洲镇'),
	(43, 04, 26, 106, N'归阳镇'),
	(43, 04, 26, 107, N'过水坪镇'),
	(43, 04, 26, 108, N'双桥镇'),
	(43, 04, 26, 109, N'灵官镇'),
	(43, 04, 26, 110, N'风石堰镇'),
	(43, 04, 26, 111, N'白地市镇'),
	(43, 04, 26, 112, N'黄土铺镇'),
	(43, 04, 26, 113, N'石亭子镇'),
	(43, 04, 26, 114, N'官家嘴镇'),
	(43, 04, 26, 115, N'步云桥镇'),
	(43, 04, 26, 116, N'砖塘镇'),
	(43, 04, 26, 117, N'蒋家桥镇'),
	(43, 04, 26, 118, N'太和堂镇'),
	(43, 04, 26, 200, N'马杜桥乡'),
	(43, 04, 26, 201, N'凤歧坪乡'),
	(43, 04, 26, 202, N'城连圩乡'),
	(43, 04, 26, 203, N'四明山乡');

/* 湖南省 衡阳市 耒阳市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 81, 001, N'蔡子池街道'),
	(43, 04, 81, 002, N'灶市街街道'),
	(43, 04, 81, 003, N'水东江街道'),
	(43, 04, 81, 004, N'五里牌街道办事处'),
	(43, 04, 81, 005, N'三顺街道办事处'),
	(43, 04, 81, 100, N'黄市镇'),
	(43, 04, 81, 101, N'小水镇'),
	(43, 04, 81, 102, N'公平圩镇'),
	(43, 04, 81, 103, N'泗门洲镇'),
	(43, 04, 81, 104, N'三都镇'),
	(43, 04, 81, 105, N'南阳镇'),
	(43, 04, 81, 106, N'竹市镇'),
	(43, 04, 81, 107, N'夏塘镇'),
	(43, 04, 81, 108, N'龙塘镇'),
	(43, 04, 81, 109, N'哲桥镇'),
	(43, 04, 81, 110, N'永济镇'),
	(43, 04, 81, 111, N'遥田镇'),
	(43, 04, 81, 112, N'新市镇'),
	(43, 04, 81, 113, N'淝田镇'),
	(43, 04, 81, 114, N'大市镇'),
	(43, 04, 81, 115, N'仁义镇'),
	(43, 04, 81, 116, N'南京镇'),
	(43, 04, 81, 200, N'洲陂乡'),
	(43, 04, 81, 201, N'亮源乡'),
	(43, 04, 81, 202, N'马水乡'),
	(43, 04, 81, 203, N'太平圩乡'),
	(43, 04, 81, 204, N'导子乡'),
	(43, 04, 81, 205, N'东湖圩乡'),
	(43, 04, 81, 206, N'上架乡'),
	(43, 04, 81, 207, N'沙明乡'),
	(43, 04, 81, 208, N'大义乡'),
	(43, 04, 81, 209, N'磨形乡'),
	(43, 04, 81, 212, N'余庆乡'),
	(43, 04, 81, 213, N'长坪乡'),
	(43, 04, 81, 214, N'太和圩乡'),
	(43, 04, 81, 215, N'坛下乡');

/* 湖南省 衡阳市 常宁市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 04, 82, 001, N'宜阳街道'),
	(43, 04, 82, 002, N'泉峰街道'),
	(43, 04, 82, 003, N'培元街道'),
	(43, 04, 82, 006, N'天堂山办事处'),
	(43, 04, 82, 007, N'水口山街道办事处'),
	(43, 04, 82, 101, N'柏坊镇'),
	(43, 04, 82, 102, N'松柏镇'),
	(43, 04, 82, 103, N'烟洲镇'),
	(43, 04, 82, 104, N'荫田镇'),
	(43, 04, 82, 105, N'白沙镇'),
	(43, 04, 82, 106, N'西岭镇'),
	(43, 04, 82, 107, N'盐湖镇'),
	(43, 04, 82, 108, N'三角塘镇'),
	(43, 04, 82, 109, N'洋泉镇'),
	(43, 04, 82, 110, N'庙前镇'),
	(43, 04, 82, 111, N'罗桥镇'),
	(43, 04, 82, 112, N'板桥镇'),
	(43, 04, 82, 113, N'胜桥镇'),
	(43, 04, 82, 114, N'官岭镇'),
	(43, 04, 82, 115, N'新河镇'),
	(43, 04, 82, 200, N'宜潭乡'),
	(43, 04, 82, 201, N'蓬塘乡'),
	(43, 04, 82, 202, N'兰江乡'),
	(43, 04, 82, 203, N'大堡乡'),
	(43, 04, 82, 204, N'江河乡'),
	(43, 04, 82, 205, N'弥泉乡'),
	(43, 04, 82, 206, N'塔山瑶族乡');

/* 湖南省 邵阳市 双清区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 02, 001, N'兴隆街道'),
	(43, 05, 02, 002, N'龙须塘街道'),
	(43, 05, 02, 003, N'汽车站街道'),
	(43, 05, 02, 004, N'小江湖街道'),
	(43, 05, 02, 005, N'东风路街道'),
	(43, 05, 02, 006, N'桥头街道'),
	(43, 05, 02, 100, N'高崇山镇'),
	(43, 05, 02, 101, N'渡头桥镇'),
	(43, 05, 02, 200, N'城东乡'),
	(43, 05, 02, 201, N'石桥乡'),
	(43, 05, 02, 202, N'火车站乡'),
	(43, 05, 02, 203, N'云水乡');

/* 湖南省 邵阳市 大祥区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 03, 001, N'中心路街道'),
	(43, 05, 03, 002, N'红旗路街道'),
	(43, 05, 03, 003, N'城北路街道'),
	(43, 05, 03, 004, N'城西路街道'),
	(43, 05, 03, 005, N'翠园街道'),
	(43, 05, 03, 006, N'百春园街道'),
	(43, 05, 03, 007, N'城南街道办事处'),
	(43, 05, 03, 008, N'火车南站街道办事处'),
	(43, 05, 03, 009, N'学院路街道办事处'),
	(43, 05, 03, 100, N'雨溪镇'),
	(43, 05, 03, 101, N'罗市镇'),
	(43, 05, 03, 202, N'檀江乡'),
	(43, 05, 03, 203, N'蔡锷乡'),
	(43, 05, 03, 204, N'板桥乡');

/* 湖南省 邵阳市 北塔区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 11, 001, N'新滩镇街道'),
	(43, 05, 11, 002, N'状元洲街道'),
	(43, 05, 11, 200, N'田江乡'),
	(43, 05, 11, 202, N'茶元头乡'),
	(43, 05, 11, 203, N'陈家桥乡');

/* 湖南省 邵阳市 邵东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 21, 001, N'大禾塘街道办事处'),
	(43, 05, 21, 002, N'两市塘街道办事处'),
	(43, 05, 21, 003, N'宋家塘街道办事处'),
	(43, 05, 21, 101, N'牛马司镇'),
	(43, 05, 21, 102, N'范家山镇'),
	(43, 05, 21, 103, N'九龙岭镇'),
	(43, 05, 21, 104, N'仙槎桥镇'),
	(43, 05, 21, 105, N'火厂坪镇'),
	(43, 05, 21, 106, N'佘田桥镇'),
	(43, 05, 21, 107, N'灵官殿镇'),
	(43, 05, 21, 108, N'团山镇'),
	(43, 05, 21, 109, N'砂石镇'),
	(43, 05, 21, 110, N'廉桥镇'),
	(43, 05, 21, 111, N'流光岭镇'),
	(43, 05, 21, 112, N'流泽镇'),
	(43, 05, 21, 113, N'魏家桥镇'),
	(43, 05, 21, 114, N'野鸡坪镇'),
	(43, 05, 21, 115, N'杨桥镇'),
	(43, 05, 21, 116, N'水东江镇'),
	(43, 05, 21, 117, N'黑田铺镇'),
	(43, 05, 21, 118, N'简家陇镇'),
	(43, 05, 21, 119, N'界岭镇'),
	(43, 05, 21, 201, N'黄陂桥乡'),
	(43, 05, 21, 203, N'双凤乡'),
	(43, 05, 21, 204, N'周官桥乡'),
	(43, 05, 21, 209, N'堡面前乡'),
	(43, 05, 21, 210, N'石株桥乡'),
	(43, 05, 21, 212, N'斫曹乡');

/* 湖南省 邵阳市 新邵县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 22, 100, N'酿溪镇'),
	(43, 05, 22, 101, N'严塘镇'),
	(43, 05, 22, 102, N'雀塘镇'),
	(43, 05, 22, 103, N'陈家坊镇'),
	(43, 05, 22, 104, N'潭溪镇'),
	(43, 05, 22, 105, N'寸石镇'),
	(43, 05, 22, 106, N'坪上镇'),
	(43, 05, 22, 107, N'龙溪铺镇'),
	(43, 05, 22, 108, N'巨口铺镇'),
	(43, 05, 22, 109, N'新田铺镇'),
	(43, 05, 22, 110, N'小塘镇'),
	(43, 05, 22, 200, N'潭府乡'),
	(43, 05, 22, 201, N'太芝庙乡'),
	(43, 05, 22, 202, N'大新乡'),
	(43, 05, 22, 203, N'迎光乡');

/* 湖南省 邵阳市 邵阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 23, 100, N'塘渡口镇'),
	(43, 05, 23, 101, N'白仓镇'),
	(43, 05, 23, 102, N'金称市镇'),
	(43, 05, 23, 103, N'塘田市镇'),
	(43, 05, 23, 104, N'黄亭市镇'),
	(43, 05, 23, 105, N'长阳铺镇'),
	(43, 05, 23, 106, N'岩口铺镇'),
	(43, 05, 23, 107, N'九公桥镇'),
	(43, 05, 23, 108, N'下花桥镇'),
	(43, 05, 23, 109, N'谷洲镇'),
	(43, 05, 23, 110, N'郦家坪镇'),
	(43, 05, 23, 111, N'五峰铺镇'),
	(43, 05, 23, 200, N'黄塘乡'),
	(43, 05, 23, 201, N'小溪市乡'),
	(43, 05, 23, 202, N'霞塘云乡'),
	(43, 05, 23, 203, N'长乐乡'),
	(43, 05, 23, 204, N'蔡桥乡'),
	(43, 05, 23, 205, N'河伯乡'),
	(43, 05, 23, 206, N'黄荆乡'),
	(43, 05, 23, 207, N'诸甲亭乡'),
	(43, 05, 23, 208, N'罗城乡'),
	(43, 05, 23, 209, N'金江乡');

/* 湖南省 邵阳市 隆回县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 24, 100, N'桃洪镇'),
	(43, 05, 24, 101, N'小沙江镇'),
	(43, 05, 24, 102, N'金石桥镇'),
	(43, 05, 24, 103, N'司门前镇'),
	(43, 05, 24, 104, N'高平镇'),
	(43, 05, 24, 105, N'六都寨镇'),
	(43, 05, 24, 106, N'荷香桥镇'),
	(43, 05, 24, 107, N'横板桥镇'),
	(43, 05, 24, 108, N'周旺镇'),
	(43, 05, 24, 109, N'滩头镇'),
	(43, 05, 24, 110, N'鸭田镇'),
	(43, 05, 24, 111, N'西洋江镇'),
	(43, 05, 24, 112, N'雨山铺镇'),
	(43, 05, 24, 113, N'岩口镇'),
	(43, 05, 24, 114, N'北山镇'),
	(43, 05, 24, 115, N'三阁司镇'),
	(43, 05, 24, 116, N'南岳庙镇'),
	(43, 05, 24, 117, N'七江镇'),
	(43, 05, 24, 200, N'麻塘山乡'),
	(43, 05, 24, 201, N'虎形山瑶族乡'),
	(43, 05, 24, 203, N'大水田乡'),
	(43, 05, 24, 204, N'羊古坳乡'),
	(43, 05, 24, 205, N'罗洪乡'),
	(43, 05, 24, 207, N'荷田乡'),
	(43, 05, 24, 208, N'石门乡'),
	(43, 05, 24, 212, N'山界回族乡');

/* 湖南省 邵阳市 洞口县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 25, 001, N'文昌街道'),
	(43, 05, 25, 002, N'雪峰街道'),
	(43, 05, 25, 003, N'花古街道'),
	(43, 05, 25, 101, N'江口镇'),
	(43, 05, 25, 102, N'毓兰镇'),
	(43, 05, 25, 103, N'高沙镇'),
	(43, 05, 25, 104, N'竹市镇'),
	(43, 05, 25, 105, N'石江镇'),
	(43, 05, 25, 106, N'黄桥镇'),
	(43, 05, 25, 107, N'山门镇'),
	(43, 05, 25, 108, N'醪田镇'),
	(43, 05, 25, 109, N'花园镇'),
	(43, 05, 25, 110, N'岩山镇'),
	(43, 05, 25, 111, N'水东镇'),
	(43, 05, 25, 201, N'古楼乡'),
	(43, 05, 25, 202, N'长塘瑶族乡'),
	(43, 05, 25, 203, N'罗溪瑶族乡'),
	(43, 05, 25, 204, N'月溪乡'),
	(43, 05, 25, 205, N'渣坪乡'),
	(43, 05, 25, 208, N'杨林乡'),
	(43, 05, 25, 210, N'石柱乡'),
	(43, 05, 25, 211, N'桐山乡'),
	(43, 05, 25, 212, N'大屋瑶族乡');

/* 湖南省 邵阳市 绥宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 27, 100, N'长铺镇'),
	(43, 05, 27, 101, N'武阳镇'),
	(43, 05, 27, 102, N'李熙桥镇'),
	(43, 05, 27, 103, N'红岩镇'),
	(43, 05, 27, 104, N'唐家坊镇'),
	(43, 05, 27, 105, N'金屋塘镇'),
	(43, 05, 27, 106, N'瓦屋塘镇'),
	(43, 05, 27, 200, N'东山侗族乡'),
	(43, 05, 27, 201, N'鹅公岭侗族苗族乡'),
	(43, 05, 27, 202, N'朝仪侗族乡'),
	(43, 05, 27, 203, N'在市苗族乡'),
	(43, 05, 27, 204, N'乐安铺苗族侗族乡'),
	(43, 05, 27, 205, N'黄桑坪苗族乡'),
	(43, 05, 27, 206, N'关峡苗族乡'),
	(43, 05, 27, 207, N'长铺子苗族乡'),
	(43, 05, 27, 208, N'党坪苗族乡'),
	(43, 05, 27, 209, N'联民苗族瑶族乡'),
	(43, 05, 27, 210, N'麻塘苗族乡'),
	(43, 05, 27, 211, N'枫木团苗族侗族乡'),
	(43, 05, 27, 212, N'河口苗族乡'),
	(43, 05, 27, 213, N'竹舟江苗族乡'),
	(43, 05, 27, 214, N'白玉乡'),
	(43, 05, 27, 215, N'黄土矿乡'),
	(43, 05, 27, 217, N'水口乡'),
	(43, 05, 27, 218, N'梅坪乡');

/* 湖南省 邵阳市 新宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 28, 100, N'金石镇'),
	(43, 05, 28, 101, N'水庙镇'),
	(43, 05, 28, 102, N'崀山镇'),
	(43, 05, 28, 103, N'白沙镇'),
	(43, 05, 28, 104, N'黄龙镇'),
	(43, 05, 28, 105, N'高桥镇'),
	(43, 05, 28, 106, N'回龙寺镇'),
	(43, 05, 28, 107, N'一渡水镇'),
	(43, 05, 28, 108, N'马头桥镇'),
	(43, 05, 28, 200, N'黄金瑶族乡'),
	(43, 05, 28, 201, N'麻林瑶族乡'),
	(43, 05, 28, 202, N'飞仙桥乡'),
	(43, 05, 28, 203, N'万塘乡'),
	(43, 05, 28, 204, N'清江桥乡'),
	(43, 05, 28, 205, N'安山乡'),
	(43, 05, 28, 206, N'丰田乡'),
	(43, 05, 28, 208, N'巡田乡'),
	(43, 05, 28, 209, N'靖位乡');

/* 湖南省 邵阳市 城步苗族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 29, 100, N'儒林镇'),
	(43, 05, 29, 101, N'茅坪镇'),
	(43, 05, 29, 102, N'西岩镇'),
	(43, 05, 29, 103, N'丹口镇'),
	(43, 05, 29, 104, N'五团镇'),
	(43, 05, 29, 105, N'南山镇'),
	(43, 05, 29, 200, N'威溪乡'),
	(43, 05, 29, 201, N'长安营乡'),
	(43, 05, 29, 202, N'白毛坪乡'),
	(43, 05, 29, 203, N'兰蓉乡'),
	(43, 05, 29, 204, N'汀坪乡'),
	(43, 05, 29, 205, N'蒋坊乡'),
	(43, 05, 29, 206, N'金紫乡');

/* 湖南省 邵阳市 武冈市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 05, 81, 001, N'辕门口街道'),
	(43, 05, 81, 002, N'迎春亭街道'),
	(43, 05, 81, 003, N'法相岩街道办事处'),
	(43, 05, 81, 004, N'水西门街道办事处'),
	(43, 05, 81, 100, N'邓元泰镇'),
	(43, 05, 81, 101, N'湾头桥镇'),
	(43, 05, 81, 102, N'文坪镇'),
	(43, 05, 81, 103, N'荆竹铺镇'),
	(43, 05, 81, 104, N'稠树塘镇'),
	(43, 05, 81, 105, N'邓家铺镇'),
	(43, 05, 81, 106, N'龙溪镇'),
	(43, 05, 81, 107, N'司马冲镇'),
	(43, 05, 81, 108, N'秦桥镇'),
	(43, 05, 81, 109, N'双牌镇'),
	(43, 05, 81, 110, N'大甸镇'),
	(43, 05, 81, 200, N'龙田乡'),
	(43, 05, 81, 201, N'头堂乡'),
	(43, 05, 81, 202, N'安乐乡'),
	(43, 05, 81, 204, N'马坪乡'),
	(43, 05, 81, 205, N'晏田乡'),
	(43, 05, 81, 207, N'水浸坪乡');

/* 湖南省 岳阳市 岳阳楼区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 06, 02, 001, N'岳阳楼街道'),
	(43, 06, 02, 002, N'三眼桥街道'),
	(43, 06, 02, 003, N'吕仙亭街道'),
	(43, 06, 02, 004, N'金鹗山街道'),
	(43, 06, 02, 005, N'东茅岭街道'),
	(43, 06, 02, 006, N'五里牌街道'),
	(43, 06, 02, 007, N'望岳路街道'),
	(43, 06, 02, 008, N'城陵矶街道'),
	(43, 06, 02, 009, N'枫桥湖街道'),
	(43, 06, 02, 010, N'奇家岭街道'),
	(43, 06, 02, 011, N'洞庭街道'),
	(43, 06, 02, 012, N'洛王街道'),
	(43, 06, 02, 013, N'南湖街道'),
	(43, 06, 02, 014, N'站前街道'),
	(43, 06, 02, 015, N'王家河街道'),
	(43, 06, 02, 016, N'求索街道办事处'),
	(43, 06, 02, 017, N'湖滨街道办事处'),
	(43, 06, 02, 018, N'龙山街道'),
	(43, 06, 02, 019, N'月山街道'),
	(43, 06, 02, 100, N'西塘镇'),
	(43, 06, 02, 200, N'梅溪乡'),
	(43, 06, 02, 201, N'郭镇乡'),
	(43, 06, 02, 202, N'三荷乡'),
	(43, 06, 02, 203, N'康王乡');

/* 湖南省 岳阳市 云溪区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 06, 03, 100, N'云溪镇'),
	(43, 06, 03, 101, N'陆城镇'),
	(43, 06, 03, 102, N'路口镇'),
	(43, 06, 03, 103, N'道仁矶镇'),
	(43, 06, 03, 104, N'文桥镇'),
	(43, 06, 03, 200, N'云溪乡'),
	(43, 06, 03, 201, N'永济乡');

/* 湖南省 岳阳市 君山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 06, 11, 001, N'西城街道'),
	(43, 06, 11, 100, N'柳林洲镇'),
	(43, 06, 11, 101, N'广兴洲镇'),
	(43, 06, 11, 102, N'许市镇'),
	(43, 06, 11, 103, N'钱粮湖镇'),
	(43, 06, 11, 104, N'良心堡镇'),
	(43, 06, 11, 105, N'采桑湖镇');

/* 湖南省 岳阳市 岳阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 06, 21, 100, N'荣家湾镇'),
	(43, 06, 21, 102, N'麻塘镇'),
	(43, 06, 21, 103, N'鹿角镇'),
	(43, 06, 21, 104, N'黄沙街镇'),
	(43, 06, 21, 105, N'新墙镇'),
	(43, 06, 21, 106, N'柏祥镇'),
	(43, 06, 21, 107, N'筻口镇'),
	(43, 06, 21, 108, N'公田镇'),
	(43, 06, 21, 109, N'毛田镇'),
	(43, 06, 21, 110, N'月田镇'),
	(43, 06, 21, 111, N'张谷英镇'),
	(43, 06, 21, 112, N'新开镇'),
	(43, 06, 21, 202, N'中洲乡'),
	(43, 06, 21, 203, N'长湖乡'),
	(43, 06, 21, 204, N'步仙乡'),
	(43, 06, 21, 205, N'甘田乡'),
	(43, 06, 21, 206, N'杨林乡'),
	(43, 06, 21, 207, N'云山乡'),
	(43, 06, 21, 208, N'相思乡'),
	(43, 06, 21, 209, N'饶村乡');

/* 湖南省 岳阳市 华容县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 06, 23, 100, N'城关镇'),
	(43, 06, 23, 101, N'三封寺镇'),
	(43, 06, 23, 102, N'治河渡镇'),
	(43, 06, 23, 103, N'北景港镇'),
	(43, 06, 23, 104, N'鲇鱼须镇'),
	(43, 06, 23, 105, N'宋家嘴镇'),
	(43, 06, 23, 106, N'万庾镇'),
	(43, 06, 23, 110, N'插旗镇'),
	(43, 06, 23, 111, N'注滋口镇'),
	(43, 06, 23, 112, N'操军镇'),
	(43, 06, 23, 114, N'东山镇'),
	(43, 06, 23, 119, N'梅田湖镇'),
	(43, 06, 23, 200, N'胜峰乡'),
	(43, 06, 23, 201, N'新河乡'),
	(43, 06, 23, 202, N'护城乡'),
	(43, 06, 23, 203, N'新建乡'),
	(43, 06, 23, 204, N'南山乡'),
	(43, 06, 23, 205, N'终南乡'),
	(43, 06, 23, 206, N'幸福乡'),
	(43, 06, 23, 207, N'团洲乡');

/* 湖南省 岳阳市 湘阴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 06, 24, 100, N'文星镇'),
	(43, 06, 24, 101, N'东塘镇'),
	(43, 06, 24, 102, N'袁家铺镇'),
	(43, 06, 24, 104, N'樟树镇'),
	(43, 06, 24, 110, N'三塘镇'),
	(43, 06, 24, 111, N'长康镇'),
	(43, 06, 24, 116, N'岭北镇'),
	(43, 06, 24, 117, N'新泉镇'),
	(43, 06, 24, 118, N'湘滨镇'),
	(43, 06, 24, 119, N'南湖洲镇'),
	(43, 06, 24, 120, N'鹤龙湖镇'),
	(43, 06, 24, 121, N'金龙镇'),
	(43, 06, 24, 200, N'石塘乡'),
	(43, 06, 24, 201, N'六塘乡'),
	(43, 06, 24, 202, N'白泥湖乡'),
	(43, 06, 24, 203, N'静河乡'),
	(43, 06, 24, 204, N'玉华乡'),
	(43, 06, 24, 206, N'杨林寨乡'),
	(43, 06, 24, 209, N'青潭乡');

/* 湖南省 岳阳市 平江县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 06, 26, 100, N'城关镇'),
	(43, 06, 26, 101, N'安定镇'),
	(43, 06, 26, 102, N'三市镇'),
	(43, 06, 26, 103, N'加义镇'),
	(43, 06, 26, 104, N'长寿镇'),
	(43, 06, 26, 105, N'龙门镇'),
	(43, 06, 26, 106, N'虹桥镇'),
	(43, 06, 26, 107, N'南江镇'),
	(43, 06, 26, 108, N'梅仙镇'),
	(43, 06, 26, 109, N'浯口镇'),
	(43, 06, 26, 110, N'瓮江镇'),
	(43, 06, 26, 111, N'伍市镇'),
	(43, 06, 26, 112, N'向家镇'),
	(43, 06, 26, 113, N'童市镇'),
	(43, 06, 26, 114, N'岑川镇'),
	(43, 06, 26, 115, N'福寿山镇'),
	(43, 06, 26, 116, N'余坪镇'),
	(43, 06, 26, 117, N'石牛寨镇'),
	(43, 06, 26, 118, N'上塔市镇'),
	(43, 06, 26, 200, N'三阳乡'),
	(43, 06, 26, 202, N'咏生乡'),
	(43, 06, 26, 203, N'黄金洞乡'),
	(43, 06, 26, 204, N'南桥乡'),
	(43, 06, 26, 205, N'木金乡'),
	(43, 06, 26, 208, N'板江乡'),
	(43, 06, 26, 209, N'大洲乡'),
	(43, 06, 26, 210, N'三墩乡');

/* 湖南省 岳阳市 汨罗市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 06, 81, 100, N'城关镇'),
	(43, 06, 81, 101, N'汨罗镇'),
	(43, 06, 81, 102, N'新市镇'),
	(43, 06, 81, 103, N'古培镇'),
	(43, 06, 81, 104, N'白水镇'),
	(43, 06, 81, 105, N'川山坪镇'),
	(43, 06, 81, 106, N'高家坊镇'),
	(43, 06, 81, 107, N'弼时镇'),
	(43, 06, 81, 108, N'李家段镇'),
	(43, 06, 81, 109, N'黄柏镇'),
	(43, 06, 81, 110, N'长乐镇'),
	(43, 06, 81, 111, N'大荆镇'),
	(43, 06, 81, 112, N'桃林寺镇'),
	(43, 06, 81, 113, N'三江镇'),
	(43, 06, 81, 114, N'范家园镇'),
	(43, 06, 81, 115, N'沙溪镇'),
	(43, 06, 81, 118, N'屈子祠镇'),
	(43, 06, 81, 200, N'城郊乡'),
	(43, 06, 81, 201, N'红花乡'),
	(43, 06, 81, 202, N'黄市乡'),
	(43, 06, 81, 203, N'玉池乡'),
	(43, 06, 81, 205, N'天井乡'),
	(43, 06, 81, 206, N'智峰乡'),
	(43, 06, 81, 208, N'古仑乡'),
	(43, 06, 81, 209, N'火天乡'),
	(43, 06, 81, 210, N'新塘乡'),
	(43, 06, 81, 211, N'白塘乡'),
	(43, 06, 81, 214, N'磊石乡'),
	(43, 06, 81, 215, N'八景乡');

/* 湖南省 岳阳市 临湘市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 06, 82, 001, N'长安街道'),
	(43, 06, 82, 002, N'桥东街道'),
	(43, 06, 82, 003, N'桃矿街道'),
	(43, 06, 82, 101, N'忠防镇'),
	(43, 06, 82, 102, N'白云镇'),
	(43, 06, 82, 103, N'聂市镇'),
	(43, 06, 82, 104, N'源潭镇'),
	(43, 06, 82, 105, N'江南镇'),
	(43, 06, 82, 107, N'桃林镇'),
	(43, 06, 82, 108, N'长塘镇'),
	(43, 06, 82, 109, N'白羊田镇'),
	(43, 06, 82, 110, N'詹桥镇'),
	(43, 06, 82, 111, N'儒溪镇'),
	(43, 06, 82, 112, N'定湖镇'),
	(43, 06, 82, 113, N'黄盖镇'),
	(43, 06, 82, 114, N'羊楼司镇'),
	(43, 06, 82, 200, N'五里乡'),
	(43, 06, 82, 201, N'乘风乡'),
	(43, 06, 82, 204, N'坦渡乡'),
	(43, 06, 82, 205, N'城南乡'),
	(43, 06, 82, 206, N'横铺乡');

/* 湖南省 常德市 武陵区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 07, 02, 001, N'启明街道'),
	(43, 07, 02, 002, N'府坪街道'),
	(43, 07, 02, 003, N'穿紫河街道'),
	(43, 07, 02, 004, N'丹阳街道'),
	(43, 07, 02, 005, N'白马湖街道'),
	(43, 07, 02, 006, N'德山街道'),
	(43, 07, 02, 007, N'东江街道'),
	(43, 07, 02, 008, N'永安街道'),
	(43, 07, 02, 009, N'南坪街道'),
	(43, 07, 02, 010, N'长庚街道'),
	(43, 07, 02, 011, N'芷兰街道'),
	(43, 07, 02, 012, N'芙蓉街道'),
	(43, 07, 02, 013, N'柳叶湖街道'),
	(43, 07, 02, 014, N'七里桥街道'),
	(43, 07, 02, 100, N'河洑镇'),
	(43, 07, 02, 101, N'德山镇'),
	(43, 07, 02, 102, N'白鹤镇'),
	(43, 07, 02, 200, N'芦荻山乡'),
	(43, 07, 02, 204, N'丹洲乡');

/* 湖南省 常德市 鼎城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 07, 03, 001, N'玉霞街道'),
	(43, 07, 03, 002, N'红云街道'),
	(43, 07, 03, 003, N'郭家铺街道'),
	(43, 07, 03, 004, N'斗姆湖街道'),
	(43, 07, 03, 101, N'蒿子港镇'),
	(43, 07, 03, 102, N'中河口镇'),
	(43, 07, 03, 103, N'十美堂镇'),
	(43, 07, 03, 104, N'牛鼻滩镇'),
	(43, 07, 03, 105, N'韩公渡镇'),
	(43, 07, 03, 106, N'石公桥镇'),
	(43, 07, 03, 107, N'镇德桥镇'),
	(43, 07, 03, 108, N'周家店镇'),
	(43, 07, 03, 109, N'大龙站镇'),
	(43, 07, 03, 110, N'双桥坪镇'),
	(43, 07, 03, 111, N'灌溪镇'),
	(43, 07, 03, 112, N'蔡家岗镇'),
	(43, 07, 03, 114, N'草坪镇'),
	(43, 07, 03, 115, N'石门桥镇'),
	(43, 07, 03, 116, N'谢家铺镇'),
	(43, 07, 03, 117, N'黄土店镇'),
	(43, 07, 03, 118, N'尧天坪镇'),
	(43, 07, 03, 119, N'港二口镇'),
	(43, 07, 03, 120, N'雷公庙镇'),
	(43, 07, 03, 121, N'石板滩镇'),
	(43, 07, 03, 200, N'黄珠洲乡'),
	(43, 07, 03, 201, N'黑山嘴乡'),
	(43, 07, 03, 203, N'长岭岗乡'),
	(43, 07, 03, 204, N'许家桥回族维吾尔族乡'),
	(43, 07, 03, 205, N'丁家港乡'),
	(43, 07, 03, 206, N'钱家坪乡'),
	(43, 07, 03, 207, N'唐家铺乡'),
	(43, 07, 03, 208, N'沧山乡'),
	(43, 07, 03, 209, N'长茅岭乡'),
	(43, 07, 03, 210, N'逆江坪乡');

/* 湖南省 常德市 安乡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 07, 21, 100, N'深柳镇'),
	(43, 07, 21, 101, N'大鲸港镇'),
	(43, 07, 21, 102, N'黄山头镇'),
	(43, 07, 21, 103, N'三岔河镇'),
	(43, 07, 21, 104, N'官垱镇'),
	(43, 07, 21, 105, N'下渔口镇'),
	(43, 07, 21, 106, N'陈家嘴镇'),
	(43, 07, 21, 107, N'焦圻镇'),
	(43, 07, 21, 201, N'安障乡'),
	(43, 07, 21, 202, N'安昌乡'),
	(43, 07, 21, 203, N'安宏乡'),
	(43, 07, 21, 204, N'安生乡'),
	(43, 07, 21, 205, N'安全乡'),
	(43, 07, 21, 206, N'安福乡'),
	(43, 07, 21, 207, N'安凝乡'),
	(43, 07, 21, 208, N'安丰乡'),
	(43, 07, 21, 209, N'安裕乡'),
	(43, 07, 21, 210, N'安康乡'),
	(43, 07, 21, 211, N'安德乡');

/* 湖南省 常德市 汉寿县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 07, 22, 101, N'蒋家嘴镇'),
	(43, 07, 22, 102, N'岩汪湖镇'),
	(43, 07, 22, 103, N'坡头镇'),
	(43, 07, 22, 104, N'酉港镇'),
	(43, 07, 22, 105, N'洲口镇'),
	(43, 07, 22, 106, N'罐头嘴镇'),
	(43, 07, 22, 107, N'沧港镇'),
	(43, 07, 22, 108, N'朱家铺镇'),
	(43, 07, 22, 109, N'太子庙镇'),
	(43, 07, 22, 110, N'毓德铺镇'),
	(43, 07, 22, 111, N'崔家桥镇'),
	(43, 07, 22, 112, N'军山铺镇'),
	(43, 07, 22, 113, N'百禄桥镇'),
	(43, 07, 22, 114, N'西湖镇'),
	(43, 07, 22, 115, N'洋淘湖镇'),
	(43, 07, 22, 116, N'龙阳镇'),
	(43, 07, 22, 201, N'周文庙乡'),
	(43, 07, 22, 202, N'鸭子港乡'),
	(43, 07, 22, 203, N'文蔚乡'),
	(43, 07, 22, 204, N'新兴乡'),
	(43, 07, 22, 205, N'聂家桥乡'),
	(43, 07, 22, 206, N'毛家滩回族维吾尔族乡'),
	(43, 07, 22, 207, N'丰家铺乡'),
	(43, 07, 22, 208, N'东岳庙乡'),
	(43, 07, 22, 209, N'岩嘴乡'),
	(43, 07, 22, 210, N'株木山乡'),
	(43, 07, 22, 211, N'三和乡'),
	(43, 07, 22, 212, N'龙潭桥乡'),
	(43, 07, 22, 213, N'月明潭乡'),
	(43, 07, 22, 216, N'大南湖乡');

/* 湖南省 常德市 澧县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 07, 23, 001, N'澧西街道办事处'),
	(43, 07, 23, 002, N'澧阳街道办事处'),
	(43, 07, 23, 003, N'澧浦街道办事处'),
	(43, 07, 23, 004, N'澧澹街道办事处'),
	(43, 07, 23, 101, N'张公庙镇'),
	(43, 07, 23, 102, N'小渡口镇'),
	(43, 07, 23, 103, N'梦溪镇'),
	(43, 07, 23, 104, N'复兴厂镇'),
	(43, 07, 23, 105, N'盐井镇'),
	(43, 07, 23, 106, N'雷公塔镇'),
	(43, 07, 23, 107, N'大堰垱镇'),
	(43, 07, 23, 108, N'王家厂镇'),
	(43, 07, 23, 109, N'金罗镇'),
	(43, 07, 23, 110, N'码头铺镇'),
	(43, 07, 23, 111, N'方石坪镇'),
	(43, 07, 23, 112, N'甘溪滩镇'),
	(43, 07, 23, 113, N'火连坡镇'),
	(43, 07, 23, 114, N'澧南镇'),
	(43, 07, 23, 200, N'九垸乡'),
	(43, 07, 23, 201, N'官垸乡'),
	(43, 07, 23, 202, N'永丰乡'),
	(43, 07, 23, 203, N'如东乡'),
	(43, 07, 23, 206, N'澧东乡'),
	(43, 07, 23, 207, N'涔南乡'),
	(43, 07, 23, 208, N'大坪乡'),
	(43, 07, 23, 209, N'道河乡'),
	(43, 07, 23, 210, N'双龙乡'),
	(43, 07, 23, 211, N'宜万乡'),
	(43, 07, 23, 212, N'车溪乡'),
	(43, 07, 23, 213, N'中武乡'),
	(43, 07, 23, 214, N'闸口乡'),
	(43, 07, 23, 215, N'洞市乡'),
	(43, 07, 23, 216, N'杨家坊乡'),
	(43, 07, 23, 217, N'太青乡');

/* 湖南省 常德市 临澧县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 07, 24, 100, N'安福镇'),
	(43, 07, 24, 101, N'合口镇'),
	(43, 07, 24, 102, N'新安镇'),
	(43, 07, 24, 103, N'佘市桥镇'),
	(43, 07, 24, 104, N'太浮镇'),
	(43, 07, 24, 105, N'四新岗镇'),
	(43, 07, 24, 106, N'停弦渡镇'),
	(43, 07, 24, 107, N'修梅镇'),
	(43, 07, 24, 200, N'杉板乡'),
	(43, 07, 24, 201, N'文家乡'),
	(43, 07, 24, 202, N'陈二乡'),
	(43, 07, 24, 203, N'柏枝乡'),
	(43, 07, 24, 204, N'烽火乡'),
	(43, 07, 24, 205, N'望城乡'),
	(43, 07, 24, 206, N'杨板乡'),
	(43, 07, 24, 207, N'官亭乡'),
	(43, 07, 24, 208, N'九里乡');

/* 湖南省 常德市 桃源县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 07, 25, 100, N'漳江镇'),
	(43, 07, 25, 101, N'陬市镇'),
	(43, 07, 25, 102, N'盘塘镇'),
	(43, 07, 25, 103, N'热市镇'),
	(43, 07, 25, 104, N'黄石镇'),
	(43, 07, 25, 105, N'漆河镇'),
	(43, 07, 25, 106, N'理公港镇'),
	(43, 07, 25, 107, N'观音寺镇'),
	(43, 07, 25, 108, N'龙潭镇'),
	(43, 07, 25, 109, N'三阳港镇'),
	(43, 07, 25, 110, N'剪市镇'),
	(43, 07, 25, 111, N'茶庵铺镇'),
	(43, 07, 25, 112, N'西安镇'),
	(43, 07, 25, 113, N'沙坪镇'),
	(43, 07, 25, 114, N'桃花源镇'),
	(43, 07, 25, 115, N'架桥镇'),
	(43, 07, 25, 116, N'马鬃岭镇'),
	(43, 07, 25, 117, N'凌津滩镇'),
	(43, 07, 25, 200, N'青林乡'),
	(43, 07, 25, 201, N'车湖垸乡'),
	(43, 07, 25, 202, N'枫树维吾尔族回族乡'),
	(43, 07, 25, 203, N'木塘垸乡'),
	(43, 07, 25, 206, N'双溪口乡'),
	(43, 07, 25, 207, N'郝坪乡'),
	(43, 07, 25, 208, N'九溪乡'),
	(43, 07, 25, 209, N'黄甲铺乡'),
	(43, 07, 25, 210, N'钟家铺乡'),
	(43, 07, 25, 211, N'牛车河乡'),
	(43, 07, 25, 212, N'佘家坪乡'),
	(43, 07, 25, 213, N'太平桥乡'),
	(43, 07, 25, 214, N'浯溪河乡'),
	(43, 07, 25, 215, N'深水港乡'),
	(43, 07, 25, 216, N'泥窝潭乡'),
	(43, 07, 25, 218, N'兴隆街乡'),
	(43, 07, 25, 219, N'太平铺乡'),
	(43, 07, 25, 220, N'牯牛山乡'),
	(43, 07, 25, 221, N'杨溪桥乡'),
	(43, 07, 25, 222, N'寺坪乡'),
	(43, 07, 25, 223, N'郑家驿乡'),
	(43, 07, 25, 224, N'芦花潭乡');

/* 湖南省 常德市 石门县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 07, 26, 100, N'楚江镇'),
	(43, 07, 26, 101, N'蒙泉镇'),
	(43, 07, 26, 102, N'夹山镇'),
	(43, 07, 26, 103, N'易家渡镇'),
	(43, 07, 26, 104, N'新关镇'),
	(43, 07, 26, 105, N'皂市镇'),
	(43, 07, 26, 106, N'维新镇'),
	(43, 07, 26, 107, N'太平镇'),
	(43, 07, 26, 108, N'磨市镇'),
	(43, 07, 26, 109, N'壶瓶山镇'),
	(43, 07, 26, 110, N'南北镇'),
	(43, 07, 26, 200, N'二都乡'),
	(43, 07, 26, 201, N'新铺乡'),
	(43, 07, 26, 202, N'白云乡'),
	(43, 07, 26, 203, N'三圣乡'),
	(43, 07, 26, 204, N'子良乡'),
	(43, 07, 26, 205, N'所街乡'),
	(43, 07, 26, 206, N'雁池乡'),
	(43, 07, 26, 207, N'罗坪乡');

/* 湖南省 常德市 津市市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 07, 81, 001, N'三洲驿街道'),
	(43, 07, 81, 002, N'汪家桥街道'),
	(43, 07, 81, 003, N'襄阳街街道'),
	(43, 07, 81, 004, N'金鱼岭街道'),
	(43, 07, 81, 100, N'新洲镇'),
	(43, 07, 81, 101, N'渡口镇'),
	(43, 07, 81, 102, N'保和堤镇'),
	(43, 07, 81, 103, N'白衣镇'),
	(43, 07, 81, 104, N'灵泉镇'),
	(43, 07, 81, 203, N'棠华乡'),
	(43, 07, 81, 204, N'李家铺乡');

/* 湖南省 张家界市 永定区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 08, 02, 001, N'永定街道'),
	(43, 08, 02, 002, N'大庸桥街道'),
	(43, 08, 02, 003, N'西溪坪街道'),
	(43, 08, 02, 004, N'官黎坪街道'),
	(43, 08, 02, 005, N'崇文街道'),
	(43, 08, 02, 006, N'南庄坪街道'),
	(43, 08, 02, 100, N'新桥镇'),
	(43, 08, 02, 101, N'温塘镇'),
	(43, 08, 02, 102, N'教字垭镇'),
	(43, 08, 02, 103, N'大坪镇'),
	(43, 08, 02, 104, N'沅古坪镇'),
	(43, 08, 02, 105, N'尹家溪镇'),
	(43, 08, 02, 106, N'后坪镇'),
	(43, 08, 02, 107, N'阳湖坪镇'),
	(43, 08, 02, 108, N'王家坪镇'),
	(43, 08, 02, 201, N'三家馆乡'),
	(43, 08, 02, 202, N'沙堤乡'),
	(43, 08, 02, 203, N'枫香岗乡'),
	(43, 08, 02, 204, N'合作桥乡'),
	(43, 08, 02, 205, N'双溪桥乡'),
	(43, 08, 02, 206, N'谢家垭乡'),
	(43, 08, 02, 207, N'青安坪乡'),
	(43, 08, 02, 208, N'罗塔坪乡'),
	(43, 08, 02, 209, N'罗水乡'),
	(43, 08, 02, 210, N'桥头乡'),
	(43, 08, 02, 211, N'三岔乡'),
	(43, 08, 02, 212, N'四都坪乡');

/* 湖南省 张家界市 武陵源区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 08, 11, 001, N'军地坪街道'),
	(43, 08, 11, 002, N'锣鼓塔街道'),
	(43, 08, 11, 100, N'天子山镇'),
	(43, 08, 11, 200, N'索溪峪土家族乡'),
	(43, 08, 11, 201, N'协合乡'),
	(43, 08, 11, 202, N'中湖乡');

/* 湖南省 张家界市 慈利县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 08, 21, 100, N'零阳镇'),
	(43, 08, 21, 101, N'岩泊渡镇'),
	(43, 08, 21, 102, N'溪口镇'),
	(43, 08, 21, 103, N'东岳观镇'),
	(43, 08, 21, 104, N'通津铺镇'),
	(43, 08, 21, 105, N'杉木桥镇'),
	(43, 08, 21, 106, N'象市镇'),
	(43, 08, 21, 107, N'江垭镇'),
	(43, 08, 21, 108, N'苗市镇'),
	(43, 08, 21, 109, N'零溪镇'),
	(43, 08, 21, 110, N'高桥镇'),
	(43, 08, 21, 111, N'龙潭河镇'),
	(43, 08, 21, 112, N'广福桥镇'),
	(43, 08, 21, 200, N'南山坪乡'),
	(43, 08, 21, 201, N'宜冲桥乡'),
	(43, 08, 21, 202, N'洞溪乡'),
	(43, 08, 21, 203, N'金坪乡'),
	(43, 08, 21, 204, N'景龙桥乡'),
	(43, 08, 21, 205, N'二坊坪乡'),
	(43, 08, 21, 206, N'三合口乡'),
	(43, 08, 21, 207, N'国太桥乡'),
	(43, 08, 21, 208, N'庄塌乡'),
	(43, 08, 21, 209, N'杨柳铺乡'),
	(43, 08, 21, 210, N'朝阳乡'),
	(43, 08, 21, 211, N'三官寺土家族乡'),
	(43, 08, 21, 212, N'高峰土家族乡'),
	(43, 08, 21, 213, N'许家坊土家族乡'),
	(43, 08, 21, 214, N'金岩土家族乡'),
	(43, 08, 21, 215, N'赵家岗土家族乡'),
	(43, 08, 21, 216, N'甘堰土家族乡'),
	(43, 08, 21, 217, N'阳和土家族乡');

/* 湖南省 张家界市 桑植县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 08, 22, 100, N'澧源镇'),
	(43, 08, 22, 101, N'瑞塔铺镇'),
	(43, 08, 22, 102, N'官地坪镇'),
	(43, 08, 22, 103, N'凉水口镇'),
	(43, 08, 22, 104, N'龙潭坪镇'),
	(43, 08, 22, 105, N'五道水镇'),
	(43, 08, 22, 106, N'陈家河镇'),
	(43, 08, 22, 107, N'廖家村镇'),
	(43, 08, 22, 108, N'利福塔镇'),
	(43, 08, 22, 200, N'空壳树乡'),
	(43, 08, 22, 201, N'汨湖乡'),
	(43, 08, 22, 202, N'竹叶坪乡'),
	(43, 08, 22, 203, N'走马坪白族乡'),
	(43, 08, 22, 204, N'人潮溪乡'),
	(43, 08, 22, 205, N'西莲乡'),
	(43, 08, 22, 206, N'白石乡'),
	(43, 08, 22, 207, N'刘家坪白族乡'),
	(43, 08, 22, 208, N'芙蓉桥白族乡'),
	(43, 08, 22, 209, N'麦地坪白族乡'),
	(43, 08, 22, 210, N'马合口白族乡'),
	(43, 08, 22, 211, N'长潭坪乡'),
	(43, 08, 22, 212, N'淋溪河乡'),
	(43, 08, 22, 213, N'洪家关乡'),
	(43, 08, 22, 214, N'桥自湾乡'),
	(43, 08, 22, 215, N'谷罗山乡'),
	(43, 08, 22, 216, N'沙塔坪乡'),
	(43, 08, 22, 217, N'苦竹坪乡'),
	(43, 08, 22, 218, N'四方溪乡'),
	(43, 08, 22, 219, N'芭茅溪乡'),
	(43, 08, 22, 220, N'细沙坪乡'),
	(43, 08, 22, 221, N'八大公山乡'),
	(43, 08, 22, 222, N'蹇家坡乡'),
	(43, 08, 22, 223, N'岩屋口乡'),
	(43, 08, 22, 224, N'河口乡'),
	(43, 08, 22, 225, N'上河溪乡'),
	(43, 08, 22, 226, N'两河口乡'),
	(43, 08, 22, 227, N'打鼓泉乡'),
	(43, 08, 22, 228, N'上洞街乡');

/* 湖南省 益阳市 资阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 09, 02, 005, N'大码头街道'),
	(43, 09, 02, 006, N'汽车路街道'),
	(43, 09, 02, 102, N'迎风桥镇'),
	(43, 09, 02, 104, N'沙头镇'),
	(43, 09, 02, 105, N'茈湖口镇'),
	(43, 09, 02, 106, N'长春镇'),
	(43, 09, 02, 107, N'新桥河镇'),
	(43, 09, 02, 203, N'张家塞乡');

/* 湖南省 益阳市 赫山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 09, 03, 001, N'赫山街道'),
	(43, 09, 03, 002, N'桃花仑街道'),
	(43, 09, 03, 003, N'金银山街道'),
	(43, 09, 03, 006, N'会龙山街道'),
	(43, 09, 03, 007, N'鱼形山街道'),
	(43, 09, 03, 101, N'八字哨镇'),
	(43, 09, 03, 103, N'泉交河镇'),
	(43, 09, 03, 104, N'欧江岔镇'),
	(43, 09, 03, 105, N'沧水铺镇'),
	(43, 09, 03, 107, N'岳家桥镇'),
	(43, 09, 03, 110, N'新市渡镇'),
	(43, 09, 03, 111, N'兰溪镇'),
	(43, 09, 03, 112, N'龙光桥镇'),
	(43, 09, 03, 113, N'衡龙桥镇'),
	(43, 09, 03, 114, N'泥江口镇'),
	(43, 09, 03, 202, N'牌口乡'),
	(43, 09, 03, 209, N'笔架山乡');

/* 湖南省 益阳市 南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 09, 21, 102, N'明山头镇'),
	(43, 09, 21, 103, N'青树嘴镇'),
	(43, 09, 21, 106, N'厂窖镇'),
	(43, 09, 21, 107, N'武圣宫镇'),
	(43, 09, 21, 125, N'南洲镇'),
	(43, 09, 21, 126, N'华阁镇'),
	(43, 09, 21, 127, N'茅草街镇'),
	(43, 09, 21, 128, N'三仙湖镇'),
	(43, 09, 21, 129, N'麻河口镇'),
	(43, 09, 21, 131, N'浪拔湖镇'),
	(43, 09, 21, 201, N'乌嘴乡'),
	(43, 09, 21, 212, N'中鱼口乡');

/* 湖南省 益阳市 桃江县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 09, 22, 101, N'修山镇'),
	(43, 09, 22, 103, N'鸬鹚渡镇'),
	(43, 09, 22, 107, N'石牛江镇'),
	(43, 09, 22, 108, N'牛田镇'),
	(43, 09, 22, 109, N'松木塘镇'),
	(43, 09, 22, 112, N'桃花江镇'),
	(43, 09, 22, 113, N'灰山港镇'),
	(43, 09, 22, 114, N'武潭镇'),
	(43, 09, 22, 115, N'马迹塘镇'),
	(43, 09, 22, 116, N'三堂街镇'),
	(43, 09, 22, 117, N'大栗港镇'),
	(43, 09, 22, 118, N'沾溪镇'),
	(43, 09, 22, 203, N'高桥乡'),
	(43, 09, 22, 208, N'鲊埠回族乡'),
	(43, 09, 22, 212, N'浮丘山乡');

/* 湖南省 益阳市 安化县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 09, 23, 101, N'清塘铺镇'),
	(43, 09, 23, 103, N'仙溪镇'),
	(43, 09, 23, 105, N'长塘镇'),
	(43, 09, 23, 106, N'小淹镇'),
	(43, 09, 23, 108, N'羊角塘镇'),
	(43, 09, 23, 109, N'冷市镇'),
	(43, 09, 23, 111, N'奎溪镇'),
	(43, 09, 23, 112, N'烟溪镇'),
	(43, 09, 23, 113, N'渠江镇'),
	(43, 09, 23, 114, N'平口镇'),
	(43, 09, 23, 115, N'柘溪镇'),
	(43, 09, 23, 116, N'乐安镇'),
	(43, 09, 23, 117, N'滔溪镇'),
	(43, 09, 23, 118, N'梅城镇'),
	(43, 09, 23, 119, N'大福镇'),
	(43, 09, 23, 120, N'马路镇'),
	(43, 09, 23, 121, N'东坪镇'),
	(43, 09, 23, 122, N'江南镇'),
	(43, 09, 23, 200, N'高明乡'),
	(43, 09, 23, 206, N'龙塘乡'),
	(43, 09, 23, 209, N'田庄乡'),
	(43, 09, 23, 211, N'南金乡'),
	(43, 09, 23, 212, N'古楼乡');

/* 湖南省 益阳市 沅江市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 09, 81, 006, N'琼湖街道办事处'),
	(43, 09, 81, 007, N'庆云山街道办事处'),
	(43, 09, 81, 102, N'四季红镇'),
	(43, 09, 81, 105, N'泗湖山镇'),
	(43, 09, 81, 107, N'南嘴镇'),
	(43, 09, 81, 108, N'新湾镇'),
	(43, 09, 81, 110, N'茶盘洲镇'),
	(43, 09, 81, 112, N'南大膳镇'),
	(43, 09, 81, 113, N'黄茅洲镇'),
	(43, 09, 81, 114, N'草尾镇'),
	(43, 09, 81, 115, N'阳罗洲镇'),
	(43, 09, 81, 116, N'共华镇'),
	(43, 09, 81, 117, N'三眼塘镇'),
	(43, 09, 81, 209, N'万子湖乡');

/* 湖南省 郴州市 北湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 10, 02, 001, N'人民路街道办事处'),
	(43, 10, 02, 002, N'北湖街道办事处'),
	(43, 10, 02, 003, N'燕泉街道办事处'),
	(43, 10, 02, 004, N'下湄桥街道办事处'),
	(43, 10, 02, 005, N'骆仙街道办事处'),
	(43, 10, 02, 006, N'增福街道办事处'),
	(43, 10, 02, 007, N'郴江街道办事处'),
	(43, 10, 02, 008, N'涌泉街道办事处'),
	(43, 10, 02, 100, N'石盖塘镇'),
	(43, 10, 02, 101, N'华塘镇'),
	(43, 10, 02, 102, N'鲁塘镇'),
	(43, 10, 02, 105, N'保和镇'),
	(43, 10, 02, 202, N'大塘瑶族乡'),
	(43, 10, 02, 205, N'月峰瑶族乡'),
	(43, 10, 02, 206, N'芙蓉乡'),
	(43, 10, 02, 207, N'永春乡');

/* 湖南省 郴州市 苏仙区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 10, 03, 001, N'苏仙岭街道'),
	(43, 10, 03, 002, N'南塔街道'),
	(43, 10, 03, 003, N'白鹿洞街道'),
	(43, 10, 03, 004, N'王仙岭街道'),
	(43, 10, 03, 005, N'卜里坪街道'),
	(43, 10, 03, 006, N'观山洞街道'),
	(43, 10, 03, 100, N'桥口镇'),
	(43, 10, 03, 101, N'白露塘镇'),
	(43, 10, 03, 102, N'良田镇'),
	(43, 10, 03, 103, N'栖凤渡镇'),
	(43, 10, 03, 104, N'坳上镇'),
	(43, 10, 03, 105, N'许家洞镇'),
	(43, 10, 03, 107, N'五里牌镇'),
	(43, 10, 03, 108, N'望仙镇'),
	(43, 10, 03, 109, N'五盖山镇'),
	(43, 10, 03, 202, N'马头岭乡');

/* 湖南省 郴州市 桂阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 10, 21, 001, N'龙潭街道'),
	(43, 10, 21, 002, N'鹿峰街道'),
	(43, 10, 21, 003, N'黄沙坪街道'),
	(43, 10, 21, 102, N'仁义镇'),
	(43, 10, 21, 103, N'太和镇'),
	(43, 10, 21, 104, N'洋市镇'),
	(43, 10, 21, 105, N'和平镇'),
	(43, 10, 21, 106, N'流峰镇'),
	(43, 10, 21, 107, N'塘市镇'),
	(43, 10, 21, 108, N'莲塘镇'),
	(43, 10, 21, 109, N'舂陵江镇'),
	(43, 10, 21, 110, N'荷叶镇'),
	(43, 10, 21, 111, N'方元镇'),
	(43, 10, 21, 112, N'樟市镇'),
	(43, 10, 21, 113, N'敖泉镇'),
	(43, 10, 21, 114, N'正和镇'),
	(43, 10, 21, 115, N'浩塘镇'),
	(43, 10, 21, 116, N'雷坪镇'),
	(43, 10, 21, 117, N'欧阳海镇'),
	(43, 10, 21, 118, N'四里镇'),
	(43, 10, 21, 209, N'桥市乡'),
	(43, 10, 21, 214, N'华山瑶族乡'),
	(43, 10, 21, 217, N'泗洲乡'),
	(43, 10, 21, 219, N'光明乡'),
	(43, 10, 21, 220, N'白水乡'),
	(43, 10, 21, 221, N'杨柳瑶族乡');

/* 湖南省 郴州市 宜章县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 10, 22, 101, N'白石渡镇'),
	(43, 10, 22, 102, N'杨梅山镇'),
	(43, 10, 22, 103, N'瑶岗仙镇'),
	(43, 10, 22, 104, N'梅田镇'),
	(43, 10, 22, 105, N'麻田镇'),
	(43, 10, 22, 106, N'黄沙镇'),
	(43, 10, 22, 107, N'迎春镇'),
	(43, 10, 22, 108, N'一六镇'),
	(43, 10, 22, 109, N'栗源镇'),
	(43, 10, 22, 110, N'岩泉镇'),
	(43, 10, 22, 111, N'玉溪镇'),
	(43, 10, 22, 201, N'浆水乡'),
	(43, 10, 22, 202, N'长村乡'),
	(43, 10, 22, 204, N'天塘乡'),
	(43, 10, 22, 205, N'莽山瑶族乡'),
	(43, 10, 22, 206, N'笆篱乡'),
	(43, 10, 22, 207, N'白沙圩乡'),
	(43, 10, 22, 208, N'关溪乡'),
	(43, 10, 22, 210, N'里田乡'),
	(43, 10, 22, 212, N'赤石乡'),
	(43, 10, 22, 213, N'平和乡'),
	(43, 10, 22, 216, N'五岭乡');

/* 湖南省 郴州市 永兴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 10, 23, 101, N'马田镇'),
	(43, 10, 23, 102, N'湘阴渡镇'),
	(43, 10, 23, 103, N'塘门口镇'),
	(43, 10, 23, 104, N'金龟镇'),
	(43, 10, 23, 105, N'柏林镇'),
	(43, 10, 23, 106, N'鲤鱼塘镇'),
	(43, 10, 23, 107, N'油市镇'),
	(43, 10, 23, 108, N'便江镇'),
	(43, 10, 23, 109, N'悦来镇'),
	(43, 10, 23, 110, N'复和镇'),
	(43, 10, 23, 111, N'高亭镇'),
	(43, 10, 23, 112, N'黄泥镇'),
	(43, 10, 23, 113, N'樟树镇'),
	(43, 10, 23, 114, N'太和镇'),
	(43, 10, 23, 203, N'洋塘乡'),
	(43, 10, 23, 205, N'油麻乡'),
	(43, 10, 23, 206, N'三塘乡'),
	(43, 10, 23, 209, N'香梅乡'),
	(43, 10, 23, 214, N'大布江乡'),
	(43, 10, 23, 215, N'龙形市乡'),
	(43, 10, 23, 216, N'七甲乡');

/* 湖南省 郴州市 嘉禾县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 10, 24, 100, N'珠泉镇'),
	(43, 10, 24, 101, N'车头镇'),
	(43, 10, 24, 102, N'塘村镇'),
	(43, 10, 24, 103, N'袁家镇'),
	(43, 10, 24, 104, N'行廊镇'),
	(43, 10, 24, 105, N'肖家镇'),
	(43, 10, 24, 106, N'龙潭镇'),
	(43, 10, 24, 107, N'石桥镇'),
	(43, 10, 24, 108, N'坦坪镇'),
	(43, 10, 24, 109, N'田心镇'),
	(43, 10, 24, 110, N'广发镇'),
	(43, 10, 24, 201, N'普满乡'),
	(43, 10, 24, 206, N'盘江乡');

/* 湖南省 郴州市 临武县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 10, 25, 100, N'舜峰镇'),
	(43, 10, 25, 101, N'金江镇'),
	(43, 10, 25, 104, N'武水镇'),
	(43, 10, 25, 105, N'南强镇'),
	(43, 10, 25, 106, N'汾市镇'),
	(43, 10, 25, 107, N'水东镇'),
	(43, 10, 25, 108, N'楚江镇'),
	(43, 10, 25, 109, N'麦市镇'),
	(43, 10, 25, 110, N'香花镇'),
	(43, 10, 25, 200, N'双溪乡'),
	(43, 10, 25, 203, N'同益乡'),
	(43, 10, 25, 205, N'土地乡'),
	(43, 10, 25, 208, N'花塘乡'),
	(43, 10, 25, 210, N'武源乡'),
	(43, 10, 25, 211, N'万水乡'),
	(43, 10, 25, 214, N'镇南乡'),
	(43, 10, 25, 215, N'大冲乡'),
	(43, 10, 25, 216, N'西山瑶族乡');

/* 湖南省 郴州市 汝城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 10, 26, 101, N'小垣瑶族镇'),
	(43, 10, 26, 102, N'热水镇'),
	(43, 10, 26, 103, N'土桥镇'),
	(43, 10, 26, 104, N'泉水镇'),
	(43, 10, 26, 105, N'暖水镇'),
	(43, 10, 26, 106, N'大坪镇'),
	(43, 10, 26, 107, N'三江口瑶族镇'),
	(43, 10, 26, 108, N'卢阳镇'),
	(43, 10, 26, 109, N'马桥镇'),
	(43, 10, 26, 110, N'文明镇'),
	(43, 10, 26, 202, N'井坡乡'),
	(43, 10, 26, 204, N'盈洞瑶族乡'),
	(43, 10, 26, 205, N'岭秀瑶族乡'),
	(43, 10, 26, 206, N'田庄乡'),
	(43, 10, 26, 207, N'南洞乡'),
	(43, 10, 26, 208, N'永丰乡'),
	(43, 10, 26, 209, N'濠头乡'),
	(43, 10, 26, 214, N'延寿瑶族乡'),
	(43, 10, 26, 216, N'集益乡');

/* 湖南省 郴州市 桂东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 10, 27, 100, N'沤江镇'),
	(43, 10, 27, 101, N'沙田镇'),
	(43, 10, 27, 102, N'清泉镇'),
	(43, 10, 27, 103, N'大塘镇'),
	(43, 10, 27, 104, N'四都镇'),
	(43, 10, 27, 105, N'寨前镇'),
	(43, 10, 27, 106, N'普乐镇'),
	(43, 10, 27, 200, N'桥头乡'),
	(43, 10, 27, 201, N'寒口乡'),
	(43, 10, 27, 204, N'增口乡'),
	(43, 10, 27, 206, N'流源乡'),
	(43, 10, 27, 208, N'新坊乡'),
	(43, 10, 27, 210, N'东洛乡'),
	(43, 10, 27, 211, N'贝溪乡'),
	(43, 10, 27, 213, N'青山乡');

/* 湖南省 郴州市 安仁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 10, 28, 101, N'安平镇'),
	(43, 10, 28, 102, N'龙海镇'),
	(43, 10, 28, 104, N'关王镇'),
	(43, 10, 28, 105, N'灵官镇'),
	(43, 10, 28, 106, N'永乐江镇'),
	(43, 10, 28, 201, N'龙市乡'),
	(43, 10, 28, 204, N'渡口乡'),
	(43, 10, 28, 205, N'华王乡'),
	(43, 10, 28, 206, N'牌楼乡'),
	(43, 10, 28, 207, N'平背乡'),
	(43, 10, 28, 208, N'坪上乡'),
	(43, 10, 28, 209, N'承坪乡'),
	(43, 10, 28, 210, N'竹山乡'),
	(43, 10, 28, 211, N'豪山乡'),
	(43, 10, 28, 212, N'羊脑乡'),
	(43, 10, 28, 213, N'新洲乡'),
	(43, 10, 28, 214, N'洋际乡');

/* 湖南省 郴州市 资兴市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 10, 81, 001, N'唐洞街道'),
	(43, 10, 81, 002, N'东江街道'),
	(43, 10, 81, 100, N'滁口镇'),
	(43, 10, 81, 102, N'三都镇'),
	(43, 10, 81, 103, N'蓼江镇'),
	(43, 10, 81, 104, N'七里镇'),
	(43, 10, 81, 105, N'兴宁镇'),
	(43, 10, 81, 106, N'州门司镇'),
	(43, 10, 81, 107, N'青腰镇'),
	(43, 10, 81, 108, N'黄草镇'),
	(43, 10, 81, 110, N'汤溪镇'),
	(43, 10, 81, 111, N'程水镇'),
	(43, 10, 81, 202, N'东坪乡'),
	(43, 10, 81, 203, N'团结瑶族乡'),
	(43, 10, 81, 207, N'连坪瑶族乡'),
	(43, 10, 81, 213, N'兰市乡'),
	(43, 10, 81, 214, N'波水乡'),
	(43, 10, 81, 216, N'清江乡'),
	(43, 10, 81, 217, N'龙溪乡'),
	(43, 10, 81, 218, N'白廊乡');

/* 湖南省 永州市 零陵区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 11, 02, 001, N'朝阳街道'),
	(43, 11, 02, 002, N'南津渡街道'),
	(43, 11, 02, 003, N'七里店街道'),
	(43, 11, 02, 004, N'徐家井街道'),
	(43, 11, 02, 101, N'水口山镇'),
	(43, 11, 02, 102, N'珠山镇'),
	(43, 11, 02, 103, N'黄田铺镇'),
	(43, 11, 02, 104, N'富家桥镇'),
	(43, 11, 02, 105, N'菱角塘镇'),
	(43, 11, 02, 106, N'邮亭圩镇'),
	(43, 11, 02, 107, N'接履桥镇'),
	(43, 11, 02, 108, N'石岩头镇'),
	(43, 11, 02, 200, N'大庆坪乡'),
	(43, 11, 02, 201, N'梳子铺乡'),
	(43, 11, 02, 202, N'石山脚乡'),
	(43, 11, 02, 203, N'凼底乡');

/* 湖南省 永州市 冷水滩区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 11, 03, 001, N'梅湾街道'),
	(43, 11, 03, 002, N'菱角山街道'),
	(43, 11, 03, 003, N'肖家园街道'),
	(43, 11, 03, 004, N'杨家桥街道'),
	(43, 11, 03, 005, N'梧桐街道'),
	(43, 11, 03, 006, N'凤凰街道'),
	(43, 11, 03, 007, N'珊瑚街道'),
	(43, 11, 03, 008, N'曲河街道'),
	(43, 11, 03, 101, N'花桥街镇'),
	(43, 11, 03, 102, N'普利桥镇'),
	(43, 11, 03, 103, N'牛角坝镇'),
	(43, 11, 03, 104, N'高溪市镇'),
	(43, 11, 03, 105, N'黄阳司镇'),
	(43, 11, 03, 106, N'上岭桥镇'),
	(43, 11, 03, 107, N'竹山桥镇'),
	(43, 11, 03, 108, N'伊塘镇'),
	(43, 11, 03, 109, N'岚角山镇'),
	(43, 11, 03, 110, N'蔡市镇'),
	(43, 11, 03, 201, N'杨村甸乡');

/* 湖南省 永州市 祁阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 11, 21, 001, N'龙山街道'),
	(43, 11, 21, 002, N'长虹街道'),
	(43, 11, 21, 003, N'浯溪街道'),
	(43, 11, 21, 101, N'观音滩镇'),
	(43, 11, 21, 102, N'茅竹镇'),
	(43, 11, 21, 103, N'大忠桥镇'),
	(43, 11, 21, 104, N'三口塘镇'),
	(43, 11, 21, 105, N'肖家村镇'),
	(43, 11, 21, 106, N'八宝镇'),
	(43, 11, 21, 107, N'白水镇'),
	(43, 11, 21, 108, N'黄泥塘镇'),
	(43, 11, 21, 109, N'进宝塘镇'),
	(43, 11, 21, 110, N'潘市镇'),
	(43, 11, 21, 111, N'梅溪镇'),
	(43, 11, 21, 112, N'羊角塘镇'),
	(43, 11, 21, 113, N'下马渡镇'),
	(43, 11, 21, 114, N'七里桥镇'),
	(43, 11, 21, 115, N'大村甸镇'),
	(43, 11, 21, 116, N'黎家坪镇'),
	(43, 11, 21, 117, N'文富市镇'),
	(43, 11, 21, 118, N'文明铺镇'),
	(43, 11, 21, 119, N'龚家坪镇'),
	(43, 11, 21, 206, N'内下乡'),
	(43, 11, 21, 208, N'挂榜山乡'),
	(43, 11, 21, 209, N'大江乡');

/* 湖南省 永州市 东安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 11, 22, 100, N'白牙市镇'),
	(43, 11, 22, 101, N'大庙口镇'),
	(43, 11, 22, 102, N'紫溪市镇'),
	(43, 11, 22, 103, N'横塘镇'),
	(43, 11, 22, 104, N'石期市镇'),
	(43, 11, 22, 105, N'井头圩镇'),
	(43, 11, 22, 106, N'端桥铺镇'),
	(43, 11, 22, 107, N'鹿马桥镇'),
	(43, 11, 22, 108, N'芦洪市镇'),
	(43, 11, 22, 109, N'新圩江镇'),
	(43, 11, 22, 110, N'花桥镇'),
	(43, 11, 22, 111, N'大盛镇'),
	(43, 11, 22, 112, N'南桥镇'),
	(43, 11, 22, 200, N'大江口乡'),
	(43, 11, 22, 201, N'川岩乡'),
	(43, 11, 22, 202, N'水岭乡'),
	(43, 11, 22, 203, N'黄泥洞乡');

/* 湖南省 永州市 双牌县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 11, 23, 100, N'泷泊镇'),
	(43, 11, 23, 101, N'江村镇'),
	(43, 11, 23, 102, N'五里牌镇'),
	(43, 11, 23, 103, N'茶林镇'),
	(43, 11, 23, 104, N'何家洞镇'),
	(43, 11, 23, 105, N'麻江镇'),
	(43, 11, 23, 200, N'平福头乡'),
	(43, 11, 23, 201, N'尚仁里乡'),
	(43, 11, 23, 202, N'永江乡'),
	(43, 11, 23, 206, N'塘底乡'),
	(43, 11, 23, 207, N'上梧江瑶族乡'),
	(43, 11, 23, 208, N'理家坪乡'),
	(43, 11, 23, 209, N'五星岭乡'),
	(43, 11, 23, 210, N'打鼓坪乡');

/* 湖南省 永州市 道县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 11, 24, 001, N'濂溪街道'),
	(43, 11, 24, 002, N'西洲街道'),
	(43, 11, 24, 003, N'上关街道'),
	(43, 11, 24, 004, N'营江街道'),
	(43, 11, 24, 005, N'东门街道'),
	(43, 11, 24, 006, N'富塘街道'),
	(43, 11, 24, 007, N'万家庄街道'),
	(43, 11, 24, 101, N'梅花镇'),
	(43, 11, 24, 102, N'寿雁镇'),
	(43, 11, 24, 103, N'仙子脚镇'),
	(43, 11, 24, 104, N'清塘镇'),
	(43, 11, 24, 105, N'祥霖铺镇'),
	(43, 11, 24, 106, N'蚣坝镇'),
	(43, 11, 24, 107, N'四马桥镇'),
	(43, 11, 24, 108, N'白马渡镇'),
	(43, 11, 24, 109, N'柑子园镇'),
	(43, 11, 24, 110, N'新车镇'),
	(43, 11, 24, 111, N'白芒铺镇'),
	(43, 11, 24, 112, N'桥头镇'),
	(43, 11, 24, 201, N'乐福堂乡'),
	(43, 11, 24, 210, N'审章塘瑶族乡'),
	(43, 11, 24, 211, N'井塘瑶族乡'),
	(43, 11, 24, 212, N'横岭瑶族乡'),
	(43, 11, 24, 213, N'洪塘营瑶族乡');

/* 湖南省 永州市 江永县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 11, 25, 100, N'潇浦镇'),
	(43, 11, 25, 101, N'上江圩镇'),
	(43, 11, 25, 102, N'允山镇'),
	(43, 11, 25, 103, N'夏层铺镇'),
	(43, 11, 25, 104, N'桃川镇'),
	(43, 11, 25, 105, N'粗石江镇'),
	(43, 11, 25, 200, N'松柏瑶族乡'),
	(43, 11, 25, 201, N'黄甲岭乡'),
	(43, 11, 25, 202, N'千家峒瑶族乡'),
	(43, 11, 25, 203, N'兰溪瑶族乡'),
	(43, 11, 25, 204, N'源口瑶族乡');

/* 湖南省 永州市 宁远县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 11, 26, 001, N'文庙街道'),
	(43, 11, 26, 002, N'舜陵街道'),
	(43, 11, 26, 003, N'桐山街道'),
	(43, 11, 26, 004, N'东溪街道'),
	(43, 11, 26, 101, N'天堂镇'),
	(43, 11, 26, 102, N'水市镇'),
	(43, 11, 26, 103, N'湾井镇'),
	(43, 11, 26, 104, N'冷水镇'),
	(43, 11, 26, 105, N'太平镇'),
	(43, 11, 26, 106, N'禾亭镇'),
	(43, 11, 26, 107, N'仁和镇'),
	(43, 11, 26, 108, N'中和镇'),
	(43, 11, 26, 109, N'柏家坪镇'),
	(43, 11, 26, 110, N'清水桥镇'),
	(43, 11, 26, 111, N'鲤溪镇'),
	(43, 11, 26, 112, N'保安镇'),
	(43, 11, 26, 200, N'九疑山瑶族乡'),
	(43, 11, 26, 202, N'五龙山瑶族乡'),
	(43, 11, 26, 203, N'棉花坪瑶族乡'),
	(43, 11, 26, 204, N'桐木漯瑶族乡');

/* 湖南省 永州市 蓝山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 11, 27, 100, N'塔峰镇'),
	(43, 11, 27, 101, N'竹管寺镇'),
	(43, 11, 27, 102, N'毛俊镇'),
	(43, 11, 27, 103, N'楠市镇'),
	(43, 11, 27, 104, N'所城镇'),
	(43, 11, 27, 105, N'新圩镇'),
	(43, 11, 27, 200, N'汇源瑶族乡'),
	(43, 11, 27, 201, N'犁头瑶族乡'),
	(43, 11, 27, 202, N'浆洞瑶族乡'),
	(43, 11, 27, 203, N'紫良瑶族乡'),
	(43, 11, 27, 204, N'大桥瑶族乡'),
	(43, 11, 27, 205, N'荆竹瑶族乡'),
	(43, 11, 27, 206, N'祠堂圩乡'),
	(43, 11, 27, 207, N'土市乡'),
	(43, 11, 27, 208, N'太平圩乡');

/* 湖南省 永州市 新田县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 11, 28, 100, N'龙泉镇'),
	(43, 11, 28, 101, N'金陵镇'),
	(43, 11, 28, 102, N'骥村镇'),
	(43, 11, 28, 103, N'枧头镇'),
	(43, 11, 28, 104, N'新圩镇'),
	(43, 11, 28, 105, N'石羊镇'),
	(43, 11, 28, 106, N'新隆镇'),
	(43, 11, 28, 107, N'十字镇'),
	(43, 11, 28, 108, N'大坪塘镇'),
	(43, 11, 28, 200, N'莲花乡'),
	(43, 11, 28, 201, N'冷水井乡'),
	(43, 11, 28, 202, N'门楼下瑶族乡'),
	(43, 11, 28, 203, N'茂家乡'),
	(43, 11, 28, 204, N'毛里乡'),
	(43, 11, 28, 206, N'金盆圩乡'),
	(43, 11, 28, 207, N'三井乡'),
	(43, 11, 28, 208, N'陶岭乡'),
	(43, 11, 28, 209, N'高山乡'),
	(43, 11, 28, 210, N'知市坪乡');

/* 湖南省 永州市 江华瑶族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 11, 29, 100, N'沱江镇'),
	(43, 11, 29, 101, N'桥头铺镇'),
	(43, 11, 29, 102, N'东田镇'),
	(43, 11, 29, 103, N'大路铺镇'),
	(43, 11, 29, 104, N'白芒营镇'),
	(43, 11, 29, 105, N'涛圩镇'),
	(43, 11, 29, 106, N'河路口镇'),
	(43, 11, 29, 107, N'小圩镇'),
	(43, 11, 29, 108, N'大圩镇'),
	(43, 11, 29, 109, N'水口镇'),
	(43, 11, 29, 110, N'码市镇'),
	(43, 11, 29, 200, N'界牌乡'),
	(43, 11, 29, 201, N'桥市乡'),
	(43, 11, 29, 202, N'大石桥乡'),
	(43, 11, 29, 203, N'清塘壮族乡'),
	(43, 11, 29, 204, N'两岔河乡'),
	(43, 11, 29, 205, N'务江乡'),
	(43, 11, 29, 206, N'花江乡'),
	(43, 11, 29, 207, N'湘江乡'),
	(43, 11, 29, 208, N'贝江乡'),
	(43, 11, 29, 209, N'未竹口乡'),
	(43, 11, 29, 210, N'大锡乡');

/* 湖南省 怀化市 鹤城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 02, 001, N'城中街道'),
	(43, 12, 02, 002, N'城北街道'),
	(43, 12, 02, 003, N'红星街道'),
	(43, 12, 02, 004, N'迎丰街道'),
	(43, 12, 02, 005, N'坨院街道'),
	(43, 12, 02, 006, N'河西街道'),
	(43, 12, 02, 007, N'城南街道'),
	(43, 12, 02, 101, N'黄金坳镇'),
	(43, 12, 02, 201, N'盈口乡'),
	(43, 12, 02, 202, N'杨村乡'),
	(43, 12, 02, 203, N'石门乡'),
	(43, 12, 02, 204, N'贺家田乡'),
	(43, 12, 02, 205, N'凉亭坳乡'),
	(43, 12, 02, 206, N'芦坪乡');

/* 湖南省 怀化市 中方县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 21, 100, N'中方镇'),
	(43, 12, 21, 101, N'牌楼镇'),
	(43, 12, 21, 102, N'泸阳镇'),
	(43, 12, 21, 103, N'花桥镇'),
	(43, 12, 21, 104, N'铜湾镇'),
	(43, 12, 21, 105, N'桐木镇'),
	(43, 12, 21, 106, N'铁坡镇'),
	(43, 12, 21, 107, N'新建镇'),
	(43, 12, 21, 108, N'接龙镇'),
	(43, 12, 21, 109, N'铜鼎镇'),
	(43, 12, 21, 110, N'新路河镇'),
	(43, 12, 21, 200, N'炉亭坳乡'),
	(43, 12, 21, 201, N'下坪乡'),
	(43, 12, 21, 202, N'聂家村乡'),
	(43, 12, 21, 203, N'龙场乡'),
	(43, 12, 21, 206, N'袁家乡'),
	(43, 12, 21, 207, N'蒋家乡'),
	(43, 12, 21, 209, N'丁家乡'),
	(43, 12, 21, 211, N'锦溪乡'),
	(43, 12, 21, 212, N'活水乡'),
	(43, 12, 21, 213, N'石宝乡'),
	(43, 12, 21, 214, N'蒿吉坪瑶族乡');

/* 湖南省 怀化市 沅陵县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 22, 102, N'麻溪铺镇'),
	(43, 12, 22, 105, N'五强溪镇'),
	(43, 12, 22, 109, N'沅陵镇'),
	(43, 12, 22, 110, N'明溪口镇'),
	(43, 12, 22, 111, N'凉水井镇'),
	(43, 12, 22, 112, N'七甲坪镇'),
	(43, 12, 22, 113, N'筲箕湾镇'),
	(43, 12, 22, 114, N'官庄镇'),
	(43, 12, 22, 223, N'杜家坪乡'),
	(43, 12, 22, 224, N'楠木铺乡'),
	(43, 12, 22, 229, N'深溪口乡'),
	(43, 12, 22, 230, N'肖家桥乡'),
	(43, 12, 22, 234, N'火场土家族乡'),
	(43, 12, 22, 238, N'陈家滩乡'),
	(43, 12, 22, 239, N'清浪乡'),
	(43, 12, 22, 245, N'借母溪乡'),
	(43, 12, 22, 247, N'荔溪乡'),
	(43, 12, 22, 248, N'大合坪乡'),
	(43, 12, 22, 249, N'太常乡'),
	(43, 12, 22, 250, N'马底驿乡'),
	(43, 12, 22, 251, N'北溶乡'),
	(43, 12, 22, 252, N'二酉乡'),
	(43, 12, 22, 253, N'盘古乡');

/* 湖南省 怀化市 辰溪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 23, 100, N'辰阳镇'),
	(43, 12, 23, 101, N'孝坪镇'),
	(43, 12, 23, 102, N'田湾镇'),
	(43, 12, 23, 103, N'火马冲镇'),
	(43, 12, 23, 104, N'黄溪口镇'),
	(43, 12, 23, 105, N'潭湾镇'),
	(43, 12, 23, 106, N'安坪镇'),
	(43, 12, 23, 107, N'寺前镇'),
	(43, 12, 23, 200, N'船溪乡'),
	(43, 12, 23, 201, N'城郊乡'),
	(43, 12, 23, 202, N'板桥乡'),
	(43, 12, 23, 204, N'长田湾乡'),
	(43, 12, 23, 205, N'小龙门乡'),
	(43, 12, 23, 206, N'后塘瑶族乡'),
	(43, 12, 23, 207, N'苏木溪瑶族乡'),
	(43, 12, 23, 208, N'罗子山瑶族乡'),
	(43, 12, 23, 209, N'上蒲溪瑶族乡'),
	(43, 12, 23, 210, N'仙人湾瑶族乡'),
	(43, 12, 23, 211, N'龙头庵乡'),
	(43, 12, 23, 212, N'锦滨乡'),
	(43, 12, 23, 213, N'石碧乡'),
	(43, 12, 23, 214, N'桥头乡'),
	(43, 12, 23, 215, N'大水田乡'),
	(43, 12, 23, 216, N'桥头溪乡'),
	(43, 12, 23, 217, N'石马湾乡'),
	(43, 12, 23, 218, N'龙泉岩乡'),
	(43, 12, 23, 219, N'修溪乡'),
	(43, 12, 23, 220, N'伍家湾乡'),
	(43, 12, 23, 221, N'柿溪乡'),
	(43, 12, 23, 222, N'谭家场乡');

/* 湖南省 怀化市 溆浦县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 24, 100, N'卢峰镇'),
	(43, 12, 24, 101, N'江口镇'),
	(43, 12, 24, 102, N'低庄镇'),
	(43, 12, 24, 103, N'桥江镇'),
	(43, 12, 24, 104, N'龙潭镇'),
	(43, 12, 24, 105, N'均坪镇'),
	(43, 12, 24, 106, N'观音阁镇'),
	(43, 12, 24, 107, N'双井镇'),
	(43, 12, 24, 108, N'水东镇'),
	(43, 12, 24, 109, N'两丫坪镇'),
	(43, 12, 24, 110, N'黄茅园镇'),
	(43, 12, 24, 111, N'祖市殿镇'),
	(43, 12, 24, 112, N'葛竹坪镇'),
	(43, 12, 24, 113, N'谭家湾镇'),
	(43, 12, 24, 200, N'洑水湾乡'),
	(43, 12, 24, 201, N'小江口乡'),
	(43, 12, 24, 202, N'思蒙乡'),
	(43, 12, 24, 203, N'木溪乡'),
	(43, 12, 24, 204, N'舒溶溪乡'),
	(43, 12, 24, 205, N'仲夏乡'),
	(43, 12, 24, 207, N'水隘乡'),
	(43, 12, 24, 208, N'让家溪乡'),
	(43, 12, 24, 209, N'大渭溪乡'),
	(43, 12, 24, 210, N'岩家垅乡'),
	(43, 12, 24, 212, N'水田庄乡'),
	(43, 12, 24, 213, N'油洋乡'),
	(43, 12, 24, 214, N'新田乡'),
	(43, 12, 24, 215, N'岗东乡'),
	(43, 12, 24, 216, N'两江乡'),
	(43, 12, 24, 217, N'善溪乡'),
	(43, 12, 24, 218, N'桐木溪乡'),
	(43, 12, 24, 219, N'小横垅乡'),
	(43, 12, 24, 220, N'统溪河乡'),
	(43, 12, 24, 221, N'龙王江乡'),
	(43, 12, 24, 222, N'陶金坪乡'),
	(43, 12, 24, 223, N'中都乡'),
	(43, 12, 24, 224, N'沿溪乡'),
	(43, 12, 24, 225, N'九溪江乡'),
	(43, 12, 24, 226, N'北斗溪乡'),
	(43, 12, 24, 227, N'横板桥乡'),
	(43, 12, 24, 228, N'温水乡'),
	(43, 12, 24, 229, N'大华乡'),
	(43, 12, 24, 230, N'龙庄湾乡');

/* 湖南省 怀化市 会同县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 25, 100, N'林城镇'),
	(43, 12, 25, 101, N'坪村镇'),
	(43, 12, 25, 102, N'堡子镇'),
	(43, 12, 25, 103, N'团河镇'),
	(43, 12, 25, 104, N'若水镇'),
	(43, 12, 25, 105, N'朗江镇'),
	(43, 12, 25, 106, N'广坪镇'),
	(43, 12, 25, 107, N'马鞍镇'),
	(43, 12, 25, 200, N'沙溪乡'),
	(43, 12, 25, 201, N'金子岩侗族苗族乡'),
	(43, 12, 25, 202, N'王家坪乡'),
	(43, 12, 25, 203, N'长寨乡'),
	(43, 12, 25, 204, N'高椅乡'),
	(43, 12, 25, 205, N'黄茅乡'),
	(43, 12, 25, 206, N'肖家乡'),
	(43, 12, 25, 207, N'金龙乡'),
	(43, 12, 25, 209, N'宝田侗族苗族乡'),
	(43, 12, 25, 210, N'漠滨侗族苗族乡'),
	(43, 12, 25, 211, N'蒲稳侗族苗族乡'),
	(43, 12, 25, 212, N'青朗侗族苗族乡'),
	(43, 12, 25, 213, N'炮团侗族苗族乡'),
	(43, 12, 25, 214, N'地灵乡'),
	(43, 12, 25, 215, N'连山乡'),
	(43, 12, 25, 216, N'岩头乡'),
	(43, 12, 25, 217, N'洒溪乡');

/* 湖南省 怀化市 麻阳苗族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 26, 101, N'锦和镇'),
	(43, 12, 26, 102, N'江口墟镇'),
	(43, 12, 26, 103, N'岩门镇'),
	(43, 12, 26, 104, N'兰里镇'),
	(43, 12, 26, 105, N'吕家坪镇'),
	(43, 12, 26, 106, N'高村镇'),
	(43, 12, 26, 200, N'郭公坪乡'),
	(43, 12, 26, 201, N'长潭乡'),
	(43, 12, 26, 202, N'拖冲乡'),
	(43, 12, 26, 203, N'尧市乡'),
	(43, 12, 26, 204, N'文昌阁乡'),
	(43, 12, 26, 205, N'大桥江乡'),
	(43, 12, 26, 206, N'舒家村乡'),
	(43, 12, 26, 207, N'隆家堡乡'),
	(43, 12, 26, 208, N'谭家寨乡'),
	(43, 12, 26, 209, N'石羊哨乡'),
	(43, 12, 26, 210, N'板栗树乡'),
	(43, 12, 26, 211, N'谷达坡乡'),
	(43, 12, 26, 212, N'兰村乡'),
	(43, 12, 26, 213, N'栗坪乡'),
	(43, 12, 26, 214, N'绿溪口乡'),
	(43, 12, 26, 215, N'和坪溪乡'),
	(43, 12, 26, 216, N'黄桑乡');

/* 湖南省 怀化市 新晃侗族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 27, 100, N'新晃镇'),
	(43, 12, 27, 101, N'波洲镇'),
	(43, 12, 27, 102, N'兴隆镇'),
	(43, 12, 27, 103, N'鱼市镇'),
	(43, 12, 27, 104, N'凉伞镇'),
	(43, 12, 27, 105, N'扶罗镇'),
	(43, 12, 27, 106, N'中寨镇'),
	(43, 12, 27, 200, N'步头降苗族乡'),
	(43, 12, 27, 201, N'洞坪乡'),
	(43, 12, 27, 202, N'大湾罗乡'),
	(43, 12, 27, 203, N'方家屯乡'),
	(43, 12, 27, 204, N'晏家乡'),
	(43, 12, 27, 205, N'林冲乡'),
	(43, 12, 27, 206, N'天堂乡'),
	(43, 12, 27, 207, N'黄雷乡'),
	(43, 12, 27, 208, N'凳寨乡'),
	(43, 12, 27, 209, N'茶坪乡'),
	(43, 12, 27, 210, N'新寨乡'),
	(43, 12, 27, 211, N'贡溪乡'),
	(43, 12, 27, 212, N'李树乡'),
	(43, 12, 27, 213, N'禾滩乡'),
	(43, 12, 27, 214, N'碧朗乡'),
	(43, 12, 27, 215, N'米贝苗族乡');

/* 湖南省 怀化市 芷江侗族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 28, 100, N'芷江镇'),
	(43, 12, 28, 101, N'罗旧镇'),
	(43, 12, 28, 102, N'新店坪镇'),
	(43, 12, 28, 103, N'碧涌镇'),
	(43, 12, 28, 104, N'公坪镇'),
	(43, 12, 28, 201, N'牛牯坪乡'),
	(43, 12, 28, 202, N'艾头坪乡'),
	(43, 12, 28, 203, N'岩桥乡'),
	(43, 12, 28, 204, N'水宽乡'),
	(43, 12, 28, 206, N'木叶溪乡'),
	(43, 12, 28, 207, N'五郎溪乡'),
	(43, 12, 28, 208, N'麻缨塘乡'),
	(43, 12, 28, 209, N'竹坪铺乡'),
	(43, 12, 28, 210, N'土桥乡'),
	(43, 12, 28, 211, N'上坪乡'),
	(43, 12, 28, 212, N'大树坳乡'),
	(43, 12, 28, 213, N'大洪山乡'),
	(43, 12, 28, 214, N'杨公庙乡'),
	(43, 12, 28, 215, N'梨溪口乡'),
	(43, 12, 28, 216, N'洞下场乡'),
	(43, 12, 28, 217, N'罗岩乡'),
	(43, 12, 28, 218, N'板山乡'),
	(43, 12, 28, 219, N'大垅乡'),
	(43, 12, 28, 220, N'禾梨坳乡'),
	(43, 12, 28, 221, N'冷水溪乡'),
	(43, 12, 28, 222, N'楠木坪乡'),
	(43, 12, 28, 223, N'晓坪乡'),
	(43, 12, 28, 224, N'罗卜田乡');

/* 湖南省 怀化市 靖州苗族侗族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 29, 100, N'渠阳镇'),
	(43, 12, 29, 101, N'甘棠镇'),
	(43, 12, 29, 102, N'大堡子镇'),
	(43, 12, 29, 103, N'坳上镇'),
	(43, 12, 29, 104, N'新厂镇'),
	(43, 12, 29, 105, N'平茶镇'),
	(43, 12, 29, 200, N'太阳坪乡'),
	(43, 12, 29, 201, N'三锹乡'),
	(43, 12, 29, 202, N'文溪乡'),
	(43, 12, 29, 203, N'寨牙乡'),
	(43, 12, 29, 204, N'横江桥乡'),
	(43, 12, 29, 205, N'铺口乡'),
	(43, 12, 29, 206, N'藕团乡');

/* 湖南省 怀化市 通道侗族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 30, 100, N'双江镇'),
	(43, 12, 30, 101, N'县溪镇'),
	(43, 12, 30, 102, N'播阳镇'),
	(43, 12, 30, 103, N'临口镇'),
	(43, 12, 30, 104, N'牙屯堡镇'),
	(43, 12, 30, 105, N'菁芜洲镇'),
	(43, 12, 30, 106, N'溪口镇'),
	(43, 12, 30, 107, N'陇城镇'),
	(43, 12, 30, 200, N'江口乡'),
	(43, 12, 30, 201, N'锅冲苗族乡'),
	(43, 12, 30, 203, N'大高坪苗族乡'),
	(43, 12, 30, 204, N'独坡乡'),
	(43, 12, 30, 209, N'杉木桥乡'),
	(43, 12, 30, 210, N'木脚乡'),
	(43, 12, 30, 211, N'下乡乡'),
	(43, 12, 30, 212, N'马龙乡'),
	(43, 12, 30, 214, N'传素瑶族乡'),
	(43, 12, 30, 215, N'黄土乡'),
	(43, 12, 30, 216, N'坪坦乡'),
	(43, 12, 30, 218, N'坪阳乡'),
	(43, 12, 30, 219, N'甘溪乡');

/* 湖南省 怀化市 洪江市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 12, 81, 101, N'黔城镇'),
	(43, 12, 81, 102, N'安江镇'),
	(43, 12, 81, 103, N'托口镇'),
	(43, 12, 81, 104, N'雪峰镇'),
	(43, 12, 81, 105, N'双溪镇'),
	(43, 12, 81, 106, N'江市镇'),
	(43, 12, 81, 107, N'沅河镇'),
	(43, 12, 81, 108, N'塘湾镇'),
	(43, 12, 81, 200, N'硖州乡'),
	(43, 12, 81, 201, N'龙田乡'),
	(43, 12, 81, 202, N'岔头乡'),
	(43, 12, 81, 203, N'茅渡乡'),
	(43, 12, 81, 204, N'大崇乡'),
	(43, 12, 81, 205, N'熟坪乡'),
	(43, 12, 81, 206, N'铁山乡'),
	(43, 12, 81, 207, N'群峰乡'),
	(43, 12, 81, 208, N'湾溪乡'),
	(43, 12, 81, 209, N'洗马乡'),
	(43, 12, 81, 211, N'沙湾乡'),
	(43, 12, 81, 212, N'深渡苗族乡'),
	(43, 12, 81, 213, N'龙船塘瑶族乡'),
	(43, 12, 81, 214, N'太平乡'),
	(43, 12, 81, 215, N'土溪乡'),
	(43, 12, 81, 216, N'红岩乡'),
	(43, 12, 81, 217, N'岩垅乡');

/* 湖南省 娄底市 娄星区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 13, 02, 001, N'乐坪街道'),
	(43, 13, 02, 002, N'花山街道'),
	(43, 13, 02, 003, N'黄泥塘街道'),
	(43, 13, 02, 004, N'长青街道'),
	(43, 13, 02, 005, N'大科街道'),
	(43, 13, 02, 006, N'涟滨街道办事处'),
	(43, 13, 02, 007, N'大埠桥街道办事处'),
	(43, 13, 02, 100, N'杉山镇'),
	(43, 13, 02, 101, N'万宝镇'),
	(43, 13, 02, 103, N'茶园镇'),
	(43, 13, 02, 104, N'石井镇'),
	(43, 13, 02, 202, N'百亩乡'),
	(43, 13, 02, 203, N'小碧乡'),
	(43, 13, 02, 204, N'双江乡');

/* 湖南省 娄底市 双峰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 13, 21, 100, N'永丰镇'),
	(43, 13, 21, 101, N'荷叶镇'),
	(43, 13, 21, 102, N'井字镇'),
	(43, 13, 21, 103, N'梓门桥镇'),
	(43, 13, 21, 104, N'杏子铺镇'),
	(43, 13, 21, 105, N'走马街镇'),
	(43, 13, 21, 106, N'蛇形山镇'),
	(43, 13, 21, 107, N'洪山殿镇'),
	(43, 13, 21, 108, N'甘棠镇'),
	(43, 13, 21, 109, N'三塘铺镇'),
	(43, 13, 21, 110, N'青树坪镇'),
	(43, 13, 21, 111, N'花门镇'),
	(43, 13, 21, 112, N'锁石镇'),
	(43, 13, 21, 200, N'石牛乡'),
	(43, 13, 21, 201, N'沙塘乡'),
	(43, 13, 21, 202, N'印塘乡');

/* 湖南省 娄底市 新化县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 13, 22, 100, N'上梅镇'),
	(43, 13, 22, 101, N'石冲口镇'),
	(43, 13, 22, 102, N'洋溪镇'),
	(43, 13, 22, 103, N'槎溪镇'),
	(43, 13, 22, 104, N'水车镇'),
	(43, 13, 22, 105, N'文田镇'),
	(43, 13, 22, 106, N'奉家镇'),
	(43, 13, 22, 107, N'炉观镇'),
	(43, 13, 22, 108, N'游家镇'),
	(43, 13, 22, 109, N'西河镇'),
	(43, 13, 22, 110, N'孟公镇'),
	(43, 13, 22, 111, N'琅塘镇'),
	(43, 13, 22, 112, N'白溪镇'),
	(43, 13, 22, 113, N'圳上镇'),
	(43, 13, 22, 114, N'吉庆镇'),
	(43, 13, 22, 115, N'温塘镇'),
	(43, 13, 22, 116, N'田坪镇'),
	(43, 13, 22, 117, N'桑梓镇'),
	(43, 13, 22, 118, N'曹家镇'),
	(43, 13, 22, 200, N'科头乡'),
	(43, 13, 22, 201, N'维山乡'),
	(43, 13, 22, 202, N'天门乡'),
	(43, 13, 22, 203, N'荣华乡'),
	(43, 13, 22, 204, N'金凤乡'),
	(43, 13, 22, 205, N'油溪乡'),
	(43, 13, 22, 206, N'坐石乡');

/* 湖南省 娄底市 冷水江市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 13, 81, 001, N'冷水江街道'),
	(43, 13, 81, 002, N'锡矿山街道'),
	(43, 13, 81, 003, N'沙塘湾街道'),
	(43, 13, 81, 004, N'布溪街道'),
	(43, 13, 81, 100, N'禾青镇'),
	(43, 13, 81, 101, N'岩口镇'),
	(43, 13, 81, 102, N'渣渡镇'),
	(43, 13, 81, 103, N'铎山镇'),
	(43, 13, 81, 104, N'毛易镇'),
	(43, 13, 81, 105, N'三尖镇'),
	(43, 13, 81, 106, N'金竹山镇'),
	(43, 13, 81, 200, N'潘桥乡'),
	(43, 13, 81, 203, N'梓龙乡'),
	(43, 13, 81, 204, N'矿山乡'),
	(43, 13, 81, 205, N'中连乡'),
	(43, 13, 81, 206, N'同兴乡');

/* 湖南省 娄底市 涟源市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 13, 82, 001, N'蓝田街道'),
	(43, 13, 82, 100, N'六亩塘镇'),
	(43, 13, 82, 101, N'石马山镇'),
	(43, 13, 82, 102, N'安平镇'),
	(43, 13, 82, 103, N'湄江镇'),
	(43, 13, 82, 104, N'伏口镇'),
	(43, 13, 82, 105, N'桥头河镇'),
	(43, 13, 82, 106, N'七星街镇'),
	(43, 13, 82, 107, N'杨市镇'),
	(43, 13, 82, 108, N'枫坪镇'),
	(43, 13, 82, 109, N'斗笠山镇'),
	(43, 13, 82, 110, N'水洞底镇'),
	(43, 13, 82, 111, N'白马镇'),
	(43, 13, 82, 112, N'茅塘镇'),
	(43, 13, 82, 113, N'荷塘镇'),
	(43, 13, 82, 114, N'金石镇'),
	(43, 13, 82, 115, N'龙塘镇'),
	(43, 13, 82, 116, N'渡头塘镇'),
	(43, 13, 82, 200, N'三甲乡'),
	(43, 13, 82, 202, N'古塘乡');

/* 湖南省 湘西土家族苗族自治州 吉首市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 31, 01, 002, N'峒河街道办事处'),
	(43, 31, 01, 004, N'乾州街道办事处'),
	(43, 31, 01, 005, N'镇溪街道办事处'),
	(43, 31, 01, 100, N'矮寨镇'),
	(43, 31, 01, 101, N'马颈坳镇'),
	(43, 31, 01, 102, N'河溪镇'),
	(43, 31, 01, 103, N'双塘镇'),
	(43, 31, 01, 104, N'丹青镇'),
	(43, 31, 01, 200, N'寨阳乡'),
	(43, 31, 01, 201, N'已略乡'),
	(43, 31, 01, 202, N'社塘坡乡'),
	(43, 31, 01, 203, N'太平乡'),
	(43, 31, 01, 204, N'白岩乡'),
	(43, 31, 01, 205, N'排绸乡'),
	(43, 31, 01, 206, N'排吼乡');

/* 湖南省 湘西土家族苗族自治州 泸溪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 31, 22, 100, N'白沙镇'),
	(43, 31, 22, 102, N'达岚镇'),
	(43, 31, 22, 104, N'兴隆场镇'),
	(43, 31, 22, 105, N'潭溪镇'),
	(43, 31, 22, 106, N'洗溪镇'),
	(43, 31, 22, 107, N'武溪镇'),
	(43, 31, 22, 108, N'浦市镇'),
	(43, 31, 22, 109, N'合水镇'),
	(43, 31, 22, 203, N'石榴坪乡'),
	(43, 31, 22, 205, N'永兴场乡'),
	(43, 31, 22, 206, N'解放岩乡'),
	(43, 31, 22, 207, N'小章乡'),
	(43, 31, 22, 208, N'白羊溪乡'),
	(43, 31, 22, 209, N'梁家潭乡'),
	(43, 31, 22, 210, N'八什坪乡');

/* 湖南省 湘西土家族苗族自治州 凤凰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 31, 23, 101, N'廖家桥镇'),
	(43, 31, 23, 104, N'茶田镇'),
	(43, 31, 23, 105, N'吉信镇'),
	(43, 31, 23, 107, N'腊尔山镇'),
	(43, 31, 23, 108, N'禾库镇'),
	(43, 31, 23, 109, N'沱江镇'),
	(43, 31, 23, 110, N'阿拉营镇'),
	(43, 31, 23, 111, N'木江坪镇'),
	(43, 31, 23, 112, N'山江镇'),
	(43, 31, 23, 202, N'官庄乡'),
	(43, 31, 23, 204, N'水打田乡'),
	(43, 31, 23, 205, N'林峰乡'),
	(43, 31, 23, 206, N'都里乡'),
	(43, 31, 23, 207, N'落潮井乡'),
	(43, 31, 23, 208, N'新场乡'),
	(43, 31, 23, 209, N'茨岩乡'),
	(43, 31, 23, 212, N'三拱桥乡'),
	(43, 31, 23, 213, N'竿子坪乡'),
	(43, 31, 23, 216, N'麻冲乡'),
	(43, 31, 23, 218, N'千工坪乡'),
	(43, 31, 23, 219, N'木里乡'),
	(43, 31, 23, 220, N'两林乡'),
	(43, 31, 23, 221, N'柳薄乡'),
	(43, 31, 23, 222, N'米良乡');

/* 湖南省 湘西土家族苗族自治州 花垣县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 31, 24, 102, N'龙潭镇'),
	(43, 31, 24, 103, N'民乐镇'),
	(43, 31, 24, 104, N'团结镇'),
	(43, 31, 24, 105, N'吉卫镇'),
	(43, 31, 24, 106, N'麻栗场镇'),
	(43, 31, 24, 107, N'雅酉镇'),
	(43, 31, 24, 108, N'边城镇'),
	(43, 31, 24, 109, N'花垣镇'),
	(43, 31, 24, 200, N'长乐乡'),
	(43, 31, 24, 202, N'两河乡'),
	(43, 31, 24, 204, N'排碧乡'),
	(43, 31, 24, 205, N'董马库乡'),
	(43, 31, 24, 206, N'猫儿乡'),
	(43, 31, 24, 209, N'道二乡'),
	(43, 31, 24, 210, N'排吾乡'),
	(43, 31, 24, 211, N'排料乡'),
	(43, 31, 24, 212, N'雅桥乡'),
	(43, 31, 24, 213, N'补抽乡');

/* 湖南省 湘西土家族苗族自治州 保靖县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 31, 25, 104, N'普戎镇'),
	(43, 31, 25, 107, N'野竹坪镇'),
	(43, 31, 25, 108, N'复兴镇'),
	(43, 31, 25, 109, N'迁陵镇'),
	(43, 31, 25, 110, N'清水坪镇'),
	(43, 31, 25, 111, N'比耳镇'),
	(43, 31, 25, 112, N'毛沟镇'),
	(43, 31, 25, 113, N'水田河镇'),
	(43, 31, 25, 114, N'葫芦镇'),
	(43, 31, 25, 115, N'碗米坡镇'),
	(43, 31, 25, 202, N'水银乡'),
	(43, 31, 25, 203, N'涂乍乡'),
	(43, 31, 25, 205, N'大妥乡'),
	(43, 31, 25, 210, N'夯沙乡'),
	(43, 31, 25, 215, N'清水乡'),
	(43, 31, 25, 217, N'阳朝乡');

/* 湖南省 湘西土家族苗族自治州 古丈县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 31, 26, 101, N'古阳镇'),
	(43, 31, 26, 102, N'罗依溪镇'),
	(43, 31, 26, 103, N'岩头寨镇'),
	(43, 31, 26, 104, N'默戎镇'),
	(43, 31, 26, 105, N'红石林镇'),
	(43, 31, 26, 106, N'万龙镇'),
	(43, 31, 26, 202, N'高峰乡'),
	(43, 31, 26, 205, N'河蓬乡'),
	(43, 31, 26, 206, N'坪坝乡'),
	(43, 31, 26, 207, N'山枣乡'),
	(43, 31, 26, 208, N'双溪乡'),
	(43, 31, 26, 212, N'高望界乡');

/* 湖南省 湘西土家族苗族自治州 永顺县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 31, 27, 101, N'首车镇'),
	(43, 31, 27, 103, N'芙蓉镇'),
	(43, 31, 27, 104, N'永茂镇'),
	(43, 31, 27, 108, N'长官镇'),
	(43, 31, 27, 109, N'青坪镇'),
	(43, 31, 27, 111, N'泽家镇'),
	(43, 31, 27, 112, N'石堤镇'),
	(43, 31, 27, 113, N'万坪镇'),
	(43, 31, 27, 114, N'塔卧镇'),
	(43, 31, 27, 115, N'砂坝镇'),
	(43, 31, 27, 116, N'灵溪镇'),
	(43, 31, 27, 117, N'松柏镇'),
	(43, 31, 27, 200, N'两岔乡'),
	(43, 31, 27, 201, N'勺哈乡'),
	(43, 31, 27, 202, N'西歧乡'),
	(43, 31, 27, 203, N'对山乡'),
	(43, 31, 27, 206, N'列夕乡'),
	(43, 31, 27, 210, N'高坪乡'),
	(43, 31, 27, 212, N'回龙乡'),
	(43, 31, 27, 214, N'小溪乡'),
	(43, 31, 27, 216, N'朗溪乡'),
	(43, 31, 27, 220, N'润雅乡'),
	(43, 31, 27, 222, N'车坪乡'),
	(43, 31, 27, 228, N'毛坝乡'),
	(43, 31, 27, 229, N'万民乡'),
	(43, 31, 27, 230, N'盐井乡'),
	(43, 31, 27, 233, N'抚志乡'),
	(43, 31, 27, 235, N'吊井乡'),
	(43, 31, 27, 237, N'大坝乡'),
	(43, 31, 27, 238, N'颗砂乡');

/* 湖南省 湘西土家族苗族自治州 龙山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(43, 31, 30, 001, N'民安街道办事处'),
	(43, 31, 30, 002, N'华塘街道办事处'),
	(43, 31, 30, 003, N'新城街道办事处'),
	(43, 31, 30, 101, N'石羔镇'),
	(43, 31, 30, 104, N'洗车河镇'),
	(43, 31, 30, 106, N'隆头镇'),
	(43, 31, 30, 110, N'石牌镇'),
	(43, 31, 30, 112, N'茨岩塘镇'),
	(43, 31, 30, 113, N'红岩溪镇'),
	(43, 31, 30, 114, N'靛房镇'),
	(43, 31, 30, 115, N'苗儿滩镇'),
	(43, 31, 30, 116, N'里耶镇'),
	(43, 31, 30, 117, N'桂塘镇'),
	(43, 31, 30, 118, N'召市镇'),
	(43, 31, 30, 200, N'洛塔乡'),
	(43, 31, 30, 203, N'洗洛乡'),
	(43, 31, 30, 204, N'湾塘乡'),
	(43, 31, 30, 205, N'白羊乡'),
	(43, 31, 30, 206, N'兴隆街乡'),
	(43, 31, 30, 207, N'三元乡'),
	(43, 31, 30, 208, N'桶车乡'),
	(43, 31, 30, 210, N'大安乡'),
	(43, 31, 30, 211, N'水田坝乡'),
	(43, 31, 30, 212, N'乌鸦乡'),
	(43, 31, 30, 213, N'猛必乡'),
	(43, 31, 30, 218, N'他砂乡'),
	(43, 31, 30, 220, N'内溪乡'),
	(43, 31, 30, 223, N'贾市乡'),
	(43, 31, 30, 231, N'塔泥乡'),
	(43, 31, 30, 232, N'农车乡'),
	(43, 31, 30, 234, N'老兴乡'),
	(43, 31, 30, 235, N'贾坝乡'),
	(43, 31, 30, 236, N'咱果乡'),
	(43, 31, 30, 237, N'茅坪乡');
