SET NOCOUNT ON;
SET XACT_ABORT ON;

/*
 *   _____                                ______
 *  /_   /  ____  ____  ____  _________  / __/ /_
 *    / /  / __ \/ __ \/ __ \/ ___/ __ \/ /_/ __/
 *   / /__/ /_/ / / / / /_/ /\_ \/ /_/ / __/ /_
 *  /____/\____/_/ /_/\__  /____/\____/_/  \__/
 *                   /____/
 *
 * Authors:
 *   钟峰(Popeye Zhong) <zongsoft@qq.com>
 *
 * Copyright (C) 2015-2019 Zongsoft Studio. All rights reserved.
 *
 * MIT License
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 */

/*
 * 《2015年统计用区划代码和城乡划分代码（截止2015年09月30日）》 即（街道、社区、镇、乡/村）行政区划信息
 * 数据来源：中华人民共和国国家统计局（http://www.stats.gov.cn/tjsj/tjbz/tjyqhdmhcxhfdm/2015/index.html）
 * 数据范围：广东省(44)、广西省(45)、海南省(46)。
 */

/* 广东省 广州市 荔湾区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 01, 03, 001, N'沙面街道'),
	(44, 01, 03, 002, N'岭南街道'),
	(44, 01, 03, 003, N'华林街道'),
	(44, 01, 03, 004, N'多宝街道'),
	(44, 01, 03, 005, N'昌华街道'),
	(44, 01, 03, 006, N'逢源街道'),
	(44, 01, 03, 007, N'龙津街道'),
	(44, 01, 03, 008, N'金花街道'),
	(44, 01, 03, 009, N'彩虹街道'),
	(44, 01, 03, 010, N'南源街道'),
	(44, 01, 03, 011, N'西村街道'),
	(44, 01, 03, 012, N'站前街道'),
	(44, 01, 03, 013, N'桥中街道'),
	(44, 01, 03, 014, N'白鹤洞街道'),
	(44, 01, 03, 015, N'冲口街道'),
	(44, 01, 03, 016, N'花地街道'),
	(44, 01, 03, 017, N'石围塘街道'),
	(44, 01, 03, 018, N'茶滘街道'),
	(44, 01, 03, 019, N'东漖街道'),
	(44, 01, 03, 020, N'海龙街道'),
	(44, 01, 03, 021, N'东沙街道'),
	(44, 01, 03, 022, N'中南街道');

/* 广东省 广州市 越秀区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 01, 04, 001, N'洪桥街道'),
	(44, 01, 04, 003, N'北京街道'),
	(44, 01, 04, 004, N'六榕街道'),
	(44, 01, 04, 005, N'流花街道'),
	(44, 01, 04, 007, N'光塔街道'),
	(44, 01, 04, 010, N'人民街道'),
	(44, 01, 04, 011, N'东山街道'),
	(44, 01, 04, 012, N'农林街道'),
	(44, 01, 04, 013, N'梅花村街道'),
	(44, 01, 04, 014, N'黄花岗街道'),
	(44, 01, 04, 015, N'华乐街道'),
	(44, 01, 04, 016, N'建设街道'),
	(44, 01, 04, 017, N'大塘街道'),
	(44, 01, 04, 018, N'珠光街道'),
	(44, 01, 04, 019, N'大东街道'),
	(44, 01, 04, 020, N'白云街道'),
	(44, 01, 04, 021, N'登峰街道'),
	(44, 01, 04, 022, N'矿泉街道');

/* 广东省 广州市 海珠区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 01, 05, 001, N'赤岗街道'),
	(44, 01, 05, 002, N'新港街道'),
	(44, 01, 05, 003, N'昌岗街道'),
	(44, 01, 05, 004, N'江南中街道'),
	(44, 01, 05, 005, N'滨江街道'),
	(44, 01, 05, 006, N'素社街道'),
	(44, 01, 05, 007, N'海幢街道'),
	(44, 01, 05, 008, N'南华西街道'),
	(44, 01, 05, 009, N'龙凤街道'),
	(44, 01, 05, 010, N'沙园街道'),
	(44, 01, 05, 011, N'南石头街道'),
	(44, 01, 05, 012, N'凤阳街道'),
	(44, 01, 05, 013, N'瑞宝街道'),
	(44, 01, 05, 014, N'江海街道'),
	(44, 01, 05, 015, N'琶洲街道'),
	(44, 01, 05, 016, N'南洲街道'),
	(44, 01, 05, 017, N'华洲街道'),
	(44, 01, 05, 018, N'官洲街道');

/* 广东省 广州市 天河区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 01, 06, 001, N'五山街道'),
	(44, 01, 06, 002, N'员村街道'),
	(44, 01, 06, 003, N'车陂街道'),
	(44, 01, 06, 004, N'沙河街道'),
	(44, 01, 06, 006, N'石牌街道'),
	(44, 01, 06, 007, N'沙东街道'),
	(44, 01, 06, 008, N'天河南街道'),
	(44, 01, 06, 009, N'林和街道'),
	(44, 01, 06, 010, N'兴华街道'),
	(44, 01, 06, 011, N'棠下街道'),
	(44, 01, 06, 012, N'天园街道'),
	(44, 01, 06, 013, N'猎德街道'),
	(44, 01, 06, 014, N'冼村街道'),
	(44, 01, 06, 015, N'元岗街道'),
	(44, 01, 06, 016, N'黄村街道'),
	(44, 01, 06, 017, N'长兴街道'),
	(44, 01, 06, 018, N'龙洞街道'),
	(44, 01, 06, 019, N'凤凰街道'),
	(44, 01, 06, 020, N'前进街道'),
	(44, 01, 06, 021, N'珠吉街道'),
	(44, 01, 06, 022, N'新塘街道');

/* 广东省 广州市 白云区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 01, 11, 002, N'三元里街道'),
	(44, 01, 11, 003, N'松洲街道'),
	(44, 01, 11, 004, N'景泰街道'),
	(44, 01, 11, 005, N'同德街道'),
	(44, 01, 11, 006, N'黄石街道'),
	(44, 01, 11, 007, N'棠景街道'),
	(44, 01, 11, 008, N'新市街道'),
	(44, 01, 11, 009, N'同和街道'),
	(44, 01, 11, 010, N'京溪街道'),
	(44, 01, 11, 011, N'永平街道'),
	(44, 01, 11, 012, N'嘉禾街道'),
	(44, 01, 11, 013, N'均禾街道'),
	(44, 01, 11, 014, N'石井街道'),
	(44, 01, 11, 015, N'金沙街道'),
	(44, 01, 11, 016, N'云城街道'),
	(44, 01, 11, 017, N'鹤龙街道'),
	(44, 01, 11, 018, N'白云湖街道'),
	(44, 01, 11, 019, N'石门街道'),
	(44, 01, 11, 103, N'人和镇'),
	(44, 01, 11, 107, N'太和镇'),
	(44, 01, 11, 108, N'钟落潭镇'),
	(44, 01, 11, 113, N'江高镇');

/* 广东省 广州市 黄埔区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 01, 12, 001, N'黄埔街道'),
	(44, 01, 12, 002, N'红山街道'),
	(44, 01, 12, 003, N'鱼珠街道'),
	(44, 01, 12, 005, N'大沙街道'),
	(44, 01, 12, 006, N'文冲街道'),
	(44, 01, 12, 007, N'穗东街道'),
	(44, 01, 12, 008, N'南岗街道'),
	(44, 01, 12, 009, N'荔联街道'),
	(44, 01, 12, 010, N'长洲街道'),
	(44, 01, 12, 011, N'夏港街道'),
	(44, 01, 12, 012, N'萝岗街道'),
	(44, 01, 12, 013, N'东区街道'),
	(44, 01, 12, 014, N'联和街道'),
	(44, 01, 12, 015, N'永和街道'),
	(44, 01, 12, 101, N'九龙镇');

/* 广东省 广州市 番禺区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 01, 13, 007, N'市桥街道'),
	(44, 01, 13, 008, N'沙头街道'),
	(44, 01, 13, 009, N'东环街道'),
	(44, 01, 13, 010, N'桥南街道'),
	(44, 01, 13, 011, N'小谷围街道'),
	(44, 01, 13, 012, N'大石街道'),
	(44, 01, 13, 013, N'洛浦街道'),
	(44, 01, 13, 014, N'石壁街道'),
	(44, 01, 13, 015, N'钟村街道'),
	(44, 01, 13, 016, N'大龙街道'),
	(44, 01, 13, 102, N'南村镇'),
	(44, 01, 13, 103, N'新造镇'),
	(44, 01, 13, 104, N'化龙镇'),
	(44, 01, 13, 105, N'石楼镇'),
	(44, 01, 13, 118, N'沙湾镇'),
	(44, 01, 13, 120, N'石基镇');

/* 广东省 广州市 花都区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 01, 14, 001, N'新华街道办事处'),
	(44, 01, 14, 002, N'花城街道办事处'),
	(44, 01, 14, 003, N'秀全街道办事处'),
	(44, 01, 14, 004, N'新雅街道办事处'),
	(44, 01, 14, 103, N'梯面镇'),
	(44, 01, 14, 104, N'花山镇'),
	(44, 01, 14, 105, N'花东镇'),
	(44, 01, 14, 107, N'炭步镇'),
	(44, 01, 14, 108, N'赤坭镇'),
	(44, 01, 14, 109, N'狮岭镇');

/* 广东省 广州市 南沙区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 01, 15, 001, N'南沙街道'),
	(44, 01, 15, 002, N'珠江街道'),
	(44, 01, 15, 003, N'龙穴街道'),
	(44, 01, 15, 100, N'万顷沙镇'),
	(44, 01, 15, 101, N'横沥镇'),
	(44, 01, 15, 102, N'黄阁镇'),
	(44, 01, 15, 103, N'东涌镇'),
	(44, 01, 15, 104, N'大岗镇'),
	(44, 01, 15, 105, N'榄核镇');

/* 广东省 广州市 从化区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 01, 17, 001, N'街口街道'),
	(44, 01, 17, 002, N'江埔街道'),
	(44, 01, 17, 003, N'城郊街道'),
	(44, 01, 17, 103, N'温泉镇'),
	(44, 01, 17, 104, N'良口镇'),
	(44, 01, 17, 107, N'吕田镇'),
	(44, 01, 17, 111, N'太平镇'),
	(44, 01, 17, 113, N'鳌头镇');

/* 广东省 广州市 增城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 01, 18, 001, N'荔城街道'),
	(44, 01, 18, 002, N'增江街道'),
	(44, 01, 18, 003, N'朱村街道'),
	(44, 01, 18, 004, N'永宁街道'),
	(44, 01, 18, 101, N'新塘镇'),
	(44, 01, 18, 102, N'石滩镇'),
	(44, 01, 18, 103, N'中新镇'),
	(44, 01, 18, 104, N'正果镇'),
	(44, 01, 18, 105, N'派潭镇'),
	(44, 01, 18, 106, N'小楼镇'),
	(44, 01, 18, 107, N'仙村镇');

/* 广东省 韶关市 武江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 02, 03, 001, N'新华街道办事处'),
	(44, 02, 03, 002, N'惠民街道办事处'),
	(44, 02, 03, 100, N'西联镇'),
	(44, 02, 03, 101, N'西河镇'),
	(44, 02, 03, 102, N'龙归镇'),
	(44, 02, 03, 103, N'江湾镇'),
	(44, 02, 03, 104, N'重阳镇');

/* 广东省 韶关市 浈江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 02, 04, 001, N'东河街道办事处'),
	(44, 02, 04, 002, N'车站街道办事处'),
	(44, 02, 04, 008, N'风采街道办事处'),
	(44, 02, 04, 100, N'新韶镇'),
	(44, 02, 04, 101, N'乐园镇'),
	(44, 02, 04, 102, N'十里亭镇'),
	(44, 02, 04, 103, N'犁市镇'),
	(44, 02, 04, 104, N'花坪镇');

/* 广东省 韶关市 曲江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 02, 05, 001, N'松山街道办事处'),
	(44, 02, 05, 100, N'马坝镇'),
	(44, 02, 05, 101, N'大塘镇'),
	(44, 02, 05, 102, N'枫湾镇'),
	(44, 02, 05, 103, N'小坑镇'),
	(44, 02, 05, 104, N'沙溪镇'),
	(44, 02, 05, 106, N'乌石镇'),
	(44, 02, 05, 107, N'樟市镇'),
	(44, 02, 05, 108, N'白土镇'),
	(44, 02, 05, 109, N'罗坑镇');

/* 广东省 韶关市 始兴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 02, 22, 100, N'太平镇'),
	(44, 02, 22, 101, N'马市镇'),
	(44, 02, 22, 102, N'澄江镇'),
	(44, 02, 22, 103, N'顿岗镇'),
	(44, 02, 22, 104, N'罗坝镇'),
	(44, 02, 22, 105, N'司前镇'),
	(44, 02, 22, 106, N'隘子镇'),
	(44, 02, 22, 107, N'城南镇'),
	(44, 02, 22, 108, N'沈所镇'),
	(44, 02, 22, 204, N'深渡水乡');

/* 广东省 韶关市 仁化县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 02, 24, 001, N'丹霞街道办事处'),
	(44, 02, 24, 102, N'闻韶镇'),
	(44, 02, 24, 103, N'扶溪镇'),
	(44, 02, 24, 104, N'长江镇'),
	(44, 02, 24, 105, N'城口镇'),
	(44, 02, 24, 106, N'红山镇'),
	(44, 02, 24, 107, N'石塘镇'),
	(44, 02, 24, 108, N'董塘镇'),
	(44, 02, 24, 109, N'大桥镇'),
	(44, 02, 24, 110, N'周田镇'),
	(44, 02, 24, 111, N'黄坑镇');

/* 广东省 韶关市 翁源县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 02, 29, 100, N'龙仙镇'),
	(44, 02, 29, 104, N'坝仔镇'),
	(44, 02, 29, 106, N'江尾镇'),
	(44, 02, 29, 109, N'官渡镇'),
	(44, 02, 29, 111, N'周陂镇'),
	(44, 02, 29, 113, N'翁城镇'),
	(44, 02, 29, 114, N'新江镇');

/* 广东省 韶关市 乳源瑶族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 02, 32, 100, N'乳城镇'),
	(44, 02, 32, 103, N'一六镇'),
	(44, 02, 32, 104, N'桂头镇'),
	(44, 02, 32, 106, N'洛阳镇'),
	(44, 02, 32, 108, N'大布镇'),
	(44, 02, 32, 109, N'大桥镇'),
	(44, 02, 32, 111, N'东坪镇'),
	(44, 02, 32, 112, N'游溪镇'),
	(44, 02, 32, 113, N'必背镇');

/* 广东省 韶关市 新丰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 02, 33, 001, N'丰城街道办事处'),
	(44, 02, 33, 100, N'黄礤镇'),
	(44, 02, 33, 101, N'马头镇'),
	(44, 02, 33, 102, N'梅坑镇'),
	(44, 02, 33, 103, N'沙田镇'),
	(44, 02, 33, 104, N'遥田镇'),
	(44, 02, 33, 105, N'回龙镇');

/* 广东省 韶关市 乐昌市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 02, 81, 001, N'乐城街道办事处'),
	(44, 02, 81, 102, N'北乡镇'),
	(44, 02, 81, 103, N'九峰镇'),
	(44, 02, 81, 104, N'廊田镇'),
	(44, 02, 81, 105, N'长来镇'),
	(44, 02, 81, 106, N'梅花镇'),
	(44, 02, 81, 107, N'三溪镇'),
	(44, 02, 81, 108, N'坪石镇'),
	(44, 02, 81, 110, N'黄圃镇'),
	(44, 02, 81, 111, N'五山镇'),
	(44, 02, 81, 112, N'两江镇'),
	(44, 02, 81, 113, N'沙坪镇'),
	(44, 02, 81, 114, N'云岩镇'),
	(44, 02, 81, 115, N'秀水镇'),
	(44, 02, 81, 117, N'大源镇'),
	(44, 02, 81, 118, N'庆云镇'),
	(44, 02, 81, 119, N'白石镇');

/* 广东省 韶关市 南雄市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 02, 82, 001, N'雄州街道办事处'),
	(44, 02, 82, 100, N'乌迳镇'),
	(44, 02, 82, 103, N'界址镇'),
	(44, 02, 82, 104, N'坪田镇'),
	(44, 02, 82, 105, N'黄坑镇'),
	(44, 02, 82, 106, N'邓坊镇'),
	(44, 02, 82, 107, N'油山镇'),
	(44, 02, 82, 109, N'南亩镇'),
	(44, 02, 82, 110, N'水口镇'),
	(44, 02, 82, 111, N'江头镇'),
	(44, 02, 82, 112, N'湖口镇'),
	(44, 02, 82, 113, N'珠玑镇'),
	(44, 02, 82, 115, N'主田镇'),
	(44, 02, 82, 116, N'古市镇'),
	(44, 02, 82, 118, N'全安镇'),
	(44, 02, 82, 120, N'百顺镇'),
	(44, 02, 82, 121, N'澜河镇'),
	(44, 02, 82, 122, N'帽子峰镇');

/* 广东省 深圳市 罗湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 03, 03, 001, N'桂园街道办事处'),
	(44, 03, 03, 002, N'黄贝街道办事处'),
	(44, 03, 03, 003, N'东门街道办事处'),
	(44, 03, 03, 004, N'翠竹街道办事处'),
	(44, 03, 03, 005, N'南湖街道办事处'),
	(44, 03, 03, 006, N'笋岗街道办事处'),
	(44, 03, 03, 007, N'东湖街道办事处'),
	(44, 03, 03, 008, N'莲塘街道办事处'),
	(44, 03, 03, 009, N'东晓街道办事处'),
	(44, 03, 03, 010, N'清水河街道办事处');

/* 广东省 深圳市 福田区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 03, 04, 001, N'南园街道办事处'),
	(44, 03, 04, 002, N'园岭街道办事处'),
	(44, 03, 04, 004, N'福田街道办事处'),
	(44, 03, 04, 005, N'沙头街道办事处'),
	(44, 03, 04, 006, N'香蜜湖街道办事处'),
	(44, 03, 04, 007, N'梅林街道办事处'),
	(44, 03, 04, 008, N'莲花街道办事处'),
	(44, 03, 04, 009, N'华富街道办事处'),
	(44, 03, 04, 010, N'福保街道办事处'),
	(44, 03, 04, 011, N'华强北街道办事处');

/* 广东省 深圳市 南山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 03, 05, 001, N'南头街道办事处'),
	(44, 03, 05, 002, N'南山街道办事处'),
	(44, 03, 05, 003, N'沙河街道办事处'),
	(44, 03, 05, 005, N'蛇口街道办事处'),
	(44, 03, 05, 006, N'招商街道办事处'),
	(44, 03, 05, 007, N'粤海街道办事处'),
	(44, 03, 05, 008, N'桃源街道办事处'),
	(44, 03, 05, 009, N'西丽街道办事处');

/* 广东省 深圳市 宝安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 03, 06, 001, N'新安街道办事处'),
	(44, 03, 06, 002, N'光明办事处'),
	(44, 03, 06, 003, N'西乡街道办事处'),
	(44, 03, 06, 004, N'福永街道办事处'),
	(44, 03, 06, 005, N'沙井街道办事处'),
	(44, 03, 06, 006, N'松岗街道办事处'),
	(44, 03, 06, 007, N'公明办事处'),
	(44, 03, 06, 008, N'石岩街道办事处'),
	(44, 03, 06, 011, N'大浪办事处'),
	(44, 03, 06, 012, N'龙华办事处'),
	(44, 03, 06, 013, N'民治办事处'),
	(44, 03, 06, 014, N'观湖办事处'),
	(44, 03, 06, 015, N'福城办事处'),
	(44, 03, 06, 016, N'观澜办事处');

/* 广东省 深圳市 龙岗区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 03, 07, 003, N'平湖街道办事处'),
	(44, 03, 07, 006, N'坪地街道办事处'),
	(44, 03, 07, 007, N'坪山街道办事处'),
	(44, 03, 07, 008, N'坑梓街道办事处'),
	(44, 03, 07, 009, N'葵涌街道办事处'),
	(44, 03, 07, 010, N'大鹏街道办事处'),
	(44, 03, 07, 011, N'南澳街道办事处'),
	(44, 03, 07, 012, N'南湾街道办事处'),
	(44, 03, 07, 013, N'坂田街道办事处'),
	(44, 03, 07, 014, N'布吉街道办事处'),
	(44, 03, 07, 015, N'龙城街道办事处'),
	(44, 03, 07, 016, N'龙岗街道办事处'),
	(44, 03, 07, 017, N'横岗街道办事处');

/* 广东省 深圳市 盐田区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 03, 08, 001, N'梅沙街道办事处'),
	(44, 03, 08, 002, N'盐田街道办事处'),
	(44, 03, 08, 003, N'沙头角街道办事处'),
	(44, 03, 08, 004, N'海山街道办事处');

/* 广东省 珠海市 香洲区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 04, 02, 001, N'翠香街道办'),
	(44, 04, 02, 002, N'梅华街道办'),
	(44, 04, 02, 003, N'前山街道办'),
	(44, 04, 02, 004, N'吉大街道办'),
	(44, 04, 02, 005, N'拱北街道办'),
	(44, 04, 02, 006, N'香湾街道办'),
	(44, 04, 02, 007, N'狮山街道办'),
	(44, 04, 02, 008, N'湾仔街道办'),
	(44, 04, 02, 100, N'唐家湾镇'),
	(44, 04, 02, 102, N'南屏镇'),
	(44, 04, 02, 104, N'横琴镇'),
	(44, 04, 02, 105, N'桂山镇'),
	(44, 04, 02, 106, N'万山镇'),
	(44, 04, 02, 107, N'担杆镇');

/* 广东省 珠海市 斗门区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 04, 03, 001, N'白藤街道办事处'),
	(44, 04, 03, 100, N'莲洲镇'),
	(44, 04, 03, 103, N'斗门镇'),
	(44, 04, 03, 105, N'乾务镇'),
	(44, 04, 03, 106, N'白蕉镇'),
	(44, 04, 03, 107, N'井岸镇');

/* 广东省 珠海市 金湾区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 04, 04, 100, N'三灶镇'),
	(44, 04, 04, 101, N'南水镇'),
	(44, 04, 04, 103, N'红旗镇'),
	(44, 04, 04, 104, N'平沙镇');

/* 广东省 汕头市 龙湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 05, 07, 001, N'金霞街道'),
	(44, 05, 07, 003, N'珠池街道'),
	(44, 05, 07, 004, N'新津街道'),
	(44, 05, 07, 005, N'鸥汀街道'),
	(44, 05, 07, 008, N'龙祥街道'),
	(44, 05, 07, 100, N'外砂镇'),
	(44, 05, 07, 101, N'新溪镇');

/* 广东省 汕头市 金平区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 05, 11, 001, N'石炮台街道'),
	(44, 05, 11, 002, N'金砂街道'),
	(44, 05, 11, 003, N'金厦街道'),
	(44, 05, 11, 004, N'东方街道'),
	(44, 05, 11, 005, N'大华街道'),
	(44, 05, 11, 006, N'同益街道'),
	(44, 05, 11, 007, N'光华街道'),
	(44, 05, 11, 008, N'东墩街道'),
	(44, 05, 11, 009, N'广厦街道'),
	(44, 05, 11, 010, N'海安街道'),
	(44, 05, 11, 011, N'新福街道'),
	(44, 05, 11, 012, N'乌桥街道'),
	(44, 05, 11, 013, N'岐山街道'),
	(44, 05, 11, 014, N'永祥街道'),
	(44, 05, 11, 015, N'鮀莲街道'),
	(44, 05, 11, 016, N'鮀江街道'),
	(44, 05, 11, 017, N'月浦街道');

/* 广东省 汕头市 濠江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 05, 12, 001, N'达濠街道'),
	(44, 05, 12, 002, N'马窖街道'),
	(44, 05, 12, 003, N'礐石街道'),
	(44, 05, 12, 004, N'广澳街道'),
	(44, 05, 12, 005, N'滨海街道'),
	(44, 05, 12, 006, N'河浦街道'),
	(44, 05, 12, 007, N'玉新街道');

/* 广东省 汕头市 潮阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 05, 13, 001, N'文光街道'),
	(44, 05, 13, 002, N'棉北街道'),
	(44, 05, 13, 003, N'城南街道'),
	(44, 05, 13, 004, N'金浦街道'),
	(44, 05, 13, 100, N'海门镇'),
	(44, 05, 13, 101, N'河溪镇'),
	(44, 05, 13, 102, N'和平镇'),
	(44, 05, 13, 103, N'西胪镇'),
	(44, 05, 13, 104, N'关埠镇'),
	(44, 05, 13, 106, N'谷饶镇'),
	(44, 05, 13, 107, N'贵屿镇'),
	(44, 05, 13, 108, N'铜盂镇'),
	(44, 05, 13, 110, N'金灶镇');

/* 广东省 汕头市 潮南区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 05, 14, 001, N'峡山街道'),
	(44, 05, 14, 101, N'井都镇'),
	(44, 05, 14, 103, N'成田镇'),
	(44, 05, 14, 104, N'司马浦镇'),
	(44, 05, 14, 105, N'陈店镇'),
	(44, 05, 14, 106, N'两英镇'),
	(44, 05, 14, 107, N'仙城镇'),
	(44, 05, 14, 108, N'胪岗镇'),
	(44, 05, 14, 109, N'红场镇'),
	(44, 05, 14, 110, N'雷岭镇'),
	(44, 05, 14, 112, N'陇田镇');

/* 广东省 汕头市 澄海区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 05, 15, 001, N'凤翔街道'),
	(44, 05, 15, 002, N'广益街道'),
	(44, 05, 15, 003, N'澄华街道'),
	(44, 05, 15, 100, N'上华镇'),
	(44, 05, 15, 101, N'隆都镇'),
	(44, 05, 15, 102, N'莲下镇'),
	(44, 05, 15, 103, N'莲上镇'),
	(44, 05, 15, 104, N'溪南镇'),
	(44, 05, 15, 105, N'东里镇'),
	(44, 05, 15, 106, N'盐鸿镇'),
	(44, 05, 15, 107, N'莲华镇');

/* 广东省 汕头市 南澳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 05, 23, 100, N'后宅镇'),
	(44, 05, 23, 101, N'云澳镇'),
	(44, 05, 23, 102, N'深澳镇');

/* 广东省 佛山市 禅城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 06, 04, 010, N'石湾镇街道办事处'),
	(44, 06, 04, 011, N'张槎街道办事处'),
	(44, 06, 04, 012, N'祖庙街道办事处'),
	(44, 06, 04, 100, N'南庄镇');

/* 广东省 佛山市 南海区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 06, 05, 011, N'桂城街道办事处'),
	(44, 06, 05, 121, N'九江镇'),
	(44, 06, 05, 122, N'西樵镇'),
	(44, 06, 05, 123, N'丹灶镇'),
	(44, 06, 05, 124, N'狮山镇'),
	(44, 06, 05, 125, N'大沥镇'),
	(44, 06, 05, 126, N'里水镇');

/* 广东省 佛山市 顺德区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 06, 06, 003, N'伦教街道办事处'),
	(44, 06, 06, 004, N'勒流街道办事处'),
	(44, 06, 06, 005, N'大良街道办事处'),
	(44, 06, 06, 006, N'容桂街道办事处'),
	(44, 06, 06, 101, N'陈村镇'),
	(44, 06, 06, 102, N'北滘镇'),
	(44, 06, 06, 103, N'乐从镇'),
	(44, 06, 06, 104, N'龙江镇'),
	(44, 06, 06, 105, N'杏坛镇'),
	(44, 06, 06, 106, N'均安镇');

/* 广东省 佛山市 三水区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 06, 07, 001, N'西南街道办事处'),
	(44, 06, 07, 004, N'云东海街道办事处'),
	(44, 06, 07, 101, N'大塘镇'),
	(44, 06, 07, 103, N'乐平镇'),
	(44, 06, 07, 104, N'白坭镇'),
	(44, 06, 07, 105, N'芦苞镇'),
	(44, 06, 07, 106, N'南山镇');

/* 广东省 佛山市 高明区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 06, 08, 004, N'荷城街道办事处'),
	(44, 06, 08, 106, N'杨和镇'),
	(44, 06, 08, 107, N'明城镇'),
	(44, 06, 08, 108, N'更合镇');

/* 广东省 江门市 蓬江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 07, 03, 002, N'白沙街道办事处'),
	(44, 07, 03, 005, N'潮连街道办事处'),
	(44, 07, 03, 006, N'环市街道办事处'),
	(44, 07, 03, 101, N'棠下镇'),
	(44, 07, 03, 102, N'荷塘镇'),
	(44, 07, 03, 103, N'杜阮镇');

/* 广东省 江门市 江海区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 07, 04, 001, N'江南街道办事处'),
	(44, 07, 04, 004, N'外海街道办事处'),
	(44, 07, 04, 005, N'礼乐街道办事处');

/* 广东省 江门市 新会区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 07, 05, 001, N'会城街道办'),
	(44, 07, 05, 101, N'大泽镇'),
	(44, 07, 05, 102, N'司前镇'),
	(44, 07, 05, 103, N'罗坑镇'),
	(44, 07, 05, 104, N'双水镇'),
	(44, 07, 05, 105, N'崖门镇'),
	(44, 07, 05, 106, N'沙堆镇'),
	(44, 07, 05, 107, N'古井镇'),
	(44, 07, 05, 108, N'三江镇'),
	(44, 07, 05, 109, N'睦洲镇'),
	(44, 07, 05, 110, N'大鳌镇');

/* 广东省 江门市 台山市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 07, 81, 001, N'台城街道办事处'),
	(44, 07, 81, 100, N'大江镇'),
	(44, 07, 81, 101, N'水步镇'),
	(44, 07, 81, 102, N'四九镇'),
	(44, 07, 81, 103, N'白沙镇'),
	(44, 07, 81, 104, N'三合镇'),
	(44, 07, 81, 105, N'冲蒌镇'),
	(44, 07, 81, 106, N'斗山镇'),
	(44, 07, 81, 107, N'都斛镇'),
	(44, 07, 81, 108, N'赤溪镇'),
	(44, 07, 81, 109, N'端芬镇'),
	(44, 07, 81, 110, N'广海镇'),
	(44, 07, 81, 111, N'海宴镇'),
	(44, 07, 81, 112, N'汶村镇'),
	(44, 07, 81, 113, N'深井镇'),
	(44, 07, 81, 114, N'北陡镇'),
	(44, 07, 81, 115, N'川岛镇');

/* 广东省 江门市 开平市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 07, 83, 001, N'三埠街道'),
	(44, 07, 83, 002, N'长沙街道'),
	(44, 07, 83, 103, N'沙塘镇'),
	(44, 07, 83, 104, N'苍城镇'),
	(44, 07, 83, 105, N'龙胜镇'),
	(44, 07, 83, 106, N'大沙镇'),
	(44, 07, 83, 107, N'马冈镇'),
	(44, 07, 83, 108, N'塘口镇'),
	(44, 07, 83, 109, N'赤坎镇'),
	(44, 07, 83, 110, N'百合镇'),
	(44, 07, 83, 111, N'蚬冈镇'),
	(44, 07, 83, 112, N'金鸡镇'),
	(44, 07, 83, 115, N'月山镇'),
	(44, 07, 83, 116, N'赤水镇'),
	(44, 07, 83, 117, N'水口镇');

/* 广东省 江门市 鹤山市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 07, 84, 001, N'沙坪街道'),
	(44, 07, 84, 101, N'龙口镇'),
	(44, 07, 84, 102, N'雅瑶镇'),
	(44, 07, 84, 103, N'古劳镇'),
	(44, 07, 84, 104, N'桃源镇'),
	(44, 07, 84, 105, N'鹤城镇'),
	(44, 07, 84, 106, N'共和镇'),
	(44, 07, 84, 107, N'址山镇'),
	(44, 07, 84, 108, N'宅梧镇'),
	(44, 07, 84, 112, N'双合镇');

/* 广东省 江门市 恩平市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 07, 85, 001, N'恩城街道办事处'),
	(44, 07, 85, 100, N'横陂镇'),
	(44, 07, 85, 101, N'圣堂镇'),
	(44, 07, 85, 102, N'良西镇'),
	(44, 07, 85, 103, N'沙湖镇'),
	(44, 07, 85, 104, N'牛江镇'),
	(44, 07, 85, 105, N'君堂镇'),
	(44, 07, 85, 106, N'大田镇'),
	(44, 07, 85, 107, N'那吉镇'),
	(44, 07, 85, 108, N'大槐镇'),
	(44, 07, 85, 109, N'东成镇');

/* 广东省 湛江市 赤坎区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 08, 02, 001, N'中华街道'),
	(44, 08, 02, 002, N'寸金街道'),
	(44, 08, 02, 003, N'民主街道'),
	(44, 08, 02, 004, N'中山街道'),
	(44, 08, 02, 005, N'沙湾街道'),
	(44, 08, 02, 006, N'调顺街道'),
	(44, 08, 02, 007, N'南桥街道'),
	(44, 08, 02, 008, N'北桥街道');

/* 广东省 湛江市 霞山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 08, 03, 001, N'解放街道办事处'),
	(44, 08, 03, 002, N'爱国街道办事处'),
	(44, 08, 03, 003, N'工农街道办事处'),
	(44, 08, 03, 004, N'友谊街道办事处'),
	(44, 08, 03, 005, N'新兴街道办事处'),
	(44, 08, 03, 006, N'海滨街道办事处'),
	(44, 08, 03, 009, N'建设街道办事处'),
	(44, 08, 03, 010, N'东新街道办事处'),
	(44, 08, 03, 011, N'新园街道办事处'),
	(44, 08, 03, 012, N'海头街道办事处'),
	(44, 08, 03, 070, N'泉庄街道办事处'),
	(44, 08, 03, 071, N'乐华街道办事处');

/* 广东省 湛江市 坡头区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 08, 04, 001, N'南调街道办事处'),
	(44, 08, 04, 002, N'麻斜街道办事处'),
	(44, 08, 04, 100, N'南三镇'),
	(44, 08, 04, 101, N'坡头镇'),
	(44, 08, 04, 102, N'乾塘镇'),
	(44, 08, 04, 103, N'龙头镇'),
	(44, 08, 04, 104, N'官渡镇');

/* 广东省 湛江市 麻章区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 08, 11, 100, N'麻章镇'),
	(44, 08, 11, 101, N'太平镇'),
	(44, 08, 11, 102, N'湖光镇'),
	(44, 08, 11, 170, N'东山镇'),
	(44, 08, 11, 171, N'东简镇'),
	(44, 08, 11, 172, N'民安镇'),
	(44, 08, 11, 173, N'硇洲镇');

/* 广东省 湛江市 遂溪县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 08, 23, 100, N'遂城镇'),
	(44, 08, 23, 101, N'黄略镇'),
	(44, 08, 23, 102, N'洋青镇'),
	(44, 08, 23, 103, N'界炮镇'),
	(44, 08, 23, 104, N'乐民镇'),
	(44, 08, 23, 105, N'江洪镇'),
	(44, 08, 23, 106, N'杨柑镇'),
	(44, 08, 23, 107, N'城月镇'),
	(44, 08, 23, 108, N'乌塘镇'),
	(44, 08, 23, 109, N'建新镇'),
	(44, 08, 23, 110, N'岭北镇'),
	(44, 08, 23, 111, N'北坡镇'),
	(44, 08, 23, 112, N'港门镇'),
	(44, 08, 23, 113, N'草潭镇'),
	(44, 08, 23, 114, N'河头镇');

/* 广东省 湛江市 徐闻县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 08, 25, 001, N'徐城街道办'),
	(44, 08, 25, 102, N'迈陈镇'),
	(44, 08, 25, 103, N'海安镇'),
	(44, 08, 25, 104, N'曲界镇'),
	(44, 08, 25, 105, N'前山镇'),
	(44, 08, 25, 106, N'西连镇'),
	(44, 08, 25, 107, N'下桥镇'),
	(44, 08, 25, 108, N'龙塘镇'),
	(44, 08, 25, 109, N'下洋镇'),
	(44, 08, 25, 110, N'锦和镇'),
	(44, 08, 25, 111, N'和安镇'),
	(44, 08, 25, 112, N'新寮镇'),
	(44, 08, 25, 113, N'南山镇'),
	(44, 08, 25, 201, N'城北乡'),
	(44, 08, 25, 204, N'角尾乡');

/* 广东省 湛江市 廉江市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 08, 81, 001, N'罗州街道办'),
	(44, 08, 81, 002, N'城南街道办'),
	(44, 08, 81, 003, N'城北街道办'),
	(44, 08, 81, 101, N'石城镇'),
	(44, 08, 81, 102, N'新民镇'),
	(44, 08, 81, 103, N'吉水镇'),
	(44, 08, 81, 104, N'河唇镇'),
	(44, 08, 81, 105, N'石角镇'),
	(44, 08, 81, 106, N'良垌镇'),
	(44, 08, 81, 107, N'横山镇'),
	(44, 08, 81, 108, N'安铺镇'),
	(44, 08, 81, 109, N'营仔镇'),
	(44, 08, 81, 110, N'青平镇'),
	(44, 08, 81, 111, N'车板镇'),
	(44, 08, 81, 112, N'高桥镇'),
	(44, 08, 81, 113, N'石岭镇'),
	(44, 08, 81, 114, N'雅塘镇'),
	(44, 08, 81, 115, N'石颈镇'),
	(44, 08, 81, 116, N'长山镇'),
	(44, 08, 81, 117, N'塘蓬镇'),
	(44, 08, 81, 118, N'和寮镇');

/* 广东省 湛江市 雷州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 08, 82, 001, N'雷城街道办'),
	(44, 08, 82, 002, N'西湖街道办'),
	(44, 08, 82, 003, N'新城街道办'),
	(44, 08, 82, 100, N'白沙镇'),
	(44, 08, 82, 101, N'沈塘镇'),
	(44, 08, 82, 102, N'客路镇'),
	(44, 08, 82, 103, N'杨家镇'),
	(44, 08, 82, 104, N'唐家镇'),
	(44, 08, 82, 105, N'企水镇'),
	(44, 08, 82, 106, N'纪家镇'),
	(44, 08, 82, 107, N'松竹镇'),
	(44, 08, 82, 108, N'南兴镇'),
	(44, 08, 82, 109, N'雷高镇'),
	(44, 08, 82, 110, N'东里镇'),
	(44, 08, 82, 111, N'调风镇'),
	(44, 08, 82, 112, N'龙门镇'),
	(44, 08, 82, 113, N'英利镇'),
	(44, 08, 82, 114, N'北和镇'),
	(44, 08, 82, 115, N'乌石镇'),
	(44, 08, 82, 116, N'覃斗镇'),
	(44, 08, 82, 117, N'附城镇');

/* 广东省 湛江市 吴川市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 08, 83, 001, N'梅录街道'),
	(44, 08, 83, 002, N'塘尾街道'),
	(44, 08, 83, 003, N'大山江街道'),
	(44, 08, 83, 004, N'博铺街道'),
	(44, 08, 83, 005, N'海滨街道'),
	(44, 08, 83, 100, N'浅水镇'),
	(44, 08, 83, 101, N'长岐镇'),
	(44, 08, 83, 102, N'覃巴镇'),
	(44, 08, 83, 103, N'王村港镇'),
	(44, 08, 83, 104, N'振文镇'),
	(44, 08, 83, 105, N'樟铺镇'),
	(44, 08, 83, 106, N'吴阳镇'),
	(44, 08, 83, 107, N'塘缀镇'),
	(44, 08, 83, 109, N'黄坡镇'),
	(44, 08, 83, 111, N'兰石镇');

/* 广东省 茂名市 茂南区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 09, 02, 001, N'红旗街道办'),
	(44, 09, 02, 002, N'河西街道办'),
	(44, 09, 02, 003, N'河东街道办'),
	(44, 09, 02, 004, N'露天矿街道办'),
	(44, 09, 02, 005, N'新华街道办'),
	(44, 09, 02, 006, N'官渡街道办'),
	(44, 09, 02, 007, N'站前街道办'),
	(44, 09, 02, 100, N'金塘镇'),
	(44, 09, 02, 101, N'公馆镇'),
	(44, 09, 02, 102, N'新坡镇'),
	(44, 09, 02, 103, N'镇盛镇'),
	(44, 09, 02, 104, N'鳌头镇'),
	(44, 09, 02, 105, N'袂花镇'),
	(44, 09, 02, 106, N'高山镇'),
	(44, 09, 02, 107, N'山阁镇');

/* 广东省 茂名市 电白区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 09, 04, 001, N'南海街道'),
	(44, 09, 04, 002, N'高地街道'),
	(44, 09, 04, 100, N'马踏镇'),
	(44, 09, 04, 101, N'岭门镇'),
	(44, 09, 04, 102, N'坡心镇'),
	(44, 09, 04, 103, N'七迳镇'),
	(44, 09, 04, 104, N'树仔镇'),
	(44, 09, 04, 105, N'沙院镇'),
	(44, 09, 04, 106, N'麻岗镇'),
	(44, 09, 04, 107, N'旦场镇'),
	(44, 09, 04, 108, N'羊角镇'),
	(44, 09, 04, 109, N'小良镇'),
	(44, 09, 04, 115, N'霞洞镇'),
	(44, 09, 04, 116, N'观珠镇'),
	(44, 09, 04, 117, N'沙琅镇'),
	(44, 09, 04, 118, N'黄岭镇'),
	(44, 09, 04, 119, N'望夫镇'),
	(44, 09, 04, 120, N'罗坑镇'),
	(44, 09, 04, 121, N'那霍镇'),
	(44, 09, 04, 123, N'水东镇'),
	(44, 09, 04, 125, N'博贺镇'),
	(44, 09, 04, 126, N'林头镇'),
	(44, 09, 04, 127, N'电城镇'),
	(44, 09, 04, 128, N'陈村镇');

/* 广东省 茂名市 高州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 09, 81, 002, N'石仔岭街道'),
	(44, 09, 81, 003, N'山美街道'),
	(44, 09, 81, 006, N'金山街道'),
	(44, 09, 81, 007, N'潘州街道'),
	(44, 09, 81, 008, N'宝光街道'),
	(44, 09, 81, 100, N'谢鸡镇'),
	(44, 09, 81, 101, N'新垌镇'),
	(44, 09, 81, 102, N'云潭镇'),
	(44, 09, 81, 103, N'分界镇'),
	(44, 09, 81, 104, N'根子镇'),
	(44, 09, 81, 105, N'泗水镇'),
	(44, 09, 81, 107, N'镇江镇'),
	(44, 09, 81, 109, N'沙田镇'),
	(44, 09, 81, 110, N'南塘镇'),
	(44, 09, 81, 111, N'荷花镇'),
	(44, 09, 81, 112, N'石板镇'),
	(44, 09, 81, 115, N'大井镇'),
	(44, 09, 81, 116, N'潭头镇'),
	(44, 09, 81, 119, N'大坡镇'),
	(44, 09, 81, 120, N'平山镇'),
	(44, 09, 81, 121, N'深镇镇'),
	(44, 09, 81, 122, N'马贵镇'),
	(44, 09, 81, 123, N'古丁镇'),
	(44, 09, 81, 124, N'曹江镇'),
	(44, 09, 81, 126, N'荷塘镇'),
	(44, 09, 81, 127, N'石鼓镇'),
	(44, 09, 81, 128, N'东岸镇'),
	(44, 09, 81, 129, N'长坡镇');

/* 广东省 茂名市 化州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 09, 82, 001, N'河西街道'),
	(44, 09, 82, 002, N'东山街道'),
	(44, 09, 82, 003, N'下郭街道'),
	(44, 09, 82, 004, N'南盛街道'),
	(44, 09, 82, 005, N'石湾街道'),
	(44, 09, 82, 100, N'长岐镇'),
	(44, 09, 82, 101, N'同庆镇'),
	(44, 09, 82, 102, N'杨梅镇'),
	(44, 09, 82, 103, N'良光镇'),
	(44, 09, 82, 104, N'笪桥镇'),
	(44, 09, 82, 106, N'丽岗镇'),
	(44, 09, 82, 107, N'新安镇'),
	(44, 09, 82, 108, N'官桥镇'),
	(44, 09, 82, 110, N'林尘镇'),
	(44, 09, 82, 112, N'合江镇'),
	(44, 09, 82, 113, N'那务镇'),
	(44, 09, 82, 114, N'播扬镇'),
	(44, 09, 82, 115, N'宝圩镇'),
	(44, 09, 82, 116, N'平定镇'),
	(44, 09, 82, 117, N'文楼镇'),
	(44, 09, 82, 118, N'江湖镇'),
	(44, 09, 82, 120, N'中垌镇');

/* 广东省 茂名市 信宜市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 09, 83, 001, N'东镇街道办'),
	(44, 09, 83, 101, N'镇隆镇'),
	(44, 09, 83, 102, N'水口镇'),
	(44, 09, 83, 105, N'丁堡镇'),
	(44, 09, 83, 106, N'池洞镇'),
	(44, 09, 83, 112, N'贵子镇'),
	(44, 09, 83, 113, N'怀乡镇'),
	(44, 09, 83, 114, N'茶山镇'),
	(44, 09, 83, 115, N'洪冠镇'),
	(44, 09, 83, 116, N'白石镇'),
	(44, 09, 83, 117, N'大成镇'),
	(44, 09, 83, 118, N'钱排镇'),
	(44, 09, 83, 119, N'合水镇'),
	(44, 09, 83, 120, N'新宝镇'),
	(44, 09, 83, 121, N'平塘镇'),
	(44, 09, 83, 122, N'思贺镇'),
	(44, 09, 83, 123, N'金垌镇'),
	(44, 09, 83, 124, N'朱砂镇'),
	(44, 09, 83, 125, N'北界镇');

/* 广东省 肇庆市 端州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 12, 02, 001, N'端州区城东街道'),
	(44, 12, 02, 003, N'端州区城西街道'),
	(44, 12, 02, 005, N'端州区黄岗街道'),
	(44, 12, 02, 006, N'端州区睦岗街道');

/* 广东省 肇庆市 鼎湖区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 12, 03, 001, N'坑口街道办事处'),
	(44, 12, 03, 002, N'桂城街道办事处'),
	(44, 12, 03, 003, N'广利街道办事处'),
	(44, 12, 03, 101, N'永安镇'),
	(44, 12, 03, 102, N'沙浦镇'),
	(44, 12, 03, 103, N'凤凰镇'),
	(44, 12, 03, 104, N'莲花镇');

/* 广东省 肇庆市 高要区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 12, 04, 001, N'南岸街道办事处'),
	(44, 12, 04, 100, N'河台镇'),
	(44, 12, 04, 101, N'乐城镇'),
	(44, 12, 04, 102, N'水南镇'),
	(44, 12, 04, 103, N'禄步镇'),
	(44, 12, 04, 105, N'小湘镇'),
	(44, 12, 04, 106, N'大湾镇'),
	(44, 12, 04, 107, N'新桥镇'),
	(44, 12, 04, 108, N'白诸镇'),
	(44, 12, 04, 109, N'莲塘镇'),
	(44, 12, 04, 110, N'活道镇'),
	(44, 12, 04, 111, N'蛟塘镇'),
	(44, 12, 04, 112, N'回龙镇'),
	(44, 12, 04, 113, N'白土镇'),
	(44, 12, 04, 114, N'金渡镇'),
	(44, 12, 04, 115, N'金利镇'),
	(44, 12, 04, 116, N'蚬岗镇');

/* 广东省 肇庆市 广宁县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 12, 23, 100, N'排沙镇'),
	(44, 12, 23, 102, N'潭布镇'),
	(44, 12, 23, 103, N'江屯镇'),
	(44, 12, 23, 105, N'螺岗镇'),
	(44, 12, 23, 106, N'北市镇'),
	(44, 12, 23, 107, N'坑口镇'),
	(44, 12, 23, 108, N'赤坑镇'),
	(44, 12, 23, 109, N'南街镇'),
	(44, 12, 23, 110, N'宾亨镇'),
	(44, 12, 23, 111, N'五和镇'),
	(44, 12, 23, 112, N'横山镇'),
	(44, 12, 23, 113, N'木格镇'),
	(44, 12, 23, 114, N'石咀镇'),
	(44, 12, 23, 115, N'古水镇'),
	(44, 12, 23, 116, N'洲仔镇');

/* 广东省 肇庆市 怀集县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 12, 24, 100, N'怀城镇'),
	(44, 12, 24, 101, N'闸岗镇'),
	(44, 12, 24, 102, N'坳仔镇'),
	(44, 12, 24, 103, N'汶朗镇'),
	(44, 12, 24, 104, N'甘洒镇'),
	(44, 12, 24, 105, N'凤岗镇'),
	(44, 12, 24, 106, N'洽水镇'),
	(44, 12, 24, 107, N'梁村镇'),
	(44, 12, 24, 108, N'大岗镇'),
	(44, 12, 24, 109, N'岗坪镇'),
	(44, 12, 24, 110, N'冷坑镇'),
	(44, 12, 24, 111, N'马宁镇'),
	(44, 12, 24, 112, N'蓝钟镇'),
	(44, 12, 24, 113, N'永固镇'),
	(44, 12, 24, 114, N'诗洞镇'),
	(44, 12, 24, 115, N'桥头镇'),
	(44, 12, 24, 116, N'中洲镇'),
	(44, 12, 24, 118, N'连麦镇'),
	(44, 12, 24, 200, N'下帅壮族瑶族乡');

/* 广东省 肇庆市 封开县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 12, 25, 100, N'江口镇'),
	(44, 12, 25, 101, N'江川镇'),
	(44, 12, 25, 102, N'白垢镇'),
	(44, 12, 25, 103, N'大洲镇'),
	(44, 12, 25, 104, N'渔涝镇'),
	(44, 12, 25, 105, N'河儿口镇'),
	(44, 12, 25, 106, N'连都镇'),
	(44, 12, 25, 107, N'杏花镇'),
	(44, 12, 25, 108, N'罗董镇'),
	(44, 12, 25, 109, N'长岗镇'),
	(44, 12, 25, 110, N'平凤镇'),
	(44, 12, 25, 111, N'南丰镇'),
	(44, 12, 25, 112, N'大玉口镇'),
	(44, 12, 25, 113, N'都平镇'),
	(44, 12, 25, 114, N'金装镇'),
	(44, 12, 25, 115, N'长安镇');

/* 广东省 肇庆市 德庆县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 12, 26, 001, N'德城街道办事处'),
	(44, 12, 26, 101, N'新圩镇'),
	(44, 12, 26, 102, N'回龙镇'),
	(44, 12, 26, 103, N'官圩镇'),
	(44, 12, 26, 105, N'马圩镇'),
	(44, 12, 26, 106, N'高良镇'),
	(44, 12, 26, 107, N'莫村镇'),
	(44, 12, 26, 109, N'永丰镇'),
	(44, 12, 26, 110, N'武垄镇'),
	(44, 12, 26, 111, N'播植镇'),
	(44, 12, 26, 112, N'凤村镇'),
	(44, 12, 26, 113, N'悦城镇'),
	(44, 12, 26, 114, N'九市镇');

/* 广东省 肇庆市 四会市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 12, 84, 001, N'城中街道'),
	(44, 12, 84, 002, N'东城街道'),
	(44, 12, 84, 003, N'贞山街道'),
	(44, 12, 84, 100, N'龙甫镇'),
	(44, 12, 84, 101, N'地豆镇'),
	(44, 12, 84, 102, N'威整镇'),
	(44, 12, 84, 103, N'罗源镇'),
	(44, 12, 84, 104, N'迳口镇'),
	(44, 12, 84, 105, N'大沙镇'),
	(44, 12, 84, 107, N'石狗镇'),
	(44, 12, 84, 108, N'黄田镇'),
	(44, 12, 84, 110, N'江谷镇'),
	(44, 12, 84, 113, N'下茆镇');

/* 广东省 惠州市 惠城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 13, 02, 001, N'桥东街道办事处'),
	(44, 13, 02, 002, N'桥西街道办事处'),
	(44, 13, 02, 003, N'江南街道办事处'),
	(44, 13, 02, 004, N'江北街道办事处'),
	(44, 13, 02, 005, N'龙丰街道办事处'),
	(44, 13, 02, 006, N'河南岸街道办事处'),
	(44, 13, 02, 007, N'惠环街道办事处'),
	(44, 13, 02, 008, N'陈江街道办事处'),
	(44, 13, 02, 009, N'水口街道办事处'),
	(44, 13, 02, 010, N'小金口街道办事处'),
	(44, 13, 02, 100, N'汝湖镇'),
	(44, 13, 02, 103, N'三栋镇'),
	(44, 13, 02, 106, N'潼湖镇'),
	(44, 13, 02, 107, N'沥林镇'),
	(44, 13, 02, 109, N'马安镇'),
	(44, 13, 02, 110, N'横沥镇'),
	(44, 13, 02, 112, N'芦洲镇'),
	(44, 13, 02, 114, N'潼侨镇');

/* 广东省 惠州市 惠阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 13, 03, 001, N'淡水街道办事处'),
	(44, 13, 03, 002, N'秋长街道办事处'),
	(44, 13, 03, 003, N'惠阳区三和街道办事处'),
	(44, 13, 03, 006, N'大亚湾澳头办事处'),
	(44, 13, 03, 007, N'大亚湾霞涌办事处'),
	(44, 13, 03, 008, N'大亚湾西区办事处'),
	(44, 13, 03, 101, N'沙田镇'),
	(44, 13, 03, 103, N'新圩镇'),
	(44, 13, 03, 104, N'镇隆镇'),
	(44, 13, 03, 108, N'永湖镇'),
	(44, 13, 03, 109, N'良井镇'),
	(44, 13, 03, 110, N'平潭镇');

/* 广东省 惠州市 博罗县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 13, 22, 100, N'石坝镇'),
	(44, 13, 22, 102, N'麻陂镇'),
	(44, 13, 22, 103, N'观音阁镇'),
	(44, 13, 22, 104, N'公庄镇'),
	(44, 13, 22, 105, N'杨村镇'),
	(44, 13, 22, 106, N'柏塘镇'),
	(44, 13, 22, 108, N'泰美镇'),
	(44, 13, 22, 110, N'罗阳镇'),
	(44, 13, 22, 113, N'湖镇镇'),
	(44, 13, 22, 115, N'长宁镇'),
	(44, 13, 22, 116, N'福田镇'),
	(44, 13, 22, 117, N'龙华镇'),
	(44, 13, 22, 118, N'龙溪镇'),
	(44, 13, 22, 119, N'园洲镇'),
	(44, 13, 22, 121, N'石湾镇'),
	(44, 13, 22, 122, N'杨侨镇'),
	(44, 13, 22, 123, N'横河镇');

/* 广东省 惠州市 惠东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 13, 23, 001, N'平山街道办事处'),
	(44, 13, 23, 101, N'大岭镇'),
	(44, 13, 23, 102, N'白花镇'),
	(44, 13, 23, 103, N'梁化镇'),
	(44, 13, 23, 104, N'稔山镇'),
	(44, 13, 23, 105, N'铁涌镇'),
	(44, 13, 23, 106, N'平海镇'),
	(44, 13, 23, 109, N'吉隆镇'),
	(44, 13, 23, 110, N'黄埠镇'),
	(44, 13, 23, 113, N'多祝镇'),
	(44, 13, 23, 115, N'安墩镇'),
	(44, 13, 23, 118, N'高潭镇'),
	(44, 13, 23, 120, N'宝口镇'),
	(44, 13, 23, 121, N'白盆珠镇');

/* 广东省 惠州市 龙门县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 13, 24, 001, N'龙城街道办事处'),
	(44, 13, 24, 100, N'麻榨镇'),
	(44, 13, 24, 101, N'永汉镇'),
	(44, 13, 24, 106, N'平陵镇'),
	(44, 13, 24, 115, N'龙田镇'),
	(44, 13, 24, 116, N'龙潭镇'),
	(44, 13, 24, 117, N'地派镇'),
	(44, 13, 24, 118, N'龙华镇'),
	(44, 13, 24, 119, N'龙江镇'),
	(44, 13, 24, 200, N'蓝田瑶族乡');

/* 广东省 梅州市 梅江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 14, 02, 004, N'江南街道'),
	(44, 14, 02, 006, N'金山街道'),
	(44, 14, 02, 007, N'西郊街道'),
	(44, 14, 02, 102, N'三角镇'),
	(44, 14, 02, 103, N'长沙镇'),
	(44, 14, 02, 105, N'城北镇'),
	(44, 14, 02, 106, N'西阳镇');

/* 广东省 梅州市 梅县区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 14, 03, 001, N'新城办事处'),
	(44, 14, 03, 101, N'城东镇'),
	(44, 14, 03, 102, N'石扇镇'),
	(44, 14, 03, 103, N'梅西镇'),
	(44, 14, 03, 104, N'大坪镇'),
	(44, 14, 03, 105, N'石坑镇'),
	(44, 14, 03, 109, N'水车镇'),
	(44, 14, 03, 110, N'梅南镇'),
	(44, 14, 03, 113, N'丙村镇'),
	(44, 14, 03, 115, N'白渡镇'),
	(44, 14, 03, 116, N'松源镇'),
	(44, 14, 03, 117, N'隆文镇'),
	(44, 14, 03, 118, N'桃尧镇'),
	(44, 14, 03, 126, N'畲江镇'),
	(44, 14, 03, 129, N'雁洋镇'),
	(44, 14, 03, 130, N'松口镇'),
	(44, 14, 03, 131, N'南口镇'),
	(44, 14, 03, 132, N'程江镇'),
	(44, 14, 03, 133, N'扶大镇');

/* 广东省 梅州市 大埔县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 14, 22, 100, N'湖寮镇'),
	(44, 14, 22, 103, N'青溪镇'),
	(44, 14, 22, 105, N'三河镇'),
	(44, 14, 22, 108, N'银江镇'),
	(44, 14, 22, 109, N'洲瑞镇'),
	(44, 14, 22, 112, N'光德镇'),
	(44, 14, 22, 113, N'桃源镇'),
	(44, 14, 22, 116, N'百侯镇'),
	(44, 14, 22, 117, N'大东镇'),
	(44, 14, 22, 121, N'大麻镇'),
	(44, 14, 22, 122, N'枫朗镇'),
	(44, 14, 22, 123, N'茶阳镇'),
	(44, 14, 22, 124, N'高陂镇'),
	(44, 14, 22, 125, N'西河镇');

/* 广东省 梅州市 丰顺县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 14, 23, 103, N'北斗镇'),
	(44, 14, 23, 104, N'汤西镇'),
	(44, 14, 23, 105, N'汤南镇'),
	(44, 14, 23, 106, N'埔寨镇'),
	(44, 14, 23, 110, N'建桥镇'),
	(44, 14, 23, 111, N'龙岗镇'),
	(44, 14, 23, 112, N'潘田镇'),
	(44, 14, 23, 114, N'黄金镇'),
	(44, 14, 23, 122, N'小胜镇'),
	(44, 14, 23, 123, N'砂田镇'),
	(44, 14, 23, 124, N'八乡山镇'),
	(44, 14, 23, 125, N'丰良镇'),
	(44, 14, 23, 126, N'潭江镇'),
	(44, 14, 23, 127, N'汤坑镇'),
	(44, 14, 23, 128, N'留隍镇'),
	(44, 14, 23, 129, N'大龙华镇');

/* 广东省 梅州市 五华县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 14, 24, 103, N'转水镇'),
	(44, 14, 24, 108, N'潭下镇'),
	(44, 14, 24, 117, N'郭田镇'),
	(44, 14, 24, 118, N'双华镇'),
	(44, 14, 24, 125, N'梅林镇'),
	(44, 14, 24, 126, N'华阳镇'),
	(44, 14, 24, 130, N'华城镇'),
	(44, 14, 24, 131, N'周江镇'),
	(44, 14, 24, 134, N'水寨镇'),
	(44, 14, 24, 135, N'河东镇'),
	(44, 14, 24, 136, N'岐岭镇'),
	(44, 14, 24, 137, N'长布镇'),
	(44, 14, 24, 138, N'横陂镇'),
	(44, 14, 24, 139, N'安流镇'),
	(44, 14, 24, 140, N'棉洋镇'),
	(44, 14, 24, 141, N'龙村镇');

/* 广东省 梅州市 平远县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 14, 26, 101, N'石正镇'),
	(44, 14, 26, 104, N'八尺镇'),
	(44, 14, 26, 105, N'差干镇'),
	(44, 14, 26, 107, N'河头镇'),
	(44, 14, 26, 108, N'中行镇'),
	(44, 14, 26, 109, N'上举镇'),
	(44, 14, 26, 110, N'泗水镇'),
	(44, 14, 26, 114, N'长田镇'),
	(44, 14, 26, 115, N'热柘镇'),
	(44, 14, 26, 117, N'东石镇'),
	(44, 14, 26, 118, N'仁居镇'),
	(44, 14, 26, 119, N'大柘镇');

/* 广东省 梅州市 蕉岭县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 14, 27, 103, N'三圳镇'),
	(44, 14, 27, 106, N'文福镇'),
	(44, 14, 27, 107, N'广福镇'),
	(44, 14, 27, 112, N'新铺镇'),
	(44, 14, 27, 113, N'蓝坊镇'),
	(44, 14, 27, 114, N'南礤镇'),
	(44, 14, 27, 115, N'蕉城镇'),
	(44, 14, 27, 116, N'长潭镇');

/* 广东省 梅州市 兴宁市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 14, 81, 001, N'兴田街道办事处'),
	(44, 14, 81, 002, N'福兴街道办事处'),
	(44, 14, 81, 003, N'宁新街道办事处'),
	(44, 14, 81, 107, N'永和镇'),
	(44, 14, 81, 111, N'新圩镇'),
	(44, 14, 81, 115, N'罗浮镇'),
	(44, 14, 81, 116, N'罗岗镇'),
	(44, 14, 81, 117, N'黄槐镇'),
	(44, 14, 81, 123, N'龙田镇'),
	(44, 14, 81, 124, N'石马镇'),
	(44, 14, 81, 128, N'宁中镇'),
	(44, 14, 81, 129, N'径南镇'),
	(44, 14, 81, 130, N'坭陂镇'),
	(44, 14, 81, 131, N'水口镇'),
	(44, 14, 81, 132, N'黄陂镇'),
	(44, 14, 81, 133, N'合水镇'),
	(44, 14, 81, 134, N'大坪镇'),
	(44, 14, 81, 135, N'叶塘镇'),
	(44, 14, 81, 136, N'新陂镇'),
	(44, 14, 81, 137, N'刁坊镇');

/* 广东省 汕尾市 城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 15, 02, 001, N'新港街道'),
	(44, 15, 02, 002, N'香洲街道'),
	(44, 15, 02, 003, N'凤山街道'),
	(44, 15, 02, 004, N'田墘街道'),
	(44, 15, 02, 005, N'东洲街道'),
	(44, 15, 02, 006, N'遮浪街道'),
	(44, 15, 02, 007, N'马宫街道'),
	(44, 15, 02, 100, N'红草镇'),
	(44, 15, 02, 102, N'东涌镇'),
	(44, 15, 02, 103, N'捷胜镇');

/* 广东省 汕尾市 海丰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 15, 21, 101, N'梅陇镇'),
	(44, 15, 21, 102, N'小漠镇'),
	(44, 15, 21, 105, N'鮜门镇'),
	(44, 15, 21, 106, N'联安镇'),
	(44, 15, 21, 107, N'陶河镇'),
	(44, 15, 21, 108, N'赤坑镇'),
	(44, 15, 21, 109, N'大湖镇'),
	(44, 15, 21, 110, N'可塘镇'),
	(44, 15, 21, 112, N'黄羌镇'),
	(44, 15, 21, 113, N'平东镇'),
	(44, 15, 21, 115, N'海城镇'),
	(44, 15, 21, 116, N'鹅埠镇'),
	(44, 15, 21, 117, N'赤石镇'),
	(44, 15, 21, 118, N'公平镇'),
	(44, 15, 21, 119, N'附城镇'),
	(44, 15, 21, 120, N'城东镇');

/* 广东省 汕尾市 陆河县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 15, 23, 100, N'河田镇'),
	(44, 15, 23, 101, N'水唇镇'),
	(44, 15, 23, 102, N'河口镇'),
	(44, 15, 23, 103, N'新田镇'),
	(44, 15, 23, 104, N'上护镇'),
	(44, 15, 23, 105, N'螺溪镇'),
	(44, 15, 23, 106, N'东坑镇'),
	(44, 15, 23, 107, N'南万镇');

/* 广东省 汕尾市 陆丰市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 15, 81, 001, N'东海街道'),
	(44, 15, 81, 002, N'河西街道'),
	(44, 15, 81, 003, N'城东街道'),
	(44, 15, 81, 101, N'甲子镇'),
	(44, 15, 81, 102, N'碣石镇'),
	(44, 15, 81, 103, N'湖东镇'),
	(44, 15, 81, 104, N'大安镇'),
	(44, 15, 81, 105, N'博美镇'),
	(44, 15, 81, 106, N'内湖镇'),
	(44, 15, 81, 107, N'南塘镇'),
	(44, 15, 81, 108, N'陂洋镇'),
	(44, 15, 81, 109, N'八万镇'),
	(44, 15, 81, 110, N'金厢镇'),
	(44, 15, 81, 111, N'潭西镇'),
	(44, 15, 81, 112, N'甲东镇'),
	(44, 15, 81, 115, N'河东镇'),
	(44, 15, 81, 116, N'上英镇'),
	(44, 15, 81, 117, N'桥冲镇'),
	(44, 15, 81, 118, N'甲西镇'),
	(44, 15, 81, 119, N'西南镇');

/* 广东省 河源市 源城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 16, 02, 001, N'上城街道办事处'),
	(44, 16, 02, 002, N'新江街道办事处'),
	(44, 16, 02, 003, N'东埔街道办事处'),
	(44, 16, 02, 004, N'源西街道办事处'),
	(44, 16, 02, 005, N'高埔岗街道办事处'),
	(44, 16, 02, 100, N'源南镇'),
	(44, 16, 02, 101, N'埔前镇');

/* 广东省 河源市 紫金县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 16, 21, 100, N'紫城镇'),
	(44, 16, 21, 102, N'龙窝镇'),
	(44, 16, 21, 103, N'九和镇'),
	(44, 16, 21, 104, N'上义镇'),
	(44, 16, 21, 105, N'蓝塘镇'),
	(44, 16, 21, 106, N'凤安镇'),
	(44, 16, 21, 107, N'义容镇'),
	(44, 16, 21, 108, N'古竹镇'),
	(44, 16, 21, 109, N'临江镇'),
	(44, 16, 21, 110, N'柏埔镇'),
	(44, 16, 21, 111, N'黄塘镇'),
	(44, 16, 21, 112, N'敬梓镇'),
	(44, 16, 21, 114, N'水墩镇'),
	(44, 16, 21, 115, N'南岭镇'),
	(44, 16, 21, 116, N'苏区镇'),
	(44, 16, 21, 117, N'瓦溪镇'),
	(44, 16, 21, 118, N'好义镇'),
	(44, 16, 21, 119, N'中坝镇');

/* 广东省 河源市 龙川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 16, 22, 100, N'老隆镇'),
	(44, 16, 22, 102, N'义都镇'),
	(44, 16, 22, 103, N'佗城镇'),
	(44, 16, 22, 104, N'鹤市镇'),
	(44, 16, 22, 105, N'黄布镇'),
	(44, 16, 22, 106, N'紫市镇'),
	(44, 16, 22, 107, N'通衢镇'),
	(44, 16, 22, 109, N'登云镇'),
	(44, 16, 22, 110, N'丰稔镇'),
	(44, 16, 22, 111, N'四都镇'),
	(44, 16, 22, 112, N'铁场镇'),
	(44, 16, 22, 114, N'龙母镇'),
	(44, 16, 22, 115, N'田心镇'),
	(44, 16, 22, 116, N'黎咀镇'),
	(44, 16, 22, 117, N'黄石镇'),
	(44, 16, 22, 118, N'赤光镇'),
	(44, 16, 22, 119, N'回龙镇'),
	(44, 16, 22, 120, N'新田镇'),
	(44, 16, 22, 121, N'车田镇'),
	(44, 16, 22, 123, N'岩镇镇'),
	(44, 16, 22, 124, N'麻布岗镇'),
	(44, 16, 22, 125, N'贝岭镇'),
	(44, 16, 22, 126, N'细坳镇'),
	(44, 16, 22, 127, N'上坪镇');

/* 广东省 河源市 连平县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 16, 23, 100, N'元善镇'),
	(44, 16, 23, 101, N'上坪镇'),
	(44, 16, 23, 102, N'内莞镇'),
	(44, 16, 23, 104, N'陂头镇'),
	(44, 16, 23, 105, N'溪山镇'),
	(44, 16, 23, 107, N'隆街镇'),
	(44, 16, 23, 108, N'田源镇'),
	(44, 16, 23, 109, N'油溪镇'),
	(44, 16, 23, 110, N'忠信镇'),
	(44, 16, 23, 111, N'高莞镇'),
	(44, 16, 23, 113, N'大湖镇'),
	(44, 16, 23, 114, N'三角镇'),
	(44, 16, 23, 115, N'绣缎镇');

/* 广东省 河源市 和平县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 16, 24, 100, N'阳明镇'),
	(44, 16, 24, 101, N'大坝镇'),
	(44, 16, 24, 102, N'长塘镇'),
	(44, 16, 24, 103, N'下车镇'),
	(44, 16, 24, 104, N'上陵镇'),
	(44, 16, 24, 105, N'优胜镇'),
	(44, 16, 24, 106, N'贝墩镇'),
	(44, 16, 24, 107, N'古寨镇'),
	(44, 16, 24, 108, N'彭寨镇'),
	(44, 16, 24, 109, N'合水镇'),
	(44, 16, 24, 110, N'公白镇'),
	(44, 16, 24, 111, N'青州镇'),
	(44, 16, 24, 112, N'浰源镇'),
	(44, 16, 24, 113, N'热水镇'),
	(44, 16, 24, 114, N'东水镇'),
	(44, 16, 24, 115, N'礼士镇'),
	(44, 16, 24, 116, N'林寨镇');

/* 广东省 河源市 东源县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 16, 25, 100, N'仙塘镇'),
	(44, 16, 25, 101, N'灯塔镇'),
	(44, 16, 25, 102, N'骆湖镇'),
	(44, 16, 25, 103, N'船塘镇'),
	(44, 16, 25, 104, N'顺天镇'),
	(44, 16, 25, 105, N'上莞镇'),
	(44, 16, 25, 106, N'曾田镇'),
	(44, 16, 25, 107, N'柳城镇'),
	(44, 16, 25, 108, N'义合镇'),
	(44, 16, 25, 109, N'蓝口镇'),
	(44, 16, 25, 110, N'黄田镇'),
	(44, 16, 25, 111, N'叶潭镇'),
	(44, 16, 25, 112, N'黄村镇'),
	(44, 16, 25, 113, N'康禾镇'),
	(44, 16, 25, 114, N'锡场镇'),
	(44, 16, 25, 115, N'新港镇'),
	(44, 16, 25, 116, N'双江镇'),
	(44, 16, 25, 117, N'涧头镇'),
	(44, 16, 25, 121, N'新回龙镇'),
	(44, 16, 25, 122, N'半江镇'),
	(44, 16, 25, 200, N'漳溪乡');

/* 广东省 阳江市 江城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 17, 02, 001, N'南恩街道办事处'),
	(44, 17, 02, 002, N'城南街道办事处'),
	(44, 17, 02, 003, N'城北街道办事处'),
	(44, 17, 02, 004, N'中洲街道办事处'),
	(44, 17, 02, 006, N'城东街道办事处'),
	(44, 17, 02, 008, N'岗列街道办事处'),
	(44, 17, 02, 009, N'城西街道办事处'),
	(44, 17, 02, 011, N'白沙街道办事处'),
	(44, 17, 02, 102, N'埠场镇'),
	(44, 17, 02, 103, N'平冈镇'),
	(44, 17, 02, 104, N'海陵镇'),
	(44, 17, 02, 105, N'闸坡镇'),
	(44, 17, 02, 106, N'双捷镇');

/* 广东省 阳江市 阳东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 17, 04, 100, N'东城镇'),
	(44, 17, 04, 101, N'北惯镇'),
	(44, 17, 04, 102, N'那龙镇'),
	(44, 17, 04, 103, N'东平镇'),
	(44, 17, 04, 104, N'雅韶镇'),
	(44, 17, 04, 105, N'大沟镇'),
	(44, 17, 04, 106, N'新洲镇'),
	(44, 17, 04, 107, N'合山镇'),
	(44, 17, 04, 108, N'塘坪镇'),
	(44, 17, 04, 109, N'大八镇'),
	(44, 17, 04, 110, N'红丰镇');

/* 广东省 阳江市 阳西县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 17, 21, 100, N'织篢镇'),
	(44, 17, 21, 101, N'程村镇'),
	(44, 17, 21, 102, N'塘口镇'),
	(44, 17, 21, 103, N'上洋镇'),
	(44, 17, 21, 104, N'溪头镇'),
	(44, 17, 21, 105, N'沙扒镇'),
	(44, 17, 21, 106, N'儒洞镇'),
	(44, 17, 21, 107, N'新圩镇');

/* 广东省 阳江市 阳春市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 17, 81, 001, N'春城街道办事处'),
	(44, 17, 81, 101, N'河朗镇'),
	(44, 17, 81, 102, N'松柏镇'),
	(44, 17, 81, 103, N'石望镇'),
	(44, 17, 81, 105, N'春湾镇'),
	(44, 17, 81, 106, N'合水镇'),
	(44, 17, 81, 107, N'陂面镇'),
	(44, 17, 81, 108, N'圭岗镇'),
	(44, 17, 81, 109, N'永宁镇'),
	(44, 17, 81, 110, N'马水镇'),
	(44, 17, 81, 111, N'岗美镇'),
	(44, 17, 81, 112, N'河口镇'),
	(44, 17, 81, 113, N'潭水镇'),
	(44, 17, 81, 114, N'三甲镇'),
	(44, 17, 81, 116, N'双窖镇'),
	(44, 17, 81, 117, N'八甲镇');

/* 广东省 清远市 清城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 18, 02, 006, N'凤城街道办事处'),
	(44, 18, 02, 007, N'东城街道办事处'),
	(44, 18, 02, 008, N'洲心街道办事处'),
	(44, 18, 02, 009, N'横荷街道办事处'),
	(44, 18, 02, 103, N'源潭镇'),
	(44, 18, 02, 105, N'龙塘镇'),
	(44, 18, 02, 106, N'石角镇'),
	(44, 18, 02, 107, N'飞来峡镇');

/* 广东省 清远市 清新区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 18, 03, 102, N'太和镇'),
	(44, 18, 03, 104, N'太平镇'),
	(44, 18, 03, 105, N'山塘镇'),
	(44, 18, 03, 106, N'三坑镇'),
	(44, 18, 03, 112, N'龙颈镇'),
	(44, 18, 03, 113, N'禾云镇'),
	(44, 18, 03, 117, N'浸潭镇'),
	(44, 18, 03, 118, N'石潭镇');

/* 广东省 清远市 佛冈县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 18, 21, 100, N'石角镇'),
	(44, 18, 21, 101, N'水头镇'),
	(44, 18, 21, 102, N'汤塘镇'),
	(44, 18, 21, 103, N'龙山镇'),
	(44, 18, 21, 104, N'高岗镇'),
	(44, 18, 21, 107, N'迳头镇');

/* 广东省 清远市 阳山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 18, 23, 100, N'青莲镇'),
	(44, 18, 23, 101, N'江英镇'),
	(44, 18, 23, 104, N'杜步镇'),
	(44, 18, 23, 105, N'七拱镇'),
	(44, 18, 23, 107, N'太平镇'),
	(44, 18, 23, 108, N'杨梅镇'),
	(44, 18, 23, 110, N'大崀镇'),
	(44, 18, 23, 111, N'小江镇'),
	(44, 18, 23, 113, N'岭背镇'),
	(44, 18, 23, 115, N'黄坌镇'),
	(44, 18, 23, 116, N'黎埠镇'),
	(44, 18, 23, 119, N'阳城镇'),
	(44, 18, 23, 201, N'秤架瑶族乡');

/* 广东省 清远市 连山壮族瑶族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 18, 25, 100, N'永和镇'),
	(44, 18, 25, 104, N'吉田镇'),
	(44, 18, 25, 105, N'太保镇'),
	(44, 18, 25, 106, N'禾洞镇'),
	(44, 18, 25, 108, N'福堂镇'),
	(44, 18, 25, 109, N'小三江镇'),
	(44, 18, 25, 111, N'上帅镇');

/* 广东省 清远市 连南瑶族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 18, 26, 100, N'三江镇'),
	(44, 18, 26, 101, N'大麦山镇'),
	(44, 18, 26, 102, N'寨岗镇'),
	(44, 18, 26, 105, N'三排镇'),
	(44, 18, 26, 106, N'涡水镇'),
	(44, 18, 26, 108, N'大坪镇'),
	(44, 18, 26, 109, N'香坪镇');

/* 广东省 清远市 英德市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 18, 81, 001, N'英城街道办事处'),
	(44, 18, 81, 101, N'沙口镇'),
	(44, 18, 81, 102, N'望埠镇'),
	(44, 18, 81, 103, N'横石水镇'),
	(44, 18, 81, 105, N'桥头镇'),
	(44, 18, 81, 106, N'青塘镇'),
	(44, 18, 81, 108, N'白沙镇'),
	(44, 18, 81, 109, N'大站镇'),
	(44, 18, 81, 110, N'西牛镇'),
	(44, 18, 81, 111, N'九龙镇'),
	(44, 18, 81, 112, N'含光镇'),
	(44, 18, 81, 114, N'大湾镇'),
	(44, 18, 81, 115, N'石灰铺镇'),
	(44, 18, 81, 116, N'石牯塘镇'),
	(44, 18, 81, 120, N'下太镇'),
	(44, 18, 81, 124, N'波罗镇'),
	(44, 18, 81, 125, N'横石塘镇'),
	(44, 18, 81, 126, N'大洞镇'),
	(44, 18, 81, 129, N'连江口镇'),
	(44, 18, 81, 130, N'黎溪镇'),
	(44, 18, 81, 131, N'水边镇'),
	(44, 18, 81, 136, N'英红镇'),
	(44, 18, 81, 137, N'东华镇'),
	(44, 18, 81, 138, N'黄花镇');

/* 广东省 清远市 连州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 18, 82, 100, N'连州镇'),
	(44, 18, 82, 101, N'星子镇'),
	(44, 18, 82, 102, N'大路边镇'),
	(44, 18, 82, 103, N'龙坪镇'),
	(44, 18, 82, 104, N'西岸镇'),
	(44, 18, 82, 105, N'保安镇'),
	(44, 18, 82, 106, N'丰阳镇'),
	(44, 18, 82, 107, N'东陂镇'),
	(44, 18, 82, 109, N'九陂镇'),
	(44, 18, 82, 118, N'西江镇'),
	(44, 18, 82, 200, N'瑶安瑶族乡'),
	(44, 18, 82, 201, N'三水瑶族乡');

/* 广东省 潮州市 湘桥区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 51, 02, 001, N'湘桥街道'),
	(44, 51, 02, 002, N'西湖街道'),
	(44, 51, 02, 003, N'金山街道'),
	(44, 51, 02, 004, N'太平街道'),
	(44, 51, 02, 005, N'南春街道'),
	(44, 51, 02, 006, N'西新街道'),
	(44, 51, 02, 007, N'桥东街道'),
	(44, 51, 02, 008, N'城西街道'),
	(44, 51, 02, 009, N'凤新街道'),
	(44, 51, 02, 100, N'意溪镇'),
	(44, 51, 02, 111, N'磷溪镇'),
	(44, 51, 02, 112, N'铁铺镇'),
	(44, 51, 02, 113, N'官塘镇');

/* 广东省 潮州市 潮安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 51, 03, 100, N'古巷镇'),
	(44, 51, 03, 101, N'登塘镇'),
	(44, 51, 03, 103, N'凤塘镇'),
	(44, 51, 03, 104, N'浮洋镇'),
	(44, 51, 03, 105, N'龙湖镇'),
	(44, 51, 03, 106, N'金石镇'),
	(44, 51, 03, 107, N'沙溪镇'),
	(44, 51, 03, 108, N'彩塘镇'),
	(44, 51, 03, 109, N'东凤镇'),
	(44, 51, 03, 110, N'庵埠镇'),
	(44, 51, 03, 114, N'江东镇'),
	(44, 51, 03, 115, N'归湖镇'),
	(44, 51, 03, 116, N'文祠镇'),
	(44, 51, 03, 117, N'凤凰镇'),
	(44, 51, 03, 120, N'赤凤镇'),
	(44, 51, 03, 121, N'枫溪镇');

/* 广东省 潮州市 饶平县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 51, 22, 100, N'黄冈镇'),
	(44, 51, 22, 102, N'上饶镇'),
	(44, 51, 22, 103, N'饶洋镇'),
	(44, 51, 22, 104, N'新丰镇'),
	(44, 51, 22, 106, N'建饶镇'),
	(44, 51, 22, 107, N'三饶镇'),
	(44, 51, 22, 108, N'新塘镇'),
	(44, 51, 22, 109, N'汤溪镇'),
	(44, 51, 22, 110, N'浮滨镇'),
	(44, 51, 22, 112, N'浮山镇'),
	(44, 51, 22, 113, N'东山镇'),
	(44, 51, 22, 114, N'新圩镇'),
	(44, 51, 22, 116, N'樟溪镇'),
	(44, 51, 22, 117, N'钱东镇'),
	(44, 51, 22, 118, N'高堂镇'),
	(44, 51, 22, 119, N'联饶镇'),
	(44, 51, 22, 120, N'所城镇'),
	(44, 51, 22, 121, N'大埕镇'),
	(44, 51, 22, 122, N'柘林镇'),
	(44, 51, 22, 123, N'汫洲镇'),
	(44, 51, 22, 124, N'海山镇');

/* 广东省 揭阳市 榕城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 52, 02, 001, N'榕华街道办事处'),
	(44, 52, 02, 002, N'新兴街道办事处'),
	(44, 52, 02, 003, N'中山街道办事处'),
	(44, 52, 02, 004, N'西马街道办事处'),
	(44, 52, 02, 005, N'东兴街道办事处'),
	(44, 52, 02, 006, N'榕东街道办事处'),
	(44, 52, 02, 007, N'仙桥街道办事处'),
	(44, 52, 02, 008, N'梅云街道办事处'),
	(44, 52, 02, 009, N'东升街道办事处'),
	(44, 52, 02, 010, N'东阳街道办事处'),
	(44, 52, 02, 101, N'渔湖镇'),
	(44, 52, 02, 102, N'炮台镇'),
	(44, 52, 02, 103, N'地都镇'),
	(44, 52, 02, 105, N'登岗镇');

/* 广东省 揭阳市 揭东区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 52, 03, 001, N'曲溪街道办事处'),
	(44, 52, 03, 002, N'磐东街道办事处'),
	(44, 52, 03, 102, N'云路镇'),
	(44, 52, 03, 103, N'玉窖镇'),
	(44, 52, 03, 104, N'锡场镇'),
	(44, 52, 03, 105, N'新亨镇'),
	(44, 52, 03, 106, N'玉湖镇'),
	(44, 52, 03, 107, N'埔田镇'),
	(44, 52, 03, 108, N'霖磐镇'),
	(44, 52, 03, 109, N'月城镇'),
	(44, 52, 03, 110, N'白塔镇'),
	(44, 52, 03, 111, N'龙尾镇'),
	(44, 52, 03, 112, N'桂岭镇');

/* 广东省 揭阳市 揭西县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 52, 22, 001, N'河婆街道办事处'),
	(44, 52, 22, 102, N'龙潭镇'),
	(44, 52, 22, 103, N'南山镇'),
	(44, 52, 22, 104, N'五经富镇'),
	(44, 52, 22, 105, N'京溪园镇'),
	(44, 52, 22, 106, N'灰寨镇'),
	(44, 52, 22, 107, N'塔头镇'),
	(44, 52, 22, 108, N'东园镇'),
	(44, 52, 22, 109, N'凤江镇'),
	(44, 52, 22, 110, N'棉湖镇'),
	(44, 52, 22, 111, N'金和镇'),
	(44, 52, 22, 112, N'大溪镇'),
	(44, 52, 22, 113, N'钱坑镇'),
	(44, 52, 22, 114, N'坪上镇'),
	(44, 52, 22, 115, N'五云镇'),
	(44, 52, 22, 116, N'上砂镇'),
	(44, 52, 22, 201, N'良田乡');

/* 广东省 揭阳市 惠来县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 52, 24, 100, N'惠城镇'),
	(44, 52, 24, 102, N'华湖镇'),
	(44, 52, 24, 103, N'仙庵镇'),
	(44, 52, 24, 104, N'靖海镇'),
	(44, 52, 24, 105, N'周田镇'),
	(44, 52, 24, 106, N'前詹镇'),
	(44, 52, 24, 107, N'神泉镇'),
	(44, 52, 24, 108, N'东陇镇'),
	(44, 52, 24, 109, N'岐石镇'),
	(44, 52, 24, 110, N'隆江镇'),
	(44, 52, 24, 111, N'溪西镇'),
	(44, 52, 24, 112, N'鳌江镇'),
	(44, 52, 24, 113, N'东港镇'),
	(44, 52, 24, 114, N'葵潭镇');

/* 广东省 揭阳市 普宁市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 52, 81, 001, N'流沙东街道'),
	(44, 52, 81, 002, N'流沙南街道'),
	(44, 52, 81, 003, N'流沙西街道'),
	(44, 52, 81, 004, N'流沙北街道'),
	(44, 52, 81, 005, N'池尾街道'),
	(44, 52, 81, 006, N'燎原街道'),
	(44, 52, 81, 007, N'大南山街道'),
	(44, 52, 81, 102, N'赤岗镇'),
	(44, 52, 81, 103, N'大坝镇'),
	(44, 52, 81, 104, N'洪阳镇'),
	(44, 52, 81, 105, N'南溪镇'),
	(44, 52, 81, 106, N'广太镇'),
	(44, 52, 81, 107, N'麒麟镇'),
	(44, 52, 81, 108, N'南径镇'),
	(44, 52, 81, 109, N'占陇镇'),
	(44, 52, 81, 110, N'军埠镇'),
	(44, 52, 81, 111, N'下架山镇'),
	(44, 52, 81, 113, N'高埔镇'),
	(44, 52, 81, 114, N'云落镇'),
	(44, 52, 81, 115, N'大坪镇'),
	(44, 52, 81, 116, N'船埔镇'),
	(44, 52, 81, 117, N'梅林镇'),
	(44, 52, 81, 119, N'里湖镇'),
	(44, 52, 81, 121, N'梅塘镇'),
	(44, 52, 81, 201, N'后溪乡');

/* 广东省 云浮市 云城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 53, 02, 001, N'云城街道'),
	(44, 53, 02, 002, N'高峰街道'),
	(44, 53, 02, 003, N'河口街道'),
	(44, 53, 02, 004, N'安塘街道'),
	(44, 53, 02, 102, N'腰古镇'),
	(44, 53, 02, 103, N'思劳镇'),
	(44, 53, 02, 105, N'前锋镇'),
	(44, 53, 02, 106, N'南盛镇');

/* 广东省 云浮市 云安区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 53, 03, 100, N'六都镇'),
	(44, 53, 03, 101, N'高村镇'),
	(44, 53, 03, 102, N'白石镇'),
	(44, 53, 03, 103, N'镇安镇'),
	(44, 53, 03, 104, N'富林镇'),
	(44, 53, 03, 105, N'石城镇'),
	(44, 53, 03, 106, N'都杨镇');

/* 广东省 云浮市 新兴县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 53, 21, 100, N'新城镇'),
	(44, 53, 21, 101, N'车岗镇'),
	(44, 53, 21, 103, N'水台镇'),
	(44, 53, 21, 104, N'稔村镇'),
	(44, 53, 21, 105, N'东成镇'),
	(44, 53, 21, 107, N'太平镇'),
	(44, 53, 21, 108, N'里洞镇'),
	(44, 53, 21, 110, N'大江镇'),
	(44, 53, 21, 112, N'天堂镇'),
	(44, 53, 21, 113, N'河头镇'),
	(44, 53, 21, 114, N'簕竹镇'),
	(44, 53, 21, 115, N'六祖镇');

/* 广东省 云浮市 郁南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 53, 22, 100, N'都城镇'),
	(44, 53, 22, 101, N'平台镇'),
	(44, 53, 22, 102, N'桂圩镇'),
	(44, 53, 22, 104, N'通门镇'),
	(44, 53, 22, 105, N'建城镇'),
	(44, 53, 22, 106, N'宝珠镇'),
	(44, 53, 22, 108, N'大方镇'),
	(44, 53, 22, 110, N'千官镇'),
	(44, 53, 22, 111, N'大湾镇'),
	(44, 53, 22, 112, N'河口镇'),
	(44, 53, 22, 113, N'宋桂镇'),
	(44, 53, 22, 114, N'东坝镇'),
	(44, 53, 22, 115, N'连滩镇'),
	(44, 53, 22, 116, N'历洞镇'),
	(44, 53, 22, 117, N'南江口镇');

/* 广东省 云浮市 罗定市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(44, 53, 81, 001, N'罗城街道'),
	(44, 53, 81, 002, N'素龙街道'),
	(44, 53, 81, 003, N'附城街道'),
	(44, 53, 81, 004, N'双东镇街道'),
	(44, 53, 81, 100, N'罗镜镇'),
	(44, 53, 81, 101, N'太平镇'),
	(44, 53, 81, 102, N'分界镇'),
	(44, 53, 81, 104, N'罗平镇'),
	(44, 53, 81, 105, N'船步镇'),
	(44, 53, 81, 106, N'满塘镇'),
	(44, 53, 81, 107, N'苹塘镇'),
	(44, 53, 81, 108, N'金鸡镇'),
	(44, 53, 81, 109, N'围底镇'),
	(44, 53, 81, 110, N'华石镇'),
	(44, 53, 81, 111, N'林滨镇'),
	(44, 53, 81, 113, N'黎少镇'),
	(44, 53, 81, 114, N'生江镇'),
	(44, 53, 81, 115, N'连州镇'),
	(44, 53, 81, 116, N'泗纶镇'),
	(44, 53, 81, 118, N'加益镇'),
	(44, 53, 81, 119, N'龙湾镇');


/* 广西壮族自治区 南宁市 兴宁区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 02, 001, N'民生街道办事处'),
	(45, 01, 02, 002, N'朝阳街道办事处'),
	(45, 01, 02, 003, N'兴东街道办事处'),
	(45, 01, 02, 101, N'三塘镇'),
	(45, 01, 02, 102, N'五塘镇'),
	(45, 01, 02, 104, N'昆仑镇');

/* 广西壮族自治区 南宁市 青秀区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 03, 001, N'新竹街道办事处'),
	(45, 01, 03, 002, N'中山街道办事处'),
	(45, 01, 03, 003, N'建政街道办事处'),
	(45, 01, 03, 004, N'南湖街道办事处'),
	(45, 01, 03, 005, N'津头街道办事处'),
	(45, 01, 03, 006, N'仙葫经济开发区管理委员会'),
	(45, 01, 03, 100, N'刘圩镇'),
	(45, 01, 03, 101, N'南阳镇'),
	(45, 01, 03, 102, N'伶俐镇'),
	(45, 01, 03, 103, N'长塘镇');

/* 广西壮族自治区 南宁市 江南区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 05, 001, N'福建园街道办事处'),
	(45, 01, 05, 002, N'江南街道办事处'),
	(45, 01, 05, 003, N'沙井街道办事处'),
	(45, 01, 05, 004, N'那洪街道办事处'),
	(45, 01, 05, 005, N'金凯街道办事处'),
	(45, 01, 05, 102, N'吴圩镇'),
	(45, 01, 05, 103, N'苏圩镇'),
	(45, 01, 05, 104, N'延安镇'),
	(45, 01, 05, 105, N'江西镇');

/* 广西壮族自治区 南宁市 西乡塘区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 07, 001, N'衡阳街道办事处'),
	(45, 01, 07, 002, N'北湖街道办事处'),
	(45, 01, 07, 003, N'西乡塘街道办事处'),
	(45, 01, 07, 004, N'安吉街道办事处'),
	(45, 01, 07, 005, N'华强街道办事处'),
	(45, 01, 07, 006, N'新阳街道办事处'),
	(45, 01, 07, 007, N'上尧街道办事处'),
	(45, 01, 07, 008, N'安宁街道办事处'),
	(45, 01, 07, 009, N'石埠街道办事处'),
	(45, 01, 07, 010, N'心圩街道办事处'),
	(45, 01, 07, 100, N'金陵镇'),
	(45, 01, 07, 101, N'双定镇'),
	(45, 01, 07, 105, N'坛洛镇');

/* 广西壮族自治区 南宁市 良庆区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 08, 001, N'大沙田街道办事处'),
	(45, 01, 08, 002, N'玉洞街道办事处'),
	(45, 01, 08, 100, N'良庆镇'),
	(45, 01, 08, 101, N'那马镇'),
	(45, 01, 08, 102, N'那陈镇'),
	(45, 01, 08, 103, N'大塘镇'),
	(45, 01, 08, 104, N'南晓镇');

/* 广西壮族自治区 南宁市 邕宁区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 09, 100, N'蒲庙镇'),
	(45, 01, 09, 101, N'那楼镇'),
	(45, 01, 09, 102, N'新江镇'),
	(45, 01, 09, 103, N'百济镇'),
	(45, 01, 09, 202, N'中和乡');

/* 广西壮族自治区 南宁市 武鸣区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 10, 100, N'城厢镇'),
	(45, 01, 10, 102, N'太平镇'),
	(45, 01, 10, 103, N'双桥镇'),
	(45, 01, 10, 104, N'宁武镇'),
	(45, 01, 10, 105, N'锣圩镇'),
	(45, 01, 10, 106, N'仙湖镇'),
	(45, 01, 10, 107, N'府城镇'),
	(45, 01, 10, 108, N'陆斡镇'),
	(45, 01, 10, 109, N'两江镇'),
	(45, 01, 10, 110, N'罗波镇'),
	(45, 01, 10, 111, N'灵马镇'),
	(45, 01, 10, 112, N'甘圩镇'),
	(45, 01, 10, 113, N'马头镇');

/* 广西壮族自治区 南宁市 隆安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 23, 100, N'城厢镇'),
	(45, 01, 23, 101, N'南圩镇'),
	(45, 01, 23, 102, N'雁江镇'),
	(45, 01, 23, 103, N'那桐镇'),
	(45, 01, 23, 104, N'乔建镇'),
	(45, 01, 23, 105, N'丁当镇'),
	(45, 01, 23, 201, N'古潭乡'),
	(45, 01, 23, 203, N'都结乡'),
	(45, 01, 23, 204, N'布泉乡'),
	(45, 01, 23, 205, N'屏山乡');

/* 广西壮族自治区 南宁市 马山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 24, 100, N'白山镇'),
	(45, 01, 24, 101, N'百龙滩镇'),
	(45, 01, 24, 102, N'林圩镇'),
	(45, 01, 24, 103, N'古零镇'),
	(45, 01, 24, 104, N'金钗镇'),
	(45, 01, 24, 105, N'周鹿镇'),
	(45, 01, 24, 106, N'永州镇'),
	(45, 01, 24, 200, N'乔利乡'),
	(45, 01, 24, 201, N'加方乡'),
	(45, 01, 24, 202, N'古寨瑶族乡'),
	(45, 01, 24, 203, N'里当瑶族乡');

/* 广西壮族自治区 南宁市 上林县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 25, 100, N'大丰镇'),
	(45, 01, 25, 101, N'明亮镇'),
	(45, 01, 25, 102, N'巷贤镇'),
	(45, 01, 25, 103, N'白圩镇'),
	(45, 01, 25, 104, N'三里镇'),
	(45, 01, 25, 105, N'乔贤镇'),
	(45, 01, 25, 106, N'西燕镇'),
	(45, 01, 25, 200, N'澄泰乡'),
	(45, 01, 25, 202, N'木山乡'),
	(45, 01, 25, 203, N'塘红乡'),
	(45, 01, 25, 205, N'镇圩瑶族乡');

/* 广西壮族自治区 南宁市 宾阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 26, 100, N'宾州镇'),
	(45, 01, 26, 101, N'黎塘镇'),
	(45, 01, 26, 102, N'甘棠镇'),
	(45, 01, 26, 103, N'思陇镇'),
	(45, 01, 26, 104, N'新桥镇'),
	(45, 01, 26, 105, N'新圩镇'),
	(45, 01, 26, 106, N'邹圩镇'),
	(45, 01, 26, 107, N'大桥镇'),
	(45, 01, 26, 108, N'武陵镇'),
	(45, 01, 26, 109, N'中华镇'),
	(45, 01, 26, 110, N'古辣镇'),
	(45, 01, 26, 111, N'露圩镇'),
	(45, 01, 26, 112, N'王灵镇'),
	(45, 01, 26, 113, N'和吉镇'),
	(45, 01, 26, 114, N'洋桥镇'),
	(45, 01, 26, 115, N'陈平镇');

/* 广西壮族自治区 南宁市 横县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 01, 27, 100, N'横州镇'),
	(45, 01, 27, 101, N'百合镇'),
	(45, 01, 27, 102, N'那阳镇'),
	(45, 01, 27, 103, N'南乡镇'),
	(45, 01, 27, 104, N'新福镇'),
	(45, 01, 27, 105, N'莲塘镇'),
	(45, 01, 27, 106, N'平马镇'),
	(45, 01, 27, 107, N'峦城镇'),
	(45, 01, 27, 108, N'六景镇'),
	(45, 01, 27, 110, N'石塘镇'),
	(45, 01, 27, 112, N'陶圩镇'),
	(45, 01, 27, 113, N'校椅镇'),
	(45, 01, 27, 114, N'云表镇'),
	(45, 01, 27, 115, N'马岭镇'),
	(45, 01, 27, 200, N'马山乡'),
	(45, 01, 27, 203, N'平朗乡'),
	(45, 01, 27, 204, N'镇龙乡');

/* 广西壮族自治区 柳州市 城中区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 02, 02, 001, N'城中街道办事处'),
	(45, 02, 02, 002, N'公园街道办事处'),
	(45, 02, 02, 003, N'中南街道办事处'),
	(45, 02, 02, 004, N'水上街道办事处'),
	(45, 02, 02, 005, N'潭中街道办事处'),
	(45, 02, 02, 006, N'河东街道办事处'),
	(45, 02, 02, 007, N'静兰街道办事处');

/* 广西壮族自治区 柳州市 鱼峰区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 02, 03, 001, N'天马街道办事处'),
	(45, 02, 03, 002, N'驾鹤街道办事处'),
	(45, 02, 03, 003, N'箭盘山街道办事处'),
	(45, 02, 03, 004, N'五里亭街道办事处'),
	(45, 02, 03, 005, N'荣军街道办事处'),
	(45, 02, 03, 006, N'白莲街道办事处'),
	(45, 02, 03, 007, N'麒麟街道办事处'),
	(45, 02, 03, 008, N'阳和街道办事处'),
	(45, 02, 03, 100, N'雒容镇'),
	(45, 02, 03, 101, N'洛埠镇');

/* 广西壮族自治区 柳州市 柳南区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 02, 04, 001, N'河西街道办事处'),
	(45, 02, 04, 002, N'南站街道办事处'),
	(45, 02, 04, 003, N'鹅山街道办事处'),
	(45, 02, 04, 004, N'柳南街道办事处'),
	(45, 02, 04, 005, N'柳石街道办事处'),
	(45, 02, 04, 006, N'银山街道办事处'),
	(45, 02, 04, 007, N'潭西街道办事处'),
	(45, 02, 04, 008, N'南环街道办事处'),
	(45, 02, 04, 100, N'太阳村镇');

/* 广西壮族自治区 柳州市 柳北区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 02, 05, 001, N'解放街道办事处'),
	(45, 02, 05, 002, N'雅儒街道办事处'),
	(45, 02, 05, 003, N'胜利街道办事处'),
	(45, 02, 05, 004, N'雀儿山街道办事处'),
	(45, 02, 05, 005, N'钢城街道办事处'),
	(45, 02, 05, 006, N'锦绣街道办事处'),
	(45, 02, 05, 007, N'白露街道办事处'),
	(45, 02, 05, 100, N'石碑坪镇'),
	(45, 02, 05, 101, N'沙塘镇'),
	(45, 02, 05, 102, N'长塘镇');

/* 广西壮族自治区 柳州市 柳江县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 02, 21, 100, N'拉堡镇'),
	(45, 02, 21, 101, N'里雍镇'),
	(45, 02, 21, 102, N'百朋镇'),
	(45, 02, 21, 103, N'成团镇'),
	(45, 02, 21, 104, N'洛满镇'),
	(45, 02, 21, 105, N'流山镇'),
	(45, 02, 21, 106, N'三都镇'),
	(45, 02, 21, 107, N'里高镇'),
	(45, 02, 21, 108, N'进德镇'),
	(45, 02, 21, 109, N'穿山镇'),
	(45, 02, 21, 110, N'土博镇'),
	(45, 02, 21, 111, N'白沙镇');

/* 广西壮族自治区 柳州市 柳城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 02, 22, 100, N'大埔镇'),
	(45, 02, 22, 101, N'龙头镇'),
	(45, 02, 22, 102, N'太平镇'),
	(45, 02, 22, 103, N'沙埔镇'),
	(45, 02, 22, 104, N'东泉镇'),
	(45, 02, 22, 105, N'凤山镇'),
	(45, 02, 22, 106, N'六塘镇'),
	(45, 02, 22, 107, N'冲脉镇'),
	(45, 02, 22, 108, N'寨隆镇'),
	(45, 02, 22, 200, N'古砦仫佬族乡'),
	(45, 02, 22, 201, N'马山乡'),
	(45, 02, 22, 202, N'社冲乡');

/* 广西壮族自治区 柳州市 鹿寨县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 02, 23, 100, N'鹿寨镇'),
	(45, 02, 23, 102, N'中渡镇'),
	(45, 02, 23, 103, N'寨沙镇'),
	(45, 02, 23, 104, N'平山镇'),
	(45, 02, 23, 105, N'黄冕镇'),
	(45, 02, 23, 106, N'四排镇'),
	(45, 02, 23, 201, N'江口乡'),
	(45, 02, 23, 202, N'导江乡'),
	(45, 02, 23, 203, N'拉沟乡');

/* 广西壮族自治区 柳州市 融安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 02, 24, 100, N'长安镇'),
	(45, 02, 24, 101, N'浮石镇'),
	(45, 02, 24, 102, N'泗顶镇'),
	(45, 02, 24, 103, N'板榄镇'),
	(45, 02, 24, 104, N'大将镇'),
	(45, 02, 24, 105, N'大良镇'),
	(45, 02, 24, 200, N'雅瑶乡'),
	(45, 02, 24, 201, N'大坡乡'),
	(45, 02, 24, 202, N'东起乡'),
	(45, 02, 24, 203, N'沙子乡'),
	(45, 02, 24, 204, N'桥板乡'),
	(45, 02, 24, 205, N'潭头乡');

/* 广西壮族自治区 柳州市 融水苗族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 02, 25, 100, N'融水镇'),
	(45, 02, 25, 101, N'和睦镇'),
	(45, 02, 25, 102, N'三防镇'),
	(45, 02, 25, 103, N'怀宝镇'),
	(45, 02, 25, 104, N'洞头镇'),
	(45, 02, 25, 105, N'大浪镇'),
	(45, 02, 25, 200, N'永乐乡'),
	(45, 02, 25, 201, N'四荣乡'),
	(45, 02, 25, 202, N'香粉乡'),
	(45, 02, 25, 203, N'安太乡'),
	(45, 02, 25, 205, N'汪洞乡'),
	(45, 02, 25, 206, N'同练瑶族乡'),
	(45, 02, 25, 207, N'滚贝侗族乡'),
	(45, 02, 25, 208, N'杆洞乡'),
	(45, 02, 25, 209, N'安陲乡'),
	(45, 02, 25, 211, N'白云乡'),
	(45, 02, 25, 212, N'红水乡'),
	(45, 02, 25, 213, N'拱洞乡'),
	(45, 02, 25, 214, N'良寨乡'),
	(45, 02, 25, 215, N'大年乡');

/* 广西壮族自治区 柳州市 三江侗族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 02, 26, 100, N'古宜镇'),
	(45, 02, 26, 101, N'斗江镇'),
	(45, 02, 26, 102, N'丹洲镇'),
	(45, 02, 26, 103, N'八江镇'),
	(45, 02, 26, 104, N'林溪镇'),
	(45, 02, 26, 200, N'独峒乡'),
	(45, 02, 26, 203, N'同乐苗族乡'),
	(45, 02, 26, 204, N'梅林乡'),
	(45, 02, 26, 205, N'富禄苗族乡'),
	(45, 02, 26, 206, N'洋溪乡'),
	(45, 02, 26, 207, N'良口乡'),
	(45, 02, 26, 208, N'老堡乡'),
	(45, 02, 26, 209, N'高基瑶族乡'),
	(45, 02, 26, 210, N'和平乡'),
	(45, 02, 26, 211, N'程村乡');

/* 广西壮族自治区 桂林市 秀峰区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 02, 001, N'秀峰街道办事处'),
	(45, 03, 02, 002, N'丽君街道办事处'),
	(45, 03, 02, 003, N'甲山街道办事处');

/* 广西壮族自治区 桂林市 叠彩区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 03, 001, N'叠彩街道办事处'),
	(45, 03, 03, 002, N'北门街道办事处'),
	(45, 03, 03, 200, N'大河乡');

/* 广西壮族自治区 桂林市 象山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 04, 001, N'南门街道办事处'),
	(45, 03, 04, 002, N'象山街道办事处'),
	(45, 03, 04, 003, N'平山街道办事处'),
	(45, 03, 04, 200, N'二塘乡');

/* 广西壮族自治区 桂林市 七星区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 05, 001, N'七星区街道办事处'),
	(45, 03, 05, 002, N'东江街道办事处'),
	(45, 03, 05, 003, N'穿山街道办事处'),
	(45, 03, 05, 004, N'漓东街道办事处'),
	(45, 03, 05, 200, N'朝阳乡');

/* 广西壮族自治区 桂林市 雁山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 11, 001, N'雁山街道办事处'),
	(45, 03, 11, 100, N'雁山镇'),
	(45, 03, 11, 101, N'柘木镇'),
	(45, 03, 11, 200, N'大埠乡'),
	(45, 03, 11, 201, N'草坪回族乡');

/* 广西壮族自治区 桂林市 临桂区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 12, 100, N'临桂镇'),
	(45, 03, 12, 101, N'六塘镇'),
	(45, 03, 12, 102, N'会仙镇'),
	(45, 03, 12, 103, N'两江镇'),
	(45, 03, 12, 104, N'五通镇'),
	(45, 03, 12, 105, N'四塘镇'),
	(45, 03, 12, 106, N'南边山镇'),
	(45, 03, 12, 107, N'中庸镇'),
	(45, 03, 12, 202, N'茶洞乡'),
	(45, 03, 12, 204, N'宛田瑶族乡'),
	(45, 03, 12, 205, N'黄沙瑶族乡');

/* 广西壮族自治区 桂林市 阳朔县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 21, 100, N'阳朔镇'),
	(45, 03, 21, 101, N'白沙镇'),
	(45, 03, 21, 102, N'福利镇'),
	(45, 03, 21, 103, N'兴坪镇'),
	(45, 03, 21, 104, N'葡萄镇'),
	(45, 03, 21, 105, N'高田镇'),
	(45, 03, 21, 200, N'金宝乡'),
	(45, 03, 21, 201, N'普益乡'),
	(45, 03, 21, 202, N'杨堤乡');

/* 广西壮族自治区 桂林市 灵川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 23, 100, N'灵川镇'),
	(45, 03, 23, 101, N'大圩镇'),
	(45, 03, 23, 102, N'定江镇'),
	(45, 03, 23, 103, N'三街镇'),
	(45, 03, 23, 104, N'潭下镇'),
	(45, 03, 23, 106, N'九屋镇'),
	(45, 03, 23, 107, N'灵田镇'),
	(45, 03, 23, 200, N'潮田乡'),
	(45, 03, 23, 201, N'大境瑶族乡'),
	(45, 03, 23, 202, N'海洋乡'),
	(45, 03, 23, 206, N'兰田瑶族乡'),
	(45, 03, 23, 207, N'公平乡');

/* 广西壮族自治区 桂林市 全州县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 24, 100, N'全州镇'),
	(45, 03, 24, 101, N'黄沙河镇'),
	(45, 03, 24, 102, N'庙头镇'),
	(45, 03, 24, 103, N'文桥镇'),
	(45, 03, 24, 104, N'大西江镇'),
	(45, 03, 24, 105, N'龙水镇'),
	(45, 03, 24, 106, N'才湾镇'),
	(45, 03, 24, 107, N'绍水镇'),
	(45, 03, 24, 108, N'石塘镇'),
	(45, 03, 24, 109, N'咸水镇'),
	(45, 03, 24, 110, N'凤凰镇'),
	(45, 03, 24, 111, N'安和镇'),
	(45, 03, 24, 112, N'两河镇'),
	(45, 03, 24, 113, N'枧塘镇'),
	(45, 03, 24, 200, N'永岁乡'),
	(45, 03, 24, 204, N'蕉江瑶族乡'),
	(45, 03, 24, 207, N'白宝乡'),
	(45, 03, 24, 208, N'东山瑶族乡');

/* 广西壮族自治区 桂林市 兴安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 25, 100, N'兴安镇'),
	(45, 03, 25, 101, N'湘漓镇'),
	(45, 03, 25, 102, N'界首镇'),
	(45, 03, 25, 103, N'高尚镇'),
	(45, 03, 25, 104, N'严关镇'),
	(45, 03, 25, 105, N'溶江镇'),
	(45, 03, 25, 200, N'漠川乡'),
	(45, 03, 25, 201, N'白石乡'),
	(45, 03, 25, 202, N'崔家乡'),
	(45, 03, 25, 203, N'华江瑶族乡');

/* 广西壮族自治区 桂林市 永福县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 26, 100, N'永福镇'),
	(45, 03, 26, 101, N'罗锦镇'),
	(45, 03, 26, 102, N'百寿镇'),
	(45, 03, 26, 103, N'苏桥镇'),
	(45, 03, 26, 104, N'三皇镇'),
	(45, 03, 26, 201, N'堡里乡'),
	(45, 03, 26, 202, N'广福乡'),
	(45, 03, 26, 204, N'永安乡'),
	(45, 03, 26, 205, N'龙江乡');

/* 广西壮族自治区 桂林市 灌阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 27, 100, N'灌阳镇'),
	(45, 03, 27, 101, N'黄关镇'),
	(45, 03, 27, 102, N'文市镇'),
	(45, 03, 27, 103, N'新街镇'),
	(45, 03, 27, 104, N'新圩镇'),
	(45, 03, 27, 200, N'洞井瑶族乡'),
	(45, 03, 27, 201, N'观音阁乡'),
	(45, 03, 27, 202, N'西山瑶族乡'),
	(45, 03, 27, 205, N'水车乡');

/* 广西壮族自治区 桂林市 龙胜各族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 28, 100, N'龙胜镇'),
	(45, 03, 28, 101, N'瓢里镇'),
	(45, 03, 28, 102, N'三门镇'),
	(45, 03, 28, 103, N'龙脊镇'),
	(45, 03, 28, 104, N'平等镇'),
	(45, 03, 28, 201, N'泗水乡'),
	(45, 03, 28, 202, N'江底乡'),
	(45, 03, 28, 203, N'马堤乡'),
	(45, 03, 28, 204, N'伟江乡'),
	(45, 03, 28, 206, N'乐江乡');

/* 广西壮族自治区 桂林市 资源县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 29, 100, N'资源镇'),
	(45, 03, 29, 101, N'中峰镇'),
	(45, 03, 29, 102, N'梅溪镇'),
	(45, 03, 29, 202, N'瓜里乡'),
	(45, 03, 29, 203, N'车田苗族乡'),
	(45, 03, 29, 204, N'两水苗族乡'),
	(45, 03, 29, 205, N'河口瑶族乡');

/* 广西壮族自治区 桂林市 平乐县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 30, 100, N'平乐镇'),
	(45, 03, 30, 101, N'二塘镇'),
	(45, 03, 30, 102, N'沙子镇'),
	(45, 03, 30, 103, N'同安镇'),
	(45, 03, 30, 104, N'张家镇'),
	(45, 03, 30, 105, N'源头镇'),
	(45, 03, 30, 200, N'阳安乡'),
	(45, 03, 30, 201, N'青龙乡'),
	(45, 03, 30, 202, N'桥亭乡'),
	(45, 03, 30, 203, N'大发瑶族乡');

/* 广西壮族自治区 桂林市 荔浦县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 31, 100, N'荔城镇'),
	(45, 03, 31, 101, N'东昌镇'),
	(45, 03, 31, 102, N'新坪镇'),
	(45, 03, 31, 103, N'杜莫镇'),
	(45, 03, 31, 104, N'青山镇'),
	(45, 03, 31, 105, N'修仁镇'),
	(45, 03, 31, 106, N'大塘镇'),
	(45, 03, 31, 107, N'花箦镇'),
	(45, 03, 31, 108, N'双江镇'),
	(45, 03, 31, 109, N'马岭镇'),
	(45, 03, 31, 200, N'龙怀乡'),
	(45, 03, 31, 201, N'茶城乡'),
	(45, 03, 31, 202, N'蒲芦瑶族乡');

/* 广西壮族自治区 桂林市 恭城瑶族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 03, 32, 100, N'恭城镇'),
	(45, 03, 32, 101, N'栗木镇'),
	(45, 03, 32, 102, N'莲花镇'),
	(45, 03, 32, 103, N'嘉会镇'),
	(45, 03, 32, 200, N'平安乡'),
	(45, 03, 32, 201, N'三江乡'),
	(45, 03, 32, 203, N'西岭乡'),
	(45, 03, 32, 204, N'观音乡'),
	(45, 03, 32, 205, N'龙虎乡');

/* 广西壮族自治区 梧州市 万秀区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 04, 03, 001, N'城东街道办事处'),
	(45, 04, 03, 002, N'城南街道办事处'),
	(45, 04, 03, 003, N'城中办街道事处'),
	(45, 04, 03, 004, N'城北办街道事处'),
	(45, 04, 03, 005, N'角嘴街道办事处'),
	(45, 04, 03, 006, N'东兴街道办事处'),
	(45, 04, 03, 007, N'富民街道办事处'),
	(45, 04, 03, 101, N'城东镇'),
	(45, 04, 03, 103, N'龙湖镇'),
	(45, 04, 03, 104, N'夏郢镇');

/* 广西壮族自治区 梧州市 长洲区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 04, 05, 001, N'大塘街道办事处'),
	(45, 04, 05, 002, N'兴龙街道办事处'),
	(45, 04, 05, 101, N'长洲镇'),
	(45, 04, 05, 102, N'倒水镇');

/* 广西壮族自治区 梧州市 龙圩区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 04, 06, 100, N'龙圩镇'),
	(45, 04, 06, 101, N'大坡镇'),
	(45, 04, 06, 102, N'广平镇'),
	(45, 04, 06, 103, N'新地镇');

/* 广西壮族自治区 梧州市 苍梧县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 04, 21, 100, N'石桥镇'),
	(45, 04, 21, 101, N'沙头镇'),
	(45, 04, 21, 102, N'梨埠镇'),
	(45, 04, 21, 105, N'岭脚镇'),
	(45, 04, 21, 108, N'京南镇'),
	(45, 04, 21, 109, N'狮寨镇'),
	(45, 04, 21, 110, N'旺甫镇'),
	(45, 04, 21, 112, N'六堡镇'),
	(45, 04, 21, 114, N'木双镇');

/* 广西壮族自治区 梧州市 藤县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 04, 22, 100, N'藤州镇'),
	(45, 04, 22, 103, N'塘步镇'),
	(45, 04, 22, 104, N'埌南镇'),
	(45, 04, 22, 105, N'同心镇'),
	(45, 04, 22, 106, N'金鸡镇'),
	(45, 04, 22, 107, N'新庆镇'),
	(45, 04, 22, 108, N'象棋镇'),
	(45, 04, 22, 109, N'岭景镇'),
	(45, 04, 22, 110, N'天平镇'),
	(45, 04, 22, 111, N'蒙江镇'),
	(45, 04, 22, 112, N'和平镇'),
	(45, 04, 22, 113, N'太平镇'),
	(45, 04, 22, 114, N'古龙镇'),
	(45, 04, 22, 115, N'东荣镇'),
	(45, 04, 22, 116, N'大黎镇'),
	(45, 04, 22, 200, N'平福乡'),
	(45, 04, 22, 201, N'藤县宁康乡');

/* 广西壮族自治区 梧州市 蒙山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 04, 23, 100, N'蒙山镇'),
	(45, 04, 23, 101, N'西河镇'),
	(45, 04, 23, 102, N'新圩镇'),
	(45, 04, 23, 103, N'文圩镇'),
	(45, 04, 23, 104, N'黄村镇'),
	(45, 04, 23, 105, N'陈塘镇'),
	(45, 04, 23, 200, N'汉豪乡'),
	(45, 04, 23, 201, N'长坪瑶族乡'),
	(45, 04, 23, 202, N'夏宜瑶族乡');

/* 广西壮族自治区 梧州市 岑溪市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 04, 81, 100, N'岑城镇'),
	(45, 04, 81, 102, N'马路镇'),
	(45, 04, 81, 103, N'南渡镇'),
	(45, 04, 81, 105, N'水汶镇'),
	(45, 04, 81, 106, N'大隆镇'),
	(45, 04, 81, 107, N'梨木镇'),
	(45, 04, 81, 108, N'大业镇'),
	(45, 04, 81, 109, N'筋竹镇'),
	(45, 04, 81, 110, N'城谏镇'),
	(45, 04, 81, 111, N'归义镇'),
	(45, 04, 81, 112, N'糯垌镇'),
	(45, 04, 81, 113, N'安平镇'),
	(45, 04, 81, 114, N'三堡镇'),
	(45, 04, 81, 115, N'波塘镇');

/* 广西壮族自治区 北海市 海城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 05, 02, 001, N'中街街道办事处'),
	(45, 05, 02, 002, N'东街街道办事处'),
	(45, 05, 02, 003, N'西街街道办事处'),
	(45, 05, 02, 004, N'海角街道办事处'),
	(45, 05, 02, 005, N'地角街道办事处'),
	(45, 05, 02, 006, N'高德街道办事处'),
	(45, 05, 02, 007, N'驿马街道办事处'),
	(45, 05, 02, 100, N'涠洲镇');

/* 广西壮族自治区 北海市 银海区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 05, 03, 100, N'福成镇'),
	(45, 05, 03, 101, N'银滩镇'),
	(45, 05, 03, 102, N'平阳镇'),
	(45, 05, 03, 103, N'侨港镇');

/* 广西壮族自治区 北海市 铁山港区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 05, 12, 100, N'南康镇'),
	(45, 05, 12, 101, N'营盘镇'),
	(45, 05, 12, 102, N'兴港镇');

/* 广西壮族自治区 北海市 合浦县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 05, 21, 100, N'廉州镇'),
	(45, 05, 21, 101, N'党江镇'),
	(45, 05, 21, 102, N'西场镇'),
	(45, 05, 21, 103, N'沙岗镇'),
	(45, 05, 21, 104, N'乌家镇'),
	(45, 05, 21, 105, N'闸口镇'),
	(45, 05, 21, 106, N'公馆镇'),
	(45, 05, 21, 107, N'白沙镇'),
	(45, 05, 21, 108, N'山口镇'),
	(45, 05, 21, 109, N'沙田镇'),
	(45, 05, 21, 110, N'石湾镇'),
	(45, 05, 21, 111, N'石康镇'),
	(45, 05, 21, 112, N'常乐镇'),
	(45, 05, 21, 200, N'曲樟乡'),
	(45, 05, 21, 201, N'星岛湖乡');

/* 广西壮族自治区 防城港市 港口区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 06, 02, 001, N'渔州坪街道办事处'),
	(45, 06, 02, 002, N'白沙万街道办事处'),
	(45, 06, 02, 003, N'沙潭江街道办事处'),
	(45, 06, 02, 004, N'王府街道办事处'),
	(45, 06, 02, 100, N'企沙镇'),
	(45, 06, 02, 101, N'光坡镇');

/* 广西壮族自治区 防城港市 防城区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 06, 03, 001, N'水营街道办事处'),
	(45, 06, 03, 002, N'珠河街道办事处'),
	(45, 06, 03, 003, N'文昌街道办事处'),
	(45, 06, 03, 101, N'大菉镇'),
	(45, 06, 03, 102, N'华石镇'),
	(45, 06, 03, 103, N'那梭镇'),
	(45, 06, 03, 104, N'那良镇'),
	(45, 06, 03, 105, N'峒中镇'),
	(45, 06, 03, 106, N'江山镇'),
	(45, 06, 03, 107, N'茅岭镇'),
	(45, 06, 03, 202, N'扶隆乡'),
	(45, 06, 03, 203, N'防城区滩营乡'),
	(45, 06, 03, 205, N'十万山瑶族乡');

/* 广西壮族自治区 防城港市 上思县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 06, 21, 100, N'思阳镇'),
	(45, 06, 21, 101, N'在妙镇'),
	(45, 06, 21, 102, N'华兰镇'),
	(45, 06, 21, 103, N'叫安镇'),
	(45, 06, 21, 203, N'南屏瑶族乡'),
	(45, 06, 21, 204, N'平福乡'),
	(45, 06, 21, 205, N'那琴乡'),
	(45, 06, 21, 206, N'公正乡');

/* 广西壮族自治区 防城港市 东兴市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 06, 81, 100, N'东兴镇'),
	(45, 06, 81, 101, N'江平镇'),
	(45, 06, 81, 102, N'马路镇');

/* 广西壮族自治区 钦州市 钦南区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 07, 02, 001, N'向阳街道办事处'),
	(45, 07, 02, 002, N'水东街道办事处'),
	(45, 07, 02, 003, N'文峰街道办事处'),
	(45, 07, 02, 004, N'南珠街道办事处'),
	(45, 07, 02, 005, N'尖山街道办事处'),
	(45, 07, 02, 100, N'沙埠镇'),
	(45, 07, 02, 101, N'康熙岭镇'),
	(45, 07, 02, 102, N'黄屋屯镇'),
	(45, 07, 02, 104, N'大番坡镇'),
	(45, 07, 02, 105, N'龙门港镇'),
	(45, 07, 02, 107, N'久隆镇'),
	(45, 07, 02, 108, N'东场镇'),
	(45, 07, 02, 109, N'那丽镇'),
	(45, 07, 02, 110, N'那彭镇'),
	(45, 07, 02, 111, N'那思镇'),
	(45, 07, 02, 112, N'犀牛脚镇');

/* 广西壮族自治区 钦州市 钦北区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 07, 03, 001, N'长田街道办事处'),
	(45, 07, 03, 002, N'鸿亭街道办事处'),
	(45, 07, 03, 003, N'子材街道办事处'),
	(45, 07, 03, 100, N'大垌镇'),
	(45, 07, 03, 101, N'平吉镇'),
	(45, 07, 03, 102, N'青塘镇'),
	(45, 07, 03, 103, N'小董镇'),
	(45, 07, 03, 104, N'板城镇'),
	(45, 07, 03, 105, N'那蒙镇'),
	(45, 07, 03, 106, N'长滩镇'),
	(45, 07, 03, 107, N'新棠镇'),
	(45, 07, 03, 108, N'大直镇'),
	(45, 07, 03, 109, N'大寺镇'),
	(45, 07, 03, 110, N'贵台镇');

/* 广西壮族自治区 钦州市 灵山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 07, 21, 001, N'灵城街道办事处'),
	(45, 07, 21, 002, N'三海街道办事处'),
	(45, 07, 21, 101, N'新圩镇'),
	(45, 07, 21, 102, N'丰塘镇'),
	(45, 07, 21, 103, N'平山镇'),
	(45, 07, 21, 104, N'石塘镇'),
	(45, 07, 21, 105, N'佛子镇'),
	(45, 07, 21, 106, N'平南镇'),
	(45, 07, 21, 107, N'烟墩镇'),
	(45, 07, 21, 108, N'檀圩镇'),
	(45, 07, 21, 109, N'那隆镇'),
	(45, 07, 21, 110, N'三隆镇'),
	(45, 07, 21, 111, N'陆屋镇'),
	(45, 07, 21, 112, N'旧州镇'),
	(45, 07, 21, 113, N'太平镇'),
	(45, 07, 21, 114, N'沙坪镇'),
	(45, 07, 21, 115, N'武利镇'),
	(45, 07, 21, 116, N'文利镇'),
	(45, 07, 21, 117, N'伯劳镇');

/* 广西壮族自治区 钦州市 浦北县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 07, 22, 001, N'小江街道办事处'),
	(45, 07, 22, 002, N'江城街道办事处'),
	(45, 07, 22, 101, N'泉水镇'),
	(45, 07, 22, 102, N'石埇镇'),
	(45, 07, 22, 103, N'安石镇'),
	(45, 07, 22, 104, N'张黄镇'),
	(45, 07, 22, 105, N'大成镇'),
	(45, 07, 22, 106, N'白石水镇'),
	(45, 07, 22, 107, N'北通镇'),
	(45, 07, 22, 108, N'三合镇'),
	(45, 07, 22, 109, N'龙门镇'),
	(45, 07, 22, 110, N'福旺镇'),
	(45, 07, 22, 111, N'寨圩镇'),
	(45, 07, 22, 112, N'乐民镇'),
	(45, 07, 22, 113, N'六硍镇'),
	(45, 07, 22, 114, N'平睦镇'),
	(45, 07, 22, 115, N'官垌镇');

/* 广西壮族自治区 贵港市 港北区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 08, 02, 001, N'贵城街道办事处'),
	(45, 08, 02, 100, N'港城镇'),
	(45, 08, 02, 101, N'大圩镇'),
	(45, 08, 02, 102, N'庆丰镇'),
	(45, 08, 02, 103, N'根竹镇'),
	(45, 08, 02, 200, N'奇石乡'),
	(45, 08, 02, 201, N'中里乡'),
	(45, 08, 02, 203, N'武乐乡');

/* 广西壮族自治区 贵港市 港南区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 08, 03, 001, N'江南办事处'),
	(45, 08, 03, 100, N'桥圩镇'),
	(45, 08, 03, 101, N'木格镇'),
	(45, 08, 03, 102, N'木梓镇'),
	(45, 08, 03, 103, N'湛江镇'),
	(45, 08, 03, 104, N'东津镇'),
	(45, 08, 03, 105, N'八塘镇'),
	(45, 08, 03, 106, N'新塘镇'),
	(45, 08, 03, 201, N'瓦塘乡');

/* 广西壮族自治区 贵港市 覃塘区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 08, 04, 100, N'覃塘镇'),
	(45, 08, 04, 101, N'东龙镇'),
	(45, 08, 04, 102, N'三里镇'),
	(45, 08, 04, 103, N'黄练镇'),
	(45, 08, 04, 104, N'石卡镇'),
	(45, 08, 04, 105, N'五里镇'),
	(45, 08, 04, 200, N'山北乡'),
	(45, 08, 04, 201, N'樟木乡'),
	(45, 08, 04, 203, N'蒙公乡'),
	(45, 08, 04, 204, N'大岭乡');

/* 广西壮族自治区 贵港市 平南县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 08, 21, 100, N'平南镇'),
	(45, 08, 21, 101, N'平山镇'),
	(45, 08, 21, 102, N'寺面镇'),
	(45, 08, 21, 103, N'六陈镇'),
	(45, 08, 21, 104, N'大新镇'),
	(45, 08, 21, 105, N'大安镇'),
	(45, 08, 21, 106, N'武林镇'),
	(45, 08, 21, 107, N'大坡镇'),
	(45, 08, 21, 108, N'大洲镇'),
	(45, 08, 21, 109, N'镇隆镇'),
	(45, 08, 21, 110, N'上渡镇'),
	(45, 08, 21, 112, N'安怀镇'),
	(45, 08, 21, 113, N'丹竹镇'),
	(45, 08, 21, 114, N'官成镇'),
	(45, 08, 21, 115, N'思旺镇'),
	(45, 08, 21, 116, N'大鹏镇'),
	(45, 08, 21, 117, N'同和镇'),
	(45, 08, 21, 202, N'东华乡'),
	(45, 08, 21, 204, N'思界乡'),
	(45, 08, 21, 205, N'国安瑶族乡'),
	(45, 08, 21, 206, N'马练瑶族乡');

/* 广西壮族自治区 贵港市 桂平市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 08, 81, 101, N'木乐镇'),
	(45, 08, 81, 102, N'木圭镇'),
	(45, 08, 81, 103, N'石咀镇'),
	(45, 08, 81, 104, N'油麻镇'),
	(45, 08, 81, 105, N'社坡镇'),
	(45, 08, 81, 106, N'罗秀镇'),
	(45, 08, 81, 107, N'麻垌镇'),
	(45, 08, 81, 108, N'社步镇'),
	(45, 08, 81, 109, N'下湾镇'),
	(45, 08, 81, 110, N'木根镇'),
	(45, 08, 81, 111, N'中沙镇'),
	(45, 08, 81, 113, N'大洋镇'),
	(45, 08, 81, 114, N'大湾镇'),
	(45, 08, 81, 115, N'白沙镇'),
	(45, 08, 81, 116, N'石龙镇'),
	(45, 08, 81, 117, N'蒙圩镇'),
	(45, 08, 81, 118, N'西山镇'),
	(45, 08, 81, 119, N'南木镇'),
	(45, 08, 81, 120, N'江口镇'),
	(45, 08, 81, 121, N'金田镇'),
	(45, 08, 81, 122, N'紫荆镇'),
	(45, 08, 81, 200, N'马皮乡'),
	(45, 08, 81, 202, N'寻旺乡'),
	(45, 08, 81, 203, N'罗播乡'),
	(45, 08, 81, 204, N'厚禄乡'),
	(45, 08, 81, 206, N'垌心乡');

/* 广西壮族自治区 玉林市 玉州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 09, 02, 001, N'玉城街道办事处'),
	(45, 09, 02, 002, N'南江街道办事处'),
	(45, 09, 02, 003, N'城西街道办事处'),
	(45, 09, 02, 004, N'城北街道办事处'),
	(45, 09, 02, 005, N'名山街道办事处'),
	(45, 09, 02, 100, N'大塘镇'),
	(45, 09, 02, 105, N'茂林镇'),
	(45, 09, 02, 106, N'仁东镇'),
	(45, 09, 02, 113, N'仁厚镇');

/* 广西壮族自治区 玉林市 福绵区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 09, 03, 107, N'福绵镇'),
	(45, 09, 03, 108, N'成均镇'),
	(45, 09, 03, 109, N'樟木镇'),
	(45, 09, 03, 110, N'新桥镇'),
	(45, 09, 03, 111, N'沙田镇'),
	(45, 09, 03, 112, N'石和镇');

/* 广西壮族自治区 玉林市 容县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 09, 21, 100, N'容州镇'),
	(45, 09, 21, 102, N'杨梅镇'),
	(45, 09, 21, 103, N'灵山镇'),
	(45, 09, 21, 104, N'六王镇'),
	(45, 09, 21, 105, N'黎村镇'),
	(45, 09, 21, 106, N'杨村镇'),
	(45, 09, 21, 107, N'县底镇'),
	(45, 09, 21, 108, N'自良镇'),
	(45, 09, 21, 109, N'松山镇'),
	(45, 09, 21, 110, N'罗江镇'),
	(45, 09, 21, 111, N'石头镇'),
	(45, 09, 21, 112, N'石寨镇'),
	(45, 09, 21, 113, N'十里镇'),
	(45, 09, 21, 114, N'容西镇'),
	(45, 09, 21, 115, N'浪水镇');

/* 广西壮族自治区 玉林市 陆川县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 09, 22, 101, N'温泉镇'),
	(45, 09, 22, 102, N'米场镇'),
	(45, 09, 22, 103, N'马坡镇'),
	(45, 09, 22, 104, N'珊罗镇'),
	(45, 09, 22, 105, N'平乐镇'),
	(45, 09, 22, 106, N'沙坡镇'),
	(45, 09, 22, 107, N'大桥镇'),
	(45, 09, 22, 108, N'乌石镇'),
	(45, 09, 22, 109, N'良田镇'),
	(45, 09, 22, 110, N'清湖镇'),
	(45, 09, 22, 111, N'古城镇'),
	(45, 09, 22, 112, N'沙湖镇'),
	(45, 09, 22, 113, N'横山镇'),
	(45, 09, 22, 114, N'滩面镇');

/* 广西壮族自治区 玉林市 博白县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 09, 23, 100, N'博白镇'),
	(45, 09, 23, 102, N'双凤镇'),
	(45, 09, 23, 105, N'顿谷镇'),
	(45, 09, 23, 106, N'水鸣镇'),
	(45, 09, 23, 107, N'那林镇'),
	(45, 09, 23, 108, N'江宁镇'),
	(45, 09, 23, 109, N'三滩镇'),
	(45, 09, 23, 110, N'黄凌镇'),
	(45, 09, 23, 111, N'亚山镇'),
	(45, 09, 23, 112, N'旺茂镇'),
	(45, 09, 23, 114, N'东平镇'),
	(45, 09, 23, 115, N'沙河镇'),
	(45, 09, 23, 116, N'菱角镇'),
	(45, 09, 23, 117, N'新田镇'),
	(45, 09, 23, 118, N'凤山镇'),
	(45, 09, 23, 119, N'宁潭镇'),
	(45, 09, 23, 120, N'文地镇'),
	(45, 09, 23, 121, N'英桥镇'),
	(45, 09, 23, 122, N'那卜镇'),
	(45, 09, 23, 123, N'大垌镇'),
	(45, 09, 23, 124, N'沙陂镇'),
	(45, 09, 23, 125, N'双旺镇'),
	(45, 09, 23, 126, N'松旺镇'),
	(45, 09, 23, 127, N'龙潭镇'),
	(45, 09, 23, 128, N'大坝镇'),
	(45, 09, 23, 129, N'永安镇'),
	(45, 09, 23, 130, N'径口镇'),
	(45, 09, 23, 131, N'浪平镇');

/* 广西壮族自治区 玉林市 兴业县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 09, 24, 100, N'石南镇'),
	(45, 09, 24, 101, N'大平山镇'),
	(45, 09, 24, 102, N'葵阳镇'),
	(45, 09, 24, 103, N'城隍镇'),
	(45, 09, 24, 104, N'山心镇'),
	(45, 09, 24, 105, N'沙塘镇'),
	(45, 09, 24, 106, N'蒲塘镇'),
	(45, 09, 24, 107, N'北市镇'),
	(45, 09, 24, 108, N'龙安镇'),
	(45, 09, 24, 109, N'高峰镇'),
	(45, 09, 24, 110, N'小平山镇'),
	(45, 09, 24, 111, N'卖酒镇'),
	(45, 09, 24, 112, N'洛阳镇');

/* 广西壮族自治区 玉林市 北流市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 09, 81, 001, N'陵城街道办事处'),
	(45, 09, 81, 002, N'城南街道办事处'),
	(45, 09, 81, 003, N'城北街道办事处'),
	(45, 09, 81, 100, N'北流镇'),
	(45, 09, 81, 101, N'新荣镇'),
	(45, 09, 81, 102, N'民安镇'),
	(45, 09, 81, 103, N'山围镇'),
	(45, 09, 81, 104, N'民乐镇'),
	(45, 09, 81, 105, N'西垠镇'),
	(45, 09, 81, 106, N'新圩镇'),
	(45, 09, 81, 107, N'大里镇'),
	(45, 09, 81, 108, N'塘岸镇'),
	(45, 09, 81, 109, N'清水口镇'),
	(45, 09, 81, 110, N'隆盛镇'),
	(45, 09, 81, 111, N'大坡外镇'),
	(45, 09, 81, 112, N'六麻镇'),
	(45, 09, 81, 113, N'新丰镇'),
	(45, 09, 81, 114, N'沙垌镇'),
	(45, 09, 81, 115, N'平政镇'),
	(45, 09, 81, 116, N'白马镇'),
	(45, 09, 81, 117, N'大伦镇'),
	(45, 09, 81, 118, N'扶新镇'),
	(45, 09, 81, 119, N'六靖镇'),
	(45, 09, 81, 120, N'石窝镇'),
	(45, 09, 81, 121, N'清湾镇');

/* 广西壮族自治区 百色市 右江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 02, 001, N'百城街道办事处'),
	(45, 10, 02, 002, N'龙景街道办事处'),
	(45, 10, 02, 101, N'阳圩镇'),
	(45, 10, 02, 102, N'四塘镇'),
	(45, 10, 02, 103, N'龙川镇'),
	(45, 10, 02, 104, N'永乐镇'),
	(45, 10, 02, 202, N'汪甸瑶族乡'),
	(45, 10, 02, 203, N'大楞乡'),
	(45, 10, 02, 204, N'泮水乡');

/* 广西壮族自治区 百色市 田阳县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 21, 100, N'田州镇'),
	(45, 10, 21, 101, N'那坡镇'),
	(45, 10, 21, 102, N'坡洪镇'),
	(45, 10, 21, 103, N'那满镇'),
	(45, 10, 21, 104, N'百育镇'),
	(45, 10, 21, 105, N'玉凤镇'),
	(45, 10, 21, 106, N'头塘镇'),
	(45, 10, 21, 107, N'五村镇'),
	(45, 10, 21, 108, N'洞靖镇'),
	(45, 10, 21, 204, N'巴别乡');

/* 广西壮族自治区 百色市 田东县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 22, 100, N'平马镇'),
	(45, 10, 22, 101, N'祥周镇'),
	(45, 10, 22, 103, N'林逢镇'),
	(45, 10, 22, 105, N'思林镇'),
	(45, 10, 22, 106, N'印茶镇'),
	(45, 10, 22, 107, N'江城镇'),
	(45, 10, 22, 108, N'朔良镇'),
	(45, 10, 22, 109, N'义圩镇'),
	(45, 10, 22, 110, N'那拔镇'),
	(45, 10, 22, 201, N'作登瑶族乡');

/* 广西壮族自治区 百色市 平果县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 23, 100, N'马头镇'),
	(45, 10, 23, 101, N'新安镇'),
	(45, 10, 23, 102, N'果化镇'),
	(45, 10, 23, 103, N'太平镇'),
	(45, 10, 23, 104, N'坡造镇'),
	(45, 10, 23, 105, N'四塘镇'),
	(45, 10, 23, 106, N'旧城镇'),
	(45, 10, 23, 107, N'榜圩镇'),
	(45, 10, 23, 108, N'风梧镇'),
	(45, 10, 23, 200, N'海城乡'),
	(45, 10, 23, 202, N'黎明乡'),
	(45, 10, 23, 203, N'同老乡');

/* 广西壮族自治区 百色市 德保县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 24, 100, N'城关镇'),
	(45, 10, 24, 101, N'足荣镇'),
	(45, 10, 24, 102, N'隆桑镇'),
	(45, 10, 24, 103, N'敬德镇'),
	(45, 10, 24, 104, N'马隘镇'),
	(45, 10, 24, 105, N'东凌镇'),
	(45, 10, 24, 200, N'都安乡'),
	(45, 10, 24, 202, N'那甲乡'),
	(45, 10, 24, 203, N'荣华乡'),
	(45, 10, 24, 204, N'燕峒乡'),
	(45, 10, 24, 205, N'龙光乡'),
	(45, 10, 24, 206, N'巴头乡');

/* 广西壮族自治区 百色市 那坡县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 26, 100, N'城厢镇'),
	(45, 10, 26, 101, N'平孟镇'),
	(45, 10, 26, 200, N'坡荷乡'),
	(45, 10, 26, 201, N'龙合乡'),
	(45, 10, 26, 203, N'德隆乡'),
	(45, 10, 26, 204, N'百合乡'),
	(45, 10, 26, 205, N'百南乡'),
	(45, 10, 26, 207, N'百省乡'),
	(45, 10, 26, 208, N'百都乡');

/* 广西壮族自治区 百色市 凌云县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 27, 100, N'泗城镇'),
	(45, 10, 27, 101, N'逻楼镇'),
	(45, 10, 27, 102, N'加尤镇'),
	(45, 10, 27, 103, N'下甲镇'),
	(45, 10, 27, 201, N'伶站瑶族乡'),
	(45, 10, 27, 202, N'朝里瑶族乡'),
	(45, 10, 27, 203, N'沙里瑶族乡'),
	(45, 10, 27, 205, N'玉洪瑶族乡');

/* 广西壮族自治区 百色市 乐业县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 28, 100, N'同乐镇'),
	(45, 10, 28, 101, N'甘田镇'),
	(45, 10, 28, 102, N'新化镇'),
	(45, 10, 28, 103, N'花坪镇'),
	(45, 10, 28, 201, N'逻沙乡'),
	(45, 10, 28, 203, N'逻西乡'),
	(45, 10, 28, 204, N'幼平乡'),
	(45, 10, 28, 205, N'雅长乡');

/* 广西壮族自治区 百色市 田林县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 29, 100, N'乐里镇'),
	(45, 10, 29, 101, N'旧州镇'),
	(45, 10, 29, 102, N'定安镇'),
	(45, 10, 29, 103, N'六隆镇'),
	(45, 10, 29, 200, N'潞城瑶族乡'),
	(45, 10, 29, 201, N'利周瑶族乡'),
	(45, 10, 29, 202, N'平塘乡'),
	(45, 10, 29, 203, N'浪平乡'),
	(45, 10, 29, 204, N'八桂瑶族乡'),
	(45, 10, 29, 205, N'八渡瑶族乡'),
	(45, 10, 29, 206, N'那比乡'),
	(45, 10, 29, 207, N'高龙乡'),
	(45, 10, 29, 208, N'百乐乡'),
	(45, 10, 29, 209, N'者苗乡');

/* 广西壮族自治区 百色市 西林县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 30, 100, N'八达镇'),
	(45, 10, 30, 101, N'古障镇'),
	(45, 10, 30, 102, N'那劳镇'),
	(45, 10, 30, 200, N'马蚌乡'),
	(45, 10, 30, 203, N'普合苗族乡'),
	(45, 10, 30, 204, N'西平乡'),
	(45, 10, 30, 206, N'那佐苗族乡'),
	(45, 10, 30, 208, N'足别瑶族苗族乡');

/* 广西壮族自治区 百色市 隆林各族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 31, 100, N'新州镇'),
	(45, 10, 31, 101, N'桠杈镇'),
	(45, 10, 31, 102, N'天生桥镇'),
	(45, 10, 31, 103, N'平班镇'),
	(45, 10, 31, 104, N'德峨镇'),
	(45, 10, 31, 105, N'隆或镇'),
	(45, 10, 31, 200, N'沙梨乡'),
	(45, 10, 31, 203, N'者保乡'),
	(45, 10, 31, 204, N'者浪乡'),
	(45, 10, 31, 205, N'革步乡'),
	(45, 10, 31, 206, N'金钟山乡'),
	(45, 10, 31, 208, N'猪场乡'),
	(45, 10, 31, 210, N'蛇场乡'),
	(45, 10, 31, 211, N'克长乡'),
	(45, 10, 31, 213, N'岩茶乡'),
	(45, 10, 31, 215, N'介廷乡');

/* 广西壮族自治区 百色市 靖西市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 10, 81, 100, N'新靖镇'),
	(45, 10, 81, 101, N'化峒镇'),
	(45, 10, 81, 102, N'湖润镇'),
	(45, 10, 81, 103, N'安德镇'),
	(45, 10, 81, 104, N'龙临镇'),
	(45, 10, 81, 105, N'渠洋镇'),
	(45, 10, 81, 106, N'岳圩镇'),
	(45, 10, 81, 107, N'龙邦镇'),
	(45, 10, 81, 108, N'禄峒镇'),
	(45, 10, 81, 109, N'武平镇'),
	(45, 10, 81, 200, N'同德乡'),
	(45, 10, 81, 201, N'壬庄乡'),
	(45, 10, 81, 202, N'安宁乡'),
	(45, 10, 81, 203, N'地州乡'),
	(45, 10, 81, 206, N'南坡乡'),
	(45, 10, 81, 207, N'吞盘乡'),
	(45, 10, 81, 209, N'果乐乡'),
	(45, 10, 81, 211, N'新甲乡'),
	(45, 10, 81, 215, N'魁圩乡');

/* 广西壮族自治区 贺州市 八步区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 11, 02, 001, N'八步街道办事处'),
	(45, 11, 02, 002, N'城东街道办事处'),
	(45, 11, 02, 003, N'江南街道办事处'),
	(45, 11, 02, 101, N'贺街镇'),
	(45, 11, 02, 102, N'步头镇'),
	(45, 11, 02, 103, N'莲塘镇'),
	(45, 11, 02, 104, N'大宁镇'),
	(45, 11, 02, 105, N'南乡镇'),
	(45, 11, 02, 106, N'桂岭镇'),
	(45, 11, 02, 107, N'开山镇'),
	(45, 11, 02, 109, N'里松镇'),
	(45, 11, 02, 114, N'信都镇'),
	(45, 11, 02, 115, N'灵峰镇'),
	(45, 11, 02, 116, N'仁义镇'),
	(45, 11, 02, 117, N'铺门镇'),
	(45, 11, 02, 200, N'黄洞瑶族乡');

/* 广西壮族自治区 贺州市 昭平县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 11, 21, 100, N'昭平镇'),
	(45, 11, 21, 101, N'文竹镇'),
	(45, 11, 21, 102, N'黄姚镇'),
	(45, 11, 21, 103, N'富罗镇'),
	(45, 11, 21, 104, N'北陀镇'),
	(45, 11, 21, 105, N'马江镇'),
	(45, 11, 21, 107, N'五将镇'),
	(45, 11, 21, 108, N'走马镇'),
	(45, 11, 21, 201, N'仙回瑶族乡'),
	(45, 11, 21, 205, N'樟木林乡'),
	(45, 11, 21, 206, N'凤凰乡'),
	(45, 11, 21, 208, N'木格乡');

/* 广西壮族自治区 贺州市 钟山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 11, 22, 100, N'钟山镇'),
	(45, 11, 22, 104, N'回龙镇'),
	(45, 11, 22, 105, N'石龙镇'),
	(45, 11, 22, 106, N'凤翔镇'),
	(45, 11, 22, 107, N'珊瑚镇'),
	(45, 11, 22, 108, N'同古镇'),
	(45, 11, 22, 109, N'公安镇'),
	(45, 11, 22, 111, N'清塘镇'),
	(45, 11, 22, 112, N'燕塘镇'),
	(45, 11, 22, 113, N'红花镇'),
	(45, 11, 22, 200, N'花山瑶族乡'),
	(45, 11, 22, 201, N'两安瑶族乡');

/* 广西壮族自治区 贺州市 富川瑶族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 11, 23, 100, N'富阳镇'),
	(45, 11, 23, 101, N'白沙镇'),
	(45, 11, 23, 102, N'莲山镇'),
	(45, 11, 23, 103, N'古城镇'),
	(45, 11, 23, 104, N'福利镇'),
	(45, 11, 23, 105, N'麦岭镇'),
	(45, 11, 23, 106, N'葛坡镇'),
	(45, 11, 23, 107, N'城北镇'),
	(45, 11, 23, 108, N'朝东镇'),
	(45, 11, 23, 200, N'新华乡'),
	(45, 11, 23, 201, N'石家乡'),
	(45, 11, 23, 203, N'柳家乡');

/* 广西壮族自治区 河池市 金城江区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 12, 02, 001, N'金城江街道办事处'),
	(45, 12, 02, 101, N'东江镇'),
	(45, 12, 02, 102, N'六圩镇'),
	(45, 12, 02, 103, N'六甲镇'),
	(45, 12, 02, 104, N'河池镇'),
	(45, 12, 02, 105, N'拔贡镇'),
	(45, 12, 02, 106, N'九圩镇'),
	(45, 12, 02, 107, N'五圩镇'),
	(45, 12, 02, 200, N'白土乡'),
	(45, 12, 02, 203, N'侧岭乡'),
	(45, 12, 02, 204, N'保平乡'),
	(45, 12, 02, 205, N'长老乡');

/* 广西壮族自治区 河池市 南丹县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 12, 21, 100, N'城关镇'),
	(45, 12, 21, 101, N'大厂镇'),
	(45, 12, 21, 102, N'车河镇'),
	(45, 12, 21, 103, N'芒场镇'),
	(45, 12, 21, 104, N'六寨镇'),
	(45, 12, 21, 105, N'月里镇'),
	(45, 12, 21, 106, N'吾隘镇'),
	(45, 12, 21, 200, N'罗富乡'),
	(45, 12, 21, 202, N'中堡苗族乡'),
	(45, 12, 21, 203, N'八圩瑶族乡'),
	(45, 12, 21, 204, N'里湖瑶族乡');

/* 广西壮族自治区 河池市 天峨县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 12, 22, 100, N'六排镇'),
	(45, 12, 22, 101, N'向阳镇'),
	(45, 12, 22, 200, N'岜暮乡'),
	(45, 12, 22, 201, N'八腊瑶族乡'),
	(45, 12, 22, 203, N'纳直乡'),
	(45, 12, 22, 204, N'更新乡'),
	(45, 12, 22, 206, N'下老乡'),
	(45, 12, 22, 207, N'坡结乡'),
	(45, 12, 22, 208, N'三堡乡');

/* 广西壮族自治区 河池市 凤山县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 12, 23, 100, N'凤城镇'),
	(45, 12, 23, 101, N'长洲镇'),
	(45, 12, 23, 102, N'三门海镇'),
	(45, 12, 23, 201, N'砦牙乡'),
	(45, 12, 23, 203, N'乔音乡'),
	(45, 12, 23, 205, N'金牙瑶族乡'),
	(45, 12, 23, 207, N'中亭乡'),
	(45, 12, 23, 208, N'平乐瑶族乡'),
	(45, 12, 23, 209, N'江洲瑶族乡');

/* 广西壮族自治区 河池市 东兰县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 12, 24, 100, N'东兰镇'),
	(45, 12, 24, 101, N'隘洞镇'),
	(45, 12, 24, 102, N'长乐镇'),
	(45, 12, 24, 103, N'三石镇'),
	(45, 12, 24, 104, N'武篆镇'),
	(45, 12, 24, 105, N'长江镇'),
	(45, 12, 24, 200, N'泗孟乡'),
	(45, 12, 24, 201, N'兰木乡'),
	(45, 12, 24, 203, N'巴畴乡'),
	(45, 12, 24, 204, N'金谷乡'),
	(45, 12, 24, 205, N'三弄瑶族乡'),
	(45, 12, 24, 206, N'大同乡'),
	(45, 12, 24, 207, N'花香乡'),
	(45, 12, 24, 208, N'切学乡');

/* 广西壮族自治区 河池市 罗城仫佬族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 12, 25, 100, N'东门镇'),
	(45, 12, 25, 101, N'龙岸镇'),
	(45, 12, 25, 102, N'黄金镇'),
	(45, 12, 25, 103, N'小长安镇'),
	(45, 12, 25, 105, N'四把镇'),
	(45, 12, 25, 106, N'天河镇'),
	(45, 12, 25, 107, N'怀群镇'),
	(45, 12, 25, 200, N'宝坛乡'),
	(45, 12, 25, 202, N'乔善乡'),
	(45, 12, 25, 203, N'纳翁乡'),
	(45, 12, 25, 204, N'兼爱乡');

/* 广西壮族自治区 河池市 环江毛南族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 12, 26, 100, N'思恩镇'),
	(45, 12, 26, 101, N'水源镇'),
	(45, 12, 26, 102, N'洛阳镇'),
	(45, 12, 26, 103, N'川山镇'),
	(45, 12, 26, 104, N'明伦镇'),
	(45, 12, 26, 105, N'东兴镇'),
	(45, 12, 26, 200, N'大才乡'),
	(45, 12, 26, 202, N'下南乡'),
	(45, 12, 26, 204, N'大安乡'),
	(45, 12, 26, 205, N'长美乡'),
	(45, 12, 26, 206, N'龙岩乡'),
	(45, 12, 26, 207, N'驯乐苗族乡');

/* 广西壮族自治区 河池市 巴马瑶族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 12, 27, 100, N'巴马镇'),
	(45, 12, 27, 101, N'甲篆镇'),
	(45, 12, 27, 200, N'燕洞乡'),
	(45, 12, 27, 202, N'那社乡'),
	(45, 12, 27, 203, N'所略乡'),
	(45, 12, 27, 205, N'西山乡'),
	(45, 12, 27, 207, N'东山乡'),
	(45, 12, 27, 208, N'凤凰乡'),
	(45, 12, 27, 209, N'百林乡'),
	(45, 12, 27, 210, N'那桃乡');

/* 广西壮族自治区 河池市 都安瑶族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 12, 28, 100, N'安阳镇'),
	(45, 12, 28, 101, N'高岭镇'),
	(45, 12, 28, 102, N'地苏镇'),
	(45, 12, 28, 103, N'下坳镇'),
	(45, 12, 28, 104, N'拉烈镇'),
	(45, 12, 28, 105, N'百旺镇'),
	(45, 12, 28, 106, N'澄江镇'),
	(45, 12, 28, 107, N'大兴镇'),
	(45, 12, 28, 204, N'东庙乡'),
	(45, 12, 28, 208, N'隆福乡'),
	(45, 12, 28, 209, N'保安乡'),
	(45, 12, 28, 210, N'板岭乡'),
	(45, 12, 28, 211, N'永安乡'),
	(45, 12, 28, 212, N'三只羊乡'),
	(45, 12, 28, 213, N'龙湾乡'),
	(45, 12, 28, 214, N'菁盛乡'),
	(45, 12, 28, 217, N'加贵乡'),
	(45, 12, 28, 218, N'拉仁乡'),
	(45, 12, 28, 219, N'九渡乡');

/* 广西壮族自治区 河池市 大化瑶族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 12, 29, 100, N'大化镇'),
	(45, 12, 29, 101, N'都阳镇'),
	(45, 12, 29, 102, N'岩滩镇'),
	(45, 12, 29, 103, N'北景镇'),
	(45, 12, 29, 200, N'共和乡'),
	(45, 12, 29, 201, N'贡川乡'),
	(45, 12, 29, 202, N'百马乡'),
	(45, 12, 29, 203, N'古河乡'),
	(45, 12, 29, 204, N'古文乡'),
	(45, 12, 29, 205, N'江南乡'),
	(45, 12, 29, 206, N'羌圩乡'),
	(45, 12, 29, 207, N'乙圩乡'),
	(45, 12, 29, 210, N'板升乡'),
	(45, 12, 29, 211, N'七百弄乡'),
	(45, 12, 29, 213, N'雅龙乡'),
	(45, 12, 29, 214, N'六也乡');

/* 广西壮族自治区 河池市 宜州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 12, 81, 100, N'庆远镇'),
	(45, 12, 81, 101, N'三岔镇'),
	(45, 12, 81, 102, N'洛西镇'),
	(45, 12, 81, 103, N'怀远镇'),
	(45, 12, 81, 104, N'德胜镇'),
	(45, 12, 81, 105, N'石别镇'),
	(45, 12, 81, 106, N'北山镇'),
	(45, 12, 81, 107, N'刘三姐镇'),
	(45, 12, 81, 108, N'洛东镇'),
	(45, 12, 81, 200, N'祥贝乡'),
	(45, 12, 81, 203, N'屏南乡'),
	(45, 12, 81, 207, N'福龙瑶族乡'),
	(45, 12, 81, 208, N'北牙瑶族乡'),
	(45, 12, 81, 210, N'同德乡'),
	(45, 12, 81, 211, N'安马乡'),
	(45, 12, 81, 213, N'龙头乡');

/* 广西壮族自治区 来宾市 兴宾区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 13, 02, 001, N'城东街道办事处'),
	(45, 13, 02, 002, N'城北街道办事处'),
	(45, 13, 02, 003, N'河西街道办事处'),
	(45, 13, 02, 004, N'八一街道办事处'),
	(45, 13, 02, 005, N'来华街道办事处'),
	(45, 13, 02, 101, N'凤凰镇'),
	(45, 13, 02, 102, N'良江镇'),
	(45, 13, 02, 103, N'小平阳镇'),
	(45, 13, 02, 104, N'迁江镇'),
	(45, 13, 02, 105, N'石陵镇'),
	(45, 13, 02, 106, N'平阳镇'),
	(45, 13, 02, 107, N'蒙村镇'),
	(45, 13, 02, 108, N'大湾镇'),
	(45, 13, 02, 109, N'桥巩镇'),
	(45, 13, 02, 110, N'寺山镇'),
	(45, 13, 02, 111, N'城厢镇'),
	(45, 13, 02, 201, N'三五乡'),
	(45, 13, 02, 202, N'五山乡'),
	(45, 13, 02, 203, N'陶邓乡'),
	(45, 13, 02, 205, N'良塘乡'),
	(45, 13, 02, 206, N'七洞乡'),
	(45, 13, 02, 212, N'石牙乡'),
	(45, 13, 02, 213, N'南泗乡'),
	(45, 13, 02, 214, N'高安乡'),
	(45, 13, 02, 216, N'正龙乡');

/* 广西壮族自治区 来宾市 忻城县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 13, 21, 100, N'城关镇'),
	(45, 13, 21, 101, N'大塘镇'),
	(45, 13, 21, 102, N'思练镇'),
	(45, 13, 21, 103, N'红渡镇'),
	(45, 13, 21, 104, N'古蓬镇'),
	(45, 13, 21, 201, N'马泗乡'),
	(45, 13, 21, 202, N'欧洞乡'),
	(45, 13, 21, 203, N'安东乡'),
	(45, 13, 21, 204, N'果遂乡'),
	(45, 13, 21, 205, N'新圩乡'),
	(45, 13, 21, 206, N'遂意乡'),
	(45, 13, 21, 207, N'北更乡');

/* 广西壮族自治区 来宾市 象州县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 13, 22, 100, N'象州镇'),
	(45, 13, 22, 101, N'石龙镇'),
	(45, 13, 22, 102, N'运江镇'),
	(45, 13, 22, 103, N'寺村镇'),
	(45, 13, 22, 104, N'中平镇'),
	(45, 13, 22, 105, N'罗秀镇'),
	(45, 13, 22, 106, N'大乐镇'),
	(45, 13, 22, 107, N'马坪镇'),
	(45, 13, 22, 201, N'妙皇乡'),
	(45, 13, 22, 202, N'百丈乡'),
	(45, 13, 22, 203, N'水晶乡');

/* 广西壮族自治区 来宾市 武宣县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 13, 23, 100, N'武宣镇'),
	(45, 13, 23, 101, N'桐岭镇'),
	(45, 13, 23, 102, N'通挽镇'),
	(45, 13, 23, 103, N'东乡镇'),
	(45, 13, 23, 104, N'三里镇'),
	(45, 13, 23, 105, N'二塘镇'),
	(45, 13, 23, 106, N'黄茆镇'),
	(45, 13, 23, 107, N'禄新镇'),
	(45, 13, 23, 202, N'思灵乡'),
	(45, 13, 23, 204, N'金鸡乡');

/* 广西壮族自治区 来宾市 金秀瑶族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 13, 24, 100, N'金秀镇'),
	(45, 13, 24, 101, N'桐木镇'),
	(45, 13, 24, 102, N'头排镇'),
	(45, 13, 24, 200, N'三角乡'),
	(45, 13, 24, 201, N'忠良乡'),
	(45, 13, 24, 202, N'罗香乡'),
	(45, 13, 24, 203, N'长垌乡'),
	(45, 13, 24, 204, N'大樟乡'),
	(45, 13, 24, 205, N'六巷乡'),
	(45, 13, 24, 207, N'三江乡');

/* 广西壮族自治区 来宾市 合山市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 13, 81, 100, N'岭南镇'),
	(45, 13, 81, 101, N'北泗镇'),
	(45, 13, 81, 102, N'河里镇');

/* 广西壮族自治区 崇左市 江州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 14, 02, 001, N'太平街道办事处'),
	(45, 14, 02, 002, N'江南街道办事处'),
	(45, 14, 02, 003, N'石景林街道办事处'),
	(45, 14, 02, 101, N'新和镇'),
	(45, 14, 02, 102, N'濑湍镇'),
	(45, 14, 02, 103, N'江州镇'),
	(45, 14, 02, 104, N'左州镇'),
	(45, 14, 02, 105, N'那隆镇'),
	(45, 14, 02, 106, N'驮卢镇'),
	(45, 14, 02, 201, N'罗白乡'),
	(45, 14, 02, 202, N'板利乡');

/* 广西壮族自治区 崇左市 扶绥县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 14, 21, 100, N'新宁镇'),
	(45, 14, 21, 101, N'渠黎镇'),
	(45, 14, 21, 102, N'渠旧镇'),
	(45, 14, 21, 103, N'柳桥镇'),
	(45, 14, 21, 104, N'东门镇'),
	(45, 14, 21, 105, N'山圩镇'),
	(45, 14, 21, 106, N'中东镇'),
	(45, 14, 21, 107, N'东罗镇'),
	(45, 14, 21, 201, N'龙头乡'),
	(45, 14, 21, 202, N'岜盆乡'),
	(45, 14, 21, 203, N'昌平乡');

/* 广西壮族自治区 崇左市 宁明县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 14, 22, 100, N'城中镇'),
	(45, 14, 22, 101, N'爱店镇'),
	(45, 14, 22, 102, N'明江镇'),
	(45, 14, 22, 103, N'海渊镇'),
	(45, 14, 22, 104, N'桐棉镇'),
	(45, 14, 22, 105, N'那堪镇'),
	(45, 14, 22, 106, N'亭亮镇'),
	(45, 14, 22, 202, N'寨安乡'),
	(45, 14, 22, 203, N'峙浪乡'),
	(45, 14, 22, 204, N'东安乡'),
	(45, 14, 22, 205, N'板棍乡'),
	(45, 14, 22, 206, N'北江乡'),
	(45, 14, 22, 209, N'那楠乡');

/* 广西壮族自治区 崇左市 龙州县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 14, 23, 100, N'龙州镇'),
	(45, 14, 23, 101, N'下冻镇'),
	(45, 14, 23, 102, N'水口镇'),
	(45, 14, 23, 103, N'金龙镇'),
	(45, 14, 23, 104, N'响水镇'),
	(45, 14, 23, 201, N'八角乡'),
	(45, 14, 23, 202, N'上降乡'),
	(45, 14, 23, 203, N'彬桥乡'),
	(45, 14, 23, 204, N'上龙乡'),
	(45, 14, 23, 205, N'武德乡'),
	(45, 14, 23, 206, N'逐卜乡'),
	(45, 14, 23, 207, N'上金乡');

/* 广西壮族自治区 崇左市 大新县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 14, 24, 100, N'桃城镇'),
	(45, 14, 24, 101, N'全茗镇'),
	(45, 14, 24, 102, N'雷平镇'),
	(45, 14, 24, 103, N'硕龙镇'),
	(45, 14, 24, 104, N'下雷镇'),
	(45, 14, 24, 200, N'五山乡'),
	(45, 14, 24, 201, N'龙门乡'),
	(45, 14, 24, 202, N'昌明乡'),
	(45, 14, 24, 203, N'福隆乡'),
	(45, 14, 24, 204, N'那岭乡'),
	(45, 14, 24, 205, N'恩城乡'),
	(45, 14, 24, 206, N'榄圩乡'),
	(45, 14, 24, 207, N'宝圩乡'),
	(45, 14, 24, 208, N'堪圩乡');

/* 广西壮族自治区 崇左市 天等县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 14, 25, 100, N'天等镇'),
	(45, 14, 25, 101, N'龙茗镇'),
	(45, 14, 25, 102, N'进结镇'),
	(45, 14, 25, 103, N'向都镇'),
	(45, 14, 25, 104, N'东平镇'),
	(45, 14, 25, 200, N'都康乡'),
	(45, 14, 25, 201, N'宁干乡'),
	(45, 14, 25, 202, N'驮堪乡'),
	(45, 14, 25, 203, N'福新乡'),
	(45, 14, 25, 205, N'进远乡'),
	(45, 14, 25, 206, N'上映乡'),
	(45, 14, 25, 207, N'把荷乡'),
	(45, 14, 25, 208, N'小山乡');

/* 广西壮族自治区 崇左市 凭祥市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(45, 14, 81, 100, N'凭祥镇'),
	(45, 14, 81, 101, N'友谊镇'),
	(45, 14, 81, 102, N'上石镇'),
	(45, 14, 81, 103, N'夏石镇');


/* 海南省 海口市 秀英区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 01, 05, 001, N'秀英街道办事处'),
	(46, 01, 05, 002, N'海秀街道办'),
	(46, 01, 05, 100, N'长流镇'),
	(46, 01, 05, 101, N'西秀镇'),
	(46, 01, 05, 102, N'海秀镇'),
	(46, 01, 05, 103, N'石山镇'),
	(46, 01, 05, 104, N'永兴镇'),
	(46, 01, 05, 105, N'东山镇');

/* 海南省 海口市 龙华区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 01, 06, 001, N'中山街道办事处'),
	(46, 01, 06, 002, N'滨海街道办事处'),
	(46, 01, 06, 003, N'金贸街道办事处'),
	(46, 01, 06, 004, N'大同街道办事处'),
	(46, 01, 06, 005, N'海垦街道办事处'),
	(46, 01, 06, 006, N'金宇街道办事处'),
	(46, 01, 06, 100, N'城西镇'),
	(46, 01, 06, 101, N'龙桥镇'),
	(46, 01, 06, 102, N'新坡镇'),
	(46, 01, 06, 103, N'遵谭镇'),
	(46, 01, 06, 104, N'龙泉镇');

/* 海南省 海口市 琼山区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 01, 07, 001, N'国兴街道办'),
	(46, 01, 07, 002, N'府城街道办'),
	(46, 01, 07, 003, N'滨江街道办'),
	(46, 01, 07, 004, N'凤翔街道办'),
	(46, 01, 07, 101, N'龙塘镇'),
	(46, 01, 07, 102, N'云龙镇'),
	(46, 01, 07, 103, N'红旗镇'),
	(46, 01, 07, 104, N'三门坡镇'),
	(46, 01, 07, 105, N'大坡镇'),
	(46, 01, 07, 106, N'甲子镇'),
	(46, 01, 07, 107, N'旧州镇');

/* 海南省 海口市 美兰区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 01, 08, 001, N'海府街道办事处'),
	(46, 01, 08, 002, N'蓝天街道办事处'),
	(46, 01, 08, 003, N'博爱街道办事处'),
	(46, 01, 08, 004, N'海甸街道办事处'),
	(46, 01, 08, 005, N'人民路街道办事处'),
	(46, 01, 08, 006, N'白龙街道办事处'),
	(46, 01, 08, 007, N'和平南街道办事处'),
	(46, 01, 08, 008, N'白沙街道办事处'),
	(46, 01, 08, 009, N'新埠街道办事处'),
	(46, 01, 08, 101, N'灵山镇'),
	(46, 01, 08, 102, N'演丰镇'),
	(46, 01, 08, 103, N'三江镇'),
	(46, 01, 08, 104, N'大致坡镇');

/* 海南省 三亚市 海棠区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 02, 02, 198, N'海棠湾镇');

/* 海南省 三亚市 吉阳区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 02, 03, 198, N'吉阳镇');

/* 海南省 三亚市 天涯区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 02, 04, 198, N'天涯镇');

/* 海南省 三亚市 崖州区 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 02, 05, 198, N'崖城镇');

/* 海南省 省直辖县级行政区划 五指山市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 01, 100, N'通什镇'),
	(46, 90, 01, 101, N'南圣镇'),
	(46, 90, 01, 102, N'毛阳镇'),
	(46, 90, 01, 103, N'番阳镇'),
	(46, 90, 01, 200, N'畅好乡'),
	(46, 90, 01, 201, N'毛道乡'),
	(46, 90, 01, 202, N'水满乡');

/* 海南省 省直辖县级行政区划 琼海市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 02, 100, N'嘉积镇'),
	(46, 90, 02, 101, N'万泉镇'),
	(46, 90, 02, 102, N'石壁镇'),
	(46, 90, 02, 103, N'中原镇'),
	(46, 90, 02, 104, N'博鳌镇'),
	(46, 90, 02, 105, N'阳江镇'),
	(46, 90, 02, 106, N'龙江镇'),
	(46, 90, 02, 107, N'潭门镇'),
	(46, 90, 02, 108, N'塔洋镇'),
	(46, 90, 02, 109, N'长坡镇'),
	(46, 90, 02, 110, N'大路镇'),
	(46, 90, 02, 111, N'会山镇');

/* 海南省 省直辖县级行政区划 儋州市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 03, 100, N'那大镇'),
	(46, 90, 03, 101, N'和庆镇'),
	(46, 90, 03, 102, N'南丰镇'),
	(46, 90, 03, 103, N'大成镇'),
	(46, 90, 03, 104, N'雅星镇'),
	(46, 90, 03, 105, N'兰洋镇'),
	(46, 90, 03, 106, N'光村镇'),
	(46, 90, 03, 107, N'木棠镇'),
	(46, 90, 03, 108, N'海头镇'),
	(46, 90, 03, 109, N'峨蔓镇'),
	(46, 90, 03, 110, N'三都镇'),
	(46, 90, 03, 111, N'王五镇'),
	(46, 90, 03, 112, N'白马井镇'),
	(46, 90, 03, 113, N'中和镇'),
	(46, 90, 03, 114, N'排浦镇'),
	(46, 90, 03, 115, N'东成镇'),
	(46, 90, 03, 116, N'新州镇');

/* 海南省 省直辖县级行政区划 文昌市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 05, 100, N'文城镇'),
	(46, 90, 05, 101, N'重兴镇'),
	(46, 90, 05, 102, N'蓬莱镇'),
	(46, 90, 05, 103, N'会文镇'),
	(46, 90, 05, 104, N'东路镇'),
	(46, 90, 05, 105, N'潭牛镇'),
	(46, 90, 05, 106, N'东阁镇'),
	(46, 90, 05, 107, N'文教镇'),
	(46, 90, 05, 108, N'东郊镇'),
	(46, 90, 05, 109, N'龙楼镇'),
	(46, 90, 05, 110, N'昌洒镇'),
	(46, 90, 05, 111, N'翁田镇'),
	(46, 90, 05, 112, N'抱罗镇'),
	(46, 90, 05, 113, N'冯坡镇'),
	(46, 90, 05, 114, N'锦山镇'),
	(46, 90, 05, 115, N'铺前镇'),
	(46, 90, 05, 116, N'公坡镇');

/* 海南省 省直辖县级行政区划 万宁市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 06, 100, N'万城镇'),
	(46, 90, 06, 101, N'龙滚镇'),
	(46, 90, 06, 102, N'和乐镇'),
	(46, 90, 06, 103, N'后安镇'),
	(46, 90, 06, 104, N'大茂镇'),
	(46, 90, 06, 105, N'东澳镇'),
	(46, 90, 06, 106, N'礼纪镇'),
	(46, 90, 06, 107, N'长丰镇'),
	(46, 90, 06, 108, N'山根镇'),
	(46, 90, 06, 109, N'北大镇'),
	(46, 90, 06, 110, N'南桥镇'),
	(46, 90, 06, 111, N'三更罗镇');

/* 海南省 省直辖县级行政区划 东方市 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 07, 100, N'八所镇'),
	(46, 90, 07, 101, N'东河镇'),
	(46, 90, 07, 102, N'大田镇'),
	(46, 90, 07, 103, N'感城镇'),
	(46, 90, 07, 104, N'板桥镇'),
	(46, 90, 07, 105, N'三家镇'),
	(46, 90, 07, 106, N'四更镇'),
	(46, 90, 07, 107, N'新龙镇'),
	(46, 90, 07, 200, N'天安乡'),
	(46, 90, 07, 201, N'江边乡');

/* 海南省 省直辖县级行政区划 定安县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 21, 100, N'定城镇'),
	(46, 90, 21, 101, N'新竹镇'),
	(46, 90, 21, 102, N'龙湖镇'),
	(46, 90, 21, 103, N'黄竹镇'),
	(46, 90, 21, 104, N'雷鸣镇'),
	(46, 90, 21, 105, N'龙门镇'),
	(46, 90, 21, 106, N'龙河镇'),
	(46, 90, 21, 107, N'岭口镇'),
	(46, 90, 21, 108, N'翰林镇'),
	(46, 90, 21, 109, N'富文镇');

/* 海南省 省直辖县级行政区划 屯昌县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 22, 100, N'屯城镇'),
	(46, 90, 22, 101, N'新兴镇'),
	(46, 90, 22, 102, N'枫木镇'),
	(46, 90, 22, 103, N'乌坡镇'),
	(46, 90, 22, 104, N'南吕镇'),
	(46, 90, 22, 105, N'南坤镇'),
	(46, 90, 22, 106, N'坡心镇'),
	(46, 90, 22, 107, N'西昌镇');

/* 海南省 省直辖县级行政区划 澄迈县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 23, 100, N'金江镇'),
	(46, 90, 23, 101, N'老城镇'),
	(46, 90, 23, 102, N'瑞溪镇'),
	(46, 90, 23, 103, N'永发镇'),
	(46, 90, 23, 104, N'加乐镇'),
	(46, 90, 23, 105, N'文儒镇'),
	(46, 90, 23, 106, N'中兴镇'),
	(46, 90, 23, 107, N'仁兴镇'),
	(46, 90, 23, 108, N'福山镇'),
	(46, 90, 23, 109, N'桥头镇'),
	(46, 90, 23, 110, N'大丰镇');

/* 海南省 省直辖县级行政区划 临高县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 24, 100, N'临城镇'),
	(46, 90, 24, 101, N'波莲镇'),
	(46, 90, 24, 102, N'东英镇'),
	(46, 90, 24, 103, N'博厚镇'),
	(46, 90, 24, 104, N'皇桐镇'),
	(46, 90, 24, 105, N'多文镇'),
	(46, 90, 24, 106, N'和舍镇'),
	(46, 90, 24, 107, N'南宝镇'),
	(46, 90, 24, 108, N'新盈镇'),
	(46, 90, 24, 109, N'调楼镇');

/* 海南省 省直辖县级行政区划 白沙黎族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 25, 100, N'牙叉镇'),
	(46, 90, 25, 101, N'七坊镇'),
	(46, 90, 25, 102, N'邦溪镇'),
	(46, 90, 25, 103, N'打安镇'),
	(46, 90, 25, 200, N'细水乡'),
	(46, 90, 25, 201, N'元门乡'),
	(46, 90, 25, 202, N'南开乡'),
	(46, 90, 25, 203, N'阜龙乡'),
	(46, 90, 25, 204, N'青松乡'),
	(46, 90, 25, 205, N'金波乡'),
	(46, 90, 25, 206, N'荣邦乡');

/* 海南省 省直辖县级行政区划 昌江黎族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 26, 100, N'石碌镇'),
	(46, 90, 26, 101, N'叉河镇'),
	(46, 90, 26, 102, N'十月田镇'),
	(46, 90, 26, 103, N'乌烈镇'),
	(46, 90, 26, 104, N'昌化镇'),
	(46, 90, 26, 105, N'海尾镇'),
	(46, 90, 26, 106, N'七叉镇'),
	(46, 90, 26, 200, N'王下乡');

/* 海南省 省直辖县级行政区划 乐东黎族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 27, 100, N'抱由镇'),
	(46, 90, 27, 101, N'万冲镇'),
	(46, 90, 27, 102, N'大安镇'),
	(46, 90, 27, 103, N'志仲镇'),
	(46, 90, 27, 104, N'千家镇'),
	(46, 90, 27, 105, N'九所镇'),
	(46, 90, 27, 106, N'利国镇'),
	(46, 90, 27, 107, N'黄流镇'),
	(46, 90, 27, 108, N'佛罗镇'),
	(46, 90, 27, 109, N'尖峰镇'),
	(46, 90, 27, 110, N'莺歌海镇');

/* 海南省 省直辖县级行政区划 陵水黎族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 28, 100, N'椰林镇'),
	(46, 90, 28, 101, N'光坡镇'),
	(46, 90, 28, 102, N'三才镇'),
	(46, 90, 28, 103, N'英州镇'),
	(46, 90, 28, 104, N'隆广镇'),
	(46, 90, 28, 105, N'文罗镇'),
	(46, 90, 28, 106, N'本号镇'),
	(46, 90, 28, 107, N'新村镇'),
	(46, 90, 28, 108, N'黎安镇'),
	(46, 90, 28, 200, N'提蒙乡'),
	(46, 90, 28, 201, N'群英乡');

/* 海南省 省直辖县级行政区划 保亭黎族苗族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 29, 100, N'保城镇'),
	(46, 90, 29, 101, N'什玲镇'),
	(46, 90, 29, 102, N'加茂镇'),
	(46, 90, 29, 103, N'响水镇'),
	(46, 90, 29, 104, N'新政镇'),
	(46, 90, 29, 105, N'三道镇'),
	(46, 90, 29, 200, N'六弓乡'),
	(46, 90, 29, 201, N'南林乡'),
	(46, 90, 29, 202, N'毛感乡');

/* 海南省 省直辖县级行政区划 琼中黎族苗族自治县 */
INSERT INTO Street (ProvinceId, CityId, DistrictId, StreetId, Name) VALUES
	(46, 90, 30, 100, N'营根镇'),
	(46, 90, 30, 101, N'湾岭镇'),
	(46, 90, 30, 102, N'黎母山镇'),
	(46, 90, 30, 103, N'和平镇'),
	(46, 90, 30, 104, N'长征镇'),
	(46, 90, 30, 105, N'红毛镇'),
	(46, 90, 30, 106, N'中平镇'),
	(46, 90, 30, 200, N'吊罗山乡'),
	(46, 90, 30, 201, N'上安乡'),
	(46, 90, 30, 202, N'什运乡');
